[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Do Dogs Get Jealous?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/three.spaniels.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/three.spaniels.jpg"}, "author": {"@type": "Person", "name": "Melissa Boldan, DVM", "url": "https://www.petmd.com/author/dr-melissa-boldan"}, "keywords": "Dog, Behavior, Mental health, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/do-dogs-get-jealous"}, "datePublished": "December 15, 2021", "dateModified": "August 30, 2023", "description": "Do dogs get jealous of other dogs? What about cats and humans? Dr. Melissa Boldan explains how dogs can feel jealousy and how to stop your dog from displaying insecure behaviors.", "articleBody": "Jealousy is defined as a desire to possess something that someone else has, or a feeling of unhappiness or anger because you fear someone you love is liked by another. But do dogs get jealous like humans do? Do they feel jealous when we spend time with or give attention to other pets or people? Can Dogs Get Jealous? In short, dogs do get jealous, and those feelings of jealousy are strikingly similar to human jealousy.   You may be able to read some of your dog’s emotions through their body language, such as happiness or sadness. In the study of human psychology, jealousy has always been considered a complex emotion with undertones of several different feelings, and it’s shaped by experience. Researchers across the globe have determined that dogs feel jealousy as well. There are several theories regarding the origin of jealousy. Some psychologists believe jealousy is a survival trait. Siblings compete for resources, and romantic partners guard their mates to ensure propagation of their line. Other researchers believe there are social factors at play, with certain cultures or households encouraging jealous behavior. This debate remains true for dogs as well. Some researchers hypothesize that jealousy is predominant in certain dogs innately (from birth). Others believe that a dog’s environment and interaction with pet parents foster stronger feelings of jealousy. Are Some Dog Breeds More Jealous? Any dog can experience jealousy. While some breeds may be more likely to have separation anxiety or struggle with the instinct to guard their pet parent like a possession, jealousy is not limited to certain breeds. No current peer-reviewed research has been published that supports some dog breeds being overall more jealous than others. Signs of a Jealous Dog Some signs of jealousy in dogs are obvious, while others may be a bit more subtle. Signs that your dog is experiencing jealousy may include: Getting between you and another pet or person Whining when you are giving attention to another pet or person Bumping against your leg, pressing their body into you, or seeking closeness Growling when you are giving affection to another Barking, performing tricks, or engaging in other attention-seeking behaviors Going to the bathroom indoors (or not on the pee pad if they use one indoors) Why Dogs Get Jealous Many situations can ignite feelings of jealousy in a dog—usually when your attention is being pulled somewhere else. Common reasons why dogs get jealous include: Introduction of a New Pet Bringing home a new puppy or another adult dog can trigger jealousy in your dog, and they may show signs of aggression toward the new addition. Your dog might growl at the new dog, guard your lap, or try to get in between you and your new furry family member. This could get worse when you show affection toward your new dog. This aggression may also be worse if the newly adopted dog is of the same sex, or the dogs have clashing personalities. Your dog may feel that their place in the household is threatened and that the new dog will take all your love and attention, leaving less for them. Introduction of a New Human Family Member New human family members may also trigger feelings of jealousy in your dog. When a new baby arrives, your dog may feel like all the attention they once got is now divided or has even been completely redirected toward the infant. You may also notice jealousy when introducing your dog to a new partner. Your dog may not want to share your affection with your new partner and could act out in turn. Change in the Home Environment Any time there is a major change in your dog’s environment, it can cause feelings of uncertainty and jealousy. When you move to a new home, your attention is likely focused on cleaning and boxing up all your things. This can be concerning to your dog—they are not sure why things are changing and worried about your distracted attention. They may feel jealous that your focus is diverted to other tasks and that their role may not be the same in your life. Routine changes may also trigger these feelings of upset and uncertainty, like if your work schedule changes, or when kids go back to school after the summer. Being the New Pet in Your Home After getting a new dog, you may find that they quickly become jealous after you bring them home. Finding a new forever home can be a very emotional time. Sometimes, a newly adopted dog becomes jealous because they crave your attention, touch, and voice as a comfort during this time of change. They may also feel that any shared attention could mean that you might replace them with another dog, and they fear losing their new home. Pet Parent Interacting With Another Pet Dogs exhibit jealous behavior by trying to prevent their pet parent from giving attention to another pet. While some dogs are only jealous if they feel their relationship with you is threatened, other dogs are less secure and become jealous of all other people or animals. Dogs That Are Jealous of Other Dogs Dogs can get jealous of other dogs, but why do some dogs show more signs of jealousy than others? In one interesting study, researchers from the University of California were able to demonstrate jealousy in dogs when their pet parents gave affection to inanimate, realistic-looking stuffed dogs that barked, whined, and wagged their tails. When their pet parents spoke sweetly to the stuffed animal and petted it, three-quarters of the dogs in the study pushed up against their pet parent, tried to get in between their pet parent and the stuffed animal, or growled at the stuffed animal. So how do you know if your dog is likely to be jealous of a new dog or puppy? If you’ve noticed your dog displaying signs of jealousy when you encounter other dogs on walks, or when friends or family members bring dogs over to your house, they may initially struggle with jealousy if you get a second dog. Can Some Dogs Be Jealous of Cats? As cats are also a potential source of competition for a pet parent&#039;s affection, dogs can certainly be jealous of cats. This may be exacerbated when cats are allowed certain privileges that dogs are not, like getting up on the bed, couch, or even the counter. Your dog may see your cat as stealing love and attention that they feel should be directed at them. How to Handle a Jealous Dog While initially it may be cute, jealousy can become a problematic behavior. Jealous dogs may bite small children when left unattended, house-soiling may become unsanitary and costly to manage, and true anxiety disorders may develop if a dog’s envy is allowed to take hold in their life. However, you can take steps to avoid letting jealousy get out of hand. Introducing a New Dog or Family Member Be sure to foster a positive association with a new addition to the family. Go slow with introductions. Start with a piece of clothing or bedding with a new pet or human’s smell on it. Allow the first meeting to be short and sweet, and gradually increase the amount of time your dog must interact with a new household member. In the beginning, never leave your dog unattended with a new pet or baby. When you reach out to pet your new cat, be sure to send a loving stroke your dog’s way as well. Every time a new puppy gets a treat, your dog should also get a reward. You may even find that this technique helps your dog to be more invested in a new puppy’s housetraining success! Adult housetrained dogs can serve as excellent role models for new puppies that are still learning the ropes of a household. When you are holding a new baby, try to share some cuddles with your pet as well, allowing them to take part in a bonding session. When a new partner enters your home, equip the new person with treats so that your dog associates their visit with good feelings. Your dog may even grow to be excited to see them and share your affection. Managing Your Dog’s Jealousy Do not feed into your dog&#039;s jealous behavior. Sometimes removing potential stimuli or going to dog obedience classes may be helpful. Re-establishing good communication and boundaries with your dog may be helpful when your dog is feeling insecure and seeking guidance. If you’re not seeing the results you’d like at home, or your dog is struggling with aggression to the point of attacking, seek assistance from your veterinarian, a certified veterinary behaviorist, or certified animal behaviorist. References Merriam-webster.com. https://www.merriam-webster.com/dictionary/jealousNih.gov. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4108309/Featured Image: iStock.com/dageldog  "}]