[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/m880qfy1bp", "@type": "VideoObject", "duration": "PT2M31S", "name": "5327083687001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/03ce5e833bb198d6d2ccdb578e42d1659ea54d07.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/m880qfy1bp", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/586dd447ca7c75c597c9542c7142611cc9c01dd0.m3u8", "transcript": "Fear and anxiety in dogs is fairly common. But pinpointing the cause and helping your dog calm down can be extremely challenging. So let's look at some common causes of fear and anxiety in dogs and how you can help your pup cope during these stressful situations. Dogs may become fearful for a variety of reasons.\n\nBut fear is often associated with a specific stimulus such as thunderstorms or loud noises in these instances, a dog may show fearful behaviors such as panting shaking cowering or hiding anxiety in dogs is the anticipation of future danger, which triggers visible symptoms and bodily reactions. Anxious dogs may pant pace urinate or even become destructive. Separation anxiety is the most common form of anxiety in dogs and manifests when dogs are left alone. The root cause of fear and anxiety in dogs could be due to past events such as abuse or abandonment or it could just be due to improper socialization.\n\nMost phobias develop at the onset of social maturity when dogs are between the ages of 12 and 26 months. So some dogs do develop certain fears and anxieties as they age. Fearful dogs will often show outward signs such as trembling tuck tails flattened ears salvation and cowering fearful dogs may also lick their lips. Yawn frequently and try to hide under or behind furniture or even in specific rooms of the house where they feel safe.\n\nAnxious dogs may exhibit many similar signs such as shaking. But they are more likely to become destructive try to escape or even urinate as a result of the anxiety dogs suffering from anxiety also tend to pant whine and paced back and forth. And in some instances dogs may become self-destructive and lick or bite themselves excessively. Your veterinarian will perform tests to make sure the symptoms are not related to any other medical condition or disease.\n\nIf fear and anxiety is the diagnosis your veterinarian may choose to prescribe in times i.e. medication or recommend behavioral modification techniques. Not all dogs will require or even do well on an anxiety medications. So it's important to work with your veterinarian, and a certified dog trainer to determine the best course of treatment for dogs a separation anxiety hiring a dog sitter taking your dog to daycare or ensuring a safe, comfortable environment like a crate where your dog cannot hurt himself while you're away may all be necessary.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/evr_dg_how-to-calm-down-an-anxious-dog?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Anxiety Help: How to Calm Down an Anxious Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-cuddled-on-couch.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-cuddled-on-couch.jpg"}, "author": {"@type": "Person", "name": "Megan Petroff, DVM (Clinical Behavior Resident)", "url": "https://www.petmd.com/author/dr-megan-petroff"}, "keywords": "Dog, Behavior, Anxiety, Mental health, Zoo Anxious Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/evr_dg_how-to-calm-down-an-anxious-dog"}, "datePublished": "April 23, 2020", "dateModified": "August 30, 2023", "description": "Check out this guide to helping an anxious dog with tips straight from a veterinary behavior specialist.", "articleBody": "By Dr. Megan Petroff, DVM For people, anxiety can feel overwhelming and debilitating at times. If you have a dog that struggles with fear, anxiety, or stress, it’s important to be supportive and patient. Calming a frequently anxious dog is possible, but it may require collaboration between you and your veterinarian, or a board-certified veterinary behaviorist. If you have a nervous dog, here’s some insight you can use to identify the signs and triggers, and steps you can take to help calm your dog’s anxiety and improve their quality of life. Recognize the Signs of Dog Anxiety “Dogs use body language to communicate how they are feeling,” says Ashley Atkinson, CPDT-KA and behavior consultant at Best Friends Animal Sanctuary. For example, if your dog seems uneasy or is fixated on licking, they could be communicating nervousness, stress, or fear. There are many subtle signs of dog anxiety. According to Dr. Susan Konecny, RN, DVM, medical director of Best Friends Animal Society, some clinical signs include: Pacing Trembling Shaking Hypervigilance Lip licking Frequent yawning Decreased appetite She also says that some physiological effects of anxiety can include: Increased salivation or drooling Dilated pupils Increased heart rate and panting Skin lesions from self-trauma Over-grooming Talk With Your Veterinarian About Your Dog’s Anxiety Once you learn how to detect when your dog is anxious, you can begin to identify the triggers that are causing the anxiety. Write down the signs that you see and describe the situations and circumstances when your dog showed these signs. Then schedule an appointment with your vet so they can rule out underlying medical issues,and help you get the right treatment for your dog. Anytime a behavior change is noted in a pet, medical problems in other areas of the body could be at play. Your veterinarian can perform diagnostic tests to confirm that your pet is otherwise healthy. In all cases, it’s best to seek the help of your veterinarian to make sure you are doing everything you can for your dog. When no other cause is found, your veterinarian can prescribe anxiety medication if needed, and/or recommend a veterinary behaviorist. Board-Certified Veterinary Behaviorists If your veterinarian thinks it’s necessary, they may refer you to a board-certified veterinary behaviorist to help your dog. These veterinarians are specialists who have done a residency for three or more years in clinical behavior medicine, and passed a board-certification exam. Board-certified veterinary behaviorists are experts in treating fear, anxiety, and aggression in pets. The American College of Veterinary Behaviorists has a directory on their website with the current board-certified veterinary behaviorists near you. Tips for Calming Your Dog’s Anxiety Your veterinarian can help create a plan for relieving your dog’s anxiety, and it may include the following steps. Some are simple actions you can try at home, and others require your veterinarian’s oversight. Remove Triggers That Cause Your Dog’s Anxiety If you’ve already gone to your veterinarian to rule out other illnesses, and they’ve helped identify possible stressors, then it may be as simple as removing those stressors and seeing if your dog’s anxiety lessens. For example, if your dog is afraid of other dogs or people, you can skip the dog park. Alternatively, you can take your dog for walks when fewer people will be outside, play in a fenced yard if you have one, and play games inside the home. Try Dog Appeasing Pheromones Dog appeasing pheromones are synthetic pheromones similar to the calming pheromones that female dogs give off while nursing puppies. These pheromones can help reduce anxiety in some dogs and are available in a few different forms. There are collars, sprays, and diffusers, so you can choose the best option for your dog. Exercise With Your Dog Exercise can help with our own anxiety, and research studies have shown that greater levels of exercise in dogs are associated with lower levels of aggression, fear, and separation anxiety.1 Create a Sanctuary Space Some dogs get so anxious in certain situations that no amount of calming, praising, or rewarding will give them relief. “When this is the case, they need a quiet space with no stimulation where they can turn off all the input and simply unwind,” says Dr. Konecny. This can help in many situations, such as if they are nervous: When visitors come to your home During loud noise events (fireworks or thunderstorms) Drowning out ambient sounds with white noise may also help them relax in their sanctuary room. Ask Your Veterinarian About Anti-Anxiety Medications If your dog is truly struggling with anxiety, you can talk to your veterinarian about whether anti-anxiety medications would be beneficial. Some pet owners worry about using these medications: Will it make their dog sleepy all the time? Will it change their personality? Will these types of medications shorten their dog’s lifespan? When treated with the proper medications, your pet should exhibit less anxiety, seem happier, and still have the same personality. If your veterinarian isn’t sure what to prescribe, a board-certified veterinary behaviorist can help you find the best medication for your dog to help them thrive. Try Behavior Modification Sometimes, additional modalities are needed to treat behavior problems in pets. Behavior modification can help you change the emotional response your dog has to offending situations or triggers. Through this cognitive therapy, your dog can learn to become less afraid of stressors and more calm. In some cases, behavior modification can help a dog to the point where they will no longer need to be on medications. This is something a veterinary behaviorist can help you with as well. Be Supportive Learning and avoiding what causes your dog stress, ruling out possible underlying illnesses, and seeking professional help will all improve the quality of life for your anxious dog. Scientific evidence has shown that stress has negative effects on health in people, and this is true in dogs as well. A 2010 study of 721 dogs concluded that, “The stress of living with a fear or anxiety disorder can have negative effects on health and lifespan in the domestic dog.”2 For this reason it’s important to be proactive to help your dog with their anxieties. Don’t give up. The solution may not be quick or easy, but with dedication and the right professional assistance, you can help your dog be happier and healthier. Citations 1. Lofgren, Sarah E., et al. “Management and Personality in Labrador Retriever Dogs.” Applied Animal Behaviour Science, vol. 156, 2014, pp. 44-53. 2. Dreschel, Nancy A. “The Effects of Fear and Anxiety on Health and Lifespan in Pet Dogs.” Applied Animal Behaviour Science, vol. 125, no. 3-4, 2010, pp. 157-162.   See Also Featured Image: iStock.com/Kerkez"}]