[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Depression: Signs, Causes, and Treatment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/sad-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/sad-dog.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Behavior, Mental health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/can-dogs-get-depressed"}, "datePublished": "November 29, 2021", "dateModified": "August 16, 2022", "description": "Dr. Stephanie Howe discusses everything you need to know about dog depression and what you can do about it.", "articleBody": "Depression, as we know it in people, is a mood disorder that causes feelings of persistent sadness and worthlessness. It’s often linked with a loss of interest in normal activities. Depression is more than just a bout of the blues, temporary sadness, or grief, though those feelings can all play a part. In humans, it can range from mild symptoms to a debilitating and chronic condition that interferes with the ability to perform daily activities. Treatment for human depression typically includes medication and therapy. But what about dogs—can they get depressed, too? Do depressed dogs feel the same? And what’s the treatment for dog depression? Can Dogs Get Depressed? Yes, but dogs do not typically experience what we recognize as clinical depression in humans. That being said, our canine family members can certainly feel depression in the form of the blues, sadness, and grief. And while we can’t ask dogs about their feelings, we can recognize signs that show that dogs certainly can experience these emotions. Dr. Gregory Burns, Distinguished Professor of Neuroeconomics and Director of the Center for Neuropolicy at Emory University, has done research on dog emotions that gives us better insight. Dr. Berns conducted non-invasive magnetic imaging resonance studies (MRIs) on nearly 100 dogs and has tracked the areas of the human and canine brains that are active during certain emotions. His research shows that the areas of the human brain that are active when experiencing certain emotions are also active in dogs. We can extrapolate from this data that the dogs are experiencing similar emotions when these areas are active.1,2  Signs of Depression in Dogs Depression can show up in many different ways, depending on the cause. A pet that’s depressed from the loss of a long-term companion will act differently than a pet that is grieving the loss of a normal routine during a move. A 2016 study out of New Zealand and Australia looked at the signs of depression in dogs and cats after the losing a companion animal.3 These signs may include: A decrease in appetite Sleeping more than usual or appearing lethargic Demanding more affection or being clingy/needy with their owners Frequenting areas of the home where their companion sent the majority of their time A change in vocalization (meowing, barking, howling, etc. more than usual) Unusually aggressive behavior towards people or other animals Inappropriate elimination (peeing or pooping) in the home We can also see other signs of depression, sadness, or anxiety in pets, depending on the situation. You may see signs like: Withdrawal from social situations Hiding Increase in destructive behaviors Not wanting to participate in normal play activities When a veterinarian is looking to potentially diagnose a pet with depression, the first step is to get a thorough medical history from the pet parent. Knowing about any changes in the home can be extraordinarily helpful in determining if depression is the cause of any clinical signs your pet is showing. Other Conditions That Can Be Confused With Dog Depression Unfortunately, the symptoms of dog depression can be similar to other medical conditions. Chronic pain is often mistaken as depression in older pets, and to further confuse matters, stress from depression can make underlying medical conditions emerge.   Canine cognitive dysfunction syndrome (CCD) is a condition associated with the aging of a dog’s brain, which can affect their awareness, memory, learning, and response to certain stimuli. CCD can have signs similar to depression. If you have an older pet (usually 8 years and above) that is starting to show these signs, ask your vet about CCD. If your dog is showing signs that are consistent with depression, especially in the absence of a life-altering event, they should be evaluated by their primary care veterinarian to look for an underlying cause. If your dog’s symptoms of depression are accompanied by any other signs, like vomiting, diarrhea, severe lethargy, significant aggression, peeing or pooping more often, and so on, take your dog to the vet right away. What Causes Dog Depression? If you suspect your dog is suffering from depression, think about what has changed or is changing in their life, such as changes in their environment or social situations. Any significant change to a pet’s normal routine can cause stress and/or depression. This is not a complete list, but dog depression can be caused by: Chronic pain or chronic illness Trauma (like an injury or abuse) Isolation (such as a pet that is crated only after a surgery or injury) Lack of mental or physical stimulation, especially in energetic or working dogs Changes in the household: The addition of a new family member (human or pet) A change in work or school routines, like a pet parent going back to work after an extended stay at home Pets can also feel empathy with pet parents, including depression. A 2019 study in Sweden looked at the concentration of long-term stress hormones in humans and their pets and found that dogs had similar stress levels as their owners. They concluded that “the dogs...mirror the stress levels of their owners rather than the owners responding to the stress in their dogs.” Dogs can pick up on our moods and recognize our facial expressions and body language. They know when we are happy or sad, and our moods can affect them.4 How to Help a Depressed Dog Similar to humans, depression and its effects can be different for each dog. To help your dog, you need to find out what is causing the symptoms. Thankfully, dogs are pretty resilient creatures. After a depression-inciting event, small changes can make a huge improvement to their emotional state. Here are a few ideas that may be helpful. Set up play dates. If your pet is missing a furry friend, engaging with another dog can help fill the void. Adopting another dog can also help, but you should not make this decision solely to cheer your dog up. Bringing a new pet home needs to be the right fit for both you and your pet. Increase mental and physical stimulation. This could be taking your dog on extra or longer walks, playing fetch consistently, giving them a new enrichment or puzzle toy, or encouraging them to engage in some of their favorite activities. Make sure they are eating. Adding a topper to their food temporarily can encourage your pet to eat. A sudden change in diet can lead to digestion issues, so do not change their diet completely or abruptly. Give them some individual time. This is not time spent in a kennel or alone at home, but time where they can enjoy a mentally stimulating toy or activity, like a KONG with frozen KONG stuffing inside, treat dispenser toys, puzzle games, or chews. Respond appropriately. If your pet’s depression is causing them to act out, you need to direct your behavior so you are not inadvertently reinforcing a bad behavior. Reward appropriate behaviors with attention, treats, etc. You should not punish unwanted behavior in general, and it especially does not work for pets suffering from depression or anxiety. It’s important to know what a relaxed dog looks like so you can monitor their return to normal. A relaxed dog will have an open mouth with no facial tension, and they may pant. Ears can be a bit tricky since they come in all different shapes and sizes, but generally, a relaxed dog will have their ears slightly back or out to the sides. If your dog is relaxed, they will hold their tail out in a low or neutral position with an easy wag, and when they play, their body will be loose and wiggly. When to See a Vet About Your Dog’s Depression It is important to know when to contact your veterinarian when your dog is showing symptoms of depression. Your dog should be seen right away if they: Are very lethargic or not eating Have stopped improving Develop other symptoms, like vomiting or diarrhea There are the rare circumstances when the stress caused by depression can cause underlying health issues to emerge. If you are concerned about your pet&#039;s depression, schedule a visit to talk to your veterinarian. This can help ease your concern and give you some great ideas on how to help your pet navigate their depression. Is There Medication for Dog Depression? As with the majority of behavioral concerns in dogs, medications should be just one part of the treatment plan. Medications for dog depression are usually beneficial when combined with behavioral modification, supplements, and pheromone products. Medications can be especially helpful for pets that have a history of fears or anxieties and are also going through a difficult situation. Treatment Plans for Dog Depression If your dog’s depression is causing behavioral issues, careful environmental management and behavior modification are important. It is vital that the treatment plan for a pet with severe depression come from a Certified Applied Animal Behaviorist, a veterinary behaviorist, or a primary care veterinarian who practices veterinary behavior. After you talk to your veterinarian about your dog’s specific situation, you can move forward with the recommended treatment, which may include: Prescription medications Behavior modification Environmental changes Supplements Medical therapies Selecting a trainer who is qualified to manage these issues Thankfully, your pets have us as their advocates for their mental health. When you notice changes in your dog’s behavior, you can work with your veterinarian to ensure they are getting care the care they need for their depression.   References Berns G. How Dogs Love Us: A Neuroscientist and His Dog Decode the Canine Brain. Brunswick, Victoria Scribe; 2014.Berns G. What It’s like to Be a Dog: And Other Adventures in Animal Neuroscience. Oneworld; 2019.Walker J, Waran N, Phillips C. Owners’ Perceptions of Their Animal’s Behavioural Response to the Loss of an Animal Companion. Animals. 2016;6(11):68. doi:10.3390/ani6110068Sundman A-S, Van Poucke E, Svensson Holm A-C, et al. Long-term stress levels are synchronized in dogs and their owners. Scientific Reports. 2019;9(1). doi:10.1038/s41598-019-43851-xFeatured Image: iStock.com/mustafagull"}]