[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Lick The Air?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-09/dog-in-the-wind-picture-id507281462.lucievisser.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-09/dog-in-the-wind-picture-id507281462.lucievisser.jpg"}, "author": {"@type": "Person", "name": "Kasey Stopp, DVM, CVA", "url": "https://www.petmd.com/author/dr-kasey-stopp"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-lick-air"}, "datePublished": "September 28, 2021", "dateModified": "August 16, 2022", "description": "Dr. Kasey Stopp talks about the strange phenomenon of dogs licking the air, when you should worry, and possible causes.", "articleBody": "Has your dog ever stopped in the middle of a walk to point their nose to the sky and lick the air? Do they ever lick at the air briefly after eating a meal or enjoying a treat? Or maybe you hit the perfect itchy spot on your pup, and they licked at the air while you scratched it. This may seem confusing or unusual or even funny to us, but licking the air can help dogs communicate a variety of information if only we take the time to “listen” to the lick! Is It Normal For Dogs to Lick the Air? While we may not easily understand what dogs are telling us when they lick at the air, it can be perfectly normal. The better question is whether the licking is something to worry about. Dogs lick the air for a number of reasons: to better smell things they are interested in, to communicate anxiety, to combat an upset stomach, etc. Occasional, short-lived episodes of air-licking are not a cause for alarm, but you should watch for increases in the time and/or frequency spent licking. Why Do Dogs Lick the Air? With so many distinct reasons for why your dog might be licking the air, the list of possible treatments is varied. Working with your veterinarian to find the root cause of your dog’s air-licking will help you decide how to best treat the problem, if treatment is even necessary. Here’s a list of possible reasons your dog licks the air. Amplifying Their Sense of Smell Your dog has a sense of smell that is 10,000 to 100,000 times more sensitive than yours, in part because their noses contain 125-250 million olfactory receptors while human noses only have 5-6 million. This increased sense of smell is thanks to a special organ called the vomeronasal organ (or Jacobson’s organ). This organ is located inside a dog’s nasal cavity, opening into the roof of the mouth behind their front teeth. When dogs curl up their top lip and flare their nostrils, they are opening up their vomeronasal organ to get an even better smell of their surroundings. Dogs can further increase the scent being delivered to this sensitive organ by licking the air, directing even more smell-carrying molecules to the brain. Stress or Anxiety In the dog world, when a more dominant or aggressive dog approaches, there are a number of behaviors that indicate submission or appeasement. Licking is one of those behaviors. If you notice your dog licking at the air when you speak sternly or stare at them, they are letting you know they understand that you are in charge. If your pup regularly licks the air as you approach, avoid eye contact and speak in a quiet, high-pitched voice. This may decrease their anxiety enough to stop the licking. Depending on the cause of stress or anxiety, increased activity and some anti-anxiety supplements or medications might be appropriate. Dental Disease and Painful Teeth A loose or painful tooth can change the pattern of your dog’s bite and may cause them to appear to lick at the air when they’re trying to move that tooth or dull the pain. Ask your vet about your dog’s dental health at every annual visit.  Dogs need dental care just like people, including professional cleanings. If your dog has halitosis (bad breath), excessive drooling, or trouble picking up food, or they lick their lips/teeth/air excessively, make an appointment for a thorough oral exam by your veterinarian. Foreign Object in the Mouth Just like you might work a popcorn kernel out from between your teeth with your tongue, dogs may appear to be licking at the air when they have a chunk of food stuck in their teeth or to the roof of their mouth. It may require sedation to remove the object before the licking will resolve. If your dog is chewing on a stick or bone and suddenly licks at the air, check for chunks of debris that could be stuck between their teeth on the roof of their mouth. Don’t let your dog chew on items that can crack or splinter, as they can cause injuries in their mouths as well as dangerous gastrointestinal issues that may require surgery. Gastrointestinal (GI) Issues Your dog might be licking the air to grapple with nausea, which can be a symptom of an underlying medical concern. If nausea or GI issues are the root of your pup’s licking problem, a change of diet or medications specific to your dog’s needs may be the solution. If your dog’s air-licking comes with vomiting, diarrhea, or a decreased appetite, schedule an appointment with your veterinarian. A chronic upset stomach could be caused by something as simple as a food sensitivity, but it could also be a symptom of pancreatitis, irritable bowel syndrome, or other GI disorders. Skin Issues Dogs with itchy skin or external parasites, like fleas, will usually lick, bite, or scratch at their skin to relieve the itch. However, if a dog has been scolded for licking, or they can’t quite reach the itchy spot due to obesity and/or arthritis, they may lick at the air in an attempt to mentally scratch that itch. Skin issues, such as itchiness, that cause a dog to lick can often be treated with flea prevention products, a food allergy diet trial, or the addition of omega fatty acids to your dog’s diet. If your dog’s air-licking goes along with generally itchy skin, consult with your veterinarian about parasite control, as well as other potential options to decrease the itch. From feeding a sensitive skin diet to prescription anti-itch medications, your veterinarian can make recommendations based on the root cause of your dog’s itch and their medical history. Compulsive Disorder If your dog’s air-licking started due to anxiety, but now seems to occur more often or in new situations, it may have progressed to a compulsive behavior they are no longer able to cease on their own. Talk to your veterinarian to determine if a compulsive disorder may be to blame for your dog’s excessive licking. Cognitive Dysfunction An estimated 14% of dogs 8 years and older (with increasing prevalence with age) are thought to be affected by canine cognitive dysfunction syndrome (CDS), similar to Alzheimer&#039;s in humans. One of the many symptoms of CDS is repetitive behavior, such as licking, chewing, circling, etc. Talk to your vet about other symptoms if you think your dog might be suffering from CDS. Why Do Dogs Lick the Air When You Scratch or Pet Them? Similar to dogs that move their back leg when you find that perfect spot to pet them, some dogs will lick at the air as a sign of enjoyment. If your dog isn’t suffering from any skin issues or excessive itchiness but licks the air when you scratch certain areas on their body, take it as a “Thank you, keep up the good petting.” When Should You Worry If a Dog Is Licking the Air? If you notice that your dog licks the air obsessively for long periods of time, it’s time to see your veterinarian, as there may be a medical or behavioral cause that needs to be addressed. Take a video of your dog displaying the behavior at home. If possible, also take a video of your dog when you’re out of the house to determine if the obsessive licking only happens in the presence of people. Be prepared to tell your vet about the amount of exercise, mental stimulation, and social interaction your dog gets on a daily basis, along with any training or methods you have tried to stop the licking. Compulsive licking can often be treated through a combination of medication, environmental changes, decreased stress, and specific types of training. Likewise, if your dog bites at the air or has twitches in their face or body while licking at the air,  take video(s) of the behavior. Make an appointment with your veterinarian as soon as possible to discuss the possibility of focal seizures being the cause of the air-licking behavior. If your vet determines that your dog is licking at the air as part of a type of seizure activity, they will likely start your pup on anti-seizure medication or recommend further diagnostics, such as a referral to a veterinary neurologist. Featured Image: istock.com/lucievisser"}]