[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/p2ytogjft8", "@type": "VideoObject", "duration": "PT1M6S", "name": "5412323526001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/d95f3b5b4395198d7d5decae88ea5adab391f342.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/p2ytogjft8", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/f67278e64acec036f5dea687c437ef0fba3e2f83.m3u8", "transcript": "I don't think you do. But now how I've been with you and every word you say then you get your men get them.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/why-do-dogs-yawn?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Yawn?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-08/beagle-tired-sleeping-on-couch-yawning-picture-id1135151062.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-08/beagle-tired-sleeping-on-couch-yawning-picture-id1135151062.jpg"}, "author": {"@type": "Person", "name": "Manette M. Kohler, DVM", "url": "https://www.petmd.com/author/dr-manette-m-kohler"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-yawn"}, "datePublished": "August 31, 2021", "dateModified": "August 16, 2022", "description": "Dr. Manette Kohler talks about what it means when a dog yawns and whether it’s normal for dogs to yawn a lot.", "articleBody": "Yawning is perfectly normal in dogs. In fact, it is normal behavior in most vertebrates, including primates, horses, penguins, fish, cats, and even snakes, among many others. You’ve no doubt seen your dog settle in for a nap with a big, satisfying yawn just before they rest their head and drift off to sleep. You’ve probably done it yourself, too, because you were tired or bored. While being tired or bored seem to be common reasons for human yawns, what about dogs? Are they just bored, or might it mean something else? Here’s what you need to know about dog yawning, including what it means when your dog yawns a lot and what you should do if they are. What Does It Mean When a Dog Yawns? This is where things get interesting. Turns out, tiredness and boredom don’t come close to fully explaining why dogs yawn. There are many theories on the function of yawning, including physiological and emotional/sociological functions. Physiological Reasons for Dog Yawning Physiologically, some studies suggest that yawning, like caffeine, might play a role in stimulation of the nervous system. Yawning might also “cool” down the brain when its temperature increases. Neuroscientist Robert Provine has done extensive research on yawning that shows that, in dogs, humans, and other vertebrates, yawns often come during moments of transition from one behavioral state to another, such as: Waking up Falling asleep Going from an anxious state to a calm state Moving from boredom to alertness Emotional and Sociological Functions for Dog Yawning Dog yawning also seems to have emotional and sociological functions. Simply put, dogs yawn when they are stressed. According to Turid Rugaas, Norwegian behaviorist and author of On Talking Terms With Dogs: Calming Signals, yawning is one of many signals dogs use to calm themselves when they are stressed or uneasy. A dog could feel stressed when: Entering a veterinary clinic Witnessing or hearing a quarrel in the household Being restrained or held tightly Being hugged by a child Having a stranger approach Rugaas also explains that yawning and other “calming signals” can communicate a dog’s peaceful intentions to others to avoid conflict or diffuse a potentially threatening situation. We need to look at the rest of the dog’s body language to fully understand how they are feeling. For example, a stressed dog that’s yawning might also be licking their lips and/or tucking their tail, holding their ears back, and maintaining an averted gaze or big, wide eyes. A dog&#039;s yawn can also transmit feelings of stress to their social group. In a recent study at the Ontario Veterinary College, University of Guelph, researchers evaluated the influence of owner presence on behavioral and physiological indicators of fear in dogs during routine physical exams. They found that when the dogs’ owners were present, there were fewer vocalizations, a lower body temperature, and a higher rate of yawning. Researchers felt that yawning might have been a social signal between a dog and their owner during the exam. They concluded that, when practical, owners should be encouraged to remain with their dog during routine vet exams. Similar results were seen in previous studies. In one study, dogs yawned more frequently when encountering familiar dogs as compared to unfamiliar dogs. In another study, shelter dogs that were petted by a handler as they were removed from their cages yawned more, sought more contact with the person, and had more relaxed postures than dogs that received no attention. Yawns can also be contagious, and this is true for dogs, primates, and horses. According to Nick Dodman, BVMS, Dipl. ACVB and Professor Emeritus at Tufts University School of Veterinary Medicine, yawning in dogs may well prove that they can experience empathy. In a recent study that described the contagious effect of humans yawning, they found that dogs yawn more frequently when watching their owner yawn compared to watching an unfamiliar person yawn. This indicates dogs’ emotional closeness with their owners. This implies that dogs are self-aware and also aware of the feelings of others. What Does It Mean When a Dog Is Yawning a Lot? If you’re seeing a lot of yawning along with some of the other indicators of stress (tail tucked, ears back, avoidance, cowering, looking away, lip licking, big eyes, etc.), you can assume that your dog is feeling fearful, uncertain, anxious, or stressed about the outcome of the interaction or situation. In the book Doggie Language, illustrator and author Lili Chin explains that a stress yawn is accompanied by a body that is not relaxed or sleepy and may indicate that the dog may be feeling: Anxious Uneasy Like they need to release tension Like they need to avoid conflict Like they need a break When you see your dog yawning a lot (and showing other signs of stress), your goal should be to help your dog feel better. How Can You Help a Dog That Keeps Yawning? Choice is extremely important for dogs that are feeling fearful, anxious, or stressed. Never force your dog to interact with a person, a child, or another dog. Preventing your dog from leaving the situation or allowing a person to continue the approach can make the situation more intense. The dog may be forced to use more overt signs of fear, anxiety, and stress to ask for distance, such as growling, snapping, and biting. If your dog looks scared and/or yawns a lot, here are some simple and basic things you can do to help: Avoid situations that are stressful or that cause your dog to feel fearful (leave your dog at home when you go to loud or crowded events like a parade or fireworks show). Create a safe space for your dog. Give them a quiet room with background noise and special puzzles/treats/toys. Learn your dog’s signs of fear, anxiety, and stress and help your dog feel safe (move your dog farther away from the scary stimulus; ask the approaching stranger to stop their approach; take your dog to a quiet location with fewer scary stimuli). If fear and stress are part of your dog’s everyday life, help them gradually feel less fearful of their particular triggers through science-based behavior modification. This involves creating positive associations, teaching and rewarding new behaviors, in some cases, utilizing anxiety management to help your dog feel better and be able to learn. A veterinary behaviorist or a trainer can help you with this. Theories on the function of yawning abound and date back to 400 BC, but one thing is clear—yawning is a nonverbal signal that may have multiple functions in many different species, including dogs. If you are seeing your dog yawning a lot, look at the whole picture, including the rest of your dog’s body language, and look at the context to figure out a way to help your dog feel safer.   Resources Chin, L (2020). Doggie Language: A Dog Lover’s Guide to Understanding Your Best Friend, Summersdale Publishers Ltd Rugaas, T (2006). On Talking Terms With Dogs: Calming Signals, Dogwise Publishing Stellato AC, Dewey CE, Widowski TM, Niel L. Evaluation of associations between owner presence and indicators of fear in dogs during routine veterinary examinations. Journal of the American Veterinary Medical Association. 2020 November; 257(10): 1031-1040 https://doi.org/10.2460/javma.2020.257.10.1031 Featured Image: iStock/Przemysław Iciak See Also:"}]