[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Growl &amp; What To Do", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1283078399.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1283078399.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-growl"}, "datePublished": "December 12, 2022", "dateModified": "January 26, 2023", "description": "Dr. Wailani Sung explains different meanings of common dog growls, what to do when your pup growls, and most importantly, what not to do when a dog growls.", "articleBody": "Growling is part of normal canine communication. People usually think of a dog’s growl as a warning or as a sign of defense. Often, growling means that the dog needs space or is uncomfortable. However, growling is a complex vocalization that also occurs in other situations. It is important to understand why your dog is growling, how you can prevent them from escalating their behavior, and when to intervene. Potential Causes of Dog Growls Depending on the situation and who is involved, dogs may growl when they are: Playing Greeting another dog or person Verbally reprimanded or physically corrected Interacting with another dog or person while they are lying down in a preferred location Approached by another dog or person while they have a preferred toy or high-value food item How To Tell the Difference Between Growls Play growling­: Growling may occur during playful interactions among dogs or between a dog and the pet parent. The growling in this case does not indicate that the other dog or person should go away. It’s just a part of normal play behavior. The dog usually has loose body language and soft facial expression, such as a tail held in neutral position and soft ears moved slightly to the side. Both puppies and adult dogs may growl during play. Growling during greeting: Sometimes, growling occurs during greeting other dogs face-to-face. The growl may happen before the other dog comes closer. This may be accompanied by stiff body language, a hard stare, and ears pointed forward or held to the side. This is a clear message that the growling dog does not want the second dog to come any closer. Other times, growling may occur after the face-to-face greeting ritual, especially if one dog is taking a long time sniffing the other dog’s face. This means that the growling dog is uncomfortable and wants the other dog to move back. Growling when verbally reprimanded or physically corrected: Dogs growl when they are yelled at, hit, choked, sprayed at, or shocked. Verbal and physical corrections may temporarily stop the bad behavior, but they do not teach the dog not to repeat it. They also damage the human–animal bond and teach a dog not to trust people since they are unpredictable. Punishment techniques increase a dog’s fear and anxiety. They can also increase the dog’s aggression toward those administering the punishment. Growling when another dog or person approaches while they are lying down in a preferred location: When approached while lying down, the dog growls, lowers their head, avoids direct eye contact, such as looking out of the side of their eyes, and pulls their ears back. This is a clear indication to the other party that the dog does not want to interact or is worried that they may be displaced from their comfortable location. Growling when another dog or person approaches while they have a preferred toy, or high-value food item: When approached, the dog growls and makes direct eye contact, bares their teeth, and has the front half of their body hunched over the preferred object. This means that the dog is uncomfortable with the proximity of the other party to them, and they are worried that the other person or dog may take the item away. What Not To Do When Dog Is Growling Do not yell at or hit your dog when they growl. Remember that a growl, just like a bark, is your dog’s vocal communication. When you tell your growling dog to be quiet, you are only correcting what you perceive to be a problem in that moment and not understanding why your dog is growling. When you physically punish your dog for growling at another dog or stranger, it may lead to further aggression with your dog baring their teeth, lunging, snapping, or even biting the other party. The punishment may reinforce your dog’s underlying fear or anxiety, and you are contributing to the formation of negative associations. By punishing, you also may be confirming to your dog that they should be worried or fearful when strangers approach, because you, the person they trust the most, become unpredictable and mean when strangers are present. It reinforces their feeling that the presence of strangers is a negative experience. What To Do When Dog Is Growling When your dog growls, acknowledge the growl and redirect your dog to perform more desirable behaviors. For example, if you are on a walk and your dog growls at someone heading in their direction, interrupt the behavior using a neutral noise, such as a quick whistle, finger snap, or light clap. You do not want to use a loud, startling noise, just one loud enough to get your dog’s attention. Next, as the stranger walks by, have your dog focus their attention on you by asking them to perform a command (like “look” or “touch”). When your dog performs the behavior, offer a treat and praise. By doing this, you are teaching them to focus on you when they feel worried or uncomfortable. You are also working on counter-conditioning to change your dog’s negative emotional response to strangers. If your dog has a habit of growling at strangers, carry a treat pouch on every outing with your dog. Every time you see a stranger heading your way, immediately give your dog a treat before they growl. Ask them to look at you when you anticipate a growl to teach them an alternate behavior: “I look at my parent when I see strangers.” You want your dog to check in with you and not escalate their behavior when they are uncomfortable. If your dog is not interested in high-value treats, offer plenty of praise and petting or playing with a preferred toy. Find the items that motivate your dog and use them as rewards. Training your dog provides a clear way to communicate with them. Training, as well as providing appropriate mental and physical outlets, also reinforces the desirable behaviors that you want to see in your dog and weeds out the undesirable ones. Professional Training for Dogs If you need some guidance on how to work with your dog, find a trainer who uses positive reinforcement training, such as a Fear Free trainer, KPA-, or CTC-certified trainers. Do not use a trainer who endorses punitive or balanced training techniques. Trainers should not make your dog feel uncomfortable or scared. Trainers should help your dog gain confidence and be excited about learning from you and listening to you. If your dog continues to growl, refuses to take rewards, appears fearful and anxious, or escalates their behavior to barking, lunging, and biting, then it is time to see a board-certified animal behavior professional such as a veterinary behaviorist (DACVM) or an applied animal behaviorist (CAAB). Featured Image: iStock.com/sanjagrujic"}]