[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Military Working Dogs: Understanding Canine Post-Traumatic Stress Disorder", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-canine-PTSD.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-canine-PTSD.jpg"}, "author": {"@type": "Person", "name": "Desireé Broach, DVM, Dipl. ACVB", "url": "https://www.petmd.com/author/dr-desiree-broach"}, "keywords": "Dog, Behavior, Syndromes, Mental health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/military-working-dogs-understanding-canine-post-traumatic-stress-disorder"}, "datePublished": "February 6, 2018", "dateModified": "September 8, 2023", "description": "Due to the nature of the combat environments in which they perform, military working dogs can be susceptible to canine post-traumatic stress disorder. Learn more about this condition on petMD.", "articleBody": "By Desireé Broach, DVM, Dipl. ACVB Military working dogs (MWDs) have served officially in the U.S. military since 1942, although their history of service dates back before then. Training originally ranged from scouting, messenger, and tactical-type tasks, to the present-day installation law enforcement, detection, and combat-operations tasks. Each of the specializations that a military working dog can obtain has its own set of skills for the dogs to learn before becoming a certified MWD. Bred for a specific set of skills, dogs selected to serve as MWDs are resilient, highly intelligent, and have a robust capability. Skills that have saved countless lives—neither man nor machine have been able to replicate them. Despite their genetics and training, due to the nature of the combat environments in which they perform their jobs, military working dog can be susceptible to canine post-traumatic stress disorder (C-PTSD).   What Is Canine Post-Traumatic Stress Disorder? The condition classified as C-PTSD in U.S. military working dogs was first applied in 2010, after a review of cases that presented with noticeable adverse behaviors associated with dogs who had been or were currently deployed, described Dr. Walter Burghardt during a presentation at the ACVB/AVSAB Veterinary Behavior Symposium in 2013. The adverse behavior “syndromes” documented in those military working dogs correlated with most of the criteria for the human diagnosis of PTSD, so the term canine post-traumatic stress disorder was adopted. There are currently approximately 1,600 dogs in the military working dog program, with a fluctuating number of those dogs in training or deployed. As of 2017, C-PTSD diagnosis accounted for approximately 68 military working dogs. However, the numbers have decreased since 2013, with only 4.25 percent of the population affected over the last seven years. When a military working dog displays a noticeable change in behavior, whether in general temperament or working behavior, the handlers and veterinarians working directly with the dogs exhaust all possible reasons for the change. First, a potential medical cause is explored, to ensure no illness or injury has caused a change in the dog’s behavior. If a medical reason is not found, other options are explored, such as a behavioral disorder like C-PTSD. The difficulty in diagnosing C-PTSD, however, is there is not always an instantaneous or apparent change in the military working dog after an event, or recognition of an event the dog may perceive as traumatic goes unnoticed. The symptoms resulting from an event can be mild or delayed for months, so correlating the behavior back to a specific time or place can be difficult as well. Additionally, to diagnose a military working dog with C-PTSD, the symptoms must be present for longer than what is considered a typical recovery time from a traumatic event, which can vary between dogs. Common Symptoms of Canine PTSD in Military Working Dogs As with other disorders related to distress or a traumatic experience, common symptoms of C-PTSD can include: increased or decreased responsiveness to the environment, changes in the relationship with the handler, failure to perform work-related tasks, escape or avoidance behavior, or other general signs of fear, anxiety, or stress, according to Burghardt. The symptoms seen with C-PTSD can vary widely between individual military working dogs. For example, one MWD may become depressed and uninterested in working, while another MWD may still work well but becomes aggressive and difficult to handle. Using a behavioral diagnosis, like C-PTSD, is a method for veterinarians to categorize the issues using consistent terminology, but it does not imply that each patient presents in the same manner. We assign the problem a name (i.e., canine post-traumatic stress disorder); however, each patient may present with different symptoms, be in different stages of the disorder, and respond differently to treatment. Treating Canine PTSD As mentioned previously, military working dogs are bred to be highly resilient. Those genetics, along with the training, preparation, and care they receive are strategies used to protect against C-PTSD. However, in the event a military working dog has difficulty recovering from a traumatic event, the best treatment is combination therapy. The combination of recommendations cater to the intensity, frequency, and type of symptoms displayed by each individual dog. Medication can help reduce the fear, anxiety, or aggression symptoms, but it is important to avoid triggers for the C-PTSD behavior, such as combat settings or noises, incorporating behavior exercises and training to teach the dog how to cope in stressful situations. The majority of the military working dogs with C-PTSD are treated and managed successfully. Handlers and veterinarians recognize the importance of identifying any issues and getting treatment initiated as soon as possible. However, there is a difference between curative treatment and successful treatment when treating C-PTSD, or another behavioral disorder. Every animal learns from experience, so treatment is not expected to erase what happened, nor is it the goal to cure them from trauma. Rather, we treat each military working dog so that they can successfully recover and return to work while maintaining good health and welfare. There are some cases where treatment is successful for the dog; but part of the treatment could include retirement from military service. Recognition of Canine PTSD The veterinary community does not have a standardized book of behavioral diagnoses like human psychology has. There is always room for debate regarding terminology in diagnoses, even with C-PTSD. Regardless of the term chosen, veterinarians recognize fear, anxiety, and stress, and it is necessary to treat these symptoms for the health and welfare of the patient. There is a difference between pets and military working dogs diagnosed with C-PTSD, because MWDs are exposed to combat environments as part of their job requirements. The difficulty in diagnosing C-PTSD in a pet animal is knowing whether there is history of trauma (real or perceived) and if the pet’s current behavior is a result of a failure to cope with previous trauma. Although there may be debate on how and when it is appropriate to diagnose C-PTSD in the pet population, the criteria for diagnosis in military working dogs is specific to the work they perform. C-PTSD is a rare but recognized problem in military working dogs. Early recognition of the symptoms of distress following a trauma by handlers and veterinarians can lead to prevention or successful treatment of C-PTSD. However, if a military working dog is retired for a medical or behavioral reason (such as C-PTSD), there are many organizations dedicated to assisting the adoptive owners of veteran dogs with medication costs, as well as providing a forum for networking and support."}]