[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Laugh?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/happy-white-fluffy-dog-with-big-smile-picture-id1056388636.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/happy-white-fluffy-dog-with-big-smile-picture-id1056388636.jpg"}, "author": {"@type": "Person", "name": "Autumn Madden, DVM", "url": "https://www.petmd.com/author/dr-autumn-madden"}, "keywords": "Dog, Behavior, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/can-dogs-laugh"}, "datePublished": "December 2, 2021", "dateModified": "August 16, 2022", "description": "Dr. Autumn Madden explains whether dogs actually laugh like we do, how they react to our laughter, and whether you can make your dog laugh.", "articleBody": "Laughter, by definition, is a physiological response to humor. Dogs can be playful, but do they understand humor and laughing at funny things? Do they have their own version of laughter? What do they think when humans laugh? Do Dogs Laugh? Dogs do laugh; however, it is not the same way humans do. In humans, laughter is composed of rhythmic, vocalized, expiratory, and involuntary actions. The sound can be any variation of “ha-ha” or “ho-ho.” Dogs produce a similar sound through forceful panting—a  “hhuh-hhah” variation. Dogs usually make this sound while playing to invite humans and other dogs to play; it is known as a “play-pant.” The play-pant is a form of breathing and not a vocal sound. The appearance of this laugh has been described by Konrad Lorenz in his book, Man Meets Dog, as “…opened jaws which reveal the tongue, and the tilted angle of the mouth which stretches almost from ear to ear give a still stronger impression of laughing. This ‘laughing’ is most often seen in dogs playing with an adorned master and which become so excited that they soon start panting.”1,2 Dogs also use body language to invite play. These behavioral cues consist of play bows, pawing, and jumping with a relaxed demeanor. Do Dogs Have a Sense of Humor? Dogs have been bred throughout the years to have a juvenile mind, which is similar to neoteny (the retention of juvenile features) in humans. It is believed that this stage of development is responsible for playful behavior in dogs, which is comparable to a sense of humor in humans. This phenomenon was first observed by Charles Darwin. Similar to humans, a dog’s sense of humor is personal. Research also shows that certain breeds have more of a sense of humor than others, which means they may play-pant more.3 The top five most playful dog breeds (with the biggest “sense of humor”) are: Irish Setter English Springer Spaniel Miniature Schnauzer Cairn Terrier Airedale Terrier The top five least playful dog breeds (not much of a “sense of humor”): Samoyed Chihuahua Rottweiler Pekingese Akita Do Dogs Know When We Are Laughing?            A study performed at Eötvös Loránd University in Hungary using fMRI (functional magnetic resonance imaging), found that dogs can detect emotion such as happiness or sadness.4 The study detected an increase in blood flow to various areas of the brain. This blood flow represents increased activity in the brain. Similar to humans, dogs also have dedicated areas in their brains to understand dog barks and human voices. The study concluded that there are similarities in the way that dogs and humans process social information. The more positive the sound, such as laughter, the stronger the response. It is not clear if these responses are a learned behavior from living with humans or an adaptation created through selective evolutionary breeding.           Do Dogs Get Embarrassed When You Laugh at Them? No, dogs do not feel embarrassment for being laughed at. While dogs can distinguish between positive (laughter) and negative (sadness) emotions, it is believed that they are unable to understand the social cues necessary to distinguish being laughed at and laughing with someone. Do Dogs Try to Make Us Laugh?          Yes, dogs do try to make us laugh. Dogs have enough of a grasp of social cues to recognize that laughter is positive. They understand that laughter means play, and play is positive. Laughter reduces stress and anxiety and helps the human-animal bond grow. So depending on how much of a sense of humor your dog has, they may do things to try to make you laugh. Can You Make Your Dog Laugh? “Play-panting” has very useful implications. Recordings of this sound can be used to calm dogs that are worried, anxious, and shy in a variety of settings. The sound can be imitated by humans to promote a sense of ease in new environments where a human-animal bond has yet to form. This is especially helpful at shelters, training facilities, and foster homes. References Konrad Lorenz. Man Meets Dog. Routledge; 2015. Do Dogs Laugh? | Psychology Today. https://www.psychologytoday.com/us/blog/canine-corner/200911/do-dogs-laughDo Dogs Have a Sense of Humor? Psychology Today. https://www.psychologytoday.com/us/blog/canine-corner/201512/do-dogs-have-sense-humorMagazine S, Stromberg J. Your Dog Can Tell From Your Voice If You’re Happy or Sad. Smithsonian Magazine. https://www.smithsonianmag.com/science-nature/your-dog-can-tell-from-your-voice-if-youre-happy-or-sad-180949807/Featured image: iStock.com/articgoneape"}]