[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Keep Your Pet Calm During Social Gatherings", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1094535504.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1094535504.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Cat, Behavior, General Care, Christmas", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-to-keep-pets-safe-during-holiday-gatherings"}, "datePublished": "December 13, 2022", "dateModified": "January 26, 2023", "description": "If you’re planning to have people over, check out this helpful guide from a veterinary behaviorist to keep your pets (and guests) stress-free.", "articleBody": "A recent study found that about 30% of dogs may exhibit some form of anxiety, and in another survey, two-thirds of cat owners reported their cats had anxiety or fear. Anxiety is the emotional response a person or animal exhibits in anticipation of encountering an unpleasant experience. You may think hosting a social gathering or party is fun, but for your pets, it can be highly stressful and unpleasant. It’s important to be able to recognize the signs of anxiety in your pets so you can decrease that stress. This can improve their quality of life and mental well-being. If you notice that your pet is seriously stressed out when guests come over, you may need to rethink hosting social gatherings. Here’s what to look for and consider: Know the Signs of Anxiety in Pets Signs of anxiety in dogs include: Excessive panting Pacing Excessive salivation Excessive vocalizations Excessive licking of themselves, you, or objects Dilated pupils Ears pulled to the side or all the way back Tail hanging down or tucked under Shaking Feigned sleep Drinking more water Increased frequency of urination or defecation Not eating as much  Staying close to their owners Hiding Signs of anxiety in cats include: Excessive vocalizations Hiding Using the litter box less Urinating or defecating outside the litter box Decreased appetite Dilated pupils Ears pulled to the side or flattened Tail tucked under their body Feigned sleep Hiding and not coming out to eat or use their litter box What to Do if Your Pet Gets Stressed About Strangers If your pet is not comfortable having strangers in the house, then it’s really important to consider the safety and welfare of both your pet and guests, especially if your pet exhibits aggressive behavior. Even if your pet does not act aggressively, they may be so stressed by the sight, sounds, and smells of strangers in their home that they may exhibit anxious behavior hours or days after the guests have left. These pets have a difficult time recovering. Some pets may experience episodes of vomiting or stress colitis for several days. They may have a decreased appetite and/or lethargy, and they may hide until they feel safe again and are sure the strangers will not come back into their home. If your pet shows these signs, then having people over to your house may be too much for your pet. Get Prepared Before the Event If you don’t know yet how your pet will react, or they tend to only have mild anxiety, there are several ways you can prepare for gatherings at your home. Create safe spaces for pets with anxiety to retreat to. This could be a crate, exercise pen, closet, bedroom, spare bathroom, area under a bed/desk, or even a corner of a room. Ideally, it should be quiet and as far away from the hosting area as possible. You can set up the safe space with comfortable bedding, white noise, calming music, and pet pheromone products. Dogs and cats can be trained to go to their safe space on cue. When you work on teaching your pet to retreat to these locations, pair the experience with a verbal cue and a reward, such as a high-value treat or toy. Practice sending your pet to their safe space when they are not experiencing any anxiety or stress. They will gradually learn that this location is the best place to be. Any time you see your pet showing signs of anxiety, bring them to their special spot. Offer plenty of treats, praise, or attention when they go there. Clicker training can be a useful method to teach your pet to go to a specific location, especially for cats. Try placing a remote treat dispenser in that location to simplify training. If you have multiple pets, place each pet in their own safe space unless they get along with each other. Use this checklist to help prepare your pets when you are having company over. These items can be set up a few days ahead of time: A safe space to retreat to. This should be set up days to weeks ahead of time, if possible. Work on placing your pet in the safe place for short periods of time throughout the day and/or week. Gradually increase the duration of time they spend in that location. A set of new puzzle toys along with a few old favorites High-value treats and long-lasting chews Pheromone diffuser or spray White-noise maker Calming music Cats: https://www.youtube.com/watch?v=vGyElqvALbY Dogs: https://www.youtube.com/watch?v=xmvMCaG-FSQ Talk to your veterinarian about the use of supplements or prescription medications to help reduce your pet’s anxiety. Ideally, you’ll want a few days to test out how your pet responds to the supplement or medication. Nutramax Solliquin soft chews for dogs and cats Vetoquinol Zylkene capsules Remote treat dispenser Petcube Bites WiFi Camera and Treat Dispenser PetSafe Treat &amp; Train Prepare Your Pets the Day of the Event This guideline will help you prepare your pet for the gathering: Provide at least 30 minutes of exercise for your dog. This could be a long walk, hike, or run, or playing fetch in the yard. Cats should receive 15-20 minutes of object play such as a fishing pole toy (teaser wand) or chasing a ball or felt mice. Add some catnip to encourage your cat to play. Set aside 5-10 minutes of training time with your dog or cat to provide some mental stimulation in addition to physical activity. Set up the pheromone diffuser or apply the pheromone spray to their bedding. Give your pet the calming supplement or medication at least 2 hours before guests would be arriving. Take your pets to their safe space before guests arrive, especially if you and other family members are going to be rushing around the house for last-minute preparations. They may enjoy being in their own place to rest and relax while everyone is rushing around. Manage Your Pet’s Stress During the Event Ideally, you do not want guests to have access to pets that are going to be stressed by meeting strangers. Consider setting up barriers to limit your guests’ access, such as a pet gate, or closing the doors to the room where your pet’s safe space is. Check in on your pets throughout the event. If your pet appears content to be in their space with their special toys and treats, then you might check on them every 1-2 hours. If your pet is stressed by the sound of strangers’ voices and hearing people moving around, you may want to check on them every 30-60 minutes. Every time you visit, spend a few minutes with them to reassure them that you are still in the house. You can spend a few minutes talking to them, playing with them, or petting them. For pets that are calm enough to eat, you can offer them special treats every time you visit them. If everyone is seated or there are not a lot of people moving around, some of the more confident pets may enjoy coming out for a brief visit. However, if your pet is not comfortable around strangers and gets easily stressed, it is best to leave them in their safe space. With a bit of planning and preparation, you can help minimize the stress your pets experience when strangers come into their home. Some pets may never adjust to having strangers in their home, but others may learn to enjoy having visitors because your preparations have minimized stress and set them up for success.  "}]