[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/7w1pttfjih", "@type": "VideoObject", "duration": "PT1M53S", "name": "5595608313001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/1e58cbe6d18858d74ed762308318db391a6d74b7.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/7w1pttfjih", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/4fe42b39ed56c82bdefb9fd2065e976420a1665d.m3u8", "transcript": "It can be flattering and adorable when our pets follow us around. It's nice to feel needed in love but at some point, you might want a little space. Turns out there are scientific reasons why our dogs follow us everywhere. Young puppies may be clingy because they recognize you as a surrogate parent or an object of trust.\n\nThey're most impressionable between 3 and 12 weeks old. The dog is also more likely to follow you around if he associate you with treats petting and other fun activities. Some breeds especially those that have been bred for centuries to work alongside their people are known for their attachment to their owners. Now one of the most obvious reasons dogs follow us is because they value the companionship domesticated dogs share a bond with humans in the same way that parents and young children do.\n\nDogs have an uncanny ability to understand our wants and needs by studying our every move. They can better interpret the meaning behind our actions. For example, they may anticipate when it's time to go for a walk or see when you're getting ready to leave the house for the day. Now it's normal for dogs to watch their owners for clues about daily life.\n\nBut it can be unhealthy when a dog can't stop following his owner. This is especially concerning if the dog is fearful or avoids interactions with other humans. In this case, the dog may be improperly socialized and at risk for developing behavioral problems. If you think your dog may be suffering from mild separation and tolerance interactive toys are background noises from the TV or radio may help to redirect his attention in your absence.\n\nIf these tools don't work you can try gradually desensitizing your dog to your absence. So the way you do it is you leave for a few seconds, then you come back in the house. Keeping both your departure and arrival low key over many trials, gradually extend the length of time you're going to help your dog get used to being left alone in more extreme cases. Consult your veterinarian to come up with a targeted approach to help your dog feel more comfortable.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/4-reasons-your-dog-follows-you-everywhere?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Does My Dog Follow Me Everywhere?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-following.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-following.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Behavior, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/4-reasons-your-dog-follows-you-everywhere"}, "datePublished": "October 27, 2021", "dateModified": "August 30, 2023", "description": "Dr. Sandra Mitchell explains why your dog follows you everywhere (including the bathroom), whether it’s normal, and what to do if it becomes too much to handle.", "articleBody": "We’ve all had the experience—you walk to the kitchen to refill your drink, and your little shadow is underfoot. Or you head into the bathroom, only to find a curious nose pushing the door open behind you. Although you surely enjoy your dog’s companionship and may even like being followed around sometimes, it can get to be a little much. If it causes you or someone else to trip, it can be dangerous as well. So why do dogs like to follow us everywhere? Can it ever a sign of a deeper problem you need to address? Here are all the answers you need, including when to be concerned and what you can do to stop your dog from following you if it gets to be excessive. Reasons Dogs Follow You Everywhere There are many reasons dogs choose to follow us. Probably the most consistent one is that it’s in their genes—throughout history, dogs have been pack animals. When we remove dogs from their canine pack, they simply adopt their human pack instead. The same instincts that kick in with wild dogs are present in our canine companions. But genetics aren’t the only reason dogs like to follow people. Dogs are social animals. Just as we enjoy their companionship, they often like ours as well. And what better way to show it than to stick close to your buddy? Further, if your dog was adopted as a young puppy, she may be “imprinted” on you, truly feeling like you are their “dog mother.” In other cases, some dogs just get bored, so they figure that if you’re doing something, why not tag along? These dogs will often greatly benefit from more exercise. Lots of pets learn to clue in on daily routines, like the fact that they are fed or walked at certain times. What better way to make sure you don’t forget than to be right there and waiting? We often unconsciously reward this cute behavior, too, by providing food or treats. Just beware that this can be a double-edged sword, as it makes your dog more likely to repeat the behavior, which might not be something you want. Occasionally, dogs will stick close to your side if they are nervous, frightened, uncertain of strangers, or not feeling well. This is especially common during thunderstorms and fireworks; dogs see us as their protectors in these events. And the very occasional dog gets so anxious if they are separated from their pet parent that they panic—this is not a good situation for either party. Why Does My Dog Follow Me and No One Else? Dogs are smart animals and will often single out one person to follow, sometimes even to the exclusion of others. This usually indicates that this person fulfills whatever the dog is looking for. Sometimes, this person is the primary caregiver who feeds, walks, and plays with the dog. Other times, it is the person who gives out snacks most frequently. Or it could just be the “most fun” person. Dogs get everything they need from people, and they will generally follow the person who takes them to the things they want most. Why Do Dogs Follow You to the Bathroom? The simple answer to this question is, “Why not, since I follow you everywhere else?” But it’s not that simple. Dogs have a world of new things to explore when it comes to the bathroom, including the wastebasket. There are all kinds of things in the bathroom that smell intensely like their family members, and it’s great fun to explore these! Add to this the fact that dogs have an excellent sense of smell, and they do not always match our taste in smells. The array of odors that come from the bathroom can be both intense and intriguing to a dog. So, if you are headed into the bathroom, your dog may see this an excellent opportunity to explore. Why Do Puppies Follow You Everywhere? Puppies are a bit of a special case when it comes to following people around. Young dogs rely on their mother to show them the ways of the world, and when they are removed from her and their siblings, their new family becomes their “imprinted” parents. As a result, they will follow you, often closely, to learn what they need to know about their environment. They are often less confident than older dogs and haven’t learned the proper social skills. These behaviors tend to lessen a bit as they mature and become more confident. Why Do Older Dogs Follow You Everywhere? Older dogs may follow their owners purely out of familiarity and habit. However, if this is a new behavior, it may also indicate that things are changing for your dog, making them less confident. Perhaps your dog is starting to lose their hearing or vision. Or they have started to have joint problems, so they are less independent than they were. Other dogs experience a mental decline—much like Alzheimer’s in people—that makes them become clingy. If you notice that your senior dog has suddenly started to follow you around, or you see any other changes in their behavior, schedule a veterinary visit to look for the underlying problem. Why Is My Dog Suddenly Following Me Everywhere? If your dog has always been a confident, independent dog and has suddenly become clingy, there’s a good chance they are trying to tell you something. Often, this may mean something is wrong—that they aren’t feeling well or something in their body has changed and is making them less confident, like a loss of sight or hearing. Any time a dog’s behavior changes markedly and suddenly, it is time to schedule a checkup. Why Is My Newly Adopted Dog Following Me Around? In most instances, newly adopted dogs won’t feel confident right away since they are in a new situation with new people, and they don’t know the routines and what to expect. This puts them almost back in puppy mode, as their new people become “mom” and take on the role of showing them the environment and teaching them the expectations for the household. Fortunately, most dogs become less clingy with time as they adjust to the new situation. Which Dog Breeds Are More Likely to Follow People? In most cases, it is an individual thing whether a dog choses to follow their people around or not. However, some breeds are known to be “Velcro dogs” and in fact, have been bred to be companions, such as Chihuahuas. Working dogs, such as Border Collies and Labrador Retrievers, will follow people because they were bred to follow human orders and they are waiting for cues as to what should be done next. Other dogs, like Terriers, are quite a bit more independent and are much more likely to go off and do their own thing. Is It a Problem That My Dog Follows Me Everywhere? It may or may not be an issue if your dog follows you everywhere. Many people don’t mind having their dogs always underfoot, while other people can’t stand it. Or it could be a safety issue where you might easily trip over your dog. In the ideal situation, your dog follows you as a companion but not to the point of being annoying, and at the same time, you can separate yourself from your dog without producing anxiety. Some dogs are perfectly fine when separated from their owners. If your dog panics when they are separated from you, this is concerning and should be treated. Clearly, if your dog is repeatedly tripping you, this is a problem that should be addressed. If both you and your dog are content with the situation, and your dog doesn’t panic when you leave, then it is a good balance. What to Do If Your Dog Always Follows You Around If you feel that your dog follows you too much, or panics when they can’t follow you, it’s time to take action. It will help to consult your veterinarian for advice, particularly if your dog becomes overly anxious when separated from you. The first step is to make sure your dog is getting plenty of exercise. A tired dog is usually a content dog and less likely to continually follow their owners. Next, look at your role in the behavior. Are you reinforcing it in any way? Do you look at your dog when they follow you, or pay your dog attention or give them treats? This simply encourages your dog to follow you. Even scolding your dog (which you should not do) is a form of attention and inadvertently rewards the activity. If your dog is bored, provide plenty of food puzzles, toys, and activities near their dog bed to encourage them to spend some alone time there. If you switch your expectations and totally ignore your dog while they are following you and only pay attention or give treats once your dog has settled in another area, you will start to break the habit of trailing you to “get” something. In many cases, training helps. Teaching your dog commands like “stay” and “place” will show them it’s okay to be left in an area that you consider safe. Dogs that lack confidence or become anxious will need some encouragement and training to feel it’s okay to be left alone, and that you—as the primary person the dog follows—feel it’s safe for them to stay in a kennel or dog bed when asked to. In many cases, dogs simply need to have rules and expectations set for them, and then the remainder of the pack (the household) must stick by those rules for the dog to feel accepted and confident. It is also helpful to have other people walk your dog regularly and provide meals and treats. This helps reduce the focus on a single person and divides the duties up among the “pack.” There is a wide range of acceptable dog behaviors in this department, but it is important to find a middle ground where you are comfortable with the amount of following, and your dog is comfortable and secure enough to be with the pack or alone sometimes. Featured Image: iStock.com/KristinaKibler"}]