[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/v5r0xk47dr", "@type": "VideoObject", "duration": "PT3M2S", "name": "5477986479001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/42d7f48dc4c5af4f3d437b6aa4ac8378495748b6.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/v5r0xk47dr", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/38c14ac160f4d77ea2aa76ea1160c268a3ebcae6.m3u8", "transcript": "So there is the common myth that dogs that man's best friend. Is this true. I guess whether or not you regard the dog is man's best friend depends a bit on how you define friend. Well, I don't know if I can speak for the men out there, but I can certainly say that their woman's best friend.\n\nLet's call it human's best friends. We don't actually know why humans and wolves go together in the first place. There are all sorts of ideas about how wolves used to come and scavenge of human rubbish. Once that relationship was initially established humans were selecting very rapidly for the most sociable wolves the ones that responded to humans in this characteristically dog like way.\n\nAnd so this was obviously something that humans valued from the get go. We've sort of matured going through this world together, and the relationship evolves. If you think about how dogs were utilized even 100 years ago They were part of the work, team. They were out there with you herding cattle or whatever it was that you were doing for a living your dog was there helping you do that.\n\nThey've gone from being that part of the workforce to truly becoming our best friends. Now I think that dogs value our companionship just as much as we value theirs because their family. We are the only family that they have unless they're other pets in the house. But it's magic.\n\nDogs make a much bigger effort to understand humans than humans do to understand dogs. They actually read our facial expressions and that might seem hard to believe, but there's a really cool test you can do. Look at your dog. Don't say anything and just smile.\n\nAnd I guarantee you're going to get a tail wag back. Dogs are constantly scanning scanning happy sad. What's going on. We should also look at our dogs and say or do you feel OK.\n\nAre you comfortable in this situation. Dogs are much more likely to listen to you when you have a happy face, which if we're talking about friendship is it always works. If I'm friends with someone and I know when someone is really, really, really upset, then I tend to be very cautious or maybe say, oh, OK. I'll call you tomorrow and when this person is happy.\n\nI'm eager to spend time with this person exactly the same for dogs. I have to admit, it's nice to have an individual who seems to really consider me to be the most important person in the world. In conclusion, I can say that dogs are man's best friend, but probably humans should make more of an effort to show this friendship to dog eat in a dog friendly way. I think that all we can do is hope that one day we're able to give them as much as they give us.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/pet-myths-are-dogs-really-mans-best-friend?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Myths: Are Dogs Really Man&#039;s Best Friend?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/mans-best-friend.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/mans-best-friend.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/pet-myths-are-dogs-really-mans-best-friend"}, "datePublished": "June 20, 2017", "dateModified": "August 16, 2022", "description": "There&#039;s a long held belief that dogs are man&#039;s best friend. Is this pet myth true? Watch as researchers, dog trainers and veterinarians discuss the dog-human bond.", "articleBody": "By Deidre Grieves  When it comes to the bond between dogs and humans, the term “man’s best friend” is frequently used to describe the inter-species relationship. But are dogs really man’s best friend? Is there validity in this commonly held belief? According to researchers, dog trainers, and veterinarians, the answer is yes. Dr. James Serpell, director of the Center for the Interaction of Animals and Society at the University of Pennsylvania School of Veterinary Medicine, says that the modern-day bond between humans and dogs dates back centuries and can be traced to the early interactions between nomadic human hunters and wolves. “We don’t actually know why humans and wolves got together in the first place, but once that relationship was established, humans were selecting, very rapidly, for the most sociable wolves—the ones who responded to humans in this characteristically dog-like way,” says Serpell. “This was obviously something that humans valued from the get go.” As dogs’ shifted into domesticated animals, they evolved to become part of the work force, helping humans with all kinds of tasks from herding to hunting. “We’ve sort of matured going through this world together,” says Dr. Katy Nelson, a veterinarian at the Belle Haven Animal Medical Centre in Washington, D.C., and a medical advisor for petMD. “If you think about how dogs were utilized, even 100 years ago, they were part of the work team. Whatever it was that you were doing for a living, your dog was out there helping you do it.” Today, dogs are an integral part of family life, and studies show the strength of the animal-human bond. A 2015 study published in the journal “Science,” demonstrates that there is a real emotional connection that happens when dogs and people look at each other. Data from the study reveals that oxytocin levels rose in both humans and dogs after they looked into each other’s eyes during a 30-minute period. Oxytocin is often referred to as “the love hormone” because it’s produced in the body when humans have close contact with the people they love. The hormone is also associated with maternal bonding and rises when mothers interact with newborn babies. Other studies show that dogs can recognize human facial expressions and make decisions based on those expressions, showing a high level of emotional intelligence in pet dogs. “They actually read our facial expressions,” says Victoria Schade, a certified dog trainer, speaker, and author. “That might seem hard to believe, but there’s a really cool test you can do. Look at your dog, don’t say anything, and just smile. I guarantee you’re going to get a tail wag back.” Dr. Carlo Siracusa, a clinical assistant professor of behavior medicine at the University of Pennsylvania School of Veterinary Medicine, explains that how humans interact with dogs has a big impact on a dog’s overall demeanor. “Dogs are much more likely to listen to you when you have a happy face,” he says. “And if we’re talking about friendship—that’s how it works. If I’m friends with someone and I know when [that person] is really, really, really upset, I tend to be very cautious. It’s exactly the same thing for dogs.” While dogs may be hyper aware of how their human counterparts are feeling, Schade says that some pet owners don’t always give their dogs the same amount of consideration and attention. “Dogs are constantly scanning—[wondering] whether we’re happy or sad,” she says. “We should also look at our dogs and say, ‘Do you feel okay?’ ‘Are you comfortable in this situation?’” Siracusa agrees. “Dogs are man’s best friend,” he says. “But humans should make more of an effort to show this friendship to dogs.” Despite human flaws such as texting at the dog park or cutting playtime short to binge watch Netflix, dogs remain loyal and loving companions. “I have to admit, it’s nice to have an individual there that seems to consider me to be the most important person in the world,” says Serpell.    "}]