[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "9 Signs Your Pet Is Jealous (and How to Stop It)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog.and_.cat_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog.and_.cat_.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/9-signs-your-pet-jealous-and-how-stop-it"}, "datePublished": "December 6, 2017", "dateModified": "August 16, 2022", "description": "Can pets feel the same type of jealous feelings that humans do? Here are some jealous behaviors to look out for and tips for helping jealous pets.", "articleBody": "By Nicole Pajer When you go to pet another animal, your pup may jump in between and push your hand away from the other dog. Or your cat may meow excessively because you’re not paying attention to them. But are these actually jealous behaviors? Suzanne Hetts, applied animal behaviorist and co-owner of Animal Behavior Associates in Littleton, Colorado, says the jury is out on whether a cat or dog feels the same type of jealous feelings that humans do. “In most cases, this is better described as a competitive situation where the pet is competing with another individual—human, dog, cat, or otherwise—for something it wants,” says Hetts.  Regardless of what you call it, jealous behavior in pets can be an issue. 9 Signs of Jealousy in Pets Here are some jealous behaviors in pets that you should be on the lookout for: 1. Aggression  “This can often be in the form of biting or nibbling of the animal or person getting attention over them,” says Dr. Scarlett Magda, founding president of New York City-based Veterinarians International. 2. Going to the bathroom indoors/outside the litter box  “Our pets can’t express their thoughts and feelings in words, so instead, they sometimes express their feelings in actions,” says Dr. Geoffrey Broderick, a veterinarian in Huntington, New York. “If you see them peeing or pooping in places where they shouldn’t, they may be trying to tell you something.” However, having accidents in the house or going outside the litter box can be a sign of a health issue, so your first stop should be a vet visit to make sure your pet does not need medical attention. 3. Paying extra attention to you (being “clingy”)  According to Dr. Broderick, clingy behavior from a dog or cat can come across as a pet cuddling up extra-close to you and suddenly licking your hand or face. “This is a sign of affection, and they are trying to get your attention,” he says. 4. Pushy behavior  Dr. Magda notes that this often comes in the form of a pet “inhibiting another person or animal from moving freely on a regular basis, or pushing their way into a situation, demanding the attention of their owner.” 5. Growling, hissing, or getting into a fight with another pet  This may especially be an issue in a multi-pet household where pets are competing for attention and resources, Dr. Broderick points out. 6. Trying to scare off strangers  “Pets may aggressively bark, hiss, or growl when owners are greeted or visitors arrive,” Dr. Magda says. 7. Doing a trick  According to Dr. Broderick, this is a surefire sign that your pet is trying to get your attention. 8. Crowding your space  “Cats sometimes will lie down on your work table or sit on your computer keyboard to get attention, or even start knocking things off the table,” Dr. Broderick says. “A dog may sit up and beg to try and get your attention, or sit up on their hind legs.” 9. Leaving the room  Sometimes when pets get mad, they may have a tendency to withdraw, Dr. Broderick says. What Causes Jealous Behaviors in Pets? According to experts, jealous-like behaviors in pets typically suggest boredom or a ploy for attention from their owners. “Sometimes, just like people, they can feel insecure,” Dr. Broderick explains. “They need individual attention, lots of cuddling, and activities to keep them busy and to keep them from being bored. Sometimes, our pets just want us, and they don’t want to share us with another pet or person.” A lack of resources (only one toy for multiple pets), social conflict, too small of a space, stress, lack of exercise, and genetic disposition can cause jealous behavior, says Katenna Jones, associate applied animal behaviorist and owner of Jones Animal Behavior in Warwick, Rhode Island. How to Stop Jealous Behavior in Pets Here are some of Dr. Magda’s tips for reducing jealousy in a multi-pet household: Keep notes on the circumstances that cause signs of jealousy/aggression. This can be helpful when you see behaviors that you can’t manage on your own, as you can share the list with your vet or a professional animal behaviorist. Don’t give one pet more attention than another. Help your dog feel safe and relaxed in their crate so they see it as their own safe space. Give cats a space to call their own as well. Feed pets separately to avoid conflict during mealtimes. Give your pets the same amount of treats. When you arrive home, make sure you don’t give one pet more attention than the other, or wait a bit to give attention. The level of emotional excitement will diminish, preventing signs of aggression from occurring. Put a leash on both dogs when walking two at a time and consider a gentle leader for better control. Don’t pet one animal without petting the other. Have at least two of all toys and beds, but remove food-based toys unless supervised. Catch your pets being good. Give them attention and praise when they are acting calm and not showing jealous behaviors. Managing unwanted behaviors and keeping pets mentally healthy are keys to avoiding unpleasant situations down the line, Dr. Broderick says. “As pet parents, we need to attend to their physical and emotional needs, just like we do for our human children,” he says. “Our pets just want to feel loved.” Featured Image: iStock.com/chendongshan"}]