[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Signs of Anxiety in Dogs and Puppies", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/portrait-of-a-chihuahua-picture-id498803992.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/portrait-of-a-chihuahua-picture-id498803992.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Behavior, Anxiety, Mental health, Symptom Checker, Stress/Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/signs-anxiety-dogs-and-puppies"}, "datePublished": "February 2, 2022", "dateModified": "September 12, 2023", "description": "Dr. Katie Grzyb explains signs of anxiety you can look for in your dog and offers a few helpful strategies and tips for helping an anxious dog feel less stressed.", "articleBody": "There’s been a huge shift in understanding and treating human anxiety over the past decade. Our canine counterparts also feel stress and anxiety, but they can’t verbalize their feelings, which makes it hard to know when they’re feeling anxious. When you become a dog parent, you take on the job of recognizing what causes anxiety for your pup. If you lessen these causes, you can make your dog feel as safe and comfortable as possible in their environment. Signs of anxiety in dogs can be subtle, which makes it even more important for you to be vigilant and learn to identify what may be causing their stress. Stress in dogs can be broken down into three types: fear, phobias, and anxiety. Fear is an instinct in response to an external threat. Analyzing the situation helps you figure out if it’s a normal or inappropriate response. For example, fear aggression could be normal if there’s a true threat to your dog or their loved ones. In other cases, fear aggression is considered inappropriate if it’s directed at a person who is not showing any signs of being a threat to your dog. Remember that your dog may interpret the situation differently, and something that is not a threat to you may be to them. Phobias are excessive fears to an external stimulus. The most common phobias in dogs are noise phobias (fireworks, loud noises, thunderstorms). Anxiety is an uncomfortable feeling or fear related to the anticipation of danger. For instance, separation anxiety occurs when a pet has abnormal reactions to being away from their owner, whether for short or long periods of time. Signs of Stress and Anxiety in Dogs It is important to be able to distinguish between normal and anxious dog behaviors, which requires familiarity with your dog’s normal behavior. Most of the time, relaxed dogs will have round, open eyes; weight on all four legs; a raised tail; and raised, forward-facing ears. They will breathe normally unless they are panting from play or exercise. Here are some dog anxiety symptoms to watch for. Pacing and Shaking Just like humans, dogs often pace or make wide circling movements repeatedly when stressed. This can be a sign of panic or nervousness in general. Your dog may also shake or tremble. This often stops once the stressor is gone. Increased Heart Rate and Panting The autonomic nervous system kicks in automatically when stress occurs. This is the “fight, flight, or freeze” response to external fears or stressors. It is an involuntary response system for survival and adapting. Dogs also have a sympathetic nervous system. When a dog is stressed, this system releases adrenaline and increases their heart rate and respiratory rate, which is often seen as panting.   Yawning Dogs do not only yawn when they are tired—they also yawn when they’re nervous. Usually, these yawns are frequent and longer than when they are tired. Drooling A dog’s nervous system is activated by stress and causes drooling and frequent lip-licking or “lip-smacking.” This is also seen when a dog has nausea and may have something to do with activation of the gastrointestinal tract by the nervous system. Compulsive Behaviors Dogs engage in a number of behaviors to help calm themselves, but these can become compulsive and destructive when they are really stressed. Common compulsions include licking themselves excessively, licking floors or walls, barking excessively, or chewing objects compulsively. Often, this behavior can lead to skin infections from overgrooming, foreign body ingestion, upset stomach from ingesting things, digging behavior (holes, bedding, rugs), or destroying their crates in order to break free. Crying or barking can also be a self-soothing behavior in anxious dogs, or a way to alert us to their stress.   Hypervigilance (Dilated Pupils, Ear Signals, Stiff Posture) Dogs with anxiety often have dilated pupils and blink faster. They tend to stand stiffly at attention when preparing for impending danger, but this behavior may also be related to the involuntary freeze, fight, or flight autonomic nervous system response. The whites of their eyes tend to show more than when they are calm, and their ears can either be standing at attention or pinned back against their head in times of stress. Tucking their tails between their legs or shifting their weight to their hind end can also be signs of fear in dogs. Hiding or Acting Depressed Stressed dogs will often hide behind you or objects such as chairs or cars to avoid stressors. They may seem hyperactive and use their muzzles to nudge your legs or hands to tell you to move away from the stressor. Your dog may also completely shut down, stop moving, and seem depressed or disassociated from the situation. Having Diarrhea or Accidents Adrenaline affects dogs similarly to humans, causing an urge to go to the bathroom. Your dog may immediately posture and urinate as a result of stress, dribble urine, lose control of their bowels, or even have diarrhea. This behavior is modulated by the sympathetic nervous system. A lesser gastrointestinal sign of stress in dogs is a decreased appetite. A stressed dog may even refuse their favorite treats if their anxiety level is too high. Shedding Dogs who are stressed often shed more, and this is frequently seen during veterinary visits. How to Help an Anxious Dog Here are some tips you can use to help your dog avoid or react to stress. Avoid Stressful Situations The most important treatment for stress and anxiety in dogs is limiting the exposure to stressful situations. Avoid interactions that may cause an anxious response. For example, in cases of separation anxiety, set up a calm, quiet space with safe toys and items that smell familiar. Start training your dog by leaving them for very short periods of time. Every time you return, praise your dog, and perhaps give them a small, healthy treat. Through repetition and slowly increasing the length of time that you are gone, your dog will learn that you will always return, and their stress will start to fade. If your dog is stressed by having new people in their environment, keep them confined in a calm area of the house when new people are there to avoid a fear-induced interaction. Try New Strategies in a Safe Environment Abrupt desensitization, where you expose your dog to the thing that is causing stress until they no longer react, is no longer thought to be the best way to help with stress and anxiety in dogs. Continuing to introduce triggers often increases your dog’s fearful responses. Instead, you should teach new strategies and ways for your dog to respond to stress. To establish a new response to a stressor, you must develop a reward program for your dog, such as offering food, love, or an activity/playtime. The reward should always be earned, and training will be slow and steady. This should be done in a stable, safe environment, and not during anxious situations. Treatment starts with learning control strategies at home, where your dog is required to earn everything by responding appropriately when you give a specific cue. This creates a predictable response from your dog’s perspective. Starting with calm tasks such as “sit” or “lie down” and then eventually moving to “focus” and “escape” responses will help set expectations for what will happen. With focus responses, the goal is to have your dog make eye contact with you or focus on a treat/toy to distract them from stressors. Escape response is training your pet to go to a safe, calm environment (such as a bed or a room) as soon as they feel stressed. Using yummy treats can be helpful until they learn where their safe space is. Never punish your dog physically or by scolding them, since this is ineffective and will only raise their stress level and teach them to fear you. It is important to have realistic expectations. Some issues may be lifelong or require training or medications that can only be given by a training specialist, veterinary behaviorist, or veterinarian. Ask Your Vet About Anti-Anxiety Medications Your veterinarian may recommend prescription anti-anxiety medications (including Fluoxetine, Clomipramine, or Alprazolam). These are almost always prescribed with the recommendation of behavior modification training. The medication type and dosage will be based on your dog’s age, other medical conditions, and triggers. Medications often take several weeks to months  to improve anxiety, and they often require adjustments and regular bloodwork. The minimum treatment for anxiety in dogs usually averages 4-6 months but can take years in some cases. Medication therapy may help alleviate your dog’s response to triggers and can assist in learning new behaviors. However, when medication is weaned or discontinued, their anxious behaviors may return. Medication is usually continued lifelong. Your primary care veterinarian may refer you to a board-certified veterinary behaviorist when severe anxiety issues are noted, or if previously attempted treatment plans fail to help. It is important to learn your dog’s triggers to be able to help them have a calm, balanced, and positive quality of life. Featured image: iStock.com/DNF-Style"}]