[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Have Bipolar Disorder?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-dogs-bipolar-disorder.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-dogs-bipolar-disorder.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Mental health, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/can-dogs-have-bipolar-disorder"}, "datePublished": "November 3, 2017", "dateModified": "August 16, 2022", "description": "Your dog is usually happy, friendly, affectionate, and always game for a great fetch followed by a cuddle session. But then on some days, he’ll be withdrawn or unleash an angry bark storm for no apparent reason. But can canines actually have bipolar disorder just like humans?", "articleBody": "By Andrew Daniels  Your dog is usually happy, friendly, affectionate, and always game for a great fetch followed by a cuddle session. But then on some days, he’ll be withdrawn or unleash an angry bark storm for no apparent reason. Chances are, you chalk this up to him waking up on the wrong side of the dog bed. But can canines actually have bipolar disorder just like humans? The answer: “Not exactly,” says Dr. Peter L. Borchelt, a board-certified animal behavior consultant based in Brooklyn, New York. Bipolar disorder is “a mental health condition which causes extreme shifts in a person’s mood, energy, and ability to function,” according to the International Bipolar Foundation. People living with a bipolar condition experience the highs of mania and the lows of depression. A dog’s emotions don’t fluctuate dramatically from high to low and back again, Borchelt says. Instead, their mood changes are often triggered by an external factor. “For a dog, it’s not like they have a biochemical reason to switch between states, like [people living with bipolar disorder] do,” Borchelt says. “It’s almost always a response to something in their environment.” For example, a dog could be friendly and affectionate around his or her family members, but then once a stranger comes onto the scene, that same dog may suddenly be afraid, aggressive, or fearful. “So, it’s a switch in polarity, so to speak,” Borchelt says, but it’s not comparable to the manic and depressive episodes that people with bipolar disorder experience.   Think of it like this: Say you usually have a warm, positive disposition, but you’re extremely afraid of spiders. So when you see a creepy spider crawling in your room, you suddenly get scared and only return back to your normal mood once you remove the bug (or run screaming and ask someone else to handle it). That’s not a sign of bipolar disorder, Borchelt says—it’s just a temporary mood change caused by a certain trigger. Although dogs have the same basic brain chemistry and structures as humans, their behavior and mental health issues likely don’t manifest the same way, mainly because of language and cognitive differences, says Trish McMillan Loehr, a certified dog trainer and dog behavior consultant based in Weaverville, North Carolina. “We can&#039;t yet hack into canine brains and know just what they&#039;re thinking,” she says, “but I suspect dogs can&#039;t ruminate over the same sorts of sad thoughts that depressed people do.” But emotional events, such as being surrendered to a shelter or the death of a friend, can cause behavioral changes in dogs that are consistent with depression, Loehr adds. A dog may stop eating, pace around, or appear nervous or subdued. “Dogs have most of the same emotions as humans do, and can show behavior that looks somewhat like depression in humans,” she says. “And they can certainly feel anxiety.” So, what else can trigger your pooch to change moods? Plenty of things. Let’s use the example of a new visitor entering the family home: “If that person comes into your dog’s territory and he or she is too boisterous, it might make your dog afraid or aggressive,” Borchelt says. “What we see a lot is that dog will calm down when he warms up to the stranger,” he continues, “but when the person makes a quick move to get up, the dog will freak out and bark because they think he’s going after their owner. That’s one sudden switch from friendly to defensive.” Your dog might be overly protective of his (and your) house, and so may bark when he senses a threat—like that pesky doorbell that sounds when the FedEx guy drops off a package. Or maybe it’s an occasional dominance issue, Borchelt says: “He might not want you interrupting him while he’s eating, or waking him up while he’s sleeping,” he says. “But you can almost always find this external trigger. You can’t do the same with [people living with bipolar disorder], since it’s something internal.” The first step is identifying that trigger, Borchelt says. Once you zero in on the cause of your pup’s mood swings, you have two strategies for modifying his behavior. The first is a method called desensitization. Let’s say your canine companion goes crazy every time there’s a nasty thunderstorm. To nip this in the bud, you might buy a weather sound effects CD and play the thunder track at a soft volume so that you make a little sound to get your dog’s attention—but not freak him out. Then as long as your dog stays calm, “you keep doing it so you gradually increase the level of sound,” Borchelt says. “That way you get your dog used to the thing that startles him.” The second strategy is called counter conditioning. “This is where you bring in a positive stimulus to counter the negative one,” Borchelt says. Does your dog hate the doorbell? Try Borchelt’s trick: Push the button gently so your dog hears the first “ding,” give him a treat to calm him down, wait several moments, then slowly take your finger off the button so the chime finishes. Gradually repeat this so your dog learns to associate the annoying sound with something positive. You should consult with a behaviorist and your veterinarian to determine the best course of action, but another treatment option is dog medication, Borchelt says. “The drugs that often work the best for anxious dogs are SSRIs like Prozac and Zoloft,” he says. “They’re inexpensive, and they work very well for certain types of behaviors. But you have to talk to your vet first.” Also, keep in mind that medications aren’t often a solution on their own—they work best in combination with desensitization and counter conditioning strategies. Read more: Can Dogs Get Depressed?"}]