[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/cat/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Like Squeaky Toys?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-holding-squeaky-toy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-holding-squeaky-toy.jpg"}, "author": {"@type": "Person", "name": "Manette M. Kohler, DVM", "url": "https://www.petmd.com/author/dr-manette-m-kohler"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/cat/behavior/why-do-dogs-squeaky-toys"}, "datePublished": "May 15, 2020", "dateModified": "August 11, 2022", "description": "Have you ever wondered why your dog goes crazy for squeaky toys? Dr. Manette Kohler explains what makes dogs like squeaky toys.", "articleBody": "Just the sheer number of toy options for dogs is a clear indicator that dogs love toys. There are toys that bounce, toys that fly, toys for chewing, toys for tugging, and, probably the most interesting of all, toys that squeak. What is it about squeaky toys that gets dogs so excited and engaged? While we can’t read dogs’ minds or ask them why they find squeaky toys so alluring, we can observe their body language and behavior to form a few viable theories. First, we’ll need to take a look at why dogs like to play and the types of play they seem to enjoy. Why Do Dogs Play? Something that people have in common with dogs is that we love to play. “Our unique relationship with dogs is, in part, a result of our mutual love of play,” says Certified Applied Animal Behaviorists Patricia McConnell, PhD, and Karen London, PhD, authors of “Play Together, Stay Together: Happy and Healthy Play Between People and Dogs.” Retaining this juvenile trait, “the love of play,” into adulthood is an example of neoteny. According to Dr. McConnell and Dr. London, it’s unusual for most adult animals to play with any regularity, although a few exceptions exist.1 Through the process of domestication in dogs, we’ve selected for the retention of the desire to play, which contributes to our emotionally based bond with dogs. Types of Play Dogs typically engage in social play and solitary play. Social play involves a partner, which might be another dog, a human, or another species of animal. Solitary play often involves objects such as toys. In a 2015 study by Bradshaw, Pullen, and Rooney, they examined the playfulness of adult dogs. They discuss how play behavior is usually made up of motor patterns characteristic of predatory, agonistic, and courtship behavior.2 They state that solitary play with objects resembles predatory behavior, both in form and motivation, and that the preferred toys are those that can be dismembered. The Allure of the “Squeak” While some dogs don’t particularly care for squeaky toys, the vast majority do seem to really love them. Why are they so drawn to these types of toys? Is it that the sound reminds them of scared or injured prey, thus tapping into their “wild” side? Are they positively reinforced by us for engaging with squeaky toys? Or, is it just plain old fun?   Here are three theories that can help you understand the squeak appeal. Prey-Drive Theory Wolves, the ancestors of domestic dogs, were hunters that had to rely on catching prey to live. Today, dogs still have these inherent prey drives, although some more than others. During the domestication process, various traits have been enhanced in different breeds. Does this affect how a dog plays? A 2017 study by Mehrkam et al. looked at the influence of breed on social and solitary play in dogs. They chose adult dogs from working lines (retrievers, herders, and livestock-guarding dogs). Of the three breed types, they found that overall, retrievers and herders were significantly more likely to engage in solitary play (i.e., with toys) than livestock-guarding dogs.3 However, they also found that social play levels did not differ significantly across breed types. While this study didn’t specifically look at “squeaky toy” play, another study (Pullen, Merrill, Bradshaw, 2010) found that dogs had more interest in playing with toys that can be easily chewed and/or made a noise.4 Again, we wonder, does the squeaky noise stimulate dogs at an instinctive level? Many sources suggest that this is the case, but it has not been proven through studies as of yet. Human Reinforcement Theory Another theory is that pet parents are somehow reinforcing the play behavior in dogs. In other words, dogs notice that we give them more attention when they play with a squeaky toy. Dogs are masters at figuring out what gets our attention (and it’s hard to ignore a squeaky toy). The Mehrkam, et al. study found that across all breeds, higher levels of play were seen when human attention was a factor as well as a moving toy (like throwing a ball for the dog). It makes sense that by interacting with our dog during toy play, we can increase their interest in the toy. However, I believe it’s a case of mutual reinforcement. I’ve never come across a human that can pick up a squeaky toy without squeezing it to make it squeak, me included. We just can’t resist it, and we like the response we get from dogs when we squeak the toy, thus reinforcing the squeezing action. “Just Plain Fun” Theory Doing something that elicits an entertaining response is just plain fun and enjoyable. It stands to reason that dogs enjoy squeaky toys because it’s fun to bite down and get an interesting sound. It’s not just toys that elicit the squeaking sounds that dogs like. Many dogs also love toys that grunt or make other noises. Dogs engage in behaviors that are reinforced or rewarded, which is why we repeat “fun” things. They are self-reinforcing. Moving about, playing, and exercising, both with a toy and/or with us, also triggers the release of happy hormones (serotonin, dopamine, endorphins, oxytocin). What If Your Dog Doesn’t Like Squeaky Toys? If your dog doesn’t like squeaky toys, or toys in general, are they abnormal? Not at all. Dogs are individuals, like us, and they have likes and dislikes. Some dogs prefer tug toys or flying discs, and some dogs don’t like toy play at all, and that’s okay. Some dogs engage their new squeaky toy with reckless abandon and don’t stop until they’ve disemboweled the toy and removed the squeaker with the precision of a surgeon. Others leave their toy intact and functional for years. For my dog, part of the fun of getting a squeaky toy seems to be that he gets to engage in the entertaining challenge of getting the squeaker out of the toy. My guess is that, as is the case for all behavior, it is a combination of genetics (perhaps prey drive and neoteny?), rewarding behaviors, and just plain old fun that drives the zest with which dogs engage their squeaky toys. References: 1.McConnell P, London K. (2008). Play Together, Stay Together. Black Earth, WI:  McConnell Publishing, Ltd. 2.Bradshaw JWS, Pullen AJ, Rooney NJ. Why do adult dogs ‘play’? Behavioural Processes. 2015 January; 110: 82-87. https://www.sciencedirect.com/science/article/abs/pii/S0376635714002289 3.Mehrkam LR, Hall NJ, Haitz C, Wynne C. The influence of breed and environmental factors on social and solitary play in dogs (Canis lupus familiaris). Learning &amp; Behavior. 2017 July; 45:367-377. https://link.springer.com/article/10.3758/s13420-017-0283-0 4.Pullen AJ, Merrill RJ, Bradshaw JW. Preferences for toy types and presentations in kennel housed dogs. Applied Animal Behaviour Science. 2010 July; 125(3-4): 151-156. https://www.sciencedirect.com/science/article/abs/pii/S0168159110001255 Featured Image: iStock.com/CreativeNature_nl"}]