[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Female Dogs Hump?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/why-do-female-dogs-hump.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/why-do-female-dogs-hump.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Behavior, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-female-dogs-hump"}, "datePublished": "November 30, 2021", "dateModified": "October 16, 2023", "description": "Why do female dogs hump? Dr. Sandra Mitchell explains the potential reasons behind female dogs humping other dogs, objects, and humans.", "articleBody": "Humping is normal canine behavior, and it’s not limited to male dogs. Female dogs hump, too, though the behavior isn’t exactly socially acceptable to us. But why do female dogs hump?  Despite a popular myth, dogs don’t hump to establish social dominance. Instead, the behavior can arise from feelings of stress or anxiety, a surge in hormones, or because it’s a learned behavior (a behavior continued from previous, rewarded experiences).  Is It Normal for Female Dogs to Hump? All dogs can and do hump, whether they are male or female. This is considered a very normal behavior, although it can be embarrassing or annoying to us humans.   It’s important to set expectations for our dogs so they learn what is acceptable and what is unacceptable behavior. This begins by learning to effectively read your dog’s body language and communicate with them. If your dog is humping, never yell, swat, or give any attention to the behavior. The goal is to modify the behavior and not use force or punishment.    It’s also important to recognize that humping behavior is not just sexual—it can be a learned behavior that, while usually driven by hormones, can arise from stress, anxiety, and fear. Female dogs may hump just as commonly as male dogs.  Why Female Dogs Hump There are several reasons why male or female dogs will hump, including:  Juvenile hormone increases: Puppies that are just learning to explore the world and discovering appropriate behavior may hump quite frequently. Hyperarousal: Many dogs will respond to meeting a new dog or person by humping them or a nearby piece of furniture or toy. Under-socialized dogs may mount other dogs excessively, since they have not learned how to play well with others and can become over-aroused. Unfortunately, in some animals, this can lead to a learned behavior that can increase with anxiety and interfere with other normal routines.   Natural sexual behaviors: When dogs hump as part of a sexual behavior, you may also notice “flirtatious” behavior such as play bows and pawing. Stress and anxiety: For some dogs, humping is a natural response to stress or excitement. Dogs that have other mechanisms to deal with stress may not hump as often as dogs that don’t.  Abnormal hormone production: Humping can also indicate potential medical issues, particularly if the humping started up suddenly. If a dog starts humping suddenly, a trip to the vet is probably warranted.  It’s become a learned behavior: Many dogs will hump as an attention-seeking behavior, especially if it gets a response from their humans. Most people are not able to ignore being humped by a dog, so the behavior gets a response. Therefore, humping is a guaranteed form of attention, from a dog’s perspective.  Why Do Female Dogs Hump After Being Spayed?  Hormones don’t immediately leave a dog’s body after they’re spayed; it can take up to three months post-spay for a dog’s hormones to do so. If your dog is humping after being spayed, it could be because of lingering hormones, or it could be because the behavior has been reinforced and learned. Why Do Female Dogs Hump Specific Things or People?  Dogs will often pick specific things that they enjoy humping. These items can include toys, the arm of a sofa, or the leg of a person. Sometimes the choice is targeted for attention, like in humping a person. Other times, dogs just choose something nearby that is favored, or something soft. Usually, humping is just a release of pent-up energy.  Why Do Female Dogs Hump Another Female Dog?  A female dog humping another female dog is likely doing it out of excitement or stress, such as from resource guarding. Pet parents must identify the cause of the humping and begin behavior modification. A certified fear-free professional do trainer can help. Why Does My Female Dog Hump Male Dogs?  Again, they may be demonstrating some excitement or stress at meeting a new dog. Why Does My Female Dog Hump Me?  Female dogs will often hump their pet parents due to anxiety or stress, like if they’re experiencing separation anxiety. After all, they are very likely to get attention every time they do it. They may also hump you out of excitement, particularly when you first come home and greet them.  Why Do Female Dogs Hump Certain People?  Often, dogs will hump the people that give them the biggest reaction. Some dogs that hump for attention will pick the person that responds the most, effectively rewarding the behavior.   Dogs may also have specific targets for their humping behavior due to stress. For example, your pup might hump another dog in your house if they are experiencing resource guarding anxiety.  When Should You Worry About Female Dogs Humping? Humping in female dogs can be a normal behavior or caused by medical certain conditions. If your adult dog suddenly begins humping, it may be an indication of a health problem that should be checked out by a veterinarian, particularly if the dog is also licking excessively at their private areas.  If the behavior is extremely frequent, it may have become learned. However, some dogs will appear to hump out of boredom, and this indicates that perhaps more physical and mental enrichment is needed. Other dogs will hump more if they are stressed. Looking closely at your dog’s lifestyle for indications of stress may help identify the problem.  Should You Try to Stop Your Female Dog From Humping? Even though humping is a normal behavior in female dogs, it’s something most people wish to stop. There are multiple ways to discourage your dog from humping.  First, have your female dog spayed. Not only does this have several health benefits, but it may also have the behavioral benefit of discouraging humping. Remember that it can take up to three months post-spay for the humping behavior to stop, and that behavior modification may be needed if the humping has already become a learned behavior.   If your dog is humping, never yell, swat, or give any attention to the behavior. The goal is to modify the behavior and not use force or punishment.Next, watch your dog closely when they are getting ready to mount someone/something. They generally will show signals such as panting, whining, or pawing. As soon as you see these warning signs, distract your dog with a toy or a training cue (such as sit, shake, lie down, etc.). The distraction must be something more high-value and rewarding to your dog than humping. Some good distractions are:  Teaching a cue to “leave it” is very helpful in these types of circumstances. When your dog tries to mount something, giving the cue “leave it” can break the cycle.  If your dog is mounting to get attention, do not reward them with any attention—ignore them entirely in that moment. For dogs that are very persistent, working with a fear-free certified professional dog trainer may help. Featured Image: Adobe/Robert Petrovic"}]