[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Put Their Paws On People?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/Dog-pawing.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/Dog-pawing.jpeg"}, "author": {"@type": "Person", "name": "Erika Lessa, CBST, CDBT, CDBC, CPDT-KA, Fear-Free Certified", "url": "https://www.petmd.com/author/erika-lessa"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-put-their-paws-on-people"}, "datePublished": "September 29, 2023", "dateModified": "September 29, 2023", "description": "Dogs use their paws for many behaviors. They can tap, pat, pounce, whack, push, and even hit us with them. So, what does this mean? Why do our dogs put their paws on us? In this article, behaviorist Erika Lessa gives the answers.", "articleBody": "Why Does My Dog Paw at Me?  Dogs use their paws for many behaviors. They can tap, pat, pounce, whack, push, and even hit us with them. So, what does this mean? Why do our dogs put their paws on us? Dog pawing begins as an instinctive behavior in puppies. As they age, they learn pawing is a useful communication tool. Pawing usually results in pet parents tending to their dog. Your pup figures out that if they want something—like food, attention, access, or protection—pawing is a proven way of getting it. Because pawing is a natural behavior from birth (pups will paw at their mothers for milk), dogs will use this communication tool when in need. Additionally, their humans will typically respond to pawing. Many people find it adorable when their fur baby gives them a pat with their paw, so typically, the dog gets the wanted reaction from their parents. But because not all pawing is a request for attention, it’s important to be aware of what else your dog is doing. Their body language can give you important information about their emotions and what they’re trying to accomplish. They Want Your Attention You may have heard the phrase “demand behavior.” It’s a dated term describing a dog that uses behaviors like pawing to get something. The current theory is that a dog uses pawing to communicate an unmet need. People typically reinforce this behavior by instantly providing the wanted outcome for their dog. Let’s look at an example: A dog is ready for some physical affection, or perhaps they want to play, but their person isn&#039;t paying attention. They walk over and put their paw on their pet parent’s lap. Wanting to discourage this behavior, the person says “No.” But then they stand up and engage with the dog. Even though the person has used a verbal correction like the word no, the dog got the attention of the owner. They learn that pawing is effective to get something they need. From a training perspective, an effective plan is to watch your dog. By observing what they do before they paw, you may be able to figure out what they’re looking for. Ask yourself a few of these questions: Does your pup come and stare at you first? Do they take a lap around the room? Do they look at one of their toys? Do they circle their food bowl? Do they walk to the back door? Once you know their tells, get up, ask for an alternate behavior—like sit—before the pawing happens, and give them what they want. Once sitting works to get their needs met, sitting can replace pawing. If your dog is bored and you’re not able to engage, then providing a self-directed activity is a great way to keep your pup busy. For dogs that love to chase, a Giggle Ball might do the trick. You may also want to try dispensing toys, like a Kong or a Toppl. You can stuff these with treats. You can also freeze these toys with peanut butter, bananas, and Kong Stuff’N Eat fillers to extend  the fun. This can provide you more time to work without being continuously pawed by your furry companion. But because not all pawing is a request for attention, it’s important to be aware of what else your dog is doing.They Need To Go Out Whether your dog needs to go to the bathroom or are chasing a sunspot outside, a paw can mean that your pup wants to go out. Similar to seeking attention, a dog may engage in other behaviors before they paw you. When you see these pre-paw behaviors, call your dog to the door, ask them to sit, and immediately open the door for them. This tactic can teach your dog that sitting at the door gets them outside. If you reinforce polite signaling, those behaviors can replace pawing. They’re Hungry Many pet parents will notice that their pup becomes restless about 30 minutes before their feeding time. When their stomach starts to rumble, your pup may use their paw to alert you that they’re hungry. You can teach them how to behave before and during meal preparation. Having your dog move to a station—like a rug, mat, or bed—can be used to teach them that it’s a signal for when they need food. This will help them remain calm while they wait for you to finish making their food. Outside scheduled feeding times, consider providing a snack that can serve as a longer activity. Bully sticks, stuffed bones, and naturally roasted chews can help provide calories to your pup. If your dog has any physical or behavioral issues, check with your veterinarian or behavior consultant before introducing a new treat. They’re Showing Their Love Love is an experience triggering a chemical reaction involving serotonin, oxytocin, and dopamine. When we experience an event or person that produces this reaction, we want more. Dogs, possessing all three neurotransmitters, can experience love and often show their need for it through pawing. A paw resting on your arm while you are petting them communicates that they are experiencing love. Because you are providing this reaction, you become associated with your pup’s positive feelings. They’re Nervous Dogs can also use paws as part of a bigger cluster of body language indicators to communicate emotions like stress or anxiety. A paw lift without contact is a stress behavior in dogs. When they make contact, we need to watch for other characteristics. Pressure or pushing with their paws are indicators that the dog is trying to slow the interaction or get space. If you notice stress or anxiety in your pup, call them away from the situation. Give them a treat as a reward for coming along. Make sure to give them time and space to acclimate to the event or the new person. This might mean taking them out for a walk, in the yard to play, or calmly observing from a safe distance. A Dog Put a Paw on Me. What Should I Do? If your dog paws you, you should first look at the situation. Pawing that indicates stress, anxiety, or medical issues needs to be handled differently than pawing for pets and playtime. If you’re struggling to identify why your dog is pawing at you, speak with a reputable professional to help sort it out. If an unfamiliar dog puts their paw on you and it makes you uncomfortable, back away and ask the pup’s pet parent to intervene. If your dog likes to paw, they may enjoy talking pet toys. While playing with this toy, your dog can use their paw to tap a button with a symbol on it to express what they want. Each symbol is paired with a result. Start with one button, like the symbol for outside. Place it by the door. Your dog will tap the button, and then open the door for them. Repeat this exercise during mealtime. Place the appropriate button where your dog eats. Once your dog taps it, give them their meal. Once your fur baby learns their toy’s symbols and their outcomes, your dog can select the button that matches their need. Best of all, they still get to use their paw. Featured Image: Stock.adobe.com/Kanstantsin"}]