[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/p622h60krv", "@type": "VideoObject", "duration": "PT1M52S", "name": "5324820011001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/1be0f6a09581e80b291d27455e016c0bfed172c2.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/p622h60krv", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/91eaeae0d7b4d0703854589330b95e91b343d9a4.m3u8", "transcript": "Even if you've done a great job house training your puppy or adult dog sometimes there might be a little squirt as you greet him or play too hard. This is called excitement urination. Now most puppies grow out of this but there is some adult dogs that still have this behavior. Once you've ruled out any medical concerns you can follow these tips to keep your dog dry.\n\nKeep your greetings low key sounding over-the-top excited can trigger excitement urination. You'll also want to watch your body language rather than leaning over your puppy and patting him directly on the head. Try to avoid direct eye contact instead angle your body slightly away from your dog. You can kneel or squat and let him approach you in his own time instruct your guests to do the same thing.\n\nAlso give them some treats so your puppy can start to make a positive association. Remember to take frequent breaks as you play because excitement makes urine and a full bladder can be harder to hold. Avoid making any scary or threatening movements as you play with your dog. Now if he does have an accident clean it up with a good odor eliminator and take him outside so he can finish the job.\n\nA dog that urinates when he's scolded nervous or approached by a stranger is exhibiting a different kind of behavior. This is submissive urination. It's an appeasement gesture or a way for your dog to say that he's not a threat. Now this behavior can continue into adulthood If it's not addressed.\n\nKeep your greetings in play times low key and instruct guests to let your dog approach on his own time. More importantly, take a look at how you're interacting with your dog on a daily basis. Your dog needs support and kindness not scolding with gentle guidance your dog will outgrow these wet greetings.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/why-dogs-pee-when-excited-or-scared?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Dogs Pee When Excited or Scared", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/pip-laying-down.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/pip-laying-down.jpg"}, "author": {"@type": "Person", "name": "Megan Keller, DVM", "url": "https://www.petmd.com/author/dr-megan-keller"}, "keywords": "Dog, Behavior, Mental health, Anxiety, Zoo Anxious Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-dogs-pee-when-excited-or-scared"}, "datePublished": "March 24, 2022", "dateModified": "August 30, 2023", "description": "Dr. Megan Keller explains why dogs pee when they get excited or scared and how you can help them overcome the behavior.", "articleBody": "If you have an older dog that suddenly begins urinating inappropriately (or cannot seem to hold their pee), make an appointment with your veterinarian, as there could be a medical cause. Have you ever been greeted by your hyper dog when you get home, and then noticed a puddle of pee by your shoes? Or perhaps your new puppy flopped onto their back to greet your friend, and then peed a little on their own fur and your clean rug. This could be excitement peeing or submissive peeing. Both are common in dogs, but what separates the two are your dog’s state of mind and their emotional triggers. Some dogs pee because they are excited and submissive at the same time. For example, a dog that excitedly pees when their pet parent comes home may also submissively urinate if they are sternly reprimanded or overcorrected for the initial excitement pee. So how do you know which one you’re dealing with? Here’s what you need to know about why dogs pee when you wish they wouldn’t. Why Does My Dog Pee When Excited? Excitement peeing is most often found in happy, hyper, young dogs that may not have full bladder control. Dogs frequently outgrow this form of peeing as they mature and emotionally calm down. It can become worse if your dog is suddenly awakened or startled, and then gets very animated (such as when you come home while they’re taking a nap). Signs of Excited Peeing in Dogs Dogs peeing when excited won’t necessarily squat or lift their leg like usual. They often pee while walking, standing, or even bouncing up and down. You can tell that your dog is excited if they are holding their tail higher than normal, wagging their entire body and tail side to side, holding their head up, or whining and/or barking. How to Stop a Dog from Peeing When Excited There are three main keys to controlling excitement peeing: Frequent walks Helping your dog relax Treating the excitability Take Frequent Walks Taking your dog for frequent walks will encourage your dog to pee in the great outdoors rather than in your living room. If they have an empty bladder, they have less urine to release when they become too excited. Beginning at the age of four months, a dog can usually hold their bladder 1 hour for every month of age, plus 1. So, a 6-month-old pup should be able to hold their bladder for up to 7 hours (6 months old + 1 = 7 hours). But some dogs may need to go out more often than that, and that’s perfectly okay. You will want to take your dog out more frequently than this to reduce the excitement pee also. Teach Your Dog How to Relax The second key is to teach your dog how to relax. Not all dogs have the instinct or desire to relax on their own and may need some help from their humans. For dogs that have a hard time settling down, they can be taught how to relax with short, daily training sessions. One good program is Dr. Karen Overall’s Protocol for Relaxation from her book Clinical Behavioral Medicine For Small Animals. This is a 15-day positive reinforcement training program that trains dogs to relax quietly while experiencing different activities and noises. Having your dog perform a behavior that is directly incompatible to excitement behavior can also help. An example would be to have your dog lie down with their head/neck extended. This helps move your dog out of the excited mindset and into a more relaxed, task-driven mentality. Don’t Interact With Your Dog When They Are Excited The third key is to not interact with your dog during situations that trigger excited pee. First, make sure your dog is capable of holding their bladder and has been fully house-trained. When your dog becomes too stimulated, simply stand quietly while turning away from your dog, and wait for them to settle down. Greet them after they are calm. If your dog starts getting excited, turn away again and let them settle down. Treating the excitability is crucial to treating excitement peeing. Reducing your dog’s energy level with consistent, daily exercise and daily mental stimulation can also help decrease excitement peeing. A tired won’t have enough energy to get excited enough to pee on your floor. Activities such as playing catch, doing agility training, jumping hurdles, or running with you are great ways to get out some of that excitable energy. While it is understandable that you might get angry or be frustrated by frequent excited peeing, do NOT use punishment to try to correct the issue of excitement peeing. Pet parents used to be told that it was a good idea to rub the dog’s face in the pee or poop to teach them that peeing or pooping inside is a bad behavior. This is an outdated and incorrect training method. Any punishment will only make the situation worse by adding a submissive or fear component to your dog’s inappropriate peeing. It may even cause damage to your bond with your dog. A better solution is to use positive reinforcement to not only help correct the situation, but also to strengthen your bond with your dog at the same time. Submissive Urination in Dogs While most dogs outgrow emotional peeing, submissive peeing can be found in dogs of all ages. It’s more common among young female dogs, puppies, dogs that have been repeatedly (and often harshly) corrected, and dogs that have been kept in a dependent situation (in a shelter or kennel). This type of peeing often occurs when some event causes the dog to give a submissive signal as they urinate a small amount. Submissive signals can vary greatly depending on your dog and their personality. Signs of Submissive Urination in Dogs Some common submissive signals include sitting, hanging their head down or to the side, exposing their groin, or full-fledged groveling. This is when a dog pees (and possibly drools) as they lie flat on their back, with their tail tucked and front legs pulled tightly into their body. A typical situation where submissive peeing occurs is when a dog is approached by a stranger, and they lie down and pee a small amount. Another classic situation is when someone moves their arm toward the dog, who will then look down, back away, and pee a tiny bit. Of course, no one wants their best four-legged friend cowering away from them. It’s important to note that this is a show of submission to a person or situation the dog considers to be dominant. It is not necessarily a sign the dog has been beaten or abused. How to Stop Submissive Peeing in Dogs You will need to change your behavior and also train your dog to become desensitized to triggers. Change How You Approach Your Dog For pet parents and other humans, this means not leaning over your dog, making direct eye contact, reaching toward your dog (especially over their head), hugging them, or approaching them head-on. Instead, sit on the ground to make yourself appear smaller. Look to the side or at the dog’s hip to avoid direct eye contact, and allow them to approach you. Entice them with treats, and if they do approach, and pet them gently under the chin, not on the top of their head. Desensitize Your Dog to Certain Triggers The next step is to desensitize your dog to movements that trigger submissive peeing. First, you’ll need to identify the situations that trigger your dog. Then in those situations, start making smaller movements and rewarding your dog for not peeing. For example, if your dog pees when you reach for their collar, begin by moving your hand a few inches away from your body and rewarding them for not reacting. Once your dog calmly accepts small movements, gradually progress to larger ones. Continue rewarding your dog when they don’t react or pee in response to the movements. Over time, you can work up to being able to touch and handle your dog’s collar without a drop of pee on the floor. Another method to discourage submissive peeing is to have your dog wear a canine diaper while you work on the desensitizing. The diaper will make getting into the submissive squat more difficult. Do not use negative reinforcement such as spanking, yelling, or rubbing their nose in it, as this will make the submissive peeing worse. If training fails to correct submissive peeing and your dog is submissive in all social settings, you talk with your veterinarian about using a mild anti-anxiety medication. Why Does My Dog Pee When I Pet Them? If your dog urinates when you reach to pet them, you most likely have triggered a submissive pee. Submissive dogs are trying to send the distress message, “Please don’t harm me; I’m no threat.” Submissive dogs need gentle encouragement and a calm environment. It takes time, patience, and a lot of positive bonding and engagement to help submissive peeing dogs stop this behavior. Try to avoid actions that trigger submissive peeing. Allowing your dog to come to you for petting and interaction will greatly decrease submissive peeing. You can also try the desensitizing method. Calm, slow movements give your dog time to process what is happening, read your body language to make sure you’re not a threat, and react in a way that feels comfortable. Environment management is also key. One common trigger for submissive peeing might be when strangers approach your dog. If this happens in your house, try asking visitors to ignore your dog until they approach on their own. Another option is to keep your dog contained in an area where there is a barrier (a crate or a baby gate) that allows them to see the stranger but also feel safe in their own area or den. If you are out on a walk and a stranger asks to pet your dog, simply decline politely, and tell them your dog is in training and needs to be focusing on you right now. Why Does My Dog Pee When I Come Home? If you come home to an exuberant pup, is this a sign of separation anxiety? Most likely not. Separation anxiety is a mental disorder where dogs will go to the bathroom indoors, destroy things, and/or vocalize when left alone. It is a complex condition with many causes, but the underlying emotion for separation anxiety in dogs is unease and displeasure. Just peeing when you come home is not enough to indicate separation anxiety. A dog’s world revolves mainly around their family group, be it other dogs or their human family. Their enthusiasm for your return home is most likely because they are happy to see you. Whether due to excitement or submission, you’re not alone dealing with inappropriate peeing. Management of both excitement and submissive peeing takes time and patience. If the peeing continues despite your best efforts, consider working with a qualified behavior professional."}]