[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Do About a Dog That Bullies Other Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/bullying-behavior-dog-530897812.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/bullying-behavior-dog-530897812.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/what-do-about-dog-bullies-other-dogs"}, "datePublished": "July 12, 2017", "dateModified": "August 16, 2022", "description": "It’s not always easy to spot a bully because dog play often looks intense and over-the-top, but if you closely watch the interactions between a bully dog and his victim, you’ll discover that only one half of the duo is having a good time. Learn more here.", "articleBody": "By Victoria Schade No one wants to hang around a canine bully. These inappropriate dogs are pushy, annoying, and tone-deaf about dog-speak, and instead of following the rules of polite social interactions, they make their own rules. It’s not always easy to spot a bully because dog play often looks intense and over-the-top, and many pet parents might consider their bullying dog’s behavior just a normal part of the game. But if you closely watch the interactions between a bully dog and his victim, you’ll discover that only one half of the duo is having a good time. Is Your Dog a Bully? How to Spot Bullying Behavior Worried that you might have a canine bully? Ask yourself the following questions: 1. Is your dog always the one chasing, pinning, barking at, or grabbing other dogs? Positive dog play involves give-and-take. Even if one dog is the designated chaser and the other is the designated chase-ee, you should see moments where both dogs pause to reset the interaction, or even swap roles so that the pursuing dog is on the receiving end, or the wrestler is at the bottom of the scrum for a change. If your dog ignores this critical part of play, he might be pushy to the point of being a bully. 2. How does your dog react if his playmate tries to tell him “no thank you”? Sometimes play tips over from a good time to overstimulation. When that happens, one dog will usually signal his discomfort about the escalating interaction, perhaps by stepping away from the other dog and doing a full-body shake off, or, if things have gotten intense, with a more obvious signal like a hard stare or growl. An appropriate playmate will take the feedback to heart and back off, but a bully will ignore what the other dog is telling him and continue pinning, nipping, body slamming, chasing, or whatever he’s doing to rattle the other dog.   3. Does your dog tend to focus on one dog? Some bullying dogs pick a specific target and go after it relentlessly. Even though there might be other dogs around that are better matched in terms of size or play style, the bully zones in on his target, often a smaller or less confident dog, and doesn’t back off. If the other dog looks like he’s trying to get away as your dog relentlessly pursues, then your dog is likely bullying him. Now That You Know… Teaching Your Dog Not to Bully Reforming a canine bully takes a keen eye and quick reflexes. It’s best to work with your dog in a controlled environment, like a fenced yard, instead of in a park where the amount of open space and the opportunity for other dogs to intervene can delay the process. For this exercise, select a confident playmate that can tolerate canine misbehavior and won’t get triggered by your dog’s pushiness. Avoid dogs that are likely to become overwhelmed by the bully dog’s behavior. The goal of the exercise is to teach your dog that when he gets pushy with another dog, his fun time ends. Much like a clicker precisely marks the exact moment when a dog has performed a correct behavior, you can employ a verbal marker to capture the moment when your dog has behaved inappropriately. It doesn’t matter what word or phrase you select, just make sure that it’s short and doesn’t sound angry when you say it. Something like “Time out” or “No thanks!” said in a neutral tone of voice should work well. Put your dog on a long, light leash before the play session begins. This “drag line” allows you to enforce the time-out without having to put your hand in between the dogs. Recognize When the Bullying Behavior Starts, and Stop It Quickly Some bullying dogs get to work immediately, while others take time to build to a fever pitch. If your dog starts off by interacting politely with the other dog, praise him for his good behavior and allow them to continue playing. If your dog has a super-strong recall, occasionally call him to you during the session before things get out of hand for occasional “de-escalation” breaks, during which you praise him and give him a small treat. This allows your dog a few seconds to cool off, which might prevent the bullying from even starting. The key to determining when play has tipped over from fun to fraught is watching the other dog. The moment the other dog looks stressed (tucked body, head down, ears back) or like he’s trying to get away from your dog, use your time-out phrase to mark your dog’s behavioral infraction, then pick up the long line and lead your dog away from the fun. Take a 30-second break during which your dog has no exposure to the other dog. Remain neutral as you move him away, and don’t repeat the time-out phrase. It’s crucial that you say the time-out phrase right as your dog engages in the pushy behavior, and lead then him away immediately. Saying the phrase without any consequence, or lagging between when you say it and when the time-out begins, will slow your progress and likely confuse your dog. With enough pairings of the phrase and the time-out, your dog should start to realize that every time he’s inappropriate with his playmate, the fun stops. That said, if your dog’s behavior continues to make the other dog uncomfortable after several time-outs, or it seems like the time-outs are not changing his behavior, you might have to wrap it up for the day. Because bullying is so rewarding for the pushy dog, rehabbing can take time. Praising your dog for appropriate interactions and taking well-timed behavior breaks should help even the most harassing of hounds figure out that fair play is the way to go."}]