[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Eat Dirt?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/dirty-west-highland-terrier-westie-dog-with-muddy-face-outdoors-in-picture-id982496942.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/dirty-west-highland-terrier-westie-dog-with-muddy-face-outdoors-in-picture-id982496942.jpg"}, "author": {"@type": "Person", "name": "Michelle Diener, DVM", "url": "https://www.petmd.com/author/dr-michelle-diener"}, "keywords": "Dog, Behavior, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-eat-dirt"}, "datePublished": "November 30, 2021", "dateModified": "August 16, 2022", "description": "Dr. Michelle Diener explains the reasons why your dog might be eating dirt, whether it’s safe, and what to do if you find your pup exhibiting this behavior.", "articleBody": "Why did my dog just eat that? As a dog parent, you’ve probably asked this question at some point, whether your dog ate a stick, a rock, or dirt. Consuming objects that are not food-related is an eating disorder called pica. A form of pica called geophagia causes dogs to purposely eat dirt or mud. Why Does My Dog Eat Dirt? Your dog’s desire to eat dirt may be caused by nutritional, behavioral, or medical reasons. Nutritional All dog foods are not created equally. Some diets do not contain all the nutrients that a dog needs to live a healthy lifestyle. Dietary deficiencies can cause dogs of any age to eat dirt to obtain minerals, like sodium, iron, and calcium from the soil. Dogs that are underfed may also eat dirt and other objects due to hunger and nutritional deficiencies. When selecting a good quality dog food, make sure the food you choose meets the World Small Animal Veterinary Association (WSAVA) nutritional guidelines and is made by a large, experienced, and reputable manufacturer. Brands such as Royal Canin, Hill’s Science Diet, and Purina all meet WSAVA guidelines. Behavioral Dogs can get bored if they don’t have enough exercise or enrichment, and some will eat dirt to occupy their time. Dogs with separation anxiety may eat dirt due to stress when they are separated from their pet parents. Dogs can develop anxiety at any age. Medical Several medical issues can also cause dogs to want to eat dirt. Anemia This medical condition refers to a low red blood cell count. Anemia can be caused by a variety of things, such as hookworms, flea infestation, tick disease, cancer, immune-mediated diseases, or bleeding disorders. It is more common for puppies to have hookworms since they can typically contract these parasites through their mother’s milk when nursing. However, dogs of any age can get hookworms from the environment if they are not on heartworm prevention. All dogs are prone to fleas and ticks, which are blood-sucking parasites that can cause severe anemia. Keep your dog on a good flea/tick prevention year-round, such as Simparica, NexGard, or Bravecto. Adult and senior dogs can develop a severe anemia due to internal bleeding from certain types of cancerous masses. Immune-mediated diseases and bleeding disorders are very rare but can also cause anemia in a dog of any age.  Any anemia, if severe enough, can cause a dog to eat dirt. Portosystemic (Liver) Shunt A shunt is an abnormal blood vessel that allows blood to bypass a dog’s liver. As a result, the liver receives an inadequate blood supply and does not function properly. Shunts are rare but can be congenital (in puppies) or seen in adult or senior dogs. Gastritis (Inflammation of the Stomach) When dogs have an upset stomach, they sometimes eat dirt and/or grass to try to make themselves vomit. Is Eating Dirt Bad for Dogs? Absolutely! Eating dirt can pose a variety of problems for dogs. Eating clumps of dirt, mud, or other objects can pose a choking hazard. Chewing and consuming hard objects, like rocks and animal bones that may be mixed in with the dirt, can also fracture teeth. Aside from the more obvious dangers, here are some others that you may not be aware of. Gastrointestinal Obstruction Dirt, rocks, sticks, or other objects, also called foreign bodies, can get stuck in a dog’s esophagus, stomach, or intestines. This is called a gastrointestinal obstruction. Surgery is often needed to treat an obstruction. Symptoms of an obstruction can include: Gagging Coughing Regurgitation Abdominal pain Decreased appetite Vomiting up food or water within minutes of eating or drinking Lethargy As soon as you see your dog ingest a foreign body, call your local animal hospital or emergency vet hospital immediately. A veterinarian may have you bring your dog right to the hospital so that vomiting can be induced to prevent possible obstruction. Timing is crucial. You must get your dog to a vet within an hour of ingestion of the foreign material because a dog’s stomach usually empties within two hours. Toxins Another risk of eating dirt or grass is that it may contain pesticides, fertilizers, or other toxins that can be severely harmful to your dog. If you see your dog eating dirt from a lawn that may have been treated with pesticides or fertilizer, call the Pet Poison Helpline at 855-764-7661 or ASPCA Poison Control at 888-426-4435 immediately. There is a fee for calling either of these helplines, but you will be advised on whether or not your dog needs immediate medical care. You will also receive a case number that you can give to your local vet or emergency vet. Damage to the Gastrointestinal Tract Dirt and rocks may also cause abrasions and inflammation to the lining of a dog’s gastrointestinal tract as they work their way down the esophagus, into the stomach, and through the intestines. Parasites Dogs that eat dirt are also more prone to ingesting soil-dwelling parasites, such as Capillaria, Giardia, hookworms, roundworms, and whipworms. They may also ingest fleas that are on the ground, which can transmit a parasite called tapeworms. What to Do If Your Dog Is Eating Dirt Eating small amounts of dirt on occasion will likely not harm your dog but should still be discouraged. If your dog eats a lot of dirt or suddenly eats dirt for the first time, this could be a sign of a medical condition and you should call your vet as soon as possible. The vet can run diagnostic tests to determine an underlying cause and proper treatment. Take your dog to a vet if they have any of the following symptoms: Eating dirt frequently or suddenly Decreased appetite Straining to poop or irregular bowel movements Lethargy Pale gums (sign of anemia) Vomiting multiple times in a 24-hour period, especially if vomiting occurs soon after eating or drinking  Your vet will want to know the following: What are your dog&#039;s symptoms? How long has your dog been sick? Did your dog eat any foreign material (dirt, rocks, toxins, etc.), and if so, how long ago? Is your dog taking any medications? What food is your dog eating? Any recent diet changes? Any vomiting and/or diarrhea? Is your dog taking heartworm and flea/tick prevention regularly? Has there been a lapse in prevention? Your vet may need to do several diagnostic tests to determine why your dog is repeatedly eating dirt or foreign objects, including: Baseline blood cell count (CBC), electrolyte panel, and chemistry panel to check for anemia, liver disease, and possible causes of gastritis Urinalysis to check for urate crystals in the urine (a possible sign of a portosystemic shunt) Fecal float and fecal antigen tests to check for intestinal parasites Gastrointestinal panel to test for exocrine pancreatic insufficiency Bile acid test to assess liver function and help in the diagnosis of a portosystemic shunt Abdominal ultrasound to look for cancerous masses, portosystemic shunt, thickened intestinal wall (suggestive of a food allergy or inflammatory bowel disease), cancer, or gastrointestinal obstruction Endoscopy/colonoscopy and biopsies of the gastrointestinal tract to determine if there is inflammation, infection, or cancer Food trial to test for food allergy How to Keep Your Dog From Eating Dirt Here are some tips to keep dogs from eating dirt and help protect them from parasites that can come from soil. Proper Diet Feed your dog a good quality diet so your dog receives the proper nutrition to live a healthy lifestyle. Talk to your local vet about the best diet to feed your dog. It is recommended that most dogs eat twice a day. Dogs under 10 pounds should eat 3-4 small meals a day. If your dog is only being fed once a day and you notice that they are eating things outside (dirt, sticks, rocks) or objects in your house, this may be due to hunger. It may help to divide your dog’s daily food portions into 2-3 meals to keep your dog’s stomach content throughout the day. Supervised Walks Leash-walk your dog whenever you go outside so they are always under direct supervision. Then you will know if your dog tries to eat anything unusual. You can immediately remove an object from your dog’s mouth and lead your dog away. If it is too difficult to walk your dog on a leash, or your dog is quick to eat dirt or other objects, try having your dog wear a basket muzzle. This muzzle sits loosely over the mouth and will prevent your dog from being able to eat dirt and other foreign objects. Parasite Prevention Keep your dog on year-round heartworm and flea/tick prevention to protect them from intestinal parasites, fleas, ticks, and heartworm disease. Heartworm prevention is prescription only. An oral flea/tick prevention is the best way to protect your dog from fleas and ticks and also requires a prescription. Reducing Anxiety and Boredom Make sure your dog gets plenty of exercise and has toys to play with. This will help reduce anxiety and prevent your dog from eating dirt out of boredom. If your dog suffers from severe anxiety, consult with your local vet. You may also need to hire a professional dog trainer or seek help from a boarded veterinary behaviorist to learn how to ease your dog’s anxiety. References Selecting the best food for your pet - WSAVA. https://wsava.org/wp-content/uploads/2021/04/Selecting-a-pet-food-for-your-pet-updated-2021_WSAVA-Global-Nutrition-Toolkit.pdf. Featured image: iStock.com/corners74"}]