[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Resource Guarding in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/resource-guarding-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/resource-guarding-dogs.jpg"}, "author": {"@type": "Person", "name": "Jeannine Berger, DVM, DACVB, DACAW, CAWA", "url": "https://www.petmd.com/author/dr-jeannine-berger"}, "keywords": "Dog, Adult, Behavior, Symptom Checker, Resource Guarding", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/resource-guarding-dogs"}, "datePublished": "March 20, 2023", "dateModified": "September 12, 2023", "description": "Resource guarding in dogs happens when a dog has a precious item and there is a perceived threat. This can worry new pet parents, but dog resource guarding can be managed and corrected. Learn more about resource guarding in dogs.", "articleBody": "When I brought Bo, a 9-month-old Australian Cattle Dog, home from the shelter, I placed his food bowl down and immediately knew I had a potential behavior problem to address. When I approached Bo while he was eating, he suddenly stopped eating, stiffened, hovered over the bowl, and I heard a deep growl. I realized I had just adopted a dog with signs of resource guarding.  What Is Resource Guarding in Dogs? Protecting a food source is within normal canine behavior. In a natural environment without humans, dogs are scavengers living in larger groups around food sources. Food protection behavior has evolved to keep other dogs away from a meal, and in most cases these behaviors are ritualistic. While a pup wants to keep his food away from fellow scavengers (including you or another animal in the house), his resource-guarding behaviors serve mainly as a threat display rather than actual aggression.  Even after thousands of years of domestication, these ritualistic behaviors continue to be displayed by some dogs. Our domesticated dogs can guard anything they consider a highly valued or scarce resource, such as food, toys, their dog bed or crate, or even a favorite human. What Does Dog Resource Guarding Look Like? There are generally three types of behavior patterns displayed by dogs with resource-guarding behavior. Eating faster: After all, no one can take away what he already swallowed! Denying access: The dog will position his body to protect the item. Typically, he stops eating; stares; hovers, stiffens, or leans over the item; or even grabs the item to run away and hide with it. Aggression: This includes growling, snarling, chasing, barking, lip-lifting, snapping, and even biting. Causes of Resource Guarding in Dogs Dog resource guarding happens when a dog has a valued resource that he deems worthy of guarding and there is a real or perceived threat to that resource. While resource guarding is a natural behavior, there are a few motivational reasons why some dogs develop this conduct: The dog is fearful or anxious. The dog lacks confidence. The dog feels a lack of control and routine. (Routine is so important for dogs!) The dog is trying to establish a hierarchy with other nearby dogs. It’s a response to a confrontational approach—the dog’s human has taken precious items away in the past, punished the dog for displaying guarding behavior, or increased the pup’s fear and anxiety. How To Stop Resourcing Guarding in Dogs While resource guarding in dogs can make new pet parents worry, this behavior can easily be managed or even changed.   1. Raise Awareness Once you’re aware of the problem, inform everyone who regularly interacts with the dog about his behavior. Don’t “test” the dog; meaning, don’t repeat interactions that are not working. Take note of what your dog’s body language is telling you and communicate that with your family. 2. Make a Management Plan Create a management plan for your pup, including a rule to not approach the dog while he’s eating. You don’t want him to see you or your family as a challenge to his food. Because resource-guarding behavior is displayed only when there’s a threat (or, in this case, a perceived threat), this is easy to avoid. Never challenge a dog for his food. Unfortunately, some outdated techniques required pet parents to “not allow this behavior” and to “take the food away.” New education in science and training has taught us this is really bad advice. Not only is this not safe for the pet parent, but it reinforces the dog’s belief that he must defend his food. It also increases stress, anxiety, and in some cases aggression.  3. Provide Relaxation During Feeding Time If a dog resource-guards his food, placing the food in a separate room without the dog present and then allowing him to enter the room helps him eat in peace. You can shut the door behind him so he can eat at his own pace without having to worry about other scavengers. After he finishes all his food, open the door, call his name, place another food bowl with some extra treats by the door, and walk away. This helps him learn that when humans approach, they add more food—not take it away. It’s important to help a resource-guarding dog relax in the presence of a food bowl for several weeks to lower his fear and anxiety. If a dog is continuously exposed to a situation where he feels threatened, the behavior can easily get worse. 4. Create a New Emotional Response After a couple weeks of following this new feeding routine, you can start opening the door while he eats, call his name, and toss a yummy treat toward him, aiming for the bowl from a distance. When we did this with Bo, he would stop eating after I opened the door and walk over to me with a wagging tail, expecting something even better than his kibble. When he remained relaxed, I would walk gradually closer toward the bowl, adding the treat directly to the bowl. Pretty soon, he learned to expect more from me—not less—and realized there is no need to guard anything from me. Only do this if your dog stays relaxed. If your dog shows any signs of resource guarding or even aggression, you’re progressing too fast. Know that, for some dogs, lifelong management is necessary. Resource Guarding Between Dogs If your dog shows resource-guarding behaviors toward other dogs at home, the best approach at management is to separate the dogs during feeding. This also applies if a dog resource-guards a favorite bone or toy—simply remove the trigger item completely (maybe create a “No peanut butter KONG toy” rule) or provide that special item only when the dogs are separated. There can sometimes be a play component to resource guarding, and pet parents should consult with their veterinarian or a behavior professional to see if their pup’s behavior is safe for both dogs. Tips for Dealing With Resource Guarding in Dogs Don’t give your dog any high-value items unless he’s allowed to enjoy and finish them in peace. If your dog displays guarding behavior with a location (for example, the couch), don’t allow the dog access to that area. If a dog is resource guarding a favorite human (like you), immediately walk away from him as soon as he displays any subtle guarding behavior (such as staring) toward another person or dog. Don’t wait until the dog growls, barks, or lunges. Teach your dog early and often to trade items, and always use a higher-value item to trade. Teach cues such as “drop it” or “leave it.” In most cases, resource guarding can be easily managed and is only a problem when people try to confront the dog. But if a dog is showing any signs of aggression—and especially if he leaves the food or other item to proactively go after a person or another dog in the home—the underlying cause could be a medical condition, such as a gastrointestinal problem or anxiety, and will need to be addressed by a veterinarian or a board-certified veterinary behavior specialist."}]