[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How To Stop a Dog From Digging", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/how-to-stop-a-dog-from-digging.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/how-to-stop-a-dog-from-digging.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Behavior, General health, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-to-stop-dog-digging"}, "datePublished": "September 1, 2023", "dateModified": "September 1, 2023", "description": "Dogs dig for many different reasons. To stop a dog from digging, you have to address the cause of the issue. Here’s how to stop dogs from digging.", "articleBody": "Digging is a great example of a behavior that dogs absolutely love … and pet parents loathe. A digging dog can turn your yard into an eyesore, but digging can also become more than an aesthetic issue if a dog excavates to escape the yard. First, try to determine why a dog is digging, then work to find a solution that addresses the cause of the behavior. Here’s how to stop a dog from digging. Why Do Dogs Dig? There are many reasons your dog might opt to dig up your yard (or couch!), including: Boredom: Dogs left alone in the yard for extended periods might fill their time by doing some creative landscaping. Play: Digging is fun! There’s “playback” as dogs dig, whether from the movement of the dirt, the uncovering of roots, or the discovery of bugs. Hoarding: Some dogs prefer to hide precious goodies, like bones, either in holes they dig outdoors or in the cushions of your couch. Beating the heat: Northern breeds with a thick coat, such as Siberian Huskies, might dig to unearth a cooler resting spot. Instinct: Some dogs, such as Dachshunds and small terriers, have a genetic predisposition to “go to ground” to hunt for prey. Escape: Dogs who are left outdoors might be looking for fun beyond the fence. How To Stop Your Dog From Digging up Your Yard Because digging is highly reinforcing for dogs in so many ways, the problem rarely goes away on its own. Check out these home remedies to stop a dog from digging. 1. Increase Your Dog’s Mental and Physical Exercise Dogs who resort to boredom digging probably aren’t getting enough stimulation, so take time to really connect with your dog—and not just on walks! Play games that tap into your dog’s inner athlete, like tug and fetch, but don’t forget about the brain as well. Games like “find the toy” and trick training are simple ways to increase your dog’s mental stimulation while wearing them out.  2. Give Your Dog Something To Do If your dog has to spend time outside unsupervised, make sure to provide him with toys instead of leaving him to find his own busy work. Give him a variety of rubber treat toys that are safe for him to use alone, or goodies that are too messy to enjoy inside, like frozen treats. The goal is to keep your dog engaged with something that will keep him constructively occupied so he doesn’t resort to digging.        3. Make a Dig Pit Rather than trying to completely remove this hardwired survival behavior, try directing it to an acceptable spot in the yard instead. A dig pit can be as simple as a far-off spot that you teach your dog to enjoy by seeding it with surprises for him to uncover, or as elaborate as a sandbox-style box in which you bury treats and surprises. Make sure to swap out the buried goodies so there’s always something new for your dog to dig up! 4. Relocate Subterranean Prey If your dog is digging in pursuit of prey, encourage the vermin to move on from your yard by using natural repellents. This can include filling the animal’s tunnel with a mix of equal parts castor oil, dishwashing soap, and cayenne pepper; using yard-safe grub control; or placing vibrating wind spinners at various points throughout the animal’s tunnel. Don’t use chemicals that can be harmful for your dog or other animals in the space. 5. Provide Appropriate Outdoor Cooling Sure, you can give your dog a cooling station, a small swimming pool, shade, or fans, but if your dog is digging because he’s too hot, reconsider why he’s outside in the first place. Some dogs enjoy lounging in the sun, but the dogs who continuously dig up the lawn trying to find refuge should probably be in a climate-controlled environment. 6. Fortify Your Fence Line There are a variety of ways to keep your dog from digging beneath the fence, like creating a boulder wall or a cement foundation. Keeping your dog inside the yard and safe is critical, but pet parents should also consider why their dog is so determined to get free and run away. Is it because he’s left outside alone for too long? Is he an intact male on the hunt for females? Is something scaring him in the yard? Instead of addressing the behavior (digging to escape), consider the motivation behind the behavior. If your dog thinks the world beyond your fence is more interesting than being close to home, it might be an issue with your bond. What NOT To Do if Your Dog Is Digging Like with any canine behavioral challenge, don’t resort to punishment. Scolding, physical punishment like spraying your dog with a hose, or anything that’s supposed to “teach the dog a lesson” can backfire at best—and, at worst, damage your relationship. The safest approach is to identify the reason your dog is digging, then use a dog-friendly solution to address the issue. Featured Image: Adobe/sir_j"}]