[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Hump?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/dog-humping-toy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/dog-humping-toy.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-hump"}, "datePublished": "November 30, 2021", "dateModified": "August 16, 2022", "description": "Dr. Wailani Sung explains why dogs hump other dogs, people, their toys, the cat, or just the air, and how to get your dog to stop humping.", "articleBody": "Humping is a common term for what veterinarians call mounting behavior. This is when a dog puts their front legs around another dog, and then thrusts their pelvis repeatedly (the humping motion). The mounting behavior can be directed towards the hind end of another dog, or sometimes the other dog’s head or side, or even toward a person. Both male and female dogs, whether they are spayed or neutered or not, can perform mounting behavior. So why do dogs hump dogs, people, toys, or just the air, even after they are fixed? Reasons Why Dogs Hump Mounting behavior is a natural, instinctive behavior that occurs in puppies 3-6 week of age, most commonly during play. Both male and female puppies may mount each other. Mounting can also occur when adult dogs play with another dog or person. People commonly think mounting behavior is strictly sexually motivated. In unneutered male dogs, mounting behavior is in fact influenced by testosterone—it will occur in the presence of an unspayed female dog or a female dog in heat. But people assume the behavior will stop once their dog has been neutered. While neutering will reduce the mounting behavior by 50-60%, not all humping behavior is sexual in nature. While there may be a hormonal reason that causes a dog to mount, humping behavior is not always triggered by hormones. Humping can occur when dogs are excitable, such as during play or after greeting another dog. Some dogs may perform this behavior when they see their favorite dog friend or person. Sometimes dogs hump to get their pet parent’s or another person’s attention. It is difficult for most people to ignore a dog when they are mounting their leg. If the person is sitting on the ground, the dog may mount them from the side or their back. Mounting behavior can also be one way of conveying social status in dogs. Some dogs may mount other dogs to assert their status, but this behavior is usually accompanied by additional social signaling. Most social communication between dogs can occur without it escalating to one dog mounting the other. It is less likely to occur in a social context with the pet parent. In most cases of humping, there is another underlying cause. Why Is My Dog Trying to Hump All of the Sudden? This behavior may seem to come out of nowhere when a male dog reaches sexual maturity around 6-18 months of age, depending upon the breed of the dog. Some female dogs may mount people or objects when they are in heat. If the mounting behavior increases in frequency during this time period, it is most likely hormonally driven in intact animals. If your dog is already spayed or neutered, then there may a learned component to this behavior. Every time your dog humps, you may be inadvertently reinforcing their behavior. For example, your dog may mount you to tell you they want to play. You might push them away using your hands or legs. In your dog’s mind, this strategy worked to get your attention and you are now “wrestling” with them. Why Do Dogs Hump People? Humping behavior can be directed toward a person when a dog is excited. It is a sign of mental or emotional arousal. The behavior can be a physical outlet for the dog or a way of seeking attention. Some dogs may just mount the person, but other dogs may mount and escalate to biting when the person tries to push them off. Legs are the most mounted areas because they are easily within a dog’s reach. However, it is not uncommon for dogs to mount any body part within reach. Dogs may select a person to mount based on their relationship with the individual. It may be a sign that the dog prefers the person. Or it could actually be a sign that the dog may be anxious about that person. You would need to look at the dog’s relationship to the person to understand the underlying motivation. Children can be targets of dog humping due to their size and depending on the dog’s previous experience or relationship with a child. Why Do Dogs Hump the Air? Some dogs may be excited or emotionally aroused but have been previously punished for humping. In this case, a dog may not be sure whether they should make physical contact or not. These dogs would be most likely to hump the air next to another dog or a person. Why Is My Dog Humping My Cat? If your dog humps your cat, it may be a sign of excitement or part of play, if the two pets do usually play with each other. Some small dogs may mount a cat if there is social conflict between them. Should You Let Dogs Hump Things? Some dogs hump their favorites toys, blanket, or pillow. They may hump regardless of whether you’re around or not and in any environment. Some dogs may hump when they are anxious. This is referred to as displacement behavior. The dog is anxious and engages in a particular behavior as an outlet for their anxious energy, similar to an anxious person tapping their foot. If your dog engages in this behavior for a short period of time and is not causing any injuries, then there’s no harm in allowing your dog to hump. It may be a self-soothing behavior for your dog. However, if you think it’s an unsightly problem, you need to engage your dog in another behavior whenever they try to mount an object. This may mean keeping all pillows, toys, and blankets out of your dog’s reach. When Is Humping a Problem in Dogs? Humping can be a problem when your dog spends most of their time performing this behavior. If you have difficulty distracting and redirecting your dog from humping, it may be a sign of compulsive behavior. In male dogs, frequent episodes of mounting may cause dermatitis over their foreskins. It is a serious problem when a male dog humps objects frequently enough that he causes lesions to form on the tip of his penis. The lesions can be painful, and in some cases, they can cause scarring at the tip of the penis, therefore forming a urinary blockage. A dog with this condition needs immediate medical attention. Frequent expression of mounting behavior can also exacerbate a painful condition, such as if your dog already has degenerative disc disease or osteoarthritis in their hips or knees. How to Stop Dog Humping It may be very embarrassing to see your dog mount other dogs, people, or children. Many pet parents may pull their dogs away and scold them. This does not teach a dog to stop performing the behavior. Instead, it may increase a dog’s anxiety.  Pet parents may also be inclined to place their dog on leash, tether them, or if at home, place their dog in a crate or another room to calm down. While these options do stop the humping behavior, better options include distracting your dog and redirecting them to perform alternate behaviors. It is difficult for a dog to hump another dog if you focus your dog’s attention on chasing their favorite ball, for example. Or you could call your dog and engage them in calming behaviors, such as getting them to sit or lie down next to you. When your dog engages in more appropriate behaviors, give them plenty of treats, praise, and attention. You can also keep your dog focused for longer by offering food puzzle toys or a long-lasting chew. References 1. Beaver B V. Canine Behavior Insights and Answers 2nd Edition. 2nd ed. Saunders; 2009. 2. Hopkins S, Schubert T HB. Castration of adult male dogs: effects on roaming, aggression, urine marking, and mounting. J Am Vet Med Assoc. 1976. 3. Bergman L. Canine Mounting: An Overview. NAVC Clin Br. Published online 2012. Featured image: iStock.com/ivandan"}]