[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Roll on Dead Animals?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-471402005.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-471402005.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-roll-dead-animals"}, "datePublished": "December 13, 2022", "dateModified": "March 16, 2023", "description": "It’s hard to imagine why you would want to roll around in a dead animal, but dogs seem to love it. Find out why your dog is so into this unpleasant smell.", "articleBody": "Have you ever had your pup come running up to you after rolling around in the grass, only to find out that they smell like roadkill? Although it’s gross, many dogs enjoy rolling around on dead animals. There are several theories why dogs roll in disgusting things like poop or dead animals: To Mask Their Own Scent Probably the most popular theory is that dogs—like their wolf ancestors—roll around in a strong scent like a dead animal to mask their own scent. This helps them sneak up on their prey more easily. Whether or not your dog realizes why they are doing this is still a mystery. They could be acting out some of the ingrained instincts they’ve received from their ancestors with no intention of seeking out prey.  Showing Off to Other Dogs Another theory is that they want other dogs to smell the scent on them to show off that they have found prey. Or it may be a behavior to signal to their “pack” that there is delicious prey nearby, so they can all go seek it out together. Dogs’ wolf ancestors hunted for food together.  Leaving Their Own Scent Dogs don’t just leave their own scent through their urine or feces. They also do it by rubbing against or on things—like a dead animal. Once they’ve left their scent on something, it signals to other dogs this is their property or territory. They are claiming this animal carcass so other dogs aren’t tempted to take it.  They Love the Smell Sometimes dogs are attracted to scents that people find gross. Scent is their strongest sense, and the more intense the smell of something, the more they like it! Your dog may just be rolling around on a dead animal, garbage, or poop because they are excited about this very strong smell.  How to Keep Your Dog from Rolling on Dead AnimalsThere are a few steps you can take to help prevent your dog from rolling on dead animals.  Leash train your dog. You may have to keep your dog on-leash or on a shorter leash so they don’t have the chance to find dead animals, poop, or garbage to roll in.  Fence in your yard. If your yard is fenced in, your dog can roam freely without you having to worry about them finding roadkill to roll on. Just be sure to check out your yard first for any smelly dangers, poisonous plants, or animals. And always be sure to clean up poop right away, so your dog isn’t tempted to roll in it.  Work on recall. The better your dog is with recall—coming back when you call them—the easier it will be for you to stop them from rolling in a dead animal or other unsavory things. Use positive reinforcement training (PRT) when teaching your dog new tricks, cues, and appropriate behaviors.  How to Get the Dead Animal Smell Out of Your Dog’s Fur The most important thing to do is bathe your dog right away! You can even try to hose them off outside first. If you have Dawn dish soap, use this as a shampoo. If your pet seems to roll in gross stuff often, it may be helpful to stock up on dog-safe shampoo like Burt’s Bees Oatmeal Shampoo, Buddy Wash Original Lavender &amp; Mint Dog Shampoo &amp; Conditioner, and Zesty Paws Itch Soother Dog Shampoo. It may take a few washes to fully remove the scent from your dog. However, bathing your dog too frequently can be harmful to their skin and coat. They need time to build up their natural oils.  You can also use baking soda on your dog in between baths as a dry shampoo to help remove that gross smell little by little. Let the baking soda sit on your dog’s fur for five minutes, then brush out their fur. If there is any remaining baking soda, let them shake it out or use a dry towel to wipe it off.  Featured image: iStock.com/NicolasMcComber"}]