[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Power of Praise: Encouraging Good Behavior in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-praise-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-praise-dog.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Behavior, Training, Mental health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/power-praise-encouraging-good-behavior-dogs"}, "datePublished": "January 22, 2018", "dateModified": "August 16, 2022", "description": "We’re quick to correct our dogs when they make mistakes, which means that we often miss out on acknowledging the many correct choices they make. By praising your dog for good behaviors, you’ll find that he is more likely to repeat them, and your relationship will start to transform.", "articleBody": "By Victoria Schade You can probably think of five things you wish your dog would stop doing, like tipping the garbage can, or grabbing your kid’s pajama pants every morning. Or maybe you can think of five things you wish your dog would do better, like coming when called or walking on the leash. You might find yourself telling your dog “stop it” or “no” frequently, and there’s a good chance that you get frustrated by your dog’s behavior. But do you ever stop to give your dog credit for the millions of things he gets right every day? Think about it. Dogs come into our lives not knowing our language or customs. They have to adapt to our way of life, and curb many of the behaviors that come naturally to them, like using their teeth and voices. We hold our dogs to a high standard of behavior whether we help them through this cultural transition with training, or leave them to figure it out on their own. Of course, dogs are excellent observers, and for the most part, they manage to seamlessly integrate into our lives whether we guide them or not. Sadly, we’re quick to correct our dogs when they make mistakes, which means that we often miss out on acknowledging the many correct choices they make as they navigate our world. This leaves a praise vacuum. Dogs get attention from us when they do the wrong thing, but their daily awesomeness goes unrecognized. But by making a tiny shift in your behavior—recognizing those many fleeting moments of good—you’ll find that your dog is more likely to repeat them, and your relationship will start to transform. Recognizing Your Dog for Good Behavior It’s true for every being, from humans to animals, that the behavior that is rewarded will be repeated. Food rewards are a nearly universal reinforcer in the dog world, so they’re a great way to get and keep behaviors. That said, you don’t have to become a bottomless treat dispenser in order to get your dog to repeat the everyday behaviors that you appreciate. Simply acknowledging your dog with verbal praise for good decisions is a powerful way to encourage your dog to keep up the good work. Tapping into your everyday praise skills requires that you become a student of your dog’s behavior, as some of the best stuff to praise can be fleeting. Once you realign your perspective and start watching for praise-worthy behavior, you’ll start to see it constantly. (Our dogs really are so much better than we give them credit for.) For example, one of the most basic requirements of “good dog” status is going to the bathroom outside, so why not praise your dog for getting it right every single day? Telling your dog “way to go” when he does his business is a simple way to let him know you appreciate his housetraining skills. Now, consider the rest of your day with your dog—can you think of other little ways that he gets it right? Perhaps he sits while you prep his food, or when you clip on the leash, or before you toss a ball for him. Those are all praiseworthy behaviors. Recognizing your dog for good behavior is just one part of the praise continuum. Acknowledging your dog for making the right decision is an even more powerful way to put praise to work. Remember, your dog has personal agency, and his days are filled with thousands of spilt-second computations about what to do next. For example, when your neighbor drags their noisy garbage can down their driveway, your dog has to determine whether he should bark. Or, if your rescued cat decides to make a surprise appearance in the family room, your dog has to decide whether to chase it. Ignoring the garbage-dragger and forgoing cat-chasing are decisions that you certainly want your dog to repeat, so praise heartily when your dog opts to do the right thing. Yes, praising the absence of a “bad” behavior, like barking, chasing, jumping, or bullying, can be just as important as praising your dog for performing a good behavior, like sitting, settling down, or staying. The simple act of using your voice to reinforce your dog’s smart choice will help to ensure that he does it again the next time he encounters the same situation. How you praise is important. You don’t have to act over-the-top when you praise your dog, especially since you’re going to end up praising your dog frequently throughout the day. A simple “nice work” or “good decision!” and a pat and smile will help your dog understand that you appreciate what he’s done. Of course, if your dog does something amazing, like coming back to you instead of chasing after a rabbit in your yard, amp up the praise so he knows he’s done something outstanding. Increasing the amount of positive acknowledgement you give your dog on a daily basis will transform your relationship. Frequent feedback helps your dog get life right more often, and will encourage him to continue to try to do the right thing. Treats will always be a powerful primary reinforcer for most dogs, but the power of positive feedback from a beloved human is a close second."}]