[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Do Talking Dog Buttons Work?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-155351545.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-155351545.jpg"}, "author": {"@type": "Person", "name": "Manette M. Kohler, DVM", "url": "https://www.petmd.com/author/dr-manette-m-kohler"}, "keywords": "Dog, General Care, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-do-talking-dog-buttons-work"}, "datePublished": "January 10, 2023", "dateModified": "February 6, 2023", "description": "Ever seen a dog pushing buttons to talk? How do they learn how to do that? Find out the science behind dog talk buttons and how to train your pup to “speak.”", "articleBody": "The following content may contain Chewy links. PetMD is operated by Chewy.  Dogs have a lot to say, and they communicate through body language, facial expressions, and vocal signals like whines, growls, grunts, and barks. But wouldn’t it be convenient to add the English language to the list of ways dogs can express what they want and how they feel? This is where talking dog buttons come in. You may have seen the dog Bunny and her talking buttons on TikTok or Instagram and wondered if your dog could learn to talk using buttons. Here’s everything you wanted to know about this new way of canine communication—because who wouldn’t want to have a conversation with their dog? What Are Dog Talk Buttons? The buttons are based on alternative and augmentative communication (AAC) devices that give non-verbal people a way to communicate. The sound boards for dogs have circular buttons with words on them, each pre-recorded to say the word when pressed. Let’s say your dog wants to go outside. The idea would be that your dog could press the “Outside” button with their nose or paw to go out in the yard or the “Walk” button to ask to go for a walk. Of course, it takes training for a dog to learn to use the buttons and what each button means. The Science Behind Talking Dog Buttons Anyone who lives with a dog knows they can easily learn what certain words and gestures mean, such as “sit” or “come” or “want to go for a walk?” Dogs have an amazing ability to understand words—in fact, psychologist John W. Pilley taught his Border Collie, Chaser, the names of over 1,000 toys. Chaser could also understand sentences containing a prepositional object, verb, and direct object. And now, we have talking dog buttons. Bunny uses the FluentPet system for her button board. It uses hexagon-shaped tiles to arrange the buttons according to the Fitzgerald Key, which organizes the buttons by word category. The idea is to make it easier for the learner to remember which button is where. Image Credit: FluentPet  Categories often include:  Subjects (human names, dog names) Objects (toy, ball, food) Places (bed, couch, walk, outside) Actions (potty, play, come) Descriptors (good, later, all done) Social (love you, hi, want) Just how detailed and accurate talking dog buttons are is still to be determined. There is an ongoing study by Leo Trottier, founder of FluentPet, and Dr. Federico Rossano, a University of California professor and director of the Comparative Cognition Lab at UC San Diego. The aim of the research, according to their site, TheyCanTalk.org, is to use a rigorous scientific approach to determine how much non-human animals can express themselves “in language-like ways.” This is an open study, which means that dog parents and their pups from all areas of the world can participate in the study. As of 2022, the study has over 3,000 active participants and counting. Some cats are also starting to use buttons as a way of communicating with their pet parents. Like, Billi the cat, who has been dubbed &quot;the most talkative feline&quot; on Instagram.  Should You Use Dog Communicator Buttons? The buttons are potentially another way for pet parents to have a richer communication with our dogs. Think about it—understanding if your dog needs to go out to use the bathroom is helpful. Many dogs stand silently by the door waiting for someone to notice, but this signal can be easily missed. An auditory signal, such as a dog pushing a button that says “Outside,” would certainly be helpful. This is the button Alexis Devine, an artist based in Tacoma, Washington, started using to teach her Sheepadoodle, Bunny. “Within a few weeks of coming home, Bunny was using the “Outside” button consistently to let me know when she wanted to go out,” she says. “And from that point, it was game on!” Devine was inspired to teach Bunny to talk by watching Stella, a big-eared mixed-breed dog owned by Christina Hunger, a speech language pathologist. Hunger taught Stella to communicate her wants and needs by pressing buttons on a board. Like Bunny, Hunger and Stella have amassed a large following on social media, and Hunger documented their journey in a book, How Stella Learned to Talk: The Groundbreaking Story of the World’s First Talking Dog. Devine says the keys to success are patience, repetition, and the ability to really listen to what your animal companion is saying, including all the things they’re already saying without words. All of this gives us information about what they might want to say with words. Can Any Dog Learn to Use Talking Buttons? Devine explains that any dog can learn to use the buttons in some capacity. “Using basic operant conditioning to teach a button like ‘Outside’ is very easy,” says Devine. It’s just like training a dog to ring a bell to go outside. Another easy and useful button to teach would be “Play,” which is also easy to model. “One would press the ‘Play’ button, then begin playing with the dog and repeat the process until the dog is understanding that the two are linked,” explains Devine. Bunny’s favorite buttons have changed over time as she’s matured, explains Devine. “Outside,” “Play,” and “Poop” were her early favorites, but now she says, “Love you” a lot more. Bunny also combines multiple buttons to convey even more information to Devine. How to Train Your Dog to Use Talking Dog Buttons According to Hunger, the key to teaching your pup this skill is talking to your dog a lot. Hunger explains that just like kids, dogs learn words by hearing words. It is also important to observe which words you tend to use. If you think you want to teach your dog the word, “Eat” for mealtime, but you say the word, “Food” more often, then you should use a “Food” button to represent mealtime. Your dog will learn to use the buttons by watching you use them. This is called modeling, and you’ll teach your dog when to use the button by pushing it at the appropriate time. For example, you would say “Food,” push the “Food” button at mealtime, and then give your dog their food. Or you would press the “Outside” button and then take your dog outside. Using modeling (a human presses the “Outside” button) along with repetition and a functional reward (getting to go outside) teaches a dog how to use the button. Tips for Using Dog Talk Buttons Not modeling enough is the biggest mistake you can make when trying to teach your dog how to use talking buttons, says Devine. She explains that, if you want the dog to press the button, they need to see you pressing the button. Here are more tips for using talking dog buttons: Go slow: Every dog is different, and it may take many weeks for a dog to even seem interested in the buttons. Keep them together: A centralized location for the button board is recommended, preferably where your dog tends to hang out. Pay attention: Don’t ignore your dog’s other means of communication, such as body language and vocal cues. You’re not changing how your dog communicates—you’re just adding another option, should your dog be interested. Don’t force it: Never force your pet to push the buttons by picking up their paw and putting it on the button. Have fun with the process: Your dog may enjoy it, or it may not be their cup of tea. And that’s OK! Even without a button board, you have a rich communication system with your dog. Exploring the world of buttons, at the very least, will provide mental enrichment for your pup, and the increased methods of communication can help strengthen your human-animal bond. Products to try: Hunger for Words Talking Pet Button Mat Mighty Paw Smart Bell"}]