[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Prevent Your Dog from Begging", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-begging.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-begging.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-prevent-your-dog-begging"}, "datePublished": "January 22, 2018", "dateModified": "August 16, 2022", "description": "A dog&#039;s begging habit can become a nuisance, but it isn’t set in stone. You can convince your dog to stand down at meal times, or better yet, prevent the behavior from even starting. The following tips will help you bring peace back to mealtimes.", "articleBody": "By Victoria Schade It starts with a whimper and sad puppy dog eyes. You’ve got a few leftover carrots on your plate, and your dog looks so pathetic and adorable that you can’t help but share one with him. Or maybe you’re getting to the bottom of a bag of pretzels and you see nothing wrong with tossing your pup a crumb or two. While giving your dog occasional “people food” is fine from a canine nutrition standpoint, the behavioral component that might accompany sharing your food with your dog can become a nuisance. Once a dog understands that what’s on your plate can be his with enough requests, you might find yourself in a constant mealtime beg-fest. A dog who begs for food—or worse, demands it—isn’t fun to be around. But a begging habit isn’t set in stone. You can convince your dog to stand down at meal times, or better yet, prevent the behavior from even starting. The following tips will help you bring peace back to mealtimes. Preventing Begging in Dogs If you’ve got a puppy or new rescue dog, you can prevent a begging habit from starting by following one simple rule: don’t feed your dog from your “eating area.” That means if you have dinner on a tray in front of the TV or seated at a dining room table, you should never give your dog your food in that dining scenario. Context is important when it comes to begging behavior. If your dog understands that food on your plate eventually means food for him, particularly if he gives you whiny encouragement, he will view that context as mealtime for two. Keep in mind that a begging habit can also develop when you share snacks on the go, like when you’re standing at the counter eating a few chips. If your dog demands some and you give in, you’ve taught your dog that begging works any time you’re consuming food. You can also prevent the behavior by keeping your dog occupied while you eat. Setting your dog up on a nearby bed with a treat-stuffed busy toy will give him something to focus on other than the delicious smells wafting from your plate. Keep in mind that you’ll have to pack the toy so that it maintains your dog’s attention for the duration of your meal. A single treat will disappear in minutes, but a toy jam-packed with goodness (including some of your dog’s meal ration) will hold his attention until you’ve finished. Freezing goodies in the toy with some peanut butter cement will help slow the process as well. Breaking Your Dog’s Begging Habit You’ve got a tougher job if your dog already has a well-established begging habit. The first rule for getting rid of it is completely ignoring your dog’s attempts to sweet talk his way to a goody. This might seem simple, but the reality is your dog will likely go through what’s called an “extinction burst” as he tries to get his formerly successful begging techniques to work. This means that your dog will whine louder, paw harder, and pace faster, since those tricks used to work to score some grub. Keep the faith and trust that if you never give in as your dog escalates his requests, he’ll eventually abandon the begging. (However, if you do give in to his new and improved begging strategy, you’ve taught your dog to never stop trying because you’ll eventually cave if he pushes hard enough!) Much like with the prevention step, keeping your dog busy while you eat will shift the focus from what’s out of reach on your plate to what’s right in front of his nose. Use a treat-stuffable hard plastic toy to give your dog a job that will keep him happily occupied. Consider using a food toy that requires movement to dislodge the goodies, like a ball with holes that he has to push around the room. This will keep him away from your food zone while you eat. If your dog opts to get right up in your business while you dine, like placing his nose in your lap, you can either put your training to work and try a long “stay” a few feet away from the table, or if your “stay” needs some help, use a quick and easy management technique like a tether to keep him away. A tether is a 4- to 5-foot leash that you anchor to a heavy piece of furniture, which is like a “stay” with reinforcements. But don’t forget that you still have to give your dog a job while you eat, as few beggars will watch you eat “their” food without barky and whiny commentary. As always, a treat-stuffed toy will help ease the transition from beggar to worker. Sharing Food with Your Dog If you can’t resist sharing food with your pup, there is a way to make it happen without encouraging an obnoxious begging habit. You can teach your dog to go to a specific spot and wait quietly until you’re ready to offer him a taste. This lesson encourages impulse control, and shows you dog that he doesn’t have to be right on top of you acting pushy in order to get a bite. Teach your dog to go to his bed or a nearby rug and chill out until you’re ready to give him a bit of apple or that last nibble of carrot. That way you’re both happy; your dog gets his goody, and you get a polite dining companion."}]