[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Sit on Your Feet?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/puppy-sitting-on-owners-feet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/puppy-sitting-on-owners-feet.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-sit-your-feet"}, "datePublished": "February 5, 2020", "dateModified": "August 16, 2022", "description": "Wondering why your dog is always underfoot? Find out from a veterinary behaviorist why your dog likes to sit on your feet.", "articleBody": "You may have heard the myth that when a dog sits or lies on top of your feet that he is trying to dominate you. But nothing could be further from the truth. Many dogs form a strong bond with their owners. Wherever the owner goes, the dog follows. Whenever the owner sits down, their dog lies down or sits on or by their feet. This is an indication of the strong relationship you have with your dog. But there can also be other reasons why your dog sits on your feet, and they happen under certain circumstances. Here’s what you need to know about why your dog likes to sit on your feet. Reasons Your Dog Likes to Sit On Your Feet Here’s a breakdown of the most common reasons for this dog behavior. Showing Their Love  It’s a normal behavior for a dog to settle down at their owner’s feet. This may be a way of showing affection, just as you would choose to sit next to a friend or loved one. Some dogs are content to stay on the floor instead of sitting next to you on the couch, so they end up right by your feet or on top of them. Your dog may prefer the texture and feel of carpet, tile, or wood, or maybe sitting next to a person makes them too warm. Some dogs may want to be at their owner’s feet so they can be prepared to stand and follow them at the slightest movement. Other dogs may specifically choose to sit or lie down on their owner’s feet. It may be that these dogs find the physical contact comforting—just simply touching their owner may be relaxing for a dog. Anxiety In certain situations, your dog may choose to sit or lie down on your feet because they are fearful or anxious. If your dog normally does not sit on your feet and suddenly exhibits this behavior, take a minute to assess their body signals: Are they exhibiting signs of fear and stress, such as excessive panting or drooling? Is their tail hanging down or tucked underneath them? Are their ears pulled back? Is their head lowered? When some dogs get anxious for fearful, they will try to get as close to their owner as possible. This may occur during a veterinary visit or when they go to an unfamiliar place. Some dogs may exhibit this behavior at home when they hear certain noises, such as fireworks, thunder, or construction noises. Or they might exhibit this behavior around people, children, or dogs that make them uncomfortable. When your dog is scared or uncertain, simply maintaining contact with you may help them feel more confident. It may be similar to a child wanting to hold their parent’s hand when they are scared. A portion of the dog population suffers from separation anxiety, and these dogs may also sit or lie down on their owners’ feet. Not all dogs with separation anxiety exhibit this behavior. The dogs that do, most likely find comfort in being close to their owners. Sitting on your feet may be a way of keeping you next to you. Learned Behavior Dogs can certainly learn that if they sit on or lie at your feet, they are more likely to get your attention. It’s a normal reaction to look at or talk to your dog when they choose to sit on top of your feet. Or your dog may have learned that you give them physical attention in the form of pets or ear rubs as they sit at your feet. This positive reinforcement makes it more likely that your dog will continue to sit by your feet. What If My Dog Doesn’t Sit on My Feet? Every dog is an individual and expresses attachment and affection towards their owners in different ways. Maybe your dog is not the huggy, touchy, feely kind of dog, but he enjoys sitting or lying next to you. Your dog may simply enjoy your company without the need for so much physical contact, and that is okay. Instead, your dog may show you affection in other ways, such as coming to greet you when you come home or bringing you his favorite toy, or following you from room to room. Think of it as your dog having certain love languages. You may be thankful that your large dog does not want to sit on your feet. Trust me, I know from personal experience.  Whether your dog is a sit-at-your-feet type or a follow-you-around type, enjoy your pup’s unique personality. By: Wailani Sung, DVM, DACVB Featured Image: iStock.com/Capuski"}]