[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Lick You?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-09/small-stray-dog-licks-a-human-hand-picture-id944785712.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-09/small-stray-dog-licks-a-human-hand-picture-id944785712.jpg"}, "author": {"@type": "Person", "name": "Kasey Stopp, DVM, CVA", "url": "https://www.petmd.com/author/dr-kasey-stopp"}, "keywords": "Dog, Behavior, Adult, Puppy, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-lick-you"}, "datePublished": "September 29, 2021", "dateModified": "October 9, 2023", "description": "Why do dogs lick people? There are many reasons why dogs lick your face, hands, lets, feet, and ears. Here&#039;s what to know about licking in dogs.", "articleBody": "You may love your dog, but not all of us like slobbery kisses from our furry canine friends. Many pet parents believe their dogs lick them to show affection, and while this may be true some of the time, there are also many other functions for licking. So, why do dogs lick us? And are there different reasons for why dogs lick your hands, face, ears, feet, or legs? Why Do Dogs Lick People? Licking is a natural instinct in dogs. Studies have shown that licking releases endorphins in a dog’s brain. Endorphins are neurotransmitters that make dogs (and us!) feel calmer and more relaxed. This then leads to a release of dopamine, another neurotransmitter associated with pleasure and motivation. There are many things that dogs lick—some more repulsive than others. So, what does it mean when a dog licks you? There isn’t one straight answer. Dogs lick people for a variety of reasons, including affection, communication, grooming, exploration, attention, and taste. Dogs Learn to Lick as Puppies Mother dogs lick their pups to clean and stimulate them as soon as they are born. For the first few weeks of their lives, puppies are prompted to urinate and defecate by mom’s licking. So, dogs learn very early that tongues are useful tools in communicating and interacting with the world around them. Puppies lick to appease older dogs, including their mom, and clear the way for safe social interactions. Pups will lick one another to show affection, and to comfort themselves and sometimes their littermates. Dogs Lick People to Enhance Smell Licking also enhances your dog’s sense of smell. Like humans, dogs can taste bitter, salty, sweet, and sour. But due to their small number of taste buds, they actually use their sense of smell far more than their sense of taste when deciding what to lick or eat. This is likely why dogs enjoy licking areas of our bodies that tend to have strong tastes and smells: our hands, faces, ears, and feet. To understand why dogs really enjoy licking certain areas of our bodies, let’s take a quick look at the anatomy of human sweat. We have two types of sweat glands: eccrine and apocrine. Eccrine glands secrete a thin, odorless, clear fluid made of salt, protein, etc., and are found in large numbers on the soles of the feet, the palms, the forehead, the cheeks, and in the armpits. Apocrine glands secrete a thicker fluid that reacts with the bacteria on your skin to create body odor and are found in the armpits and groin, but also in the ear canals, eyelids, and nostrils. With all of this fun physiology, how could dogs resist licking parts of us that contain so much scent and taste? Why Do Dogs Lick Your Hands? As you move through the world, your hands collect smells and flavors that your dog wants to investigate once you come home. You might touch other people or animals, and you very likely touch food. Your hands are like a roadmap for your pup that tells the story of your day, and they want to taste and smell every “destination” your hands visited. The palms of your hands also sweat, leaving a salty residue on your skin for your dog to enjoy. Why Do Dogs Lick Your Face? Along with your hands, your face gets constant exposure to the world, so it picks up a lot of interesting smells and tastes. Also, you’re likely to touch your face regularly, giving your dog even more reasons to lick your face! Your face contains both types of sweat glands. Eccrine glands on your cheeks and forehead leave a salty flavor many dogs are certain to enjoy. But your eyelids and nostrils contain apocrine glands, which give those areas a mild but distinct odor easily identified by your dog’s super-powered nose. Thanks to the food you eat, your lips and mouth contain all sorts of attractive smells and tastes for your dog. This may explain why some pups really want to plant a slobbery kiss right on your lips after you eat. Aside from all the scents and flavors your face offers, licking your face is likely an instinctual behavior for your dog. Dogs lick each other&#039;s faces for mutual grooming, affection, and to communicate appeasement or harmlessness. Pet parents who love when their dogs lick them may also reinforce the behavior with their excited responses. Why Does My Dog Lick My Ears? Your dog may be licking your ears to taste them, keep them clean, or possibly to show you some extra love. The apocrine glands in your ear canals secrete a thick fluid that creates an odor when it mixes with the natural bacteria on your skin. Combined with the ceruminous glands, which create earwax, your ears offer a collection of enticing smells and tastes. Dogs lick each other’s ears to groom one another. And because it’s a very vulnerable interaction, dogs that allow this likely feel very safe with the other dog. Why Does My Dog Lick My Feet? All of those eccrine glands on the soles of your feet create a lot of sweat, and that sweat creates a lot of salt. Your feet and toes offer a salty treat for your pup—and if you’re ticklish, it also makes for a fun game between you and your dog. If you smile or laugh as your dog licks your feet, you could be providing positive reinforcement for the behavior. They quickly learn that licking your feet gets them attention from you. This may not only extend the licking session, but make it more likely to happen when your sockless feet emerge in the future. Why Does My Dog Lick My Legs? If you’re fresh from the shower, your dog may want to lick the water droplets from your skin. This doesn’t mean your dog is thirsty—rather, they’re interested in all the smells and tastes you’re bringing out of the shower with you. Shampoo, body wash, and shaving creams all leave an interesting scent and taste on your skin. Nicking yourself with a razor may also attract some attention, since dogs also lick to keep wounds clean. If the leg-licking has nothing to do with shower time, it could be a lotion you applied, salt on your skin after exercise, or something completely random you weren’t even aware you came into contact with. When Is Licking a Problem? Dogs lick for many reasons. They may lick out of boredom, in which case increasing enrichment could reduce the behavior. Activities like lick mats can provide an outlet for bored dogs who like to use their tongues.   But there are times licking indicates a problem behaviorally and/or medically. Behaviorally, licking that occurs frequently in response to an event but is difficult to interrupt can be a sign of anxiety. Licking a person excessively can mean that the dog is not comfortable with that person and is either trying to sooth themselves, gather more intel, or move the person away. Licking can be a canine calming signal or a displacement behavior. When a dog feels stressed, anxious, or conflicted about what to do, they may use a behavior to buy sometime and communicate that they are not ready to engage. Licking, because of the physiological effect on endorphins and dopamine, can be used to sooth themselves in anxiety-provoking social situations. It is also a common behavior involved in compulsive disorders. Medically, chronic licking—not just grooming—of a specific area of their bodies can be evidence of allergies, infections, or pain. If they are licking everything, like couches, rugs, or floors, there may be GI issues with your companion. If you recognize any problematic forms of licking, seek help from a professional. Reach out to your vet to determine whether there is a medical issue first. Then, a certified behavior consultant can lend their expertise to take a look at the behavior. Complex cases would benefit from contacting a veterinary behaviorist as soon as possible. Featured image: iStock.com/Art_rich"}]