[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Do You Need to Hire a Dog Behaviorist?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/nervous-dog-in-dog-bed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/nervous-dog-in-dog-bed.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/do-you-need-hire-dog-behaviorist"}, "datePublished": "May 13, 2019", "dateModified": "August 16, 2022", "description": "How do you know if your dog’s behavior needs professional intervention? And who do you call? Find out when you might need to call in a dog behaviorist and what credentials you should look for.", "articleBody": "Reviewed for accuracy on May 13, 2019 by Dr. Wailani Sung, MS, PhD, DVM, DACVB Unwanted dog behaviors can range from those that are merely nuisances to behaviors that are downright destructive and harmful. Maybe you have a pup who loves to jump on your guests and greet them with big, sloppy kisses that they might not appreciate. Or maybe he spends his days barking. Do you call a dog behavior specialist or attempt to correct the issues by yourself? In some cases, you may be able to redirect a dog behavior at home, but experts recommend working with a board-certified veterinary behaviorist or certified applied animal behaviorist for more serious issues. If you do opt to work with a pro, how do you know who to call? The term &quot;dog behaviorist&quot; is used broadly, but experts vary in skills and credentials. Finding the right person for your particular situation is essential to your pup’s well-being. If you’re not sure if your pup needs professional help, err on the side of safety by asking your veterinarian. Is a Dog Behaviorist the Same as a Dog Trainer? The term &quot;dog behaviorist&quot; is often used loosely to encompass a range of professionals, including dog trainers, certified applied animal behaviorists (CAAB) and veterinary behaviorists. But there are differences in the credentials for each. Dog Trainers A dog trainer can help teach your pup basic cues like sit, stay or down. Many trainers do address problems that go well beyond basic obedience behaviors, including “dangerous” ones like resource guarding and leash aggression. Dr. Terri Bright, PhD, BCBA-D, CAAB, director of behavior services at MSPCA-Angell in Boston, says that her “favorite trainers know when to refer [clients to a certified behaviorist], and we cross-refer frequently.” The dog training profession is unregulated, so skills, education and expertise range widely in the field, says Dr. Kelly Ballantyne, a board-certified veterinary behaviorist and owner of Insight Animal Behavior Services in Chicago. Certified Applied Animal Behaviorists A CAAB holds a doctoral degree in a behavioral or biological science, says Dr. Ballantyne. “These individuals have to meet standards of education, experience and ethics set forth by the Animal Behavior Society (ABS).” Applicants must have one of the following: A doctoral degree from an accredited college or university in a biological or behavioral science with an emphasis on animal behavior, including five years of professional experience OR A doctorate from an accredited college or university in veterinary medicine plus two years in a university-approved residency in animal behavior and three additional years of professional experience in applied animal behavior In addition, the ABS site states, “The successful applicant must also demonstrate a thorough knowledge of the literature, scientific principles and principles of animal behavior; demonstrate original contributions or original interpretations of animal behavior information; and show evidence of significant experience working interactively with a particular species as a researcher, research assistant or intern with a Certified Applied Animal Behaviorist prior to working independently with the species in a clinical animal behavior setting.” Veterinary Behaviorists A veterinary behaviorist is someone who has first earned a veterinary degree (either a DVM or VMD). These are the only category of pet behavior professionals who can prescribe pet prescription medication. “By the time a veterinarian becomes a board-certified veterinary behaviorist, he or she has treated hundreds of complicated behavioral cases during the residency training program. A veterinary behaviorist has also published a peer-reviewed research project in this field, authored at least three case reports and passed a two-day board certification examination,” explains Dr. Ballantyne. Dr. Ballantyne says that by the time a veterinary behaviorist receives their board certification (as a diplomate of the American College of Veterinary Behaviorists, or DACVB), they have typically spent 4-12 years after receiving their veterinary degree studying the medical and behavioral issues that can affect many species of animals. Should You Work With a Trainer, Dog Behaviorist or Veterinary Behaviorist? Who you call depends largely on the dog’s behavior. A dog trainer handles problems that may be aggravating but not dangerous, says Dr. Bright. That could include things like dogs jumping up on people, pulling on the leash or barking until you serve them food. However, behavioral problems in dogs that can be attributed to anxiety, fear and aggression, may require the services of a behavior professional, experts say. “Any type of aggression, including, but not limited to, resource-guarding, growling, biting in the home and at other dogs or any people, especially children, should be referred to a behaviorist,” says Dr. Bright.  “When I am looking for serious help for a scary animal, I look at the CAAB list and the DACVB list; if there is no one close by, I might call the nearest one and ask who they recommend. Sometimes they know people with good specialties who can help,” says Dr. Bright. Certain issues, like separation anxiety, severe phobias or OCD, are challenging to address without a two-pronged approach. This approach would be a behavioral treatment plan that includes medication, which requires the assistance of a DACVB. Issues that require professional help, Dr. Bright says, include “separation anxiety, dogs that cannot be handled without biting, and dogs that are ‘reactive,’ meaning they lunge and bark at things in the environment—from cars and skateboards to other dogs and people.” When in doubt about the type or professional you should work with, speak to your veterinarian for a recommendation. How to Find a Qualified Dog Behaviorist or Trainer Regardless of the type of dog training or behavior professional you’re looking for, be aware for warning signs that you may not be working with someone who is qualified. “Watch for pseudoscience in website language if you are looking at websites. Anyone who refers to making you a ‘pack leader’ or ‘Alpha’ should be avoided. Also, avoid dropping your problem dog off somewhere for &#039;board and train&#039; unless you know for a fact they use only rewards-based methods,” says Dr. Bright. Directories maintained by reputable organizations and certifying agencies are some of the best places to find qualified professionals. Dog Trainers With Experience in Behavior Cases To find qualified dog trainers, Dr. Bright and other experts recommend looking for certifications from organizations such as Certification Council for Professional Dog Trainers (CCPDT) or International Association of Animal Behavior Consultants (IAABC). CCPDT offers accreditation in dog behavior counseling and training, says Dr. Ballantyne. “It requires students to complete a minimum number of training hours, pass an examination, carry liability insurance and participate in annual continuing education for recertification.” The IAABC was founded as a way to standardize and support the practice of animal behavior consulting. It offers two levels of certification and also requires all members to complete continuing-education training, explains Dr. Ballantyne. Veterinary Behaviorists and CAAB The American College of Veterinary Behaviorists maintains a directory of board-certified veterinary behaviorists. There are currently only 86 board-certified veterinary behaviorists (DACVB) throughout the world. The ABS website has a directory of certified animal applied behaviorists that you can search as well. By: Paula Fitzsimmons Featured Image: iStock.com/Sonja Rachbauer"}]