[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Shred Paper Products?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-shred-paper.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-shred-paper.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-shred-paper-products"}, "datePublished": "February 19, 2018", "dateModified": "August 16, 2022", "description": "Dogs have a way of getting into things they shouldn’t, and one thing many pups seem to love playing with is paper. But why is shredding paper so irresistible to dogs?", "articleBody": "By Lindsay Lowe Dogs have a way of getting into things they shouldn’t, and one thing many pups seem to love playing with is paper. Used tissues, napkins, paper towels, toilet paper—countless pet parents have come home to find these products shredded all over the floor.   But why is shredding paper so irresistible to dogs? It often comes down to odor, says Scott Sheaffer, a certified animal behavior consultant and owner of USA Dog Behavior in Dallas, Texas. “If you’ve used it to wipe your mouth or even wipe your nose or your hands, there’s a scent on it that’s appealing to them,” he says. Boredom or anxiety could also drive dogs to rip up paper products, if they don’t have enough other enrichment available. Or, if dogs are actually ingesting the paper, it could be a sign of pica, a medical condition that drives animals to eat non-food items (humans can also suffer from pica). “It can become a compulsion, where they obsessively and compulsively eat paper products,” Sheaffer says. “That’s much more of a behavioral issue than…appetite driven.” More often, though, dogs shred tissues and towels simply because it’s fun, says Erin Jones, a certified dog behaviorist and owner of Merit Professional Dog Training in Halifax, Nova Scotia. “The number one reason is probably just because they enjoy the sensation of ripping stuff up,” she says. Puppies and adult dogs are equally likely to enjoy playing with paper, Jones says, and it’s a common behavior regardless of breed.   Are Paper Products Dangerous for Dogs? Many dogs don’t eat the paper they play with—the joy is in the ripping up—but if pups do ingest napkins or tissues, there could be serious health consequences.  “Small amounts of paper will just pass through a dog’s digestive tract,” says Dr. Jennifer Coates, veterinarian and author of the Dictionary of Veterinary Terms, Vet-Speak Deciphered for the Non-Veterinarian. “But if a large amount is eaten or some of it gets stuck somewhere along the digestive tract, it can cause a blockage that requires surgery to correct.” Also, eating a paper towel that’s coated with a cleaning product or other potentially toxic substance could be dangerous, Jones says. “It is always best to err on the side of caution, in my opinion, and avoid using harsh or toxic chemicals and discard any used paper products immediately,” she recommends. “Particularly if there is a history of ripping up paper products and there is any chance they might have access to it.” Coates agrees, “Toss any paper products that are contaminated with potentially dangerous chemicals directly into a covered trash can in a location where your pets can’t gain access.”   Discouraging the Behavior The best way to prevent dogs from ripping up paper is to keep it out of reach in the first place. “Don’t leave these items around,” Jones says. “If we can manage their environment and prevent this unwanted behavior from happening in the first place, then that’s really the key to any training protocol.” Dogs often pull paper products out of the garbage, so using trash cans with secure, automatically closing lids can nip the problem in the bud. Not all paper products can go in the trash can, though (how many YouTube videos have we seen of dogs gleefully unspooling toilet paper from the roll?), so a more foolproof solution is to train dogs not to go near paper products in the first place. Jones often uses impulse control training with her clients to discourage destructive behavior. “[Dogs] get rewarded for staying away from the item,” she says. “That way, they learn to wait for direction from you instead of just impulsively going after everything that they want.” Teaching your dog a “drop it” cue can also be helpful, she says. In a pinch, your dog can rest comfortably in a crate when you’re not around, or you can close doors or use baby gates to block off access to certain parts of your home. To let your dog play with paper in an appropriate way, consider turning his instincts into an enriching game. This could mean “putting treats into a cardboard box and taping it up and poking holes and allowing them to rip that apart,” Jones says. “It allows them an outlet for that behavior.” If your dog gets hold of a tissue or napkin and won’t let go, there’s one thing you definitely shouldn’t do: chase him around and try to get it back. That makes your pup think it’s all a fun game. “Owners…yell, ‘Give me that napkin back!’ and they go running after the dog,” Sheaffer says. “What you’ve done by those actions is you’ve just increased the value of the item to the dog.” Instead, it’s better to ignore the behavior (unless your dog is ingesting the paper, or if the paper is covered with a dangerous substance), then quietly remove it when your pet is distracted. Bottom line, dogs will probably always love ripping up paper, but there are plenty of ways to manage the behavior and keep your dog out of harm’s way."}]