[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/o0o41yo3eb", "@type": "VideoObject", "duration": "PT1M16S", "name": "5351997579001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/7981e20bd09bae1675c84d9b3fb03e5161060492.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/o0o41yo3eb", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/7e4c86b6979b6d34626caa2ffd40cae11484409c.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/do-dogs-and-cats-have-long-term-memories?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Do Dogs and Cats Have Long-Term Memories?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-memories-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-memories-pets.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/do-dogs-and-cats-have-long-term-memories"}, "datePublished": "August 16, 2017", "dateModified": "August 16, 2022", "description": "Like humans, dogs and cats can store an array of memories, from knowing where their food or litter box is, to recognizing people and places they haven&#039;t seen in years.", "articleBody": "By Nicole Pajer We often hear the expression that “pets live in the moment,” but anyone who owns a dog or cat will tell you that they’ve experienced incidents that challenge that statement. Have you ever put your dog in his dog crate, opened the door several hours later, and watched him make a beeline to where he was last chewing his rawhide dog treat? What about those stories of cats getting lost and finding their way back home years later? Or the dogs who bury their bones in the backyard being able to dig them up months down the road? These types of incidents suggest that pets are capable of forming memories, and not just short-term ones. Like Humans, Dogs and Cats Can Store an Array of Memories “Dogs and cats have different types of memories, just like we do. They have spatial memory, remembering where things are located, short-term memories, and long-term memories,” says Dr. Brian Hare, associate professor of evolutionary anthropology at Duke University in Durham, North Carolina. Los Angeles-based veterinarian Dr. Jeff Werber adds that pets are capable of storing many different types of memories—“from the little things like knowing where their food or litter box is, to recognizing people and places they haven’t seen in years.” Short-Term vs. Long-Term Memories According to Hare, short-term memory, or “working memory,” is a kind of memory that allows people to keep information—like a phone number—in mind for a few minutes and mentally manipulate it. “This may sound simple, but working memory is crucial for any kind of problem solving,” he explains. “Working memory has been found to correlate with skills in learning, math, reading, and language. Researchers have even found some evidence that in children, working memory is more predictive of academic success than IQ.” Long-term memories, on the other hand, are stored in your brain and can be retrieved at will, like childhood memories, or what you did last week or last year. “Long-term memories do not fade in order. You might remember something that happened to you years ago better than you remember what you did yesterday,” he explains. To distill it down, Dr. Bruce Kornreich, associate director at the Cornell Feline Health Center in Ithaca, New York, says that “short-term memory is anywhere between 5 and 30 seconds and long-term memory can remain almost indefinitely.” Long-Term Memories in Pets “There are many examples of cats and dogs having long-term memory in both studies and in real-life events,” says Dr. Jenna Sansolo, associate veterinarian at Ardsley Veterinary Associates in Ardsley, New York. “For instance, when pet owners go on vacations and come home to dogs that show the same excitement a human child would show after not seeing their family for the same amount of time, or the countless videos of dogs whose owners come home from military deployments that are all over the internet.” Sansolo also points out that pets who have been abused or in less than ideal living situations can also show proof of long-term memory. “I have seen many patients who are scared of tall men, hats, certain noises, etc., which they can relate to a negative memory or event that has happened in the distant past,” she explains. Laurie Santos, director of the Comparative Cognition Laboratory and the Canine Cognition Center at Yale in New Haven, Connecticut, notes that when we think of long-term memories in pets, we are often referring to “episodic memories—remembering particular episodes from long ago.” She adds that while the topic hasn’t been extensively studied, she and her colleagues have seen evidence that pets have some episodic memory abilities. “For example, dogs can remember where and what kinds of food were hidden over longer time horizons, suggesting they&#039;re tracking some information about how and where food was hidden,” she explains. “There&#039;s also evidence that dogs behave differently when owners leave for long versus short periods of time, suggesting that pets might remember something about how long ago their companion left.” What Triggers the Formation of Memories in Pets? While pets can form memories about a variety of instances, experts suspect that extremely positive and/or negative experiences are what stick with them the most. “Important events, such as those related to food and survival, and events that have an emotional impact are more likely to be stored in the long-term memory,” says Claudia Fugazza, department of ethology at Eötvös Loránd University in Budapest. “These memories have the power to affect your pet’s behavior for a lifetime,” Weber says. Dr. Veronica Cruz Balser, a veterinarian at the Metropolitan Veterinary Center in Chicago, agrees, adding that it sometimes takes only one impactful moment to cause a memory to stick with a pet for a long period of time. “My dog, Tony, was near a campfire once when someone decided to add excessive amounts of lighter fluid. The fireball that came towards us was very frightening for him, as he was not expecting it. He no longer will get near campfires,” she says. How Far Back Can Dogs and Cats Recall? According to Cruz Balser, that’s tricky. The subject hasn’t been extensively studied, however, many experts have their own theories. The general consensus is that this is largely based on what level of impact the incident that initially formed the memory had on the dog or cat. “It depends on the type of event and emotions/reward/consequence of the event,” Cruz Balser says. Fugazza agrees. “Memory decay depends on many variables, such as the type of memory used for storing the information, its importance, and its emotional valence [the strength of a positive or negative emotion]. Important information and memories with emotional content tend to be remembered for longer times.” Do Dogs or Cats Have Better Memories? Studies show that dogs outperform cats when it comes to their short-term memory abilities. This leads experts, like Kornreich, to believe that the same would hold true when it comes to long-term memories. “You would extrapolate from the fact that dogs do better on short-term memory studies than cats do—that they perhaps have better long-term memories,” he explains. “We have to be careful about coming to that conclusion without it being tested. But it makes perfect sense to me to say, ‘Well, if a cat forgets where something is in 30 seconds and a dog remembers where it is for a minute, then you would think that the dog not only has better short-term memory but perhaps it has better long-term memory.’ But that is presuming that the mechanisms behind short-term and long-term memory are the same and they may not be.” Monique Udell, assistant professor of animal and rangeland sciences at Oregon State University, points out that new research is looking specifically at fading memories in pets. “While cats and dogs do have long term-memory, the precision and accuracy of these memories can decline over time, just as it does for humans,” she explains. “We still have a lot to learn about the types of information that animals retain for long periods of time, but recent research into age-related memory decline and dementia in dogs may shed light on some of these questions, for both healthy dogs and those suffering from memory loss.” Kornreich points out an interesting fact: Certain studies suggest that cats don’t seem to have as much of an issue with memory decline as dogs do. “In humans, special learning tasks can be inhibited with aging. That appears not to significantly occur in cats,” he explains. “Cats don’t seem to have the same decline in terms of special learning tasks. That doesn’t say that there may not be components of their cognitive function that don’t deteriorate from time to time, but in terms of special learning tasks, at least based upon this study, they don’t decline in that regard.” Your Role in Your Pet’s Memories While pets learn continuously throughout their lifetime, they form the most important impressions in their early days. “Puppies and kittens both have periods early in their lives where they learn rapidly about many things in their world. The memories that are formed during this period influence how they behave for the rest of their lives,” says Dr. Kersti Seksel, a registered veterinary specialist of behavioral medicine at Sydney Animal Behaviour Service in Australia. So it’s extra important to expose them to the socialization and proper training and conditioning that they need during this time. Pet parents can help their dog or cat turn a potential negative long-term memory into a positive one, Cruz Balser adds. “Our behavior influences our pet’s behavior and memories more than people realize,” she says. “The one that impacts me daily as a vet is client’s behavior at the vet clinic and how they respond to their pet’s stress. If they&#039;re scared and you are anxious, then the memory of the building, the smell, and the people in that building will forever be scary.” For this reason, Cruz Balser encourages people to swing by the vet clinic periodically for “happy visits” where pets get a treat and some love or just come in and then leave. “That way, the pet can have experiences in the vet clinic that aren&#039;t scary or bad and it doesn&#039;t become engrained in them that the clinic is bad,” she says. Explore More:"}]