[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/1xuh3nn9hn", "@type": "VideoObject", "duration": "PT1M59S", "name": "5327091836001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/a2248b93a57dddb2103d20fc8d08f31365c19820.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/1xuh3nn9hn", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/a7abecb161dbc15e8b04339ade60b60bb576cfa2.m3u8", "transcript": "Although it is far from appealing. Still eating or copper aphasia is a relatively common behavior seen in puppies. However, it should be addressed appropriately and quickly to prevent it from becoming a recurring habit as your dog ages at birth. It is natural for a mother to eat her puppy stool both to keep her litters den clean and to protect her puppies from predators.\n\nThat may be drawn to the scent of the puppy stool though she will stop this behavior on her own. Once the puppies are weaned her puppies may pick up on it and continue the behavior as they mature. This combined with a natural puppy curiosity to explore things with their mouths is often how Cooper aphasia begins in dogs. Additionally stool eating can be a sign of other underlying issues, including poor digestion boredom stress, or even hunger.\n\nSome puppies will also eat stool as an attention seeking behavior if their owner has a strong reaction to it either to hide the evidence or to get some extra attention. Ensure that your puppy is consistently fed a high quality food that is formulated for puppies and includes the protein, vitamins, and minerals that he needs for normal growth. Speak with your veterinarian about your puppy's diet, especially if you believe your puppy has any digestive issues. Signs of this might include watery stool or stool with large pieces when they just have food and be diligent cleaning up after your puppy eliminates and never give him a chance to play with eat or inspect his stool after he goes to the bathroom distract your puppy from his stool by rewarding him with verbal encouragement or a treat for a job well done.\n\nAs soon as he goes and if necessary, take your puppy inside before cleaning up his stool. It's also important to keep your puppy on a leash whenever you walk in to prevent him from smelling and eating the stool of other animals. Some parasites and illnesses can be transmitted through stool. So it's important to keep your puppy as far away from it as possible.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/why-do-dogs-eat-poop?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Eat Poop?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/puppy-sniffing-the-grass.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/puppy-sniffing-the-grass.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-eat-poop"}, "datePublished": "February 24, 2020", "dateModified": "October 7, 2023", "description": "Ever wonder why dogs eat poop? You&#039;re not alone. There are normal and abnormal reasons why dog eat poop. Here&#039;s what to know—and how to stop it.", "articleBody": "Have you ever caught your dog eating poop and asked yourself, “Ugh, why do dogs do this?” You’re definitely not alone. Poop-eating, also called coprophagia in dogs, is not exactly a hobby that you would consider ideal for your furry family member. Here’s everything you need to know about why dogs eat poop and what you should do about it. Why Dogs Eat Poop The scientific term for the poop-eating habit is coprophagia. Dogs eat poop for a variety of reasons. And while some are normal, others are signs of an underlying issue. For example: It’s normal and somewhat common for dogs to eat the poop of another species, but it’s uncommon for adult dogs to eat their own poop or another dog’s poop.  Normal Reasons Why Dogs Eat Poop A dog eating poop can be normal in the following scenarios: 1. They Are Nursing Nursing female dogs often eat the poop of their young to keep their den clean. 2. It’s Instinctual A 2018 survey published in Veterinary Medicine and Science hypothesizes that dogs eat poop as a behavior inherited from wolves. Wolves would typically eat fresh poop (less than two days old) to keep the den free of fecal-borne intestinal parasites. When eaten, the poop would have parasite ova that are not infective, the study explains. After two days, the infective larvae would develop. This could explain why, of the roughly 3,000 dogs surveyed, “the coprophagy was overwhelmingly directed at fresh stools.” 3. The Poop of Other Animals Tastes Good to Them Dogs sometimes eat the poop of another species. The stool of other animals, such as horses or cats, contains nutrients that can be beneficial. But this poop can also contain harmful bacteria, so it’s best to discourage your dog from eating it. It’s normal for dogs to eat the poop of another species, but it’s uncommon for adult dogs to eat their own poop or another dog’s poop.Abnormal Reasons Why Dogs Eat Poop Eating their own poop or another dog’s poop is not a common behavior, and you’ll need to find out what’s causing it. Here are four reasons why an adult dog will do this. 1. They Want to Get Your Attention Some dogs may have started eating poop when they are young because they feel like it’s a game. For example, when puppies are young, they may explore by grabbing their poop with their mouths. If your dog does this, you will probably run towards them and cry out some form of “drop it.”   When this happens, some puppies may be startled, drop the poop, and never touch it again. Other puppies may interpret the yelling as an excited invitation to play. As a result, they dart away, and then suddenly, an impromptu game of chase occurs. These puppies have learned another way to get their human parents to “play” with them. Your dog may not even necessarily want to play, but they might simply want you to engage with them. As your dog becomes an adult, this is carried over as a learned behavior that gets them attention. And let’s face it: It’s really difficult to not pay attention to a dog that’s eating poop. 2. They’re Not Feeling Well If your dog is eating poop, they may not be feeling well. When you have a puppy or dog that eats other dogs’ poop or their own poop, have your pet examined by your veterinarian. Coprophagia can be associated with diseases of the intestinal tract and sometimes other parts of the body (such as the liver or brain). If your adult dog has never been a poop eater and suddenly develops the habit in association with symptoms of disease, such as weight loss, lethargy, discomfort, behavioral changes, vomiting, or diarrhea, make an appointment with your veterinarian. Coprophagia can be associated with diseases of the intestinal tract and sometimes other parts of the body (such as the liver or brain).Your veterinarian will need to perform diagnostic tests to determine if your dog has an underlying medical problem, such intestinal parasites, nutritional deficiencies, or gastrointestinal disease. 3. They Have Anxiety Other dogs eat poop as a displacement behavior when they are anxious. If an anxious dog is confined, they may defecate and eat their own poop. Possible sources of anxiety that can cause coprophagia include: General anxiety Worrying about being confined You being away from them (separation anxiety) Lack of enrichment activities when confined 4. They’re Scared of Being Punished for an Accident Some dogs may learn to eat their poop as puppies if they have been repeatedly punished by their owners for defecating in the house. The dog may eat the evidence because they’re worried about how you’ll respond. When potty training a puppy or dog, never use punitive measures. Instead, rely on positive reinforcement. How to Stop a Dog From Eating Poop If your puppy or dog is eating poop, the best way to help them is to put systems in place that prevent them from practicing the habit. After you’ve determined why your dog eats poop, try these solutions based on the reason behind the behavior. Dogs That Eat Cat Poop Even though it’s considered normal, you don’t want your dog diving into the litter box for a snack. For dogs that eat cat poop: Put up a pet gate or door that allows the cat access to their litter box while keeping the dog out of that room. Place the litter box on a big table. This lets your cat jump up to access the box while keeping it out of your dog’s reach. Try a coprophagic supplement that discourages dogs from eating poop by changing the poop’s taste. (Keep in mind, dogs usually repeatedly eat things that taste good to them. Poop may just appeal to their taste buds.) Puppies That Start Eating Poop For puppies that like to eat poop, you need to control their access. When you are housetraining your puppy, take them out on a consistent schedule. Once your puppy has finished defecating, praise them and offer them a tasty treat. While they are eating the treat, quickly clean up the stool. This way, you’re not allowing your puppy any access and preventing the problem from occurring. You’re also positively reinforcing their potty training instead of punishing your dog for accidents. Dogs That Are Crated or Have Anxiety or Separation Anxiety For confined dogs that eat their own poop, determine how to change some aspects of their confinement to help reduce their anxiety. Some dogs need a bigger space or quieter area, or they simply more puzzle toys to keep them occupied. For dogs that exhibit anxiety and cannot be left alone, look into daycare or whether your dog to come to work with you. These dogs can also benefit from seeking the help of a veterinary behaviorist or certified animal behaviorist. Adult Dogs That Have Learned to Eat Their Poop If a dog has learned to eat poop because they are scared of being punished for having an accident, the first step is to stop using punishment. Then, take active measures to prevent your dog from having access to poop. It might be the case that the dog was punished by past owners. In this case, keep your focus on positive reinforcement—though you’ll still need to restrict access to the poop. Once the behavior has been established, it&#039;s crucial that you remain patient and consistently use positive reinforcement to encourage alternative behaviors for your dog to perform other than eating poop. Redirect Your Dog’s Attention When you have an adult dog that has been eating poop for a long time, then it’s important that you go out with your dog whenever they need to defecate. As soon as they are finished, call your dog over to you for treats. Then, either put them back in the house or toss a toy for them to chase while you pick up their stool. If your dog immediately turns around to eat their poop and does not listen to you, you’ll need to keep your dog on a leash and lead them away as soon as they have defecated. To truly discourage your dog from eating poop, you will need to continue to manage your dog and restrict access to the poop to prevent a relapse. Some people are successful by teaching their dogs a “leave it” cue and then a “come” or automatic “sit” using positive reinforcement. The real key is to always offer plenty of praise and treats when your dog chooses not to immediately go for their poop. To help, you should find a super high-value treat that they only get in these scenarios. Use Dog Training Tools You can also use pet gear to help stop your dog from eating poop. Leash: Keep your pet on a leash when working on this behavior so you can quickly lead them away from the stool. Work on “leave it” cues if needed. Clicker: Clicker training can also be very useful when teaching your dog to stop eating poop. Treats: Be sure to have a treat pouch and keep lots of tasty rewards on hand. Poop bags: Pick up and remove all stool from the yard immediately to remove any temptation for your pet. Make the Poop Less Appealing If your dog is eating their own poop because it tastes good to them and they’ve developed the habit, try using dog chews to discourage this behavior. Popular products include: Probiotics can also be used to help stop your pet from eating their stool.  These chews can be given in conjunction with your efforts to keep your dog away from their poop by distracting them with toys or using training tools. Featured Image: iStock.com/bang"}]