[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Bark?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/jack-russell-terrier-barking.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/jack-russell-terrier-barking.jpg"}, "author": {"@type": "Person", "name": "Monica Tarantino, DVM", "url": "https://www.petmd.com/author/dr-monica-tarantino"}, "keywords": "Dog, Behavior, Vocalizing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-bark"}, "datePublished": "January 8, 2020", "dateModified": "August 16, 2022", "description": "Have you ever wondered why your dog barks? Here’s an in-depth look into why dogs bark.", "articleBody": "Recent research shows that the domesticating of dogs began between 20,000-40,000 years ago. In that period of time, dogs have learned how to understand large vocabularies, compound sentences, and upwards of 1,000 words if trained properly.   Like us, dogs use verbal and nonverbal cues to communicate. For dogs, barking is a completely normal behavior—it’s one of the most effective ways dogs know how to communicate with their owners.  They use barking to communicate a variety of feelings, so in order to fully understand what a dog is communicating, pet parents need to contextualize a dog’s verbal cues within their nonverbal cues (dog body language). 7 Reasons Why Dogs Bark To help you understand what your dog may be trying to say , here’s a breakdown of the most common reasons dogs bark. Excitement Barks Does your dog bark when you come home, or start barking when they hear the familiar sound of you getting their leash? Well, those are barks of excitement.  In fact, yipping and yowling is one of the ways that packs of dogs will communicate excitement to one another. These barks are typically high-pitched or midrange in sound, and your dog will let out about one or two intermittently until the excitement has dwindled. The barks will often be accompanied by a wagging tail and an alert—but happy—body position (ears perked and head held higher). It’s also common for them to spin in circles or quickly tap their feet. This indicates their excitement and should communicate to you: let’s get going! Attention- and Food-Seeking Barks When a dog wants to get your attention, they may bark at you. This type of barking tends to be a long string of single barks with pauses between them. Depending on the dog and the situation, they may be asking you to go for a walk or to feed them. Often, their body language is less energetic and relaxed. Their tails may be straight or wagging, with their ears down/natural or at attention. However, be careful with this type of barking. If they are barking to get treats, for example, and they get what they want when they bark, it teaches them that their barking is effective. Then your dog might bark all the time to get treats. Barking From Boredom When dogs are bored, they may bark to get your attention or to try to engage you in playtime. If a dog is not mentally and physically stimulated as he should be, destructive behaviors may develop.  Daily walks, dog puzzles, quality time, and doggy day care can help prevent boredom. Some clever dogs will bring an object as an obvious hint, such as a ball or a leash. These playtime-seeking barks are usually those “harrr-ruff” barks that you hear your dog do. They are typically lower and happen singularly. Similar to attention-seeking behavior, the body posture can include having their ears drawn back with their tail straight out, or they could display neutral positioning. In some cases, a dog may lower themselves into a play bow (front legs down with their bottom in the air) to signify they are ready to play. Fear, Anxiety, or Territorial Barking Defensive barking is often heard when there is a clear stimulus—such as a strange person approaching the home, another dog being nearby, or being trapped in a position with no clear escape route. These barks will usually be deeper and may have a growl associated with them. They will also be fairly continuous and incessant. This is your dog’s way of saying, “hey, what’s this? We need to be at the ready for a problem.” For anxious/fearful dogs, their body language will usually include a tail between the legs, hackles raised, and low head posture. If it’s just territorial barking, then the body posture may include having the ears and head at attention and the tail straight. This is the dog’s way of indicating that they are larger and may bite. In both scenarios, the dog’s body will be tense. Pain Barking Dogs will bark when they are in pain. This communicates to their pack to come to their aid or to indicate that a certain behavior is causing pain and they want it to stop. This type of barking is commonly seen when an animal gets accidentally bumped during rough play or when they’re attacked by another animal. The bark may sound higher pitched and often has a staccato quality, or trails off as the bark goes on. If your dog barks like this when you touch or pet them, something may be hurting or they may be anticipating pain from being touched. This is a sign to take your pup to the vet to see what’s wrong.  Reactive or Surprise Barking This is often a singular bark, but it can be followed by more barking. It is also typically higher in pitch to reflect surprise. As with humans, it’s a mostly involuntary response to being surprised or spooked. You may hear this if you walk up to a dog that wasn’t paying attention or has poor hearing, or if they think they see something move quickly in the grass. This bark may be uncontrolled, and the body posture can vary, as they weren’t likely prepared to bark in the first place. Barking Due to Canine Dementia When some dogs get older, they will bark at night or at something that does not appear to be there. This may be a sign of cognitive dysfunction in an older animal. The bark seems to come in response to nothing and may resolve without any identifiable reason. If you notice your older dog barking into a corner or at a wall during the night, make an appointment with your veterinarian to see if there are steps you can take to make them more comfortable. Always Take Dog Body Language Into Account There are many more reasons why dogs bark aside from these common barking scenarios that you’ll likely encounter. The key to understanding your dog’s barking is to look at their body language and then for the stimulus causing the bark. In some cases, unwanted barking can be avoided by just understanding why they are barking and making simple adjustments around the house or in your routine. By: Dr. Monica Tarantino, DVM Featured Image: iStock.com/primeimages"}]