[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "True and False About Pet Friendly Travel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/truefalsepettravel.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/truefalsepettravel.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/true_and_false_about_pet_friendly_travel"}, "datePublished": "July 12, 2013", "dateModified": "August 30, 2022", "description": "There are many myths and misconceptions when it comes to traveling with pets. Here are some that may affect your next vacation.", "articleBody": "By Carol Bryant True or False: Dogs are never allowed to dine with their owners when eating out. False. There are indeed many restaurants that now allow Fido to dine alongside their owners, as ordinances in each city/state/province deem where dogs are and are not allowed. In most cases, dogs can dine al fresco alongside their pet parents on the patio. There are many myths and misconceptions when it comes to traveling with dogs; everything from “all hotels charge super high pet-friendly fees” (false), to “I could never get my dog used to a car” (not always true). Here, we dispel some falses and dish the reality on some truths pertaining to pet-friendly travel. True or False: Dogs cannot get sunburned while traveling in a car, since the exterior protects them. False. The sun’s ultraviolet rays can beam through car windows and cause sunburn on both human and pet skin. Fur is a great protector, but the sun’s harmful UV light can burn right through fur. Apply a dog-friendly sunscreen and/or use in-car window shades when traveling. True or False: Airlines will allow dogs to fly as cargo any time of year. False. Policies differ according to airlines, and depending on the temperature and climate, they may ban the flying of pets certain times of the year. True or False: Hotel pet fees are applicable one time for one pet. False. Always ask what pet fees are when making reservations and indicate that you are bringing a dog.  Fees may apply per pet and there may be a weight limit imposed. For example, “Dogs 50 pounds and under are welcome to stay for a one-time nonrefundable $25 fee.” Just because the Internet site says pets are welcome does not make it so. Websites may not be updated, so save yourself disappointment on check in: Call first and ask/confirm pet policies and pet acceptance. True or False: Dogs should have pit stops to relieve themselves when traveling. True. Though it seems common sense, a quiet restrained dog in the backseat still has potty break needs. Keep Fido’s bladder empty and allow him or her to stretch their paws every hour or two. True or False: A dog that is fearful of travel can be changed so he or she loves it. True/False: Sometimes, yes and sometimes, no. Never force or make a travel fearful dog to “face their fears.” This will only reinforce anxiety, can lead to extreme nervousness, panic, and even cause an accident. If the only time a dog experiences the car is to see the vet or groomer, then Rover is most likely to despise the car. Be patient, take your time, and make a dog’s arrival point a grand one: the dog park, a favorite friend or relative’s house, and be sure to reward when arriving at destination. Consult with a veterinarian or animal behaviorist for more tips."}]