[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Deceased Pet Care: Burial and Cremation Options", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1248452712.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1248452712.jpg"}, "author": {"@type": "Person", "name": "Leslie Gillette, DVM", "url": "https://www.petmd.com/author/dr-leslie-gillette"}, "keywords": "Dog, Cat, End of life, General Care, Zoo In Memoriam Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/deceased-pet-care-burial-cremation-options"}, "datePublished": "December 13, 2022", "dateModified": "August 30, 2023", "description": "Dr. Leslie Gillette explains the options you have for final arrangements for your pet, from traditional cremation or burial to eco-friendly “green” cemeteries and aquamation.", "articleBody": "Coping with the loss of a pet can be devastating. In addition to grieving the loss, you’re also faced with the decision of what to do with your pet’s remains. Home burial and pet burial services used to be the most common options for pet owners. But in recent years, pet aftercare has evolved to include alternative options to honor and memorialize the lives of our beloved companions, including cremation, aquamation, and green burial in eco-friendly and pet-inclusive whole-family cemeteries. Knowing your options can help make the decision easier when the time comes. Pet Cremation One of the most common options for deceased pet care is cremation. What’s involved in the process of cremation? Traditional cremation applies extremely high heat (usually 1,500 –2,000° F) to a body placed in a cremation chamber, reducing the soft tissue and skeletal remains to ashes. The process does not take long—usually 30 minutes to 2 hours, depending on the size of the pet. Does the vet perform the cremation? Veterinary clinics typically do not provide on-site cremation services, as a crematorium requires specialized equipment and operational permits issued by both state and local governing bodies. Most veterinarians work with a reputable pet cremation service in their area. After a euthanasia has been performed, the veterinary staff will contact the crematorium to schedule a pickup of the pet’s body. If you’ve requested private cremation, where you have your pet’s ashes returned to you, the veterinary team can help you select an urn, and they will notify you when your pet’s ashes have been returned to the veterinary clinic. If you choose to handle cremation arrangements on your own, spend time researching companies through organizations such as the International Association of Pet Cemeteries and Crematories (IAOPCC). IAOPCC members are required to maintain a strict code of ethics and operating standards for pet aftercare, burial, and cremation services. What is private vs. communal pet cremation? With communal cremation, multiple pets are cremated together, which means their ashes will also be mixed together. You will not usually get your pet’s ashes back after communal cremation, as there is no way to separate the ash remains. Private cremation is the preferred option for pet parents who would like their pet’s ashes returned. If your pet has any orthopedic hardware or dental implants or was wearing any collars or tags, those will be collected and added to the cremains before returning the urn to the veterinary clinic. Microchips are usually not heat-resistant enough to withstand cremation and will typically disintegrate during the process. It typically takes 1-2 weeks for your pet’s ashes to be returned. The crematorium staff delivers all private cremains to the veterinary clinic, and the veterinary staff will notify you that the cremains are ready for pickup. Cremains may be returned in either a permanently sealed urn or an urn that can be opened if you wish to spread your pet’s ashes. Aside from scattering ashes, they can also be crafted into art and jewelry as reminders of the bond you shared with your pet. If you and your pet shared a love of the outdoors, you may consider having your pet’s ashes added to a living coral reef. The ashes can be crafted into a memorial stone and placed in the reef with a plaque or included in a larger family plaque. The ashes can also be scattered in open water with a memorial plaque installed at the reef site. What are the costs for private and communal cremation? Are there extra costs for larger pets? Communal cremation is the least expensive option, usually running between $50 and $200 depending on the size of the pet. Private cremation costs are higher due to the individualized nature of the service. They may run anywhere from $150 to $450, depending on the size of the pet, and this does not necessarily include the cost of the urn. Livestock and horses would have to be specially transported to a facility that can accommodate larger animals, so additional transport and delivery fees are to be expected in addition to the cost of the cremation itself. Is cremation eco-friendly? Traditional cremation is not an eco-friendly process. Incineration of any solid material produces a significant amount of waste gases, including carbon dioxide, and requires a tremendous amount of energy to operate at such high temperatures. There are several new environmentally friendly cremation options that are becoming more widely available for customers, including aquamation (also called resomation) and cryomation. These alternatives still yield a small amount of solid ash residue but require much less energy to perform and leave a much smaller carbon footprint. Pet Burial Perhaps the most traditional options is burial, whether at home or in a pet cemetery. Many communities have pet cemeteries where pets may either be buried privately or in a communal burial plot. If private burial is not available, cemeteries may have a memorial wall on which you may place a plaque in remembrance of your companion. Green-burial pet cemeteries maintain strict guidelines regarding the type of biodegradable shroud or container used for burial, the type of landscaping that may be planted at the burial site, and the specific pesticides and lawn treatment products that can be used to maintain the cemetery property. Before purchasing a burial plot for your beloved companion in a pet cemetery, research that site to be sure that the land has been ‘deeded in perpetuity’ for that purpose. This will ensure that the land cannot be repurposed at a future date or require pet owners to exhume their pet’s remains to be moved to another burial site. Do vets recommend or work with specific cemeteries? Does the cemetery pick up the body from the vet? Talk to your veterinarian about the availability, requirements, and procedure for having your pet buried in a pet cemetery in your area. Typically, you must make burial arrangements on your own, but depending on the size of your pet and logistics of transportation, some pet cemeteries may have pickup options available from your home, farm, or the veterinary clinic where your pet’s remains are being held. Can you bury a pet in your yard? If you wish to bury your pet at home, you’ll need to check local ordinances and HOA restrictions to confirm whether home burial is allowed in your area. There may be additional regulations regarding the depth of the burial plot (to deter predation from wildlife) and the chemicals used for euthanasia. The decomposition of euthanized bodies may release hazardous chemical byproducts into the soil, which could then filter into the water table. General rules for burial include the following: The depth of the burial plot must be adequate to deter wildlife predation and prevent detectable odors of decomposition (typically 2 to 5 feet but may vary by state or local ordinance). The depth of the burial plot must not infringe on the boundaries of wetlands or a flood plain, and must not be near a shoreline, reservoir, or well source to prevent seepage of decomposing tissues, fluids, and euthanasia chemical byproducts that may contaminate local groundwater. Consider your geographical area and climate. If your pet dies during the winter and the ground is frozen, you may be unable to dig the appropriately sized plot or reach an appropriate depth. Some veterinary clinics may have space to store your pet’s body until warmer weather allows for home burial, so consult with your veterinarian about temporary storage arrangements. The pet’s remains should be wrapped in a burial shroud or biodegradable container. Most biodegradable caskets will decompose slowly, over 3 to 5 years. Eco-friendly casket examples: SWEET GOODBYE COCOON Eco-Friendly Pet Casket Burial &amp; Cremation Ceremony Kit PAW PODS Biodegradable Micro Pod Casket Aquamation for Pets One eco-friendly option you probably haven’t heard of is aquamation. What is aquamation? Aquamation is the process of immersing a body in a heated alkaline solution to accelerate the decomposition of tissues. The result is a powdery ash, in contrast to the more fragmented remains left behind after traditional heat cremation. The process takes much longer than traditional cremation (18-20 hours for aquamation vs 1-3 hours for heat cremation). How eco-friendly is aquamation compared to other options? Although aquamation takes longer than cremation, it’s still a much more environmentally friendly alternative. Studies have shown that aquamation requires only about 5% of the energy necessary for heat cremation and leaves only about 10% of a carbon footprint. With a significantly lower energy requirement and no toxic emissions, aquamation has been proven to be a considerably more eco-friendly, efficient process. Do you get ashes back with aquamation? Yes. Once the body has been completely broken down by the aquamation process, the solid remains are dried to produce a powdery ash that is collected and returned to you. Some aquamation companies will also transport your pet’s body to and from your home or veterinary clinic or arrange to have the remains mailed to your home. What is the cost of aquamation? Aquamation costs vary considerably based on the size of the pet and the other options that may be included in each burial care package. Basic aquamation packages may start at less than $100, but these services are not available in all states, so transportation and shipping arrangements, coupled with the size of the pet, could increase these costs significantly. How can you find a place that does aquamation? Professional association websites such as the IAOPCC and watchdog groups like the Better Business Bureau are both places to search for reputable pet cremation or aquamation facilities in your area. Your veterinarian may also have contact information for pet crematory or aquamation businesses they do business with, and they can give you firsthand feedback on the quality and reputability of their services."}]