[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is It Safe to Sleep with Your Pet?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-sleep-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-sleep-pets.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/is-it-safe-to-sleep-with-pets"}, "datePublished": "January 26, 2015", "dateModified": "August 30, 2022", "description": "Experts have long advised pet parents not to sleep with their dogs or cats, but are concerns over health risks overstated or incorrect? Find out once and for all whether it’s safe to sleep with your pet.", "articleBody": "By Nancy Dunham Go ahead and sleep with your dog—it’s perfectly safe, as long as you are both healthy. In fact, sharing your bedroom with your canine companion—as long as he isn&#039;t under the covers—may actually improve your sleep, according to recent research published by Mayo Clinic Proceedings. Although researchers didn’t study the impact of felines sleeping with their pet parents, anecdotally, veterinarians suggest the results are mostly positive (though the nocturnal cat may be a bit more disruptive). “Today, many pet owners are away from their pets for much of the day, so they want to maximize their time with them when they are home,” stated Lois Krahn, M.D., study coauthor and a sleep medicine specialist at the Center for Sleep Medicine on Mayo Clinic’s Arizona campus in a press release. “Having them in the bedroom at night is an easy way to do that. And, now, pet owners can find comfort knowing it won’t negatively impact their sleep.” The report left many pet owners puzzled, though. Pet experts have long advised pet parents not to sleep with their dogs or cats for at least two main reasons: it will promote poor behavior in the animal and could lead to serious illness in humans. Many vets now believe concerns over such issues are overstated or just incorrect. The resultant behavior can negatively impact both pet parents and their four-legged friends, says Dr. Ann Hohenhaus, a staff doctor at the Animal Medical Center in New York City, who specializes in small animal internal medicine and oncology. “Sleeping with your pet is an important ritual for many people,” she says. “It doesn’t need to be avoided if both pet and owner are healthy.” Behavior Issues Related to Pets Sleeping on Beds Despite what you’ve heard, allowing a dog or cat on the bed doesn’t cause behavioral problems. There are aggressive animals that you may not want to allow on a bed. Their aggression is often rooted in fear and is not caused by allowing them on beds or furniture, says certified dog behavior consultant and professional trainer Russell Hartstein. “There is chronic confusion over this issue. It is completely fine to have them on the bed,” says Hartstein, CEO of FunPawCare, based in Los Angeles and Miami. “It’s actually funny this question even exists. These dominance theories were debunked (long ago). One reason people believe some of this is that some animal TV show hosts don’t follow evidence-based science.” The bigger issue, Hartstein says, is the pet owner’s lifestyle. Do they mind pet hair on furniture? Are they comfortable sleeping with a pet by their feet? Will a cat’s decision to leave in the middle of night disrupt the person’s sleep? If owners don’t mind these inconveniences, the pet will enjoy the bed as much as the owner. “Pets love their parents and are drawn to their scents,” he says. “They also prefer sleeping on elevated spaces.” If sleeping on the bed isn’t comfortable for the pet parent, Hartstein suggests installing a comfortable, clean pet bed in or near the bedroom. Put a piece of your clothing—such as a T-shirt—in the bed so the pet can enjoy your scent. Can Children Share a Bed with Pets? Like adult pet parents, young children often want to sleep with the family dog or cat. All cases differ, of course, but it’s generally unwise to have a child of 6 or younger sleep alone with a pet. “Before a child should sleep alone with a pet, it’s my opinion they should show that they can handle the responsibility,” says Dr. Carol Osborne, a veterinarian who practices at Chagrin Falls Veterinary Center &amp; Pet Clinic in Ohio. “A parent should monitor a child to make sure they use good judgment when they feed, water, or walk it. That’s very important.” Pulling a pet’s tail, rough play, or neglecting his needs are all indications that the child is not yet mature enough to sleep with a pet. Dogs and cats may tolerate some childhood mischief but become fearful and will eventually strike out. Wait until the child has a record of maturity with the pet before allowing them to sleep together. One point you needn’t worry about, though, is a cat smothering a sleeping infant. That’s an old wives’ tale, says Osborne and others. A tale of such an incident was told more than 300 years ago and has not faded from the public consciousness. “Most cats are not interested in babies,” she says. “They make random motions and they smell bad.” It’s still a good idea to keep pets away from babies, though. Babies, especially those younger than 3 months, are more susceptible to certain kinds of infections because of undeveloped immune systems. Health Concerns of Sleeping with a Pet Perhaps the greatest concern pet parents have about sleeping with a dog or cat is that they will catch a disease from him. It would be “very rare” for something like that to occur if the pet and person are both in good health, our experts agree. Good health for a pet means no fleas, ticks, or other parasites, no illnesses, up-to-date vaccinations, and regular vet checkups. “There’s a reason your vet wants to see your pet every year,” Hohenhaus says. “A vet wants to keep the pet healthy and identify risks so you don’t get sick, too...But with the average, healthy pet, there is a very low risk they will spread an illness to a person.” And for people, good health in these cases is basically defined as those who are not immunosuppressed. Cancer patients, transplant recipients, and H.I.V.-positive people are among those who should not sleep with pets. Although there was a recent report of a dog infecting a human with the plague, such transmission is extremely rare, our experts agree. The Centers for Disease Control reports that the majority of the approximately eight annual cases of plague in the United States occur in rural parts of Arizona, New Mexico, Colorado, and California and are transmitted by rodents. “Keep in mind that the CDC reports that contracting a disease from a family pet is ‘rare,’”Osborne says. “And sleeping with a pet has its benefits. A dog’s body temperature is higher than ours, so particularly on a cold night, it’s nice to snuggle with a dog. And dogs help us relax and allow some people with insomnia to sleep without [medications].”"}]