[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Mistakes That Could Cause Weight Gain in Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/sneaky-dog-meal-picture-id692955412.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/sneaky-dog-meal-picture-id692955412.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Obesity, Weight management, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/7-mistakes-could-cause-weight-gain-dogs-and-cats"}, "datePublished": "October 9, 2018", "dateModified": "August 30, 2022", "description": "Avoid these seven mistakes that can cause weight gain in dogs and cats.", "articleBody": "Reviewed and updated for accuracy on October 9, 2018 by Jennifer Coates, DVM Has some extra weight snuck up on your dog or cat recently? If your pup is looking a little on the plump side, it&#039;s possible that you are the culprit. Here are seven common pet parent mistakes that could pile the pounds on your furry one. You&#039;re “Guestimating” How Much to Feed If you&#039;re not measuring your dog&#039;s food and instead just filling the dog bowl, there&#039;s simply no way to know if you&#039;re overfeeding or not. “When I ask owners how much they feed, most have no idea,” says holistic veterinarian Dr. Judy Morgan, DVM, who regularly lectures and writes on pet nutrition topics. “When I use a measuring cup and actually show them what 1 cup of food looks like, they are amazed.” If you&#039;re using a cup, fistful or bowl to scoop out the food, Dr. Morgan suggests switching right now to a measuring cup, before you make any other changes. Read the bag to find out how much you should be feeding your dog or cat based on his ideal weight, or ask your vet if you&#039;re not sure. Then use a proper measuring cup so you can feed the correct amount every time. For both dogs and cats, leaving food out all day can also lead to overeating. If you&#039;re gone for long periods of time during the day, consider using a portion control programmable feeder, like the Aspen Pet LeBistro pet feeder, so your pet still has access to food, but only in the right amounts. You’re Adding an Extra Treat Here or There Dogs need approximately 20-30 calories per pound of body weight per day, according to Dr. Morgan. “If you consider a 20-pound dog, for example, the average caloric daily requirement will only be around 500 calories; maybe only 400 if pretty sedentary,” says Dr. Morgan. “Some store-bought treats can be very high in calories, and many are filled with sugar.” Unfortunately, the calorie content of some treats is out of control, according to Dr. Justin Shmalberg, DVM, one of less than 100 board-certified veterinary nutritionists in the country. “I routinely see treats, especially dog biscuits, make up more than one third of a dog’s overall daily caloric needs,” says Dr. Shmalberg.  A good example of this is a 50-pound dog, who, according to Dr. Shmalberg, should eat an average of about 1000 calories per day, but gets much more than that because of dog treats. “A medium-sized dog biscuit can contain about 40 calories, and it’s not uncommon for some people to give five of those biscuits to their dog per day,” Dr. Shmalberg says. “That’s a 20 percent higher intake than what’s needed; over the course of a year, this could easily add pounds of fat to a dog’s body.” If you&#039;re using dog treats as a way to keep your dog entertained between meals, consider switching to something like the Outward Hound Fun Feeder Interactive Dog Bowl, which challenges your dog to work for his food and slows down eating, keeping him busy for longer. You’re Forgetting to Account for Training Treats In general, you don’t want more than 10 percent of a pet’s daily calories coming from treats, and you want those treat calories accounted for in your daily targets, says Dr. Shmalberg. “You can use a bigger treat so long as you break it up, and you are aware of the overall number of calories in each treat, so that you can keep track of what you’re feeding,” Dr. Shmalberg adds. When choosing treats for training, Dr. Morgan points out you should be reading labels to find a treat that&#039;s low in calories, as you’ll probably be giving many of them throughout a training session. “PureBites is a treat that is very low-calorie, contains dried meats and organs, and is easy to break into small bits,” Dr. Morgan says. You’re Suddenly Walking Your Dog Less Switching to walking your dog once around the block instead of twice might not seem like a big deal, but it might leave you with a chubbier pup. “We know that the amount of calories used during walking is proportional to the distance traveled, so it’s better to look at distance rather than time,” says Dr. Shmalberg. “If you cut the distance in half, you’re also cutting the calories burned in half.” The bad news for pet parents everywhere is that exercise can’t substitute for portion control or caloric restriction in overweight animals, according to Dr. Shmalberg. So while cutting exercise sessions short can result in weight gain, increasing activity probably won’t make much of a difference if your dog is already chubby. “I was involved in a study that looked at dogs doing relatively intense exercise on an underwater treadmill at a trotting speed,” Dr. Shmalberg says. “We found that 30 minutes of exercise only resulted in a daily increase in how many calories were consumed by about 5 percent—that’s better than nothing, but an overall small impact.” You’re Feeding Low-Quality Food Low-quality dog food can absolutely cause weight gain, according to Dr. Morgan. Unfortunately, Dr. Shmalberg emphasizes that there isn’t a single specific ingredient that experts can malign and identify as the sole culprit of pet weight gain. “It’s really just a mismatch between what a pet needs and the number of calories that pet is given,” says Dr. Shmalberg. A well-balanced, high-quality pet food is always the best choice. When in doubt, talk to your veterinarian about your pet’s specific nutritional needs. You’re Not Using Prescription Foods (When You Need To) Prescription dog food, like Hill&#039;s Prescription Diet r/d Weight Reduction dog food, and prescription cat food could be a good move if your dog or cat is already overweight. “Weight management diets often have published research studies showing that they cause pets, specifically dogs, to lose weight, but that doesn’t mean they’re the only diet that will be effective,” says Dr. Shmalberg. “The need for these diets should be evaluated by a pet’s veterinarian, who can give targeted advice based on an individual pet’s goals.” Prescription dog food is not the right choice for every pet, however. Dr. Shmalberg points out many of these diets are high in fiber, and this can make some of them less palatable, especially if your pet is used to treats and table scraps. You’re Being Too Generous With Table Scraps People food is not always a bad thing, as long as you pick the right kind and feed it in moderate amounts—but most pet parents probably don’t. “I&#039;m fine with the dog having an egg, as long as 75-100 calories are deducted from the processed food fed that day,” says Dr. Morgan. “The down side of table scraps is when the fatty trimmings from meat, gravies and high-calorie, unhealthy scraps are fed.” Dr. Shmalberg is also a big proponent of fresh foods (including steamed vegetables) and even other people foods, but all in moderation. “A 10-pound Chihuahua, for example, should be fed an average of about 280 calories per day,” says Dr. Shmalberg. “If his parent sneaks in half a slice of deli meat or maybe a quarter of a Polish sausage, that’s 50-60 calories—20 percent more than he needs.” Something else to keep in mind is that in addition to causing weight gain, table scraps can also cause other issues. “High-fat ingredients … will contribute to pancreatitis and hemorrhagic gastroenteritis,” Dr. Morgan says. By Diana Bocco Image via iStock.com/sturti"}]