[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Doodle Dogs 101", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/brown-doodle-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/brown-doodle-dog.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Zoo Labradoodle Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/doodle-dogs-101"}, "datePublished": "November 16, 2022", "dateModified": "August 30, 2023", "description": "What makes a doodle dog? Learn the types of doodles, where they came from, and what you should know if you’re thinking of adopting a doodle dog.", "articleBody": "You’ve probably heard more and more pet parents talking about doodle dog breeds. Although this trend started back in the 1980s, the popularity of owning a doodle, an “oodle,” or a “poo” has skyrocketed. Let’s find out exactly what a doodle dog is, where they came from, and what you should keep in mind if you&#039;re interested in adopting one of these mixed breeds. What Is a Doodle Dog? A doodle dog is the result of a Miniature Poodle, Standard Poodle, or Toy Poodle being mixed with another dog breed. Some people consider doodle dogs to be designer dog breeds, while others consider them mixed-breed dogs. The term “designer” is used when a breeder mixes two purebred dogs, hoping to get the best traits from each breed in the new puppy—in this case, a family dog that’s intelligent and good-natured with a low-shedding coat. However, it’s not that clear-cut when it comes to genetics. When you take the genes of two breeds, there is no guarantee on what traits the puppy will have. You risk not only losing the desirable traits of each breed, but also inheriting health issues and undesirable traits. While cross-breeding two dogs may counteract some of the typical hereditary diseases from each parent dog, there’s still no guarantee about which genes your pup will inherit. You could end up with any combination of these conditions. Doodle vs. Oodle vs. Poo  Doodle mixes come with all sorts of crazy names. They all have some part of “Poodle” name by ending in doodle, oodle, or poo and starting with part of the other breed&#039;s name.  Some doodle mixes easily give away what the Poodle breed is mixed with, while others aren’t so obvious. And although it seems that the large dog breeds mixed with a Poodle have the doodle or oodle ending, and small dog breeds use the poo ending, that’s not true 100% of the time.  What Are F1, F1B, F2, and F3 Doodles? You may have seen the terms F1, F1B, F2, or F3 doodles in your search for a new doodle puppy. These terms help define the type of designer dog breeding that has happened. As the trend gains popularity, the doodle mixes become their own new breeds that are sometimes bred together. Below are examples of the parent dog mixtures that would result in each category of a Labradoodle.  Labrador Retriever + Poodle = F1 Labradoodle F1 Labradoodle + Poodle = F1B Labradoodle  F1 Labradoodle + F1 Labradoodle = F2 Labradoodle F2 Labradoodle + F2 Labradoodle = F3 Labradoodle Where Did Doodle Dogs Come From? Although some doodle breeds were rumored to have been bred for the first time back in the 1960s, the first Labradoodle created was documented in 1989. Wally Conron spent two years and conducted over 30 trials to create what he saw as the perfect mix of a Labrador Retriever and a Standard Poodle. This concept instantly became popular because so many people wanted or needed hypoallergenic dogs, as many people believe Poodles to be, but they liked the personality or look of other dog breeds more. Are All Doodle Dogs Hypoallergenic? This is a widely believed myth. Actually, there are two myths at play here. First, every doodle dog is not necessarily hypoallergenic. And secondly, there is no such thing as a truly hypoallergenic dog. Let’s start with the first myth. When mixing the genetics of two dog breeds, you can’t control how much of which genes come through in the puppy. This is why doodle puppies who “look the part” and are supposedly hypoallergenic cost quite a bit more than doodle puppies who still shed some or have nontraditional-looking fur.  And although the non-shedding, curly fur from the Poodle parent is the preferred end result of a doodle mix, keep in mind that this fur will require more frequent grooming and maintenance because it easily gets matted. If you decide to purchase or adopt a doodle mix whose fur isn’t as curly, you may appreciate the middle-ground result—less shedding than normal, and less matting than a Poodle.  Now let’s talk about the second myth of “hypoallergenic” dogs. Allergens are carried in dander (dead skin cells), saliva, and urine, so they are impossible to fully avoid. Some dogs produce fewer allergens or shed less than others, but no dog is completely free of allergens. Allergy sensitivities also vary from person to person, and dogs vary individually in their levels of allergens, so you never truly know if, or how badly, you will react to a certain dog. What to Keep in Mind if You’re Looking for a Doodle Dog If you are looking to get a designer dog breed like a doodle from a breeder, make sure they are a reputable, certified breeder, and ask for documentation such as the medical history of the dog’s parents and grandparents. Call your veterinarian for a reference for a reputable breeder. Oftentimes, you can find doodle mixes at animal shelters because they didn’t quite hit the mark for a breeder to sell them at a higher price tag. But that doesn’t mean that these pups aren’t just as sweet, loving, playful, and in need of a good forever home. Plus, they will still have certain Poodle traits. Featured Image: iStock/urbazon"}]