[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Introducing Babies to Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/3617354570_fdc9a48152_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/3617354570_fdc9a48152_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Adoption, General Care, Training, Aggression", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_introducing_babies_to_pets"}, "datePublished": "May 26, 2011", "dateModified": "August 30, 2022", "description": "How to let pets know that the new baby is a friend, not an intruder ...", "articleBody": "How to let pets know that the new baby is a friend, not an intruder This article is courtesy of Grandparents.com. By Rebecca Webber Surprising what can happen when animal meets infant for the first time. My Jack Russell terrier was fine with my granddaughter — until I picked up the baby, says Stephanie LaFarge, PhD, director of counseling with the American Society for the Prevention of Cruelty to Animals (ASPCA). &quot;Seeing the child move through the air triggered the dog&#039;s predatory urges,&quot; she says. &quot;And here he comes, flying through the room trying to grab her diaper in his teeth.&quot; Everyone looks forward to a grandchild&#039;s first visit. Everyone, that is, except unsuspecting Fido. &quot;You love your grandchild, and you love your pets,&quot; says LeFarge. &quot;The trick is getting these creatures to love each other.&quot; Pets — and children, too — can be unpredictable. So, it&#039;s best to make plans for first introductions with caution to spare. Know What Makes Your Pet Tick &quot;Take an honest assessment of your pet&#039;s personality,&quot; says Harrison Forbes, host of the Pet Talk radio show and How to Prevent a Dog Bite DVD. &quot;Some dogs just don&#039;t like kids. If yours lunges and snaps at them in the park, or acts evasive or squirrelly, you&#039;ll need to take things slowly.&quot; Along with temperament, consider the age of your pet. Young puppies and kittens tend to bounce off walls. They&#039;re highly energetic, playfully rough, and likely to nip with needlelike teeth. You&#039;d expect adult pets to be socialized and know better than to bite; but, that&#039;s not always the case. Older animals may be grumpy with arthritis, or partially blind or deaf leaving them unable to read human signals. Talk to your grandchildren&#039;s parents about their expectations for the first meeting. They might be hoping you will kennel your cat or dog during the visit, while you were planning to let him sleep in the Pack &#039;N Play. Negotiate an appropriate amount of contact between pets and children so that everyone is comfortable. If someone isn&#039;t, the pet will sense the nervous energy. “It can make them suspicious and defensive,&quot; explains Forbes. Set up pet camp in an out-of-the-way location with all your pet&#039;s favorite things — food, water, toys — and a sleeping spot where he can&#039;t be bothered. &quot;Dogs and cats like their quiet spaces just like people do,&quot; says Forbes. And if the child is crawling or walking, clear the floor of anything that might spark possessiveness. &quot;Dog toys look just like kid toys. There&#039;s no difference, except that one has a squeaker,&quot; says LaFarge. &quot;A dog may feel threatened that this crawling creature is going to grab its favorite chew toy.&quot; Once the house is set up for the first visit, introduce your granddaughter&#039;s scent. Bring in a blanket or a onesie for the dog or cat to sniff, making him aware of, and curious, about the new arrival. Let Pets Make the First Move Start on neutral ground: Outside is best, with your dog on a leash. “Dogs feel free outside,&quot; says Forbes, “and this eliminates the possibility of territorial action.&quot; If the meeting takes place indoors, make sure your pet isn&#039;t backed into a corner. Don&#039;t hold the pet in your arms or on your lap, even if it&#039;s small. This can trigger defense mechanisms. Instead, load the child up with dog treats; or, smear his fingers with peanut butter and let your pet approach and sniff out the snacks. &quot;This will give the dog the idea that whenever this smelly kid is around, I get lots of good stuff,&quot; says LaFarge. At the same time, the child will enjoy the dog&#039;s enthusiasm. &quot;He&#039;ll think, &#039;hey the dog likes me!&#039;&quot; says Forbes. &quot;That&#039;s the best way to start.&quot; &quot;My 2-year-old grandson was intimidated by my standard poodles, so I let him watch me feed them out of my hand,&quot; says Virginia Stuart, a grandmother of two boys in Dallas, Texas. Then, she says, he reached out to pet them. His courage grew until he was ready to feed them treats. &quot;He thought it was so cool to have them take that chunk of food right out of his hand,&quot; she says.   Watch Over Them Tune into your dog&#039;s reactions to your grandchild. Most undesirable behavior stems from territorialism or defensiveness. &quot;If the dog gets upset when the child is on your lap, it&#039;s not necessarily jealousy,&quot; says Forbes. &quot;The dog is thinking, &#039;why is that person sitting on top of you? I should do something about it.&#039;&quot; And, keep an eye out for teasing. &quot;An inquisitive, lovable grandchild will experiment with things that are hurtful,&quot; says LaFarge. &quot;What if I pull his tail or poke his eye? It&#039;s not a sign that the child is going to grow up to be a sociopath,&quot; she assures, &quot;but, it does mean the child needs to be directly corrected and told, &#039;No, that hurts the dog.&#039;&quot; It&#039;s not safe for your grandchildren to learn that they can be rough with animals. &quot;Your dog might be friendly,&quot; says LaFarge, &quot;but some other dog may not be.&quot; According to the Centers for Disease Control and Prevention, each year 400,000 children in America seek medical attention for dog bites. And, the rate of dog bite-related injuries is highest for children ages 5 to 9. Introducing Cats, Birds ... Monkeys? Your cat will develop his own strategy for meeting your grandchild — or not. &quot;If the cat doesn&#039;t like children, there&#039;s nothing you can do to make him change his mind. Just keep them separate until the child has good control over his or her behavior and can approach the cat carefully. The child needs to be taught how to &#039;read&#039; or understand cat body language,&quot; says LaFarge. Even when cats do want to roughhouse with the little ones, remain cautious. &quot;Cats have a high play drive and a child can get scratched up,&quot; says Forbes. It&#039;s also wise to keep birds and other small animals in their cages when grandchildren are dawdling about the house. But, when you&#039;re around, sure, let them interact with all your pets. And let the joy and Kodak moments begin. &quot;We raised a howler monkey who loved to nibble on hard candy,&quot; says Virginia, the Dallas grandmother. &quot;When he realized the baby of the house didn&#039;t have teeth, he&#039;d bite off a tiny bit and try to share it. I didn&#039;t believe it...until my husband snapped a picture.&quot; Image: Brianna Lehman / via Flickr This article originally appeared on Grandparents.com."}]