[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/a2g40w3eoy", "@type": "VideoObject", "duration": "PT1M", "name": "5549264863001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/0e4050b96b03f0cdf8df634ce5ec70f4a24e4ecc.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/a2g40w3eoy", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/19711ae74e33290279bb2cf8fe4ff1a1a1f2e5a7.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/evr_dg_how-to-keep-flies-off-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Shoo-Fly: How to Keep Flies Off Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/keep-flies-off-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/keep-flies-off-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Insect bites, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_how-to-keep-flies-off-dogs"}, "datePublished": "February 16, 2016", "dateModified": "August 30, 2022", "description": "There is something particularly annoying about a fly buzzing around your head while you are trying to relax outside on a beautiful day. Fortunately, there are ways to keep flies away from your dog for good.", "articleBody": "By Carol McCarthy There is something particularly annoying about a fly buzzing around your head while you are trying to relax outside on a beautiful day. Though we can swat these pesky pests away with a hand or a swatter, our dogs are often at their mercy, which can be both frustrating and potentially dangerous to your dog’s health. Fortunately, there are ways to keep flies away from your dog for good. Why do Flies Bite My Dog? Flies can be drawn to a dog’s coat, especially if it is matted or unclean as a result of an illness, skin condition, or diarrhea. “Diarrhea around the perineum attracts flies; they lay eggs, and the infestation happens,” said Dr. Virginia Sinnott, an emergency doctor at Angell Animal Medical Center in Boston. This type of infestation is preventable by keeping an ill dog clean and indoors, she said. Some flies, such as horse flies, can take a bite out of your dog’s ears, belly or backside which can hurt, bleed and become infected. Though these bites are certainly irritating to our pets, flies don’t present the same health risks to dogs that other insects do, Sinnott. “Mosquitos are worse, as they bring heartworm disease (especially in the South), which is fatal to dogs and cats.” Flies are particularly active during the day in hot weather, she added, so if they tend to bother your dog, make sure to keep her inside during those times. However, solving any medical issues that may predispose your dog to a fly infestation is most important. How Can I Keep Flies Off My Dog? Keeping your dog clean and healthy will go a long way in keeping flies at bay, but there are other steps you can take to get them off your dog’s back, literally. If flies are targeting a specific area on your dog, say his ears, try applying petroleum jelly to the area to keep them from biting. You can also consider at-home, pet-safe repellants, like a mixture of apple cider vinegar and water or lemon and water, or any number of over-the-counter insect repellants that are as safe for your dog as they are for you. Just be sure to talk to your vet before pursuing any of these remedies, either homemade or store-bought. Home Maintenance Tips for Fighting Flies Still, the best way to keep flies from pestering your pup is to keep them away from your dog’s environment. That means maintaining good hygiene in and around your home, said David Jones, owner of Biotech Pest Controls, an environmentally friendly pest control company in Westerly, R.I. Most flies are scavengers looking for a meal on which to lay eggs that become maggots and create a new generation of flies to start the cycle over, Jones said, so the best and most successful method of getting rid of flies is to remove their food source. Unfortunately, even in the most pristine of homes, an intruding animal (such as a mouse or bird) may die in the attic or cellar and provide a base for flies to reproduce, he added. However, there are some easy and basic steps you can take to keep a home free of flies. Jones recommends cleaning up all waste in your yard (including food or half-chewed dog bones), rinsing and cleaning garbage and recycling bins regularly and making sure your garbage cans don’t overflow. Be sure to also keep your dog’s outdoor food and water dishes clean. In addition to keeping good hygiene, consider other pet-safe steps you can take to get flies to buzz off, such as non-toxic insecticides. Using a spray with the active botanical ingredient Pyrethrum is potent and will quickly kill the various life stages of flies, Jones said. “Don’t be fooled by using products containing artificial Pyrethroids and remember any pesticide should be used judiciously and according to the label,” he added. In addition, there are several herbs  you can plant that not only repel flies but are great kitchen staples. These are basil, bay leaf, mint and rosemary. Other herbs that are nice for people and noxious to flies include lavender, sweet woodruff and tansy. “I think planting any herb or shrub that claims to deter insects can be helpful,” Jones said. “But their usefulness won’t replace the number one method of using hygiene, especially keeping your yard clean, your compost pile covered and pet food covered.” Your vigilance shouldn’t stop outdoors, either. Sinnott recommends keeping your house clean by clearing all food items off of counters and making sure your windows and doors have screens free of rips or holes."}]