[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "21 Longest-Living Dog Breeds That&#039;ll Be Your Longtime Companion", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/longest-living-dog-breeds.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/longest-living-dog-breeds.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/longest-living-dog-breeds"}, "datePublished": "January 4, 2023", "dateModified": "September 8, 2023", "description": "The oldest-living dog was an Australian Cattle Dog, but what are the dogs that live the longest in general? Here are 21 long-living dog breeds that will be a longtime companion.", "articleBody": "If you’re looking to add a new pup to your family, you may be wondering which dog lives the longest. Not all pups live for the same amount of time—there are certain factors that play into the lifespan of dogs, including size, breed, and lifestyle. If you’re looking for a fur baby that will stick around for a long time, we’ve rounded up 21 of the longest-living dog breeds.  How Long Do Dogs Live?  Typically, the smaller the breed, the longer their life expectancy. There are, however,  a few medium-size dogs that are known for their lengthy lifespan. In fact, the “oldest dog ever” award goes to Bobi, a Portuguese Rafeiro do Alentejo who&#039;s 30 years old and counting. Dogs that live the longest (mostly small breeds) can often reach their late teens or even early 20s, while extra-large breeds like Great Danes and Newfoundlands typically only live about 7-10 years. It’s not entirely clear why small dogs outlive larger breeds. But one theory is that common medical conditions dogs develop as they age are more difficult to manage in larger dogs, thus leading to euthanasia sooner. Longest-Living Dog Breeds  1. Chihuahua  Photo credit: iStock/Phanuwat YoksiriLife expectancy: 14-16 years Chihuahuas originated in Mexico and are the smallest dog breed in the world. These alert, lively, and sometimes sassy dogs love their pet parents deeply but can be reserved around strangers. The breed is tiny but hardy and is one of the healthiest dog breeds. That said, Chihuahuas can develop health issues, like heart disease and patellar luxation, throughout their long life. 2. Shih Tzu  Photo credit: iStock/HMVartLife expectancy: 10-18 years  Shih Tzus are affectionate, outgoing, and gentle companions. They enjoy playing with their pet parents and have a cheerful attitude, but they also love being lap dogs once playtime is over. Though they can live to reach their 18th birthday, Shih Tzus have a squished brachycephalic face that can cause some health concerns throughout their life, including breathing issues and overheating. 3. Yorkshire Terrier  Photo credit: iStock/STOWEN SETOLife expectancy: 11-15 years Affectionate, bold, and curious Yorkshire Terriers are always ready for an adventure, though they can be stubborn and aren’t shy about raising their voice. These tiny terriers are known to be a fairly healthy breed, but they are also prone to some health problems, such as patellar luxation and tracheal collapse. 4. Bichon Frise Photo credit: iStock/Lisa_NagorskayaLife expectancy: 14-15 years Though Bichon Frise are considered to be “hypoallergenic” dogs, no breed is 100% allergen-free. That said, these white furballs can be a good fit for some people with dog allergies. They are curious, peppy, and social dogs who love to play with their favorite toys, snuggle up on the couch with their family, and learn fun tricks. Although Bichon Frise can live well into their teens, this long-living dog breed is prone to conditions including diabetes mellitus, dental disease, and cataracts.  5. Shiba Inu  Photo credit: iStock/KAT_TAKALife expectancy: 13-16 years The Shiba Inu is an ancient breed, but these foxy-faced dogs are one of the internet’s most famous dogs (we’ve all seen the doge meme). As pets, Shiba Inu are alert, active, and intelligent. But they are also independent dogs who have strong opinions—and communicate them through their famous “Shiba scream,” a high-pitched noise somewhere between a squeal, whine, and cry. They are a relatively healthy breed, but Shibas can often suffer from skin allergies, ear allergies, and (like many small dogs) dental disease. 6. Australian Cattle Dog Photo credit: iStock/rdonarLife expectancy: 12-16 years As a medium-size breed, Australian Cattle Dogs boast an impressive lifespan. These smart and high-energy pups love being outdoors and having a job to do, whether that’s herding on a ranch or running an agility course. Australian Cattle Dogs are a hardy breed, but can develop progressive retinal atrophy and hip dysplasia as they age. 7. Miniature Pinscher Photo credit: iStock/andrea-goitiaLife expectancy: 12-16 years Affectionately called “Min Pins” by their pet parents, Miniature Pinschers are petite pups with a big spirit. Though they look like small-scale Doberman Pinschers, Min Pins are most likely created by crossing Dachshunds with Italian Greyhounds, according to the Miniature Pinscher Club of America. These little pups can be susceptible to a handful of health issues, including patellar luxation, hypothyroidism, progressive retinal atrophy, and heart defects.  8. Dachshund  Photo credit: iStock/Dmitry AndreevLife expectancy: 12-16 years Long-bodied Dachshunds get their nickname “wiener dogs” from their lengthy torso. But don’t let those short legs fool you—they are muscular, energetic, and were originally bred to be badger hunters. Pet parents need to pay extra attention to these dogs’ backs, as Dachshunds can injure themselves as they get older or develop intervertebral disc disease (IVDD). 9. Maltese Photo credit: iStock/mixettoLife expectancy: 12-15 years Like the Bichon Frise, Maltese are small, white, long-life dogs that are considered “hypoallergenic.” These stylish dogs have long, silky coats that need daily upkeep to stay free of tangles. But the good news is Maltese are fairly healthy pups, so pet parents can focus more energy on grooming than managing any medical conditions. That said, Maltese can experience luxating patellas, liver shunts, and heart defects.  10. Miniature Schnauzer  Photo credit: iStock/FeverstockphotoLife expectancy: 12-15 years Miniature Schnauzers are bearded cuties. Minis are the smallest cousins of the Standard Schnauzer and Giant Schnauzer, and they’re the dog that lives the longest of the three. From going on walks around the neighborhood to indoor snuggle time, Miniature Schnauzers make great family pets. These small dogs will need help sticking to a healthy weight to avoid obesity, and diabetes mellitus. They can also develop skin conditions such as Schnauzer comedo syndrome and pancreatitis. 11. Affenpinscher Photo credit: iStock/Kyle ReynoldsLife expectancy: 12-15 years See an Affenpinscher on the street, and you’re sure to do a double take. With their flat face, long eyebrows, and striking beard, these long-living dogs look a bit like little monkeys. But unlike tropical primates, Affenpinschers need to be kept out of the heat because of their brachycephalic faces, which makes them susceptible to overheating and other breathing issues. 12. Australian Shepherd  Photo credit: iStock/KsuksaLife expectancy: 12-15 years Another medium-size dog, Australian Shepherds can live just as long as many toy breeds. These super-smart herders are hardworking and active, so they need a home that can provide the mental and physical stimulation they crave to be happy. Australian Shepherds are athletic and tend to be healthy, but they can have issues with hip dysplasia, cataracts, and epilepsy throughout their life. 13. Parson Russell Terrier Photo credit: iStock/ObradovicLife expectancy: 13-15 years Parson Russell Terriers, commonly called Jack Russell Terriers, are smart, friendly, and very, very energetic. Bringing home a Parson pup means you’ll be spending time on hiking trails, navigating agility courses, and competing in flyball and nose work competitions. Because these dogs are so active, they can develop conditions including patellar luxation and arthritis. 14. Russell Terrier   Photo credit: iStock/EvrymmntLife expectancy: 12-14 years Russell Terriers look a lot like their Parson Russell Terrier cousins, but they’re a bit smaller and have shorter legs. But those short legs don’t hold them back—Russell Terriers are every bit as active as their Jack Russell relatives. These long-living dogs can also develop patellar luxation and arthritis, but are typically very healthy.  15. Toy Poodle Photo credit: iStock/ozgurcankayaLife expectancy: 10-18 years Toy Poodles are the smallest of the three Poodle sizes (the other two being the Standard and Miniature Poodle), and therefore the dogs with the longest lifespan. Though small, Toy Poodles have a big personality and an even bigger brain—they are so smart that basic training and complicated tricks can be taught relatively easily. Despite their extra-long lifespan, Toy Poodles can experience common small-dog health issues like eye issues, dental disease, Legg-Calvé-Perthes disease, and luxating patellas. 16. Beagle Photo credit: iStock/sankaiLife expectancy: 10-15 years Curious and friendly Beagles love to be outside. But when you take them out for an adventure, these hounds need to stay on a leash or within a fenced-in yard because their high prey drive (developed from years of being bred for hunting) means they might dart off after a neighborhood squirrel. Beagles are prone to a few health conditions, including ear infections, so it’s important that pet parents keep their dogs’ floppy ears clean. 17. Lhasa Apso  Photo credit: iStock/CapuskiLife expectancy: 12-15 years Lhasa Apsos look like adorable little mops because their long, silky fur drapes over their entire body to the floor. Originally bred to work as watch dogs at Tibetan monasteries and palaces, these pups are now perfectly content to be your lap dog. Lhasa Apsos can have quite a few eye conditions, however, including cataracts, glaucoma, dry eye, and progressive retinal atrophy. 18. Cavalier King Charles Spaniel  Photo credit: iStock/TempuraLife expectancy: 12-18 years Cavalier King Charles Spaniels are smart and calm dogs that fit right into most families. They’re great with kids and other pets, their exercise needs are met with a couple of 20-minute walks every day, and they are easy to train. But Cavs can be prone to several health conditions, including heart disease, hip dysplasia, cherry eye, dry eye, and cataracts. 19. Papillon   Photo credit: iStock/FaST_9Life expectancy: 14-16 years “Papillon” is French for “butterfly,” and these pretty dogs get their name from their wispy ear fur that resembles a butterfly’s wings. But Papillons are more than a pretty face—these small dogs are energetic and eager to please the humans they love, which makes them a joy to train. Though Papillons are a healthy dog breed, pet parents should keep an eye out for dental disease and luxating patellas. 20. Chinese Crested  Photo credit: iStock/Ekaterina GorokhovaLife expectancy: 13-18 years Chinese Cresteds are one of the most unique-looking (and longest-living) dog breeds around. Their tiny frames are almost completely hairless, though they typically have long, silky locks on top of their head, on their paws, and on their tails. There are also “powderpuff” Chinese Cresteds, born with hair all over. Chinese Crested dogs have been known to live into their 20s, but can develop eye problems, dental disease, and Leggs-Calvé-Perthes disease, among other ailments. 21. Pomeranian   Photo credit: iStock/romasetLife expectancy: 12-16 years Pomeranians are spunky little fluff balls. They’re happy to learn new tricks and play games with their pet parents well into their teenage years, but they are prone to a number of health issues—hypoglycemia, collapsing trachea, dental disease, and eye problems, to name a few. When you bring home a Pomeranian puppy, it might be worth investing in pet insurance. Featured Image: iStock/spkphotostock"}]