[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is Exercise Safe for Pets with Cancer?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-pets-cancer-exercise.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-pets-cancer-exercise.jpg"}, "author": {"@type": "Person", "name": "Chris Pinard", "url": "https://www.petmd.com/author/dr-chris-pinard"}, "keywords": "Dog, Exercise, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/exercise-safe-pets-cancer"}, "datePublished": "January 2, 2018", "dateModified": "August 30, 2022", "description": "Hearing that your beloved companion has been diagnosed with cancer is difficult. Among the many questions that pet owners frequently ask is how much they should exercise their pet after a diagnosis of cancer. Learn more about exercise as it pertains to pets with cancer on petMD.", "articleBody": "By Chris Pinard, DVM Hearing that your beloved companion has been diagnosed with cancer is difficult. It is sometimes hard for clinicians to ensure pet parents aren’t overwhelmed by the vast amount of treatment options, treatment avenues, survival times, and other pieces of information that go forward with cancer management and at-home care. Among the many questions that pet owners frequently ask is how much they should exercise their pet after a diagnosis of cancer. Let’s look at exercise as it pertains to pets with cancer, as well as recognizing pain to better direct conversations with your veterinarian. Does Exercise Prevent Cancer in Dogs and Cats? Human medical literature has highlighted a correlation between exercise and frequency of cancers, such as colorectal, breast, and endometrial cancers. There is no current veterinary literature published that has established a causal relationship between exercise and prevention of cancer. However, exercise in general contributes to your pet’s overall health and should be incorporated in their daily routine. Should I Continue to Walk My Pet? Our main goal as veterinarians, and especially in cancer care for pets, is to always provide the best quality of life for as long as possible. Playing fetch, riding in the car, and going for a walk are still important ways to contribute to your pet’s overall health and quality of life. It is rare that veterinarians ask pet parents to restrict activity after a diagnosis of cancer, however, some exceptions apply: 1. Bone Cancer (Osteosarcoma) Osteosarcoma is a cancer of the cells that make up and break down bone. It is much more common in large-breed dogs and can affect dogs as young as 1 to 2 years of age, or as old as 9 to 10 years of age. This particular cancer causes destruction of the normal bone architecture, thereby making fracture possible. Depending on the location, treatment is usually achieved with amputation or limb-sparing procedures as well as following up with chemotherapy. However, in the interim, veterinarians generally ask that pet parents restrict excessive or strenuous activity until surgery, reducing the risk of fracture. Depending on the degree of damage to the bone, it is possible that a pet can do the slightest movement (e.g., stepping off a curb) which may cause fracture. This is very painful and requires immediate care until surgery can be performed. However, once the primary tumor has been removed (i.e., via amputation), the main source of pain for your pet has been removed. 2. Tumors Affecting the Heart (Chemodectoma, Hemangiosarcoma) There are plenty of tumors that may affect the heart, the most common of which are either a chemodectoma or hemangiosarcoma. Tumors affecting the heart can impede on the heart’s ability to pump blood forward, resulting in a “backup” of flow. This can result in significant exercise intolerance, therefore, over-exercise or strenuous activity may predispose pets with heart-based masses to heart-related complications. 3. Tumors Affecting the Lungs or Chest Cavity (Primary Lung Tumors, Metastatic Lesions, Thymoma) Once again, there are a many types of tumors that may affect the lungs or chest cavity. This can cause signs of coughing, decreased exercise tolerance, discomfort when laying in certain positions, and increased respiratory rate or effort. Many animals presenting for lung tumors or even those with evidence of metastatic disease (tumor spread) from a primary tumor may only show very mild signs and may appear otherwise unaffected. Still, caution should be taken before excessive or strenuous exercise is attempted. In many of these cases, patients should dictate their own exercise. The following are potential signs that your pet may be tired or may need to return home during a walk: Reluctance to move or walk forwardExcessive panting, coughing, or gaggingSlower-than-normal pacePulling of the leash in the opposite directionIf any of these signs are noted, it might be time to return home with your companion. Always be cautious of weather conditions and how that may affect your pet’s normal walk as well. It should be noted that after a major surgical procedure or treatment, your pet’s energy level might be lower than normal. Shorter-than-normal walks should be attempted with gradual increases in walking distance and pace to match your pet’s energy level. Is There Anything Else You Can Do? Rehabilitation is commonly used in pets with cancer as well as many other diseases, such as degenerative joint disease or arthritis, to alleviate pain and assist with mobility. Many patients diagnosed with cancer are notably older animals and thus rehabilitation becomes inherently important in management and care. This is particularly true of animals diagnosed with osteosarcoma that have a limb amputation performed. Veterinarians commonly state “dogs were born with three legs and a spare” because many animals continue to do very well after amputation of the forelimb or pelvic limb. There are animals, however, who do suffer from some form of degenerative joint disease, arthritis, or other mobility issues but are still deemed as appropriate candidates for amputation. Physical rehabilitation after surgery is therefore recommended and commonly pursued post-operatively. Physical rehabilitation, as in people, has the added benefits of assisting with range of motion and building muscle tone to deal with a change in your pet’s conformation. This should be discussed with your veterinarian and typically, you will be referred to a rehabilitation specialist who will provide you with at-home and in-clinic exercises that can benefit your pet’s overall health. Recognizing Pain in Dogs and Cats Pain recognition, especially in dogs and cats, can be particularly difficult not only for veterinarians but for pet parents as well. The following are potential signs that your pet could be in pain or discomfort related to their particular cancer:            PacingExcessive pantingDroolingDiscomfort/restlessnessVocalizationAggressive behavior/abnormal behaviorDecreased or lack of appetiteLethargyThese signs can be very vague and non-specific or even related to other concomitant conditions. Decreased appetite, lack of appetite, or excessive drooling, for example, could be attributed to pain in pets with oral/mouth cancers. In patients with cancers affecting the limbs, spine, or tumors that restrict movement can cause your pet to become restless since they can’t quite get comfortable, or become more aggressive due to anticipated pain if someone were to attempt to touch the affected area. How Do We Treat Pain? The first step is recognizing it. Once you’ve recognized pain or believe your animal is in pain pre- or post-diagnosis, it is important to have a discussion with your veterinarian about pain management options. This could be as simple as exercises mentioned above from a rehab specialist, or could include medications such as non-steroidal anti-inflammatories, opiates and their derivatives, or other medications. Your animal should never take over-the-counter pain medications and instead, you should always direct any questions to your veterinarian. "}]