[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/4fke0bsb3y", "@type": "VideoObject", "duration": "PT1M54S", "name": "5327099955001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/8ef5fd37c17b0c00d6645da92d11c0a8c19603f8.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/4fke0bsb3y", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/cd4769307414a9c496718e58d579f30081502e11.m3u8", "transcript": "Some of the products we use to improve our environment, such as cleaners or chemical air fresheners can pose serious dangers to our animal friends. And while odor eliminating room sprays plugins candles and oils do help curb unpleasant odors. Pet parents should be aware of the risks they pose who are four legged family members. The main offenders in air fresheners are volatile organic compounds or voces.\n\nThese are organic chemicals that have a high vapor pressure at room temperature due to a low boiling point. This causes these compounds to easily evaporate from a solid or liquid into the air. This transformation is called volatility. In other words volatility is just what air fresheners are meant to do.\n\nBreakdown from one form and dissipate into the air thereby changing it sent signs and symptoms of air freshener toxicity may be immediately apparent or reveal themselves a few hours or even days after use a pet might cough sneeze have a runny nose or suffer from vomiting, diarrhea lethargy or even lack of appetite. These dangers don't come from breathing the air alone. The symptoms are more often the result of a pet licking an area where the substance was sprayed or by ingesting the air freshener directly ingestion of air fresheners can cause gastrointestinal issues as well as neurological problems like agitation weakness on steadiness and even tremors in both dogs and cats.\n\nIf you think your pet may have ingested any of these products call or visit your vet Marion immediately, based on the ingredients of the product your vet Marion will be able to prescribe the appropriate treatment protocol. If you do want to deal to raise your room. Natural products such as baking soda and apple cider vinegar can help absorb and get rid of unwanted smells when it comes to a 100% safe way to clear the air the best option is ventilation. Opening a window to allow fresh air to enter and smelly odors to leave is truly the only safe way to eliminate odors without risking your pets health and safety.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/air-fresheners-and-pets?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Air Fresheners Can Affect Your Pet&#039;s Health", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog-laying-in-front-of-air-freshener.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog-laying-in-front-of-air-freshener.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Respiratory health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/air-fresheners-and-pets"}, "datePublished": "April 29, 2016", "dateModified": "August 30, 2022", "description": "Are air fresheners safe for pets? Some of the things we do to improve our environment can pose serious dangers to our animal friends, whether furry, feathered, or scaled. Do pet owners need to throw away sprays, plug-ins, candles, and solids? Learn more about the dangers to pets from scented products.", "articleBody": "Reviewed and updated for accuracy on May 28, 2020 by Jennifer Coates, DVM As parents and caregivers, one of the earliest lessons we learn is the concept of “baby-proofing”—keeping toxic substances and dangerous situations well out of the way of our children. As pet parents, we need to do the same. But unlike children, instead of this being a temporary obligation, it’s something we’ll need to do throughout the lives of our pets. Some of the things we do to improve our environment, such as cleaning or using chemical air fresheners, can pose dangers to our animal friends, whether furry, feathered, or scaled. So, do pet owners need to forever do away with their room sprays, plug-ins, candles, oils, and solids? That’s a question that’s not so easily answered. However, there are some ways to play it safe when using these products in the home. “If we are putting some kind of chemical into the air merely to mask scents, then we have to be concerned about the negative implications for our pets,” says holistic veterinarian Dr. Patrick Mahaney of California. Sadly, some forms of air fresheners can be quite toxic, especially to animals (and children!) who might ingest the substances or not have the wherewithal to avoid parts of the home where they’ve been used. The Ingredients That Makes Air Fresheners Dangerous for Pets According to Dr. Mahaney, one of the main offenders in the ingredient list for most air fresheners are volatile organic compounds (VOC). VOCs are organic chemicals that have a high vapor pressure at room temperature. This causes these compounds to easily turn into gasses or vapors from a solid or liquid form. This transformation is called volatility. In other words, volatility is just how air fresheners are meant to behave: dissipate into the air, thereby changing its scent. Unfortunately, this is the same volatility that occurs in paints and varnishes, fossil fuels, benzene, formaldehyde, refrigerants, aerosol propellants, cigarette smoke, and the dry-cleaning process. You wouldn’t open a can of paint in your living room to improve the quality of the air, but this isn’t too far removed from what happens when you break out an air freshener. These substances can cause a laundry list of maladies. According to the Environmental Protection Agency, the health effects of VOCs may include: Eye, nose and throat irritation headaches, loss of coordination, lethargy and nausea damage to liver, kidney and central nervous system Some VOCs can cause cancer in animals; some are suspected or known to cause cancer in humans. And in a study published in the Environmental Impact Assessment Review, testing of top selling air fresheners and laundry detergents “found 133 different VOCs emitted from the 25 products, with an average of 17 VOCs per product. Of these 133 VOCs, 24 are classified as toxic or hazardous under U.S. federal laws, and each product emitted at least one of these compounds. For “green” products, emissions of these compounds were not significantly different from the other products.” Natural Alternatives to Air Fresheners: Are Essential Oils Safer? For the air freshener industry, the latest catch phrase is “essential oils.” Despite this natural-sounding name, these products are by no means entirely safe. Essential oils are also defined as volatile, and while these substances are extracted from flowers, bark, berries, roots, seeds, and woods, and do have some potential medicinal and positive effects, they can still be very toxic to people and animals, particularly when they are used improperly. “Essential oils, which are included in many air freshener products, can be very toxic, especially to cats. If you simply have to have essential oils in the home, make sure they are kept in a location where your pets cannot come into direct contact with them,” says veterinarian Dr. Jennifer Coates of Fort Collins, Colorado. “Also, birds are more sensitive to potential airborne toxins than are other animals, so I generally recommend a ‘better safe than sorry’ approach with the use of air fresheners around them.” When it comes to using these products around our pets, a little information is your best defense. “Read the instructions on the side of the bottle and be sure you are spraying the recommended amount,” says Dr. Mahaney. “When you walk into a room that’s been heavily sprayed with air freshener, what does it do to your eyes and lungs? If it’s doing that to you, it’s also going to do that [or worse] to your pets.” Signs of a Toxic Reaction to Air Fresheners in Pets According to Dr. Mahaney, the negative effects of air fresheners may appear immediately or within a few hours or days after use. When you first use them, a pet might immediately withdraw from the area or cower. A pet might cough, sneeze, produce discharge from the eyes and/or nose, or suffer from vomiting, diarrhea, lethargy, or lack of appetite. Long term effects are also possible. Dr. Mahaney says “Cats have had an increase in feline asthma as a result of living in households where there are air fresheners, incense and cigarette smoke—or even just the aroma of cleaning products.” However, these dangers don’t come from the air alone. They can also be caused by contamination from where air fresheners fall – where a pet might step, roll, or lick – or from products such as carpet shampoos and cleaners that are specifically made for surfaces. “If you’re going to spray something that’s going to leave an aroma, I suggest that you don’t give your pets access to it,” says Dr. Mahaney. “If you’re cleaning, you don’t want to leave a significant residue—they could walk across it and potentially lick it off their paws.” What to Do if Your Pet Eats an Air Freshener Ingesting an air freshener can be even more dangerous than simply breathing it in. Any long-term usage products, such as solid or plug-in air fresheners, need to be closely monitored, and extra care needs to be taken when you dispose of them. If your pet is inclined to go through the trash, you might want to dispose of spent air fresheners directly in an outside trash receptacle. “If an animal ingests an air freshener, I worry primarily about its effect on the gastrointestinal system,” says Dr. Coates. “The active ingredients and/or the packaging could cause vomiting, diarrhea, etc. Systemic effects are also possible depending on the chemicals and amounts involved.”  And that is not confined to chemically scented products. “Essential oils can not only affect the GI tract, but they also are associated with neurological problems like agitation, weakness, unsteadiness, and tremors in dogs—and especially in cats.” “Anything with a fibrous nature to it can cause digestive distress, and some products may be absorbed through the small intestine and get into the blood,” explains Dr. Mahaney. So, how do you know if the products you use around your home are relatively safe? Dr. Mahaney recommends doing some research on the ASPCA’s Poison Control Center Website. This resource covers all sorts of toxins that your pet might encounter, from air fresheners, cleaning products, human and pet medications, foods, plants, and other substances. In case of a poisoning emergency, there is a 24-hour hotline at (888) 426-4435, although a $65 consultation fee might be required. And in the case of a true emergency, make sure to get your pet to a veterinarian as quickly as possible. By David F. Kramer Featured Image: iStock.com/Smikey26"}]