[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Motherly Love 2.0", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_maternal_instinct"}, "datePublished": "May 5, 2009", "dateModified": "August 30, 2022", "description": "A stray dog caring for young human babies. A mother tiger taking orphaned piglets as her own. Do animals have as strong of a maternal instinct as humans? Perhaps it&#039;s even stronger.", "articleBody": "Your Pet is More Evolved Than You Know  It is taken for granted that mammalian mothers have an inherent maternal instinct that guides them in caring for their offspring. With humans, the instinct is not limited by genetic relationships. Humans adopt other humans all the time. Nor do we limit ourselves to the adoption of people, we also adopt animals, trees, even roads. The reason behind why we behave this way is assumed to be rooted in the instinct to commit acts of altruism -- unselfish care for others of our kind, which is further assumed to be rooted in the primitive instinct for survival and the furtherance of our own species. Blind primitive instinct alone would explain stories like Speckles, the Jack Russell terrier from Dillsboro, Indiana that lost her own puppy to stillbirth in March. She was disconsolate until four orphaned puppies were brought to her for care, taking happily to the role of adoptive mother. Evidence such as this suggests that blind instinct would lead a mother animal to care for a member of her own species, based on the genetic codes that guide us to further our species. This is, in fact, what Charles Darwin once believed. Humans, the rational mammals, are assumed to have further reaching principals in mind when they help others, going beyond the mere instinct to create more of ourselves. We help others out of a sense of &quot;goodness,&quot; as it were. People who help people -- or animals, or the environment, for that matter --  are more likely to receive help when they need it as well. This can be thought of as an expectation of reciprocal altruism, and it is taken for granted that this is a behavioral phenomenon that is appreciated by humans alone, because we can consider the future consequences of our actions. But is this way of thinking outdated? Charles Darwin&#039;s theory that animals should behave in a way that would ensure their own individual survival was turned on its head when he realized that interspecies altruism was common and was occurring amongst the unlikeliest of animal species. Even today, we are often astonished by the ability of seemingly feral animals to cross the divide to care for a member of another species, despite the fact animals have been demonstrating for thousands of years their ability to be altruistic. A Mother to All Take for example two cases where dogs have taken human infants into their own litter of pups, saving the lives of the babies in the process. In 2005, a stray dog in Nairobi, Kenya was credited for carrying an abandoned infant from the forest to her litter of puppies, where she kept the baby safe until its cries led it to be discovered by other humans. And in the countryside of Argentina, a dog found an abandoned newborn (human) and carried the child back to her own newborn litter of puppies, where she kept the infant warm until being found by a man living nearby. These types of stories receive a great deal of attention because of their effect on our own species. One might assume that dogs naturally help us because we help them. But less publicized common acts of interspecies maternal altruism occur all the time, all over the world (and the maternal caregiver is not always female!). Dogs have been spotted with their adopted monkeys, in some cases nursing them through infancy and remaining companions. In Varanasi, India, a Pomeranian named Guddi adopted an infant monkey that had been found near death by the river in 2006; in northern India, a stray dog adopted a monkey that had been maimed in an accident, nursing it to health -- the two have remained companions -- and in Ciai, Africa, a male dog adopted a monkey after the floods of 2002 left them both homeless and alone.  In other cases, both pigs and dogs have been known to adopt each others orphans. In one case, a mother tiger has even taken piglets as her own. In the mountain village of Peretina, Greece, a mother pig added four abandoned puppies to her own litter, feeding and caring for them as though they were her own. In Chongqing, China, a mother dog, despondent after losing her whole litter of pups to stillbirth, disappeared from home one day, only to return with a piglet, which she took to caring for as her own. A Papillon in Seattle, Washington insisted on including an injured and orphaned squirrel to her newborn litter, and a Chihuahua in Lake City, Florida adopted and nursed an entire litter of four newborn squirrels that had survived a downed tree branch. Some dog breeds, going against type, will prove their altruistic natures. Pit Bulls, one named Ramona in Boston, Massachusetts, and Gabi in Kalikino, Russia were reported to be new mothers to orphaned kittens. Cats, too, will veer out of type. Proving that they are not always the snooty self absorbed creatures they are portrayed to be, a homeless mother cat in Savannah, Georgia adopted an abandoned newborn Labrador Retriever, of her own volition, when it was brought to the Humane Society for veterinary nursing care. Behaviorists are hard-pressed to explain why some animals will exhibit seemingly altruistic behavior towards members of different species. We know that humans can see the wider view; that in taking care of other species we are contributing to the health of the planet, and to our own health, as it has been shown that good deeds improve one&#039;s outlook, leading to more cheer and a healthier immune system in response. Perhaps animals cannot consider the long term effects of their good deeds, nor whether they will receive a direct reward for their affection and sacrifice, but there may be a deeper primitive instinct that tells all creatures that giving of ourselves to those that are in need will bring us contentment and health. Even if &quot;we&quot; don&#039;t know these things because a scientist has told us it is so, we know these things because we feel them. And that, when it comes down to it, is what the mothering instinct is all about. Image: Katie Brady / via Flickr"}]