[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/cy54qeu4tn", "@type": "VideoObject", "duration": "PT1M56S", "name": "5370186481001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/48060cc6f5aef62a71791b0fa8a431d9368cf69a.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/cy54qeu4tn", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/c04416564b579c65963d16e68af3fcb65749ca70.m3u8", "transcript": "My name is Joey. I work in animal welfare. And this is Mervyn the Chihuahua. He is a rescue that came from the ASPCA in New York City.\n\nHe had both of his back legs repaired. But now he's as good as new And quite popular on Instagram. We really had to transform our lifestyle to revolve around the dogs. So anytime we decorate or do anything.\n\nIt's about functionality that's our priority. Making sure that they're comfortable. But at the same time, making sure that they're not going to destroy our couch. So that's why as you can see, we have sheets on the couch space in New York City is huge.\n\nAnd our dogs don't give us a lot of space. They always want to be on top of us. So we have dog beds in the living room in the bedroom and we bought a high bed frame so that we can stick their crates in their beds underneath and we created a really cool den my cave space for them. So that they have a safe space.\n\nBut it's also kind of out of the way. Mervyn is completely fearless. We actually had to get stairs because he was trying to jump off the bed and he's actually the only one who used the rest of the doctor all afraid of him. We had some dog decor in our apartment some as specific to our pets some as just specific to animals and dogs.\n\nWe have a really cool piece of artwork that a fan made. And it's a collage of all five of our dogs, which is really great. We look at it every day because I bring Jack and Mervyn with me so many places when we're going to work or somewhere far. I stick them in the spaceship.\n\nI wrapped him in a blanket and they're good to go. Today we had a little photo shoot with Mervyn and he was wearing just a bunch of the different outfits he had on some hoodies he had on some lounge where he had on his fake fur lined coat that you like square outside, which is really, really cool. He probably has a bigger order than I do actually. That's what it's all about.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/dog-braces-everything-you-need-know?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Braces: Everything You Need to Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-braces.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-braces.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Dental health, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/dog-braces-everything-you-need-know"}, "datePublished": "April 5, 2016", "dateModified": "August 30, 2022", "description": "Dog braces are used by veterinary orthodontists to make a dog&#039;s bit more comfortable. Learn more about how and when dog braces are used and how to care for a dog with braces.", "articleBody": "By Helen Anne Travis Since the 1980s, veterinary dentists have used braces and other orthodontic appliances to treat dogs with painful and potentially dangerous dental issues. Many of the tools and devices are borrowed from human orthodontics, but the goal is completely different. “We’re not doing this for aesthetics,” says Dr. Donnell Hansen, a veterinary dentist and oral surgeon at BluePearl Veterinary Partners in Minnesota. “We’re doing this for a healthier and more comfortable bite.” Applying braces to a dog is not a task taken on lightly, she explains. The pet has to be healthy enough to undergo anesthesia, and compliant enough to tolerate repeated pokings and proddings. Owners also have to be up to the task of maintaining and cleaning their pet’s mouth throughout the treatment process. “It’s usually not the only option,” says Dr. Dan Carmichael, a veterinary dentist at Animal Medical Center in New York City. ”But in some cases, it is the best option.” Health Issues That Require Dog Braces Braces can help dogs who are dealing with everything from crowded teeth to cancer. One of the most common issues they’re used to address is a condition called linguoversion, when the teeth are pushed back towards the tongue. When the linguoversion occurs on the lower teeth, breeders call this “base narrow.” In this position, the teeth may rub against the roof of the dog’s mouth. At best, this can cause major discomfort. At worst, the teeth could poke holes in the roof of the mouth, leading to chronic and serious sinus infections. Other issues that can cause problems include an overbite, when the lower jaw is shorter than the top, and lance teeth, when the upper canines point out rather than down. Braces may also be used when the dog’s baby teeth fail to fall out properly. As the adult teeth come in, the mouth becomes increasingly crowded, leading to a greater risk of infections. In more extreme cases, braces may also be applied after part of the jaw has been removed for cancer treatment. This helps minimize tooth drift. It’s the veterinarian’s job to determine whether the dog’s teeth are just crooked, or crooked and causing problems. They will not apply braces for cosmetic reasons. “Our end treatment goals are not to get the mouth perfect, but to get the mouth healthy and functional,” says Carmichael. Diagnosing When a Dog Needs Braces Most diagnoses for dog braces occur when the animal is young. Typically any problems can be spotted when the dog’s permanent teeth come in around age four to six months. Some puppies show no signs of mouth discomfort. Others may appear a little head shy. Depending on the condition of the mouth, there are several options for moving the teeth into a less painful position. In minor cases this may be accomplished with what Carmichael calls “rubber ball therapy.” Dog owners are taught how to position a lacrosse ball in their pet’s mouth; the pressure can help move the teeth into a more desired location. It’s the cheapest and least risky option, but it requires a very cooperative dog and a very patient owner. Other treatment options include extracting or filing down the problem teeth. These instant fixes are often cheaper than braces, but they’re not without their risks. Shortening the teeth requires annual checkups and potential future adjustments. Extraction is a complicated and sometimes painful oral surgery.  To ensure the dog is a good candidate for orthodontia, doctors will examine the pet and make sure he’s healthy enough to undergo anesthesia. The process could require multiple rounds, depending on the teeth’s progress. While the dog’s under anesthesia, doctors usually perform any necessary x-rays and cleanings. Applying the braces takes anywhere from 30 to 90 minutes. Dog braces come in a variety of shapes and sizes. There’s even an Invisalign of sorts called PetAlign. Unlike Invisalign, the goal isn’t to look good during treatment. With PetAlign, doctors can make a model of a sedated animal’s teeth and develop a series of aligners that can be switched out without additional rounds of anesthesia.   No matter what appliances are used, moving dog teeth is a relatively quick process. Depending on the condition of the mouth, dogs often only wear their braces for a few weeks or a few months. Caring for a Dog With Braces During their pet’s treatment, owners have to brush around the apparatus and flush the mouth with oral antiseptic. In some cases the pet may have to be switched to soft foods. Chew toys and bones are off-limits. Unlike humans, once the dog’s teeth are in place no retainer is needed. The dog’s mouth serves as a natural retainer, says Hansen. If the dog is healthy enough for anesthesia, the biggest downsides of dog braces are the cost and time. Cost of Braces for Dogs Depending on the condition of the teeth and how many rounds of anesthesia are needed, dog braces could run between $1,500 and $4,000. Owners will need to bring their dog in for weekly or biweekly visits throughout the process. “I think it almost sounds silly, but surprisingly it’s a very valid treatment option,” says Carmichael. “It’s a lot quicker and simpler than most folks would imagine, and in most cases the success rate is excellent.” See Also Image: Paul Matthew Photography via Shutterstock"}]