[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tips for Traveling with a Small Animal", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/papillon%20puppy%20in%20suitcase_260673302.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/papillon%20puppy%20in%20suitcase_260673302.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_small_animal_travel"}, "datePublished": "June 8, 2009", "dateModified": "August 30, 2022", "description": "Getting away from it all is great, and often we want to travel with all our family, including our pets. Here are five tips to ensure your pet&#039;s safe and comfortable during its trip (hopefully somewhere tropical!)", "articleBody": "Pack Your Bags and Remember the Dog — or Cat Getting away from it all — AKA a vacation — is great. So much so that we often want to travel with all of our family members, including our pets. Here are five tips to ensure your pet is safe and comfortable during the trip (hopefully somewhere tropical!). 1. If you’re driving, make sure you buckle the pet carrier securely into the backseat of the car. Don’t let animals, especially cats, roam around a car freely — that’s just an accident waiting to happen. 2. With small pets, make sure they’re secure during transport. This means keeping them away from the windows and locking the doors. We wouldn&#039;t want Fido or Kitty to get hurt trying to jump out of a moving car. Safety is important at your final destination, too. Whether a cottage, condo, or beach house, you don&#039;t want your pet running amok indoors. This should be a vacation for your pet, not an obstacle course. 3. If you&#039;re lucky enough to own a cat, you know most felines aren’t really into the traveling thing. They like their own territory and tend to want to stay and lord it over, even if no one’s home. So, if you want to take your cat with you, make sure you have a snug carrying case (small spaces make kitties feel safe). Bring along favorite toys and blankets so your kitty will always have a familiar smelling place to go to. In fact, this goes for any pet, especially little dogs with nervous temperaments. 4. Whether cat, dog, or hamster, make sure you choose a solid carry case for transport. Those fancy soft ones might be all the rage on the Paris runways this season, but they’re not very practical if you have to put your pet into the back seat of the car, on a train, or on a plane. The plastic carriers offer more protection than the material ones. 5. Bring sufficient pet food. You may not be able to find your pet’s favorite yummies where you’re going, so stock up and don&#039;t let him or her go hungry. Pretzels and potato chips are not a good food substitute. So there you have it. With these helpful pointers, you&#039;ll be sipping on piña coladas by the beach or slaloming down the powder-white mountainside in no time. Best of all, your furry friend will be happy, too. Enjoy! Image: Malivan_Iuliia / Shutterstock"}]