[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Get Rid of Dog Smell Without Removing the Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dogbath2.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dogbath2.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Grooming", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_how_to_remove_the_smell_of_dog_without_removing_the_dog"}, "datePublished": "July 1, 2011", "dateModified": "August 30, 2022", "description": "Cuddling with our pets often means our house &amp; furniture begin to smell like them. Learn how to get rid of dog smell and remove pet odor from carpet on petMD.", "articleBody": "We are a nation of people who love to cuddle with our pets. It is undeniable. Long gone are the days when out pets were simply working companions whose place was at the hearth - and that was if they were allowed in the house. Now, they not only cuddle with us on the sofa to watch TV, they snuggle with us in our beds, go on long holiday trips in the car, even out to dinner at out favorite cafés. All of this one-on-one time means that all of our furnishings are going to hold the distinct smell of dog, and even the most rabid of dog lovers amongst us may not want the whole house to smell of a dog that needs a good washing – not if we want to enjoy the company of human guests. So how do you get rid of that smelly dog smell? We’re happy to tell you that it’s relatively easy. How to Eliminate Dog Odor Start off by taking all of the furniture apart – pillows, blankets and the like – and vacuuming everything thoroughly. If the sofa and chairs have removable slipcovers or cushion covers, take those off for washing (details later). Get into the crevices of the furniture as deep as possible to remove all the hair, and flip the bed mattress to get both sides. On the floors, make sure to get under all of the furniture and in the corners, where “hair bunnies” tend to gather. How to Remove Pet Odor from Carpets and Furniture Next, gather your deodorizing supplies to work on removing pet odor from carpets, furniture, and beds. It’s simple; all you need is a big box or two of baking soda and a bottle of apple cider vinegar. Wash all of your linens, blankets and cushion covers in a mix of oxy powered laundry detergent and a ¼ cup of apple cider vinegar. There are also pet odor removers available at pet supply stores, but generally speaking, they are not much more effective than the home remedies. On the carpets, bed and furniture, sprinkle baking soda liberally, using a cleaning brush to spread it around and into the fabric. Let it all sit overnight so that the baking soda has a chance to absorb the odors. For the bed, you might want to do this in the morning so that you can clean and remake the bed at the end of the day. Follow up by vacuuming all of the baking soda from the bed, carpet and furnishings and returning the bed linens and cushion covers or slipcovers to the furniture. This will get rid of a great deal of the smell, but to really do a thorough job, you might want to rent a carpet cleaning machine with an attachment for furniture – or call a cleaning company to do it for you. Always start with neutralizing as much of the smell as possible before the shampooing, though, or all you will be doing is creating a hybrid of dog smell and perfumed shampoo. Not a good combination. And don’t use carpet shampoo on the furniture, or you could end up with ruined and smelly furniture. Finally, if you do want to use a perfumed product to help neutralize the smell, make sure that it is non-toxic to animals. Many products that are safe for humans are not always safe for dogs. Some home air fresheners – sprays, plug-ins and scented oils – can be harmful to a pet’s health, so when in doubt, just stick with the tried and true baking soda solution.  Image: Daveejay / via Flickr"}]