[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Thank You, Annie ... A Letter from an Old Furry Friend", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/3655343879_c3dfc276be.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/3655343879_c3dfc276be.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_letter_from_annie"}, "datePublished": "March 1, 2011", "dateModified": "August 30, 2022", "description": "By T. J. Dunn, Jr., DVM Many people who have had to put a cherished pet to sleep, even after thorough soul-searching and careful consideration of the reasons and timing, have had second thoughts about having their pet euthanized. It is very common to be plagued by remorse, doubt, and guilt about the decision to go ahead with the euthanasia process.", "articleBody": "By T. J. Dunn, Jr., DVM Many people who have had to put a cherished pet to sleep, even after thorough soul-searching and careful consideration of the reasons and timing, have had second thoughts about having their pet euthanized. It is very common to be plagued by remorse, doubt, and guilt about the decision to go ahead with the euthanasia process. Please remember no amount of preparation will be enough to prevent those yearnings to have your special friend back with you again. You may wish you could undo what you have so carefully considered to be the correct course of action. In some cases, the self-doubt can become overwhelming... and even advance to obsession. If you get to feeling this way, read Annie&#039;s letter to her human family. It was written by a thoughtful and caring husband and father who witnessed family members suffering from self doubt -- suffering from the &quot;Did we do the right thing&quot; syndrome even after long and sincere consideration of Annie&#039;s difficulties, discomfort and loss of dignity. The decision to terminate a loved pet&#039;s suffering and discomfort is never easy, but Annie speaks to all of us who have wrestled with self-doubt about our human responsibility to ease a gentle friend&#039;s discomfort and disabilities. Annie really has some happy words for all of us; we should thank her for freeing us from our chains of self-doubt and guilt. Thanks, Annie. Annie&#039;s Letter Dear Susan, I just want you to know how happy I am to be in doggy heaven. It is great up here! My legs work fine, and I only go to the bathroom outdoors, just like I used to, before I got real old. Also, I can hear again! The other barking dogs here are all very friendly, and once in a while I even bark back at them. It feels real good to bark again. The views are spectacular. I can see all of Winnetka, Deephaven, Tonka Bay, Bloomington, and all points in between. I can see the work going on in our back yard ... it is shaping up and will stay beautiful now. At the end of my time there, I could not see the yard or anything very clearly. My mind is inquisitive again, too. I am sticking my nose in to all the new nooks and crannies here. Exploring used to be a big part of my life. Remember me tugging you in all directions on our walks, except for the last year or so. And I like being real mobile, nimble on all four feet, again. I want to thank the whole family for taking care of me for 15 great years (well, really, 14 great years -- my last year of real advanced age was not so great, for me at least). You may think you rescued me years ago after I was abandoned, but that is not quite right. You see, I selected you guys, not the other way around, because I knew you were a great family that would take really good care of me! And did you ever take really good care of me!! Really, really good as you would say. Especially you, Susan. You were the one who usually put my food in my bowl, took care of my water, too. That is all I ever really needed. And you kept the bowls clean, because you knew that was important to me. You were my very best special friend. Thanks. You took me to the vet for my check ups, and had me fixed when my spleen went bad on me. Remember when my ear filled up? You nursed me through that too. Even though you laughed at me, you knew how stupid I felt walking around with that lamp shade device on my head and you were able to comfort me through that difficult time. By the way, would you please throw out all the photos of me bumping into walls and chairs with that stupid thing on my head... it just is not in keeping with my lady-like personality!   The affection shown to me by Maggie and Katie was awesome. I felt like their sister, except I liked them so much I could never fight with them like some sisters do sometimes. I just tried to return their affection to thank them for cuddling with me on the floor and petting me so gently and stuff like that. I know they loved me so much, even when I got old and even though I could not show them the attention the way I did when I was younger and full of it, like I am again now. But you, Susan, meant the most to me because you did the most for me and we spent the most time together. You really favored me with so much care and love for 15 years. I know I was helpful to you when it was just the two of us at the end of our time in Minnesota, and how glad I am for that -- just to be able to repay you a little bit for all that you did for me. How many piles of my poop did you pick up? How many thousands of times did you open or close a door to let me in or out? How many bazillion hairs did you sweep up? How many hours did you spend vacuuming? Thank you so, so, so much. (Regarding the poop, I apologize for my little problem in cars --and boats --but I just got so excited that, well... you know.) There is NO way I could possibly thank you enough for the help and joy you gave to me during our 15 years together. I was sorry I had to go when I did, but I was so old. I did not want to be boarded any more. I had zero energy for that, or any other activity either! It was definitely time. Like Uncle T. said, I was having way more bad days than good, many more bad hours than good hours. I really was not happy at the end, and now I am happy again. Remember me with a smile on your face because that is the way I remember you and Maggie and Katie and Paul. I have a big smile on my face now. My ears are sometimes floppy and sometimes (as you would always say) &quot;precious&quot;. I get hamburgers any time I want. My head is way out the window when I go riding around with my furry pals. There are no fences or leashes here. I go for walks often. Life is great again! It really was time for me to go, and I thank you for your help in making it dignified and easy. I love you, Susan, and Maggie and Katie and Paul, and always will. Annie P. S. I really liked being a girl, in a house with three other girls. It was especially fun when we ganged up on Paul. Ha! ***   Do pets grieve when they lose a human companion?  The answer is simple after you read this.Are you considering euthanasia for your pet?  It may be helpful to read this.   Image: TheGiantVermin / via Flickr  "}]