[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/n5agvwggvj", "@type": "VideoObject", "duration": "PT2M7S", "name": "Dog-Cat-Vaccination-guide", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/03755d67b0394356d4beff0ea4efc73c08f8d251.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/n5agvwggvj", "uploadDate": "2019-12-12", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/93857aa9aa322fe698620bc08e36c79fdc0c54c6.m3u8", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/what-5-1-vaccine-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Is the DHPP Vaccine (5-in-1 Vaccine) for Dogs?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/jack-russell-terrier-female-dog-running-in-field.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/jack-russell-terrier-female-dog-running-in-field.jpg"}, "author": {"@type": "Person", "name": "Natalie Stilwell, DVM, MS, PhD", "url": "https://www.petmd.com/author/dr-natalie-stilwell"}, "keywords": "Dog, Vaccine, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/what-5-1-vaccine-dogs"}, "datePublished": "June 12, 2019", "dateModified": "August 30, 2022", "description": "Dr. Natalie Stilwell explains the DHPP vaccine, or 5-in-1 vaccine for dogs, including which diseases it protects against and how long the shot lasts.", "articleBody": "Vaccination is important for preventing serious diseases from affecting your dog. But why give your pet five shots when they could get what they need in one? For dogs, several of the most common vaccines are typically given together in a single shot that’s known as the DHPP vaccine, 5-in-1 vaccine for dogs, or 5-way puppy shot. This combination vaccine is considered a core vaccine, which means all dogs should receive it regardless of their lifestyle. Core vaccines tend to protect against viruses that are highly contagious, cause serious disease, and have high fatality rates. Here’s what pet parents should know about the DHPP vaccine, aka the 5-in-1 vaccine for dogs, including the diseases it protects against and how often it’s administered.  DHPP Vaccine: What’s Included in the 5-in-1 Vaccine for Dogs? The 5-in-1 vaccine for dogs is typically referred to by its acronym (DHPP, DAPP, or DA2PP) to indicate the diseases it protects against. The canine 5-in-1 vaccine includes protection against canine distemper virus (indicated by the letter D), two types of adenovirus, aka hepatitis and kennel cough (named A, A2, or H), parainfluenza (P), and parvovirus (P). These diseases are all caused by viruses with no known cure, so vaccination is the primary way to keep dogs protected. They are also highly contagious, and dogs of all ages are at risk of becoming infected. Canine Distemper Virus Canine distemper virus is related to the virus that causes measles in humans. Distemper is spread through the air, by direct contact with an infected animal or by indirect contact through shared bedding or dishes. This serious disease targets the respiratory, urogenital, gastrointestinal, and nervous systems of a dog. Infected dogs may suffer from a high fever, cough, vomiting, diarrhea, and watery discharge from the nose and eyes. Progressive stages of disease may include pneumonia, seizures, and paralysis. Distemper can quickly become fatal. For dogs that do survive, the disease can cause permanent brain damage. Newborn puppies and unvaccinated dogs of any age have the highest risk of infection. Canine Adenovirus There are two types of canine adenovirus (CAV).  Canine Hepatitis (CAV-1) CAV-1, which is also known as infectious canine hepatitis, is the more serious of the two types. It spreads through the urine and feces and can severely damage the liver. Even after the initial infection clears, dogs may suffer long-term, irreversible changes to the liver, kidneys, and eyes. Kennel Cough (CAV-2) CAV-2 is one of the diseases commonly associated with kennel cough. The virus spreads directly from dog to dog through coughing and sneezing. Infected dogs typically experience a dry, hacking cough along with a fever and nasal discharge. Canine Parainfluenza Like CAV-2, canine parainfluenza is another virus responsible for kennel cough. It is also transmitted in the air and can spread rapidly, especially in areas where large numbers of dogs are kept together. Coughing, fever, and nasal discharge are the major symptoms associated with infection. One important thing to remember is that canine parainfluenza is not related to canine influenza. The two viruses cause different diseases and require separate vaccines for protection. Canine Parvovirus Canine parvovirus is a serious and often fatal disease. Although dogs of all ages are susceptible, puppies that aren’t yet fully vaccinated have the highest risk of infection. Canine parvovirus is highly contagious and causes damage to the GI tract, resulting in vomiting, bloody diarrhea, and rapid fluid and protein loss. Treatment often requires hospitalization and intensive care. The virus is highly resistant to many common disinfectants and can remain in the environment (including soil) for up to one year. How Often Does My Dog Need the DHPP Vaccine? The combination vaccine is initially given as a series of injections spread out over a number of weeks. However, because it is a combo vaccine, your puppy will only need one shot per visit. Puppies at least 6 weeks of age receive a dose every two to four weeks until they reach 16 weeks of age. For dogs who are older than 16 weeks but have never been vaccinated, the number of initial doses is reduced to one or two. All dogs should receive booster doses of the vaccine every one to three years, depending on the vaccine label and your veterinarian’s recommendation. Advantages of a 5-in-1 Vaccine The 5-in-1 vaccine for dogs offers many advantages over single-pathogen vaccines. For one thing, your dog will only need to receive one shot during each visit rather than five, which saves time and money and minimizes your pet’s discomfort. This combo vaccine can even include noncore vaccines, like leptospirosis, which means your pup can get maximum protection without having to get multiple shots. Extensive research studies have shown that the 5-in-1 vaccine is generally safe for dogs, including puppies as young as 6 weeks old. Any side effects encountered are typically rare and mild, such as temporary soreness at the injection site. Featured Image: iStock.com/K_Thalhofer Related Video: Which Vaccines Does My Pet Need?"}]