[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/6av0yicur5", "@type": "VideoObject", "duration": "PT1M16S", "name": "5480342880001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/a7fa7e732071644fcd6856d1663dfc875738d44e.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/6av0yicur5", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/cf09eca1dc49b7682f316cd7a2559cef5908908c.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/7-ways-unwittingly-break-dogs-spirit?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Ways to Unwittingly Break a Dog&#039;s Spirit", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Dog-Spirit-685609735.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Dog-Spirit-685609735.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Aggression, Destructive Behavior, Training, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/7-ways-unwittingly-break-dogs-spirit"}, "datePublished": "August 26, 2014", "dateModified": "August 30, 2022", "description": "Dogs are dependent on us for their happiness and well-being. These are some dog training methods and other actions that do more harm than good for our canine companions.", "articleBody": "Image via gostua/Shutterstock By Carol Bryant &quot;No!&quot; &quot;Stop it!&quot; &quot;Get off!&quot; &quot;Sit down!&quot; &quot;Shut up and stop barking!&quot; If that’s all you heard, day in and day out, just how low would your spirits sink? We know beyond a reasonable doubt that dogs can feel sorrow and get depressed, and the very essence of who they are as a species is threatened by a very common predator: mankind. Here are seven things that are guaranteed to destroy your dog&#039;s spirit. Read on to see how many you hear about, read about, see or engage in daily, and why you should never do them. Scolding / Yelling / Rubbing a Dog’s Nose in Waste for Relieving Himself in the House It is a myth that dogs know that we are mad at them when we yell because they’ve peed or pooped in the house. Finding a puddle of piddle in the house may not be pleasant for humans, but dogs do not feel guilt when humans show their disapproval. Instead, they are reacting fearfully to the emotional response of their owner, regardless of when the accident occurred. Screaming or yelling reinforces bullying, and because it usually happens long after the accident, the dog is left confused and afraid of you. They still won’t make the connection if it happens just after. Never, ever rub a dog’s nose in poo or pee, as this is not only disgusting, but it comes from an old-school mentality that is just plain mean. Hitting a Dog Long gone are the days of dominance dog training and animal submission. Hitting is a very outdated dog training method. All hitting does is teach the dog that you are to be feared. If you need something to hit, take it out on a punching bag at the gym and look into anger management counseling. Do not, however, bring a dog into your life. He or she does not deserve this treatment.  Punishing a Dog With &quot;Time Out&quot; in a Kennel If a puppy is not cooperating or not doing the desired behavior during training, it isn’t that he is being “spiteful” or defiant; he is just being a puppy. It is your behavior that needs to be modified. Consider the task at hand and reconsider your dog training methods. Also, it could be that the puppy is distracted, or isn’t developmentally ready for that task. The same holds true for adult dogs. If an adult dog does something you are not pleased about, never punish or banish him to a kennel. Taking a Dog’s Food or Treats Away While Eating Not only is it ridiculous to take away dog food or treats, especially when they are eating, but it serves nothing more than to assert what a grand bully you are.  It’s helpful to teach your dog instead that people being near his dog bowl signals that something good is about to happen, like getting extra-special treats, rather than an attempt to take his resource away. While your dog is eating, toss goodies like freeze-dried dog food toppings in his bowl so your dog starts to welcome your approach. If you’re concerned by the intensity of your dog’s reaction when you get too close to his food bowl or bone, reach out to a force-free trainer for help addressing your dog’s resource-guarding behavior. Not Walking Your Dog or Engaging in Quality Time If you want something that lives, yet requires no attention other than to give it water and occasional sunlight, get a houseplant, not a pet. Dogs thrive on companionship, and without mental and physical stimulation, they slowly wither away. Have you ever seen a dog in a shelter who gets little to no interaction, and how sad and destroyed his spirit becomes? Do not let this happen to your dog. We are all busy, but our pets rely on us. Walk away from the electronic devices and walk with your dog instead. No matter a dog&#039;s age, they need to interact with you. Leaving a Dog Alone for Inordinate Amounts of Time Again, if you want something that can spend most of the day alone, this is the time for a houseplant, not a pet. Dogs need companionship—not just for the emotional connection and to truly thrive, but for their physical well-being, too. Would you like to hold your pee in for 10 to 12 hours a day? In fact, some dogs will do this just to not upset their owner. Other dogs will pee inside because they can’t hold it (and shouldn’t have to), and then the owner gets mad upon return. Seek the services of a family member, friend, neighbor, pet sitter or doggy day care if you must leave your dog for long hours at a time. Nothing destroys a dog’s spirit like emptiness, so don’t do it. Allowing a Dog to Suffer If an animal is hurt or injured, please seek veterinary care. Allowing an animal to suffer in pain (and dogs are known to hide their symptoms) serves no one. Yes, veterinary care can be expensive, and yes, sometimes we as pet parents don’t want to hear that our dogs are aging and showing signs of it.  But we owe it to our dogs to give back the unconditional love and dedication they provide to us. Though these are not pleasant reminders to read, they are all too true. Best advice ever: Do none of these, and if a dog you know is being harmed, speak up, do something and/or tell someone. A dog’s life just might depend on it."}]