[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How an MRI Can Help Your Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/mri-for-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/mri-for-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Diagnostics", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-mri-can-help-your-dog"}, "datePublished": "February 26, 2018", "dateModified": "August 30, 2022", "description": "Find out how MRIs can be beneficial for dogs, plus risks and potential drawbacks to consider about the diagnostic tool.", "articleBody": "By: Monica Weymouth “Your dog needs an MRI.” For pet owners, this can be a scary thing to hear—not to mention confusing. Although MRIs have been used since the 1970s to diagnose the cause behind everything from headaches to knee pain in humans, it’s only recently that the diagnostic tool has become readily available for animals. “The technology has evolved very quickly over the past ten years,” says Matthew Barnhart, a veterinary surgeon at MedVet Columbus, an emergency and specialty hospital in Ohio. “I’ve been practicing long enough to remember when they weren’t an option. When we first started doing MRIs, we used to take our patients to a human hospital.” Today, MRIs aren’t just possible for dogs, they’re commonly used. Here’s what you need to know if your veterinarian suggests one, from what conditions they can help diagnose to what potential risks they present. What is an MRI? MRI stands for “magnetic resonance imaging.” Whereas X-rays and CT scans use ionizing radiation (which is potentially harmful) to take images, MRIs use magnetic fields and radio waves to create detailed, high-quality images of the body part being scanned. Although MRIs are occasionally used to diagnose knee, nerve, and other issues in dogs, the vast majority are used to examine problems with the brain and spinal cord, says Philip Cohen, a veterinary neurologist at Mount Laurel Animal Hospital, a New Jersey-based emergency and specialty care facility. “As a neurologist, the most common diagnostic test that I recommend is an MRI,” says Cohen. “An MRI is ideal because it’s particularly good for looking at soft tissue structures [like the brain and spinal cord], and it gives more detail than a CT scan.” Problems that an MRI may be able to diagnose include tumors, inflammation, herniated discs and stenosis [narrowing]. If your dog has seizures, is exhibiting an unusual walking pattern, is suffering from back problems or is experiencing paralysis, your veterinarian may recommend an MRI. However, the test is only considered after more traditional diagnostic measures have failed and if the information obtained from an MRI will be valuable for further treatment. For example, if the dog’s current quality of life is too good or too poor to recommend invasive surgery, an MRI may not be recommended. “We don’t take this test lightly—it’s very involved,” says Barnhart. “To me, the biggest question is, ‘What are we going to do with the information that we get?’ If a dog has minor spinal issues, we’re not going to go forward with surgical intervention, so an MRI isn’t valuable to me.” What’s Involved in an MRI? Like humans, dogs are placed in a large, enclosed magnet while undergoing an MRI. However, whereas calming music is played to help humans relax and stay still, dogs need more complicated measures to ensure that the scan is successful. Because MRIs can last over an hour, animals must undergo general anesthesia. The good news is, unlike you, your dog won’t experience the claustrophobia and stress that many humans report with MRIs. The downside, however, is that all anesthesia comes with risks. “The major downside in veterinary medicine is that we can’t tell our patients, ‘OK, take a deep breath and stay still,’” says Cohen. “We can’t explain to Fluffy that these images take a long time to get, and we need him to relax.” Potential Drawbacks of MRIs for Dogs While the likelihood of anything going wrong with anesthesia is rare, it’s still something that must be considered. “There’s no risk-free anesthesia, but with today’s advances in pharmacology, an adverse event is highly, highly unusual,” says Barnhart. “We anesthetize dogs and cats every day that are very sick, and they do OK—for a dog that’s generally healthy except for a spine issue, the risk is very low.” Although generally considered safe, the added step of anesthesia contributes to another drawback of MRIs: cost. “The big downside is that they’re certainly not cheap,” says Cohen, who estimates that an MRI can cost pet owners anywhere from $2,000 to upwards of $3,500, depending on the complexity of the required images. “This is one of the reasons I always recommend pet insurance.” It’s also important to remember that, no matter how sophisticated the technology, MRIs do not always provide answers. Pet owners need to be prepared for the scan to reveal little new information about their dog’s condition. “A MRI is a great diagnostic tool, but there’s nothing perfect out there,” says Cohen. “Technology has come a long way, but I still run into cases where I’m really confident I’ll find something on an MRI and there’s nothing on there. We can run all the tests in the world and sometimes find no answer.” Before scheduling an MRI, be sure to speak with your veterinarian about all of your concerns and work together to create a plan that will make you and your dog confident and comfortable."}]