[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Top 14 Types of Doodle Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/goldendoodle-on-couch.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/goldendoodle-on-couch.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/types-of-doodle-dogs"}, "datePublished": "November 16, 2022", "dateModified": "January 26, 2023", "description": "Learn about the most popular types of Doodle dogs and the physical and behavioral traits associated with them.", "articleBody": "You may have seen some of the most common types of doodle dogs that have recently gained popularity. Every doodle dog is a little different, based on the dog breed that the Poodle is mixed with and whether the Poodle was a Standard, Miniature, or Toy-sized Poodle.  Each dog also has slightly different genetic outcomes. Not only does this apply to the dog’s appearance and temperament, but also to any hereditary health issues they may inherit from their parents.  An interesting study was done on Labradoodles and Goldendoodles that compared how they expressed inherited behavior traits with the traits of purebred Standard and Miniature Poodles / Labrador Retrievers / Golden Retrievers. For Labradoodles, many of the traits were similar to the purebred parents, but they scored much lower in dog rivalry than Miniature Poodles. Goldendoodles scored much higher in aggression toward other dogs and fear of other dogs and strangers than Golden Retrievers or Miniature or Standard Poodles. 14 Most Popular Doodle Dogs Even although every dog is unique—just like every human—below are a few stereotypical characteristics of each doodle mix, plus fun facts and what you can typically expect.  1. Goldendoodle (Golden Retriever + Poodle) The Goldendoodle first gained breeding popularity in the 1990s. After adoration for the Labradoodle grew and grew, the Goldendoodle was the next obvious choice. This designer dog breed mix has been extremely popular because of the desired traits of athleticism, intelligence, and obedience of both the Golden Retriever and the Poodle.  Weight: 50-75 pounds Height: 22-25 inches Lifespan: 8-12 years Coat colors: brown, red, gold, cream, black, white Coat texture: curly, medium to long Personality: friendly, smart, gentle, playful 2. Bernedoodle (Bernese Mountain Dog + Poodle) These giant, adorable fluff balls were first bred in 2003, solely for the purpose of companionship. Although the Bernese Mountain Dog and Poodle are both traditionally bred for outdoor activities, Bernedoodles are just as happy snuggling up on the couch with you as when they are running through the woods. And their intelligence makes them very easily trainable.  Weight: 70-90 pounds Height: 23-29 inches Lifespan: 7-12 years Coat colors: brown, black, white Coat texture: curly, long Personality: playful, friendly, outgoing, gentle 3. Labradoodle (Labrador Retriever + Poodle) As the original doodle, the Labradoodle is still one of the most popular doodle breeds. Labradoodles are desirable because both the Labrador Retriever and the Poodle are intelligent and athletic. The Poodle has non-shedding fur, and the Labrador has a laid-back, eager-to-please personality.  Weight: 50-75 pounds Height: 22-25 inches Lifespan: 7-12 years Coat colors: brown, red, yellow, cream, black, white Coat texture: curly, medium to long Personality: intelligent, friendly, outgoing, playful 4. Cavapoo (Cavalier King Charles Spaniel + Poodle) The first Cavapoo was born in the 1990s. Cavapoos are known for being great family dogs because they usually inherit the fur and intelligence of the Poodle, plus the loving nature of the Cavalier King Charles Spaniel. And because of the calm personality of the Cavapoo, they are often used as therapy dogs.  Weight: 8-25 lbs. Height: 9-14 inches Lifespan: 10-15 years Coat colors: black, gray, red, brown, cream, white Coat texture: curly, medium to long Personality: outgoing, playful, curious, gentle 5. Aussiedoodle (Australian Shepherd + Poodle) The Aussiedoodles first came about in the late 1990s and early 2000s. These adorable pups are well liked because of their widely known goofy and loving personalities. Just keep in mind that they are high-energy and require a good amount of exercise and outdoor activity to keep them mentally stimulated.  Weight: 25-70 pounds Height: 10-15 inches Lifespan: 10-12 years Coat colors: black, red, brown, white, cream, gray, tan, merle Coat texture: wavy, curly, medium Personality: loyal, smart, energetic, active 6. Sheepadoodle (Old English Sheepdog + Poodle) Sheepadoodles are thought to have been started back in the 1960s by the U.S. Army as an experiment because of their intelligence, loyalty, bravery, and intuitive nature. These dogs are also very playful and carefree, which is why they later became a popular companion and family dog in the 1990s.  Weight: 60-80 pounds Height: 16-22 inches Lifespan: 7-12 years Coat colors: black, white, gray Coat texture: curly, medium Personality: active, friendly, playful, smart 7. Rottle (Rottweiler + Poodle) The Rottle—sometimes referred to as a Rottie Poo, Rottie Poodle, or Rottie Doodle—is very intelligent and eager to please but can have a stubborn streak. They are highly active and athletic, and need lots of outdoor activity such as walking, running, and hiking. But if they get proper training and plenty of exercise, they will also enjoy curling up next to you at the end of the day.  Weight: 50-90 pounds Height: 10-25 inches Lifespan: 8-10 years Coat colors: black, gray, brown, red, cream, blue, white Coat texture: curly, medium to long Personality: playful, intelligent, eager to please 8. Foodle (Toy Fox Terrier, Wire Fox Terrier or Smooth Haired Fox Terrier + Poodle) The Foodle came about in the 1990s and is a great pet choice for someone who lives in a smaller home or apartment because of the dog’s smaller stature. Foodles are typically good with other pets and children if they are properly socialized. They are known for being alert, attentive, and easy to train.  Weight: 9-12 pounds Height: 10-11 inches Lifespan: 10-13 years Coat colors: black, brown, white Coat texture: wavy, dense, medium Personality: smart, courageous, cuddly, active 9. Yorkiepoo (Yorkshire Terrier + Poodle) Like many other doodle breeds, the Yorkiepoo became popular in the 1990s. Pet parents love them for their intelligence, affection, gentleness, and tiny size—which makes them great for apartment living. Just be aware that they tend to bark a lot. Weight: 5-15 pounds  Height: 7-15 inches Lifespan: 10-12 years Coat colors: brown, cream, black, gray, blue Coat texture: wiry, curly Personality: intelligent, affectionate, gentle, outgoing 10. Schnoodle (Standard Schnauzer, Miniature Schnauzer, or Giant Schnauzer + Poodle) Schnoodles were first bred in the late 1980s and early 1990s. They make great family pets because they love kids, playing, and getting attention. They are smart, active, easily trainable, and very friendly—but they do tend to bark a lot. Depending on their size, the Schnoodle can be a lap dog, therapy dog, performance dog, or just a good old family dog. These lovable dogs enjoy being the center of attention.  Weight: 5-70 pounds Height: 10-26 inches Lifespan: 8-12 years Coat colors: Brown, red, yellow, cream, black, gray, white Coat texture: curly, medium  Personality: Smart, active, friendly, gentle 11. Shih-Poo (Shih Tzu + Poodle) The Shih-Poo became a popular mix in the early 2000s. Shih-Poos are small, adorable pups with an alert expression. They are playful, friendly, and affectionate—but remember that their size makes them fragile. They will typically enjoy some snuggles and the opportunity to sit in your lap. They are also courageous watch dogs and enjoy barking a lot.  Weight: 7-20 pounds Height: 8-15 inches Lifespan: 10-12 years Coat colors: brown, yellow, black, cream, white, gray Coat texture: curly, short Personality: affectionate, cuddly, friendly, intelligent 12. Boxerdoodle (Boxer Dog + Poodle) Boxerdoodles are a more recent doodle mix, and are known for being playful, friendly, and active. They need a lot of exercise and do best when they have a fenced-in yard where they can run and play. If socialized, they can be great playmates for kids, and they usually love being a family dog. They can range from small to large, depending on their parents’ sizes.  Weight: 12-70 pounds Height: 10-25 inches Lifespan: 10-12 years Coat colors: black, gray, red, blue, cream, white, yellow, brown Coat texture: curly, short to medium Personality: intelligent, active, friendly, playful 13. Irish Doodle (Irish Setter + Poodle) The Irish Doodle—also known as an Irish Doodle Setter, Irish Poo Setter, Irish Setterdoodle, or Irish Setterpoo—is known for being a great hunter and retriever. Irish Doodles are intelligent, active, playful, and sensitive. They make great family dogs and are typically good with children and other pets. Just make sure to keep them physically and mentally stimulated, or they can become destructive.  Weight: 40-65 pounds Height: 22-26 inches Lifespan: 8-12 years Coat colors: cream, brown, black, blue, silver, gray, red Coat texture: wavy, dense, long Personality: intelligent, energetic, easy to train, friendly 14. Whoodle (Soft Coated Wheaten Terrier + Poodle) Whoodles are adorable, smart, and friendly. They make great companion pets, love being active, and can sometimes be a little stubborn. But they are also known for being loving, loyal, goofy, and very affectionate. And they are often compared to the look of a teddy bear.  Weight: 20-45 pounds Height: 14-20 inches Lifespan: 8-12 years Coat colors: black, gray, red, cream, white, yellow Coat texture: curly Personality: smart, friendly, outgoing, playful Featured Image: iStock/LSOphoto"}]