[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Help Older Family Members Keep Their Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_462379774.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_462379774.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-help-older-family-members-keep-their-pets"}, "datePublished": "January 20, 2017", "dateModified": "August 30, 2022", "description": "For people over age 60, the physical and emotional benefits of having a cat or dog have been well documented. Assist elderly family members or friends in keeping their pets with these helpful tips.", "articleBody": "By Samantha Drake There’s no denying that cats and dogs benefit seniors emotionally and physically. For people over age 60, the physical and emotional benefits of having a cat or dog have been well documented. According to the American Heart Association, owning a pet reduces the risk of heart disease, likely due to increased exercise and socialization, while researchers at the State University of New York at Buffalo found that people taking medication for hypertension saw their blood pressure response to stress cut in half if they owned a cat or dog. In addition, a study by researchers at Miami University, in Oxford, Ohio, published in the journal The Gerontologist found that a strong emotional bond between people over age 60 and their pets encourages more social contact with other pet owners while decreasing doctor visits due to increased exercise from walking their dogs. While the overall benefits are pretty obvious, the reality is that caring for a cat or dog comes with increasing challenges as people age. Some elderly individuals may experience decreased physical mobility, memory problems, and the restrictions that come with a fixed income. It’s important for senior citizens and their families to understand what’s involved in taking care of a cat or dog—from food and medical costs to the amount of attention the animal requires, to who will care for the pet if its owner passes away, says Susan Kurowski, executive director of Pets for the Elderly in San Tan Valley, Arizona. Seniors benefit from having a strong support system in place to help care for their pets. How to Help Seniors Care for Pets Taking the following steps can help keep both senior citizens and their cats and dogs healthy and happy: Evaluate the senior citizen’s situation. Family and/or friends with pets and staff at shelters with programs for senior citizen adopters can help ask the right questions, including how much help is needed and will help be available on a regular basis? Does the person’s housing allow pets and is the housing suitable? For example, if a senior citizen lives in a high-rise building, a dog that needs to be walked several times a day may not be a good fit, notes Kurowski. Family members should also be realistic about the senior citizen’s mental and physical capabilities. Everyone ages differently, Kurowski points out, and should be evaluated on an individual basis. Choose the right pet. Do cats or dogs (or parakeets or guinea pigs) make the best pet for senior citizens? Each comes with pros and cons. Kurowski admits 60 percent of adoptions through Pets for the Elderly’s participating shelters are cats. Not having to walk a cat is a big reason they’re more popular than dogs, but taking a dog for regular walks is a great way for mobile senior citizens to get exercise and outside interaction. An older, more sedate pet can make a great companion for an older person. “You don’t want a puppy with a 92-year-old using a walker,” Kurowski notes. Some animal shelters have their own programs that specialize in matching senior pets with senior adopters. For example, PAWS, an organization in Lynnwood, Washington, has a state-wide program called Seniors for Seniors that matches senior citizens with cats and dogs over age 7 for a reduced adoption rate of $35. Ensure day-to-day assistance is available. This could be as simple as buying lighter-weight litter for seniors with cats or stopping by regularly to check on how the senior citizen and pet are doing. Kurowski suggests taking advantage of vets that have mobile pet clinics who will come to senior citizens’ homes to provide pet care. Some mobile clinics even deliver pet food. One resource for senior citizens on fixed incomes is the Meals on Wheels Loves Pets Grant Program that supports Meals on Wheels programs nationwide to help homebound senior citizens keep their pets. Funding is used to deliver pet supplies to clients including pet food and cat litter, and provide services including grooming and veterinary care. Take advantage of financial assistance. Financial aid for seniors and for pet owners in general is available from organizations large and small around the country. One example of a small group helping local seniors is Seniors for Pets Inc. in Englewood, Florida, which provides small grants to eligible senior citizens in southwest Florida to cover certain veterinary costs including annual exams and vaccines. Similar organizations and programs exist at both the local and national level, so pet owners and their families should do research and discover if they are eligible for financial aid. To start, the Humane Society of the United States’ (HSUS) state-by-state list of pet financial aid related organizations is worth exploring. Plan for the future. When senior citizens adopt older pets, their families must confront the issue of “who outlives who,” notes Kellie Roberts of Animal Friends’ Golden Age Retrievers program, which matches people age 60 and over with older pets. Families that don’t plan ahead can end up bringing the cat or dog back to a shelter. “We see a good number of pets come in because the family doesn’t know what to do with them,” she says. Therefore, it’s important to decide who will care for the pet if he or she outlives the senior owner or the person is no longer able to care for the animal due to illness. Further, senior citizens can allocate a portion of their estate to cover the pet’s care, Roberts says. Making such decisions now will eliminate confusion and heartache later on. "}]