[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What people foods are harmful to my pet?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/people-foods-harmful-pet-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/people-foods-harmful-pet-dogs.jpg"}, "author": {"@type": "Person", "name": "Jessica Vogelsang, DVM", "url": "https://www.petmd.com/author/dr-jessica-vogelsang"}, "keywords": "Dog, Nutrition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/what-people-foods-are-harmful-my-pet"}, "datePublished": "August 20, 2015", "dateModified": "August 30, 2022", "description": "By Jessica Vogelsang, DVM While sharing food off our own plates is a common bonding experience between owners and a dog with really compelling “beggar” eyes, some food that we eat with no problem whatsoever can be toxic to our pets. Here are some of the most common offenders: Chocolate: Most people are aware that chocolate is bad for cats and dogs. In toxic doses, it can cause agitation, diarrhea, pacing, seizures, or even death. It is dose-dependent, meaning milk chocolate with lower cocoa percentages is less toxic than dark or baking chocolate.", "articleBody": "By Jessica Vogelsang, DVM While sharing food off our own plates is a common bonding experience between owners and a dog with really compelling “beggar” eyes, some food that we eat with no problem whatsoever can be toxic to our pets. Here are some of the most common offenders: Chocolate: Most people are aware that chocolate is bad for cats and dogs. In toxic doses, it can cause agitation, diarrhea, pacing, seizures, or even death. It is dose-dependent, meaning milk chocolate with lower cocoa percentages is less toxic than dark or baking chocolate. Raisins, grapes, and currants: For reasons still undetermined, these little fruits can lead to kidney damage. Onions and garlic: In toxic amounts, can lead to blood cell damage and subsequent anemia. Macadamia nuts: Cause neurologic signs such as wobbliness, weakness, and tremors. Bread dough: In addition to the mechanical damage of an expanding mass of dough in the stomach, fermentation produces alcohol, which can lead to intoxication. Mushrooms: As in people, while some varieties are fine, others are extremely toxic. Never let your pet free graze on mushrooms he finds outside. Xylitol: A very common artificial sweetener found in everything from peanut butter to gum, small amounts of xylitol can cause life threatening hypoglycemia in pets. It’s so toxic that I tell people don’t even try to keep it out of your pet’s reach: keep it out of the house, entirely."}]