[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/1xaa8a4lw7", "@type": "VideoObject", "duration": "PT2M18S", "name": "5327118653001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/1d5e6293bd913b48dd555df7c15650814eb42dd2.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/1xaa8a4lw7", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/1e491fceb4fbabcaaf20e267efaa676989960226.m3u8", "transcript": "A backyard dog dangers. Many of us know how to dog proof our homes but we often don't take the same precautions when it comes to our outdoor spaces. Here's how to protect your dog from backyard dangers. Flowers seasonal flower beds are beautiful but many common flowers including tulips daffodils azaleas and emeralds can be poisonous to dogs.\n\nTalk to your vet about which plants are safe for dogs before you put on your gardening gloves trashcans and garage supplies trash cans and recycling bins should be secured with appropriate lids liquid such as fuel cleaning supplies and antifreeze which can be fatal to pets need to be stored out of reach of your pet bug or rat bait and herbicides should be used with caution and stored properly as they can also be fatal to dogs pools. Even if your dog is a strong swimmer. He or she should never be left unattended in a yard with a pool your pool area should be fenced and your dog should know how to safely enter and exit the pool from an early age offense.\n\nEven if your yard has a fence a wiggly pup can easily slip through tiny gaps or holes you may not notice regularly check the fence in your yard to make sure it is secure before letting your dog out in the yard. Tall grass ticks will use tall grasses and branches in your yard to hitch a ride onto your dog's skin to help keep ticks at bay. Trim back hi tall grasses and remove debris decks and sheds please tend to live in dark humid areas like outdoor dog homes decks and backyard structures such as sheds. Sweep off patios clean under your deck and remove debris from outdoor structures to prevent please from congregating in your yard.\n\nInsecticides pesticides and fertilizers insecticides can help curb bug problems but when applied heavily. They may be toxic to pets. Try to avoid using insecticide when possible or talk to your veterinarian about the best way to use such chemicals. Heat dogs love playing outdoors year round but dehydration and heat sickness can be a very real threat.\n\nIn warm sunny weather. Make sure to give your pup plenty of breaks in the shade. Access to fresh water and the ability to go inside. If he needs it.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/planning-for-the-health-of-your-pet?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Planning for the Health of Your (New) Pet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-with-family-shutterstock_33017536.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-with-family-shutterstock_33017536.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Adoption, Shelters and rescue", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/planning-for-the-health-of-your-pet"}, "datePublished": "January 30, 2015", "dateModified": "August 30, 2022", "description": "Dogs and cats are great companions, but they&#039;re also a real expense. Here’s a break down of some of the major costs of pet care.", "articleBody": "By Deidre Grieves Here’s the scenario: For the past few months, all you’ve been thinking about is bringing home a new pet. You can’t wait for snuggle sessions on the couch and playtime in the yard. But before you jump headfirst into pet parenthood, it’s important to understand the financial responsibility that comes along with adding a four-legged friend to your family. Dogs and cats are great companions but they&#039;re also a real expense. Unfortunately, many prospective pet owners don&#039;t have a good grasp on just how much it costs to care for one of these animals. Here’s a breakdown of some of the major costs of pet care, as well as a few lesser-known expenses that are equally essential to your pet’s wellbeing. Food Picking up a bag of dog or cat food at the store once a month might seem like a drop in the bucket, but the yearly costs of pet food can add up. Making sure your furry companion is getting the proper nutrition is vital to your pet’s overall health. “It’s not a wise idea to attempt to save on food by simply purchasing the least expensive option,” says Dr. Louise Murray, vice president of the ASPCA Animal Hospital. “Feeding your pet a healthy diet will save you more in the long run by helping to prevent disease. According to Petfinder, the cost of dog food will run you between $120 and $500 per year1. Large breeds go through a greater amount of dog food than smaller dogs. For instance, feeding a Great Dane will cost much more than feeding a Chihuahua. If you plan to bring a large dog into your home, be aware of the significant costs you’ll shell out for pet food. To feed cats on an annual basis, a prospective pet owner can expect to spend approximately $115, according to the ASPCA2.      Medical Care Even if a pet is young and healthy, they still require basic medical care. Dogs and cats should visit a veterinarian at least once a year. Regular medical care involves exams and vaccinations, but it should also include preventative medication for heartworms, fleas, and ticks.  While some pet parents might try to forego preventatives in the winter to save money, it’s important to keep dogs and cats on this important medication year-round. “Flea and tick preventives are a good investment,” says Dr. Murray. “Both parasites can transmit serious diseases and can cause life-threatening anemia due to the blood loss suffered by an infested pet.” Dog owners can expect to spend between $200 and $500 on average annually for medical care, according to the ASPCA2 and the AKC3. Cat owners can expect to spend around $160 per year2. To help offset medical costs, pet owners can look into pet insurance plans, which have premiums that can range from less than $10 to more than $90 per month4. But before signing up for pet insurance, do some research and make sure the plan will cover your pet’s specific needs. If pet insurance isn’t the right option for you, consider starting an emergency savings fund so that you have money set aside if an emergency situation occurs. “Any pet can develop a health problem or suffer an accident,” says Dr. Murray. “It’s essential to be prepared for that possibility from the moment a pet joins your family. Learn More:  Pet Services According to the American Pet Products Association’s (APPA) bi-annual National Pet Owners Survey5, U.S. consumers spend approximately $4.73 billion on pet services each year. These include things like grooming, boarding, dog walking, training classes, and daycare facilities. Costs associated with dog walking, boarding, and pet sitting average $233 per year, while grooming costs for dogs average $190, according to the AKC survey3. Cat owners can expect to spend up to $300 each year for professional grooming services, according to Petfinder6. The Little Things Add Up As a pet parent, it’s important not to underestimate how incremental spending each month can tack big numbers onto your yearly pet-care budget. For dogs, pet parents spend about $40-$75 on toys and treats, according to the ASPCA2. New collars and leashes range from about $25-$35 a pop. The cost of a dog bed averages between $25-$1001, and a crate or travel carrier for a dog can cost anywhere between $20 to $2501 or more. Cat parents also have incremental expenses throughout the year.  A litter box generally costs about $25, but cat litter averages $165 per year, according to the ASPCA2. Scratching posts range between $10-$506, while cat trees range from $20 for simple structures to a few hundred dollars for designer perches. Food bowls, cleaning supplies and travel expenses are also expenses pet parents should keep in mind. The Bottom Line “Before considering obtaining a new pet, sit down and add up all the potential costs,” Dr. Murray suggests. “You may want to obtain the help of an experienced pet owner, and be sure to include the costs of both routine and emergency veterinary care.” Taking all of the expenses into account, new dog parents can expect to spend between $1,800 and $3,300 per year, depending on the animal’s size, according to the ASPCA2 and the AKC3. The ASPCA estimates that cat parents spend about $1,000 for care each year2. Still, while both dog and cat ownership requires a significant amount of time and money, they repay the investment over and over again with unwavering loyalty and love. Image: Phase4Studios / via Shutterstock   Sources: 1 https://www.petfinder.com/pet-adoption/dog-adoption/annual-dog-care-costs/ 2 https://www.aspca.org/adopt/pet-care-costs 3 https://www.akc.org/pdfs/press_center/costs_of_dog_ownership.pdf 4 http://www.consumerreports.org/cro/2010/09/is-pet-insurance-worth-the-cost/index.htm 5 http://www.americanpetproducts.org/press_industrytrends.asp 6 https://www.petfinder.com/pet-adoption/cat-adoption/annual-cat-care-costs/"}]