[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Must-Haves for Hiring a Pet Sitter", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/pet-sitter-for-dog-and-cat-id813338428.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/pet-sitter-for-dog-and-cat-id813338428.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/must-haves-hiring-pet-sitter-0"}, "datePublished": "September 26, 2018", "dateModified": "August 30, 2022", "description": "Going on vacation? Use our pet sitter checklist to find a professional pet sitter who you can trust with your four-legged friend and your home.", "articleBody": "Image via iStock.com/FatCamera By Rita Reimers You’re planning your dream trip, and you’ve arranged everything down to the last detail. All you can think about is leaving your daily life behind for a few days and having fun relaxing in the sun. And then you remember that your cat and/or dog can’t go with you on this particular trip, so now what do you do? Cancel your trip? Not necessarily. You could ask a neighbor, family member, a friend or the kid down the block to pet sit for you. But do you really want to impose on those people? Sometimes favors like this can strain friendships and cause hard feelings, even if unspoken. As for the kid down the street, do you really trust a child with all your worldly possessions, including your home and pets? Also consider the fact that non-professional pet sitters are not insured and bonded and usually are not skilled at handling potential emergency situations with your pet or your home. They also have their own lives and jobs, so will they be giving your pet the love and attention they deserve? Professional pet sitters handle situations like this every single day; it’s what they do for a living. With a pet sitter, you can be sure they will spend time with your pet and keep an eye on your home and your property. Hiring a professional pet sitter who has a wealth of experience will enable you to enjoy your trip knowing your home and your pets are being well cared for while you are away. How to Find a Pet Sitter Great, so you know you want to hire a professional cat sitter or dog sitter. Now how do you find them? Asking your friends for recommendations is a good place to start. Lots of pet sitters rely on their word-of-mouth reputation to find new clients. Your veterinarian’s office is also another place to ask, and some of them even let pet sitters leave business cards in their lobbies. Yelp and Google are also good places to look for professional pet sitters, as are the many professional pet sitting organizations such as Pet Sitters International (PSI) and the National Association of Professional Pet Sitters (NAAPS). So now you have a few options to check out, but how do you know which is the right pet sitter for you? Pet Sitter Checklist - Selection Before setting up a meeting with a professional cat sitter or dog sitter, there are some things you should know about the sitter or company you’ve contacted. Here are some things you’ll want to know about your pet sitting service even before scheduling an in-person consultation: Are they bonded and insured?Do they conduct background checks on their sitters?Are they a member of any professional organizations, such as PSI, NAAPS or their local Chamber of Commerce?Is their website organized and professional looking, and does it include photos and bios of their actual sitters, not just mystery people?If you are looking for a cat sitter, are their cat photos on their website? Do they understand cat behavior, or is it all about dogs?If you are looking for a dog sitter, does it look like they understand the different dog breeds and how they act?Will you get to meet your actual sitter, or just the office manager, and will you be assigned a specific pet sitter, or does the service just send whomever is available?If you are assigned a specific sitter, what happens if they are unavailable when you need them?Do they provide the specific type of service you need, such as in-home visits, multiple visits per day, overnight stays, or boarding at their facility or in the sitter’s home?For in-home visits, how long does the sitter stay, and will they also play with your pet, water your plants, bring in your mail?If the service has a blog with information about their services, about pets and how to care for them, that is a bonus. It shows they really care about what they do.Pet Sitter Checklist - Meeting Once you’ve selected a pet sitting service you feel comfortable with, the next step is the in-home meeting with your potential sitter. Here are some things you should ask and observe at this meeting: How long have you been pet sitting?How/where is the key to my home kept and how is the alarm code kept secure?How will you communicate with us while we are gone?What if my cat or dog gets sick? How does this get handled?If something in the home goes wrong, what will you do?How do you handle other types of emergencies? (fire, floor, earthquake, ice/snow storms)Do you have any references?If you are hiring a solo sitter vs. a company, ask what happens if he gets sick, Who takes over for him?Also observe how the pet sitter interacts with your dog or cat. Do they seem to know what they are doing and feel comfortable interacting with your pet, and does the pet seem to like and trust them? (This can be a tricky thing to observe with shy pets).Once you’ve selected a pet sitter that both you and your pets like, you can travel with the peace of mind that a professional pet sitting service provides."}]