[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Long Do Dogs Live?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/how-long-do-dogs-live.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/how-long-do-dogs-live.jpg"}, "author": {"@type": "Person", "name": "Jamie Lovejoy, DVM", "url": "https://www.petmd.com/author/dr-jamie-lovejoy"}, "keywords": "Dog, General Care, Zoo Chorkie Pack, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-long-do-dogs-live"}, "datePublished": "January 3, 2023", "dateModified": "October 23, 2023", "description": "The average dog lifespan varies by size, breed, and individual. But if you&#039;ve ever found yourself wondering, &quot;how long do dogs live?&quot; our expert veterinarian gives a rundown of what you need to know.", "articleBody": "When it comes to knowing how old your dog is, calculating “dog years” just doesn’t cut it anymore—studies show that a dog’s lifespan can vary significantly with breed and size, and there are other factors at play that we still don’t fully understand. There’s a lot to know about the dog lifespan. So if you ever look at your pup and wonder, “how long do dogs live?” here’s how you can estimate—and how you can ensure your best friend is around for as long as possible. The Average Dog Lifespan  The average lifespan for dogs is between 10–13 years, though there is variability among breeds and sizes. As a species, the domestic dog is incredibly diverse in size, build, and appearance, thanks to human intervention. So it’s no wonder that there are significant differences in the lifespan of a Chihuahua versus a Great Dane. In general, smaller dog breeds live longer than larger dog breeds. The cause for this is not well established; normally, smaller mammal species have shorter lifespans than larger ones. One possible reason might be that common medical conditions that dogs acquire as they age (such as incontinence and mobility issues) may be more difficult to manage in larger dogs and lead to euthanasia sooner. There also seem to be some differences in the types of illnesses experienced by different-sized breeds. Genetics also play a huge role in life expectancy for dogs. Purebred dogs are more at risk for specific hereditary diseases because they are bred by other dogs with similar genes. Mixed-breed dogs have a reduced risk of these diseases, which likely contributes to their increased lifespan. Certain breeds are also purposefully bred to have traits that, as an unfortunate result, may also lead to shortened lifespans. For example, brachycephalic dogs such as the English Bulldog are more prone to heatstroke and respiratory-related death due to their small trachea. The average lifespan for dogs is between 10–13 years, though there is variability among breeds and sizes.How Long Do Small Dogs Live? Small-breed dogs tend to have the longest lifespan, averaging 10–15 years. But as these long-life dogs age, they are more prone to liver, kidney, and adrenal disease, as well as degenerative heart disease. Small dogs are also very prone to dental disease, which can complicate these other illnesses. Here are some popular small dog breeds and their average lifespans: Chihuahua: 14–16 years Pomeranian: 12–16 years Yorkshire Terrier: 11–15 years Parson Russell Terrier: 13–15 years How Long Do Medium-Size Dogs Live? Medium-size dogs align more with the overall average dog lifespan of 10–13 years. But some medium-size dogs can be very long-lived; the oldest dog on record was a Rafeiro do Alentejo named Bobi, who lived to be 31 years old! Medium-size dog lifespans and diseases of concern vary from breed to breed. Bulldogs, for example, are often plagued with health issues due to their snub-nose design, while the hardworking Australian Shepherd has fewer genetic disease predispositions and can live to be 15 or older. Here are some popular medium-size dog breeds and their average lifespans: French Bulldog: 10–12 years Cocker Spaniel: 10–14 years Bulldog: 8–10 years Boxer: 10–12 years How Long Do Large Dogs Live? Large-breed dogs have a slightly shorter lifespan than medium breed dogs, at 9–12 years. Again, these lifespans are heavily affected by breed. As dogs get larger, they are more likely to be affected by difficult-to-manage arthritis and certain types of cancer. Popular breeds like the Golden Retriever and Bernese Mountain Dog are particularly prone to cancer. Here are some popular large dog breeds and their average lifespans: Golden Retriever: 10–12 years Rottweiler: 9–10 years Belgian Malinois: 14–16 years Bernese Mountain Dog: 7–10 years How Long Do Giant Dogs Live? Towering giant-breed dogs have the shortest average lifespan, at 8–10 years. Unfortunately, a 6-year-old Great Dane is considered a senior pet, given the wear-and-tear their joints experience. Giant breeds are also far more prone to bone cancers and neurologic diseases than smaller dogs. Here are some popular large dog breeds and their average lifespans: Great Dane: 7–10 years Irish Wolfhound: 6–8 years Newfoundland: 9–10 years Saint Bernard: 8–10 years How to Help Your Dog Live Longer Do Your Research Because dog lifespans are so breed-dependent, if you’re interested in a certain breed it’s extremely important to research carefully and select a responsible breeder who is invested in their dogs’ health. Responsible breeders will test for common diseases in their breeding dogs (both health screening and genetic tests are available for many common issues). Knowing the lifespan and health concerns of your puppy’s relatives can help you make an informed decision. While mixed-breed dogs may live longer than some breeds, many designer breeds (like Goldendoodles and Labradoodles) initially created to be healthier are now bred to the point of having their own specific issues. So, these breeders should be held to the same standards. Mixed-breed dogs from shelters often have a variable enough pedigree that they are not subject to the same risks as designer breeds. But because breed-specific illnesses can still arise, it can be worthwhile for pet parents to DNA test their shelter pup, as many of these DNA tests will also look for evidence that your dog has the genes for common diseases. So, by knowing more about your dog’s background, you can anticipate some issues that may come up. Follow Your Vet’s Guidance It’s important to follow to your veterinarian’s preventative health recommendations. Vaccinations—as well as location-appropriate flea, tick, and heartworm prevention—will protect your pet against communicable diseases. Routine testing for intestinal and blood parasites should be done on an annual basis. Discuss routine bloodwork panels to check liver, kidney, and bone marrow health with your veterinarian as well. Establishing baselines in young dogs and checking them annually as they get older can help you find diseases early when they are more easily managed. Keep in mind, senior dogs should have more testing done as they age to check for additional age-related issues that may arise.  Some breeds, like Golden Retrievers, may benefit from routine imaging (X-rays and ultrasounds) as they age to monitor for certain types of cancer. Keep Your Dog at a Healthy Weight A healthy weight is essential for a long-lived dog. A study of Labrador Retrievers found that dogs kept at a healthy body condition lived an average of two years longer than their overweight counterparts. Feed your dog in measured meals and keep track of treats and snacks so that you can appropriately adjust their intake as their metabolism changes. If you are unsure your dog is a healthy weight, that’s a great question for your veterinarian. Featured Image: iStock/Halfpoint"}]