[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/ix3j09bic5", "@type": "VideoObject", "duration": "PT2M16S", "name": "5327102530001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/742af8980ca77fb89e9046b301af725233e83490.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/ix3j09bic5", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/e78a5b200c21fe06e461dc9af48e335f34f80e37.m3u8", "transcript": "Dog owners know that sometimes accidents happen whether you're potty training a new puppy or your adult dog simply has a mishap in the house cleaning up urine from floors and carpets is something that most pet owners will have to do in their lifetime. There are several methods to cleaning dog urine. But the first step is to blot up as much of the liquid as possible. If the accident is fresh covering the area with paper towels.\n\nIf the accident happened on a hardwood or tile floor simply wipe with the urine before spring the area with a cleaning solution. If your dog peed on the carpet. Apply pressure to the area to soak up the urine before attempting to clean with homemade solutions or store. But sprays.\n\nIf the scene is set in sprinkle the area with some baking soda and let it sit. You can then spray the area with distilled white vinegar and wipe it up with a wet rag. Hydrogen peroxide can also be used in place of the baking soda and vinegar in the same way. Simply spray some on the stain.\n\nLet it bubble up, and wipe it clean with a wet rag. Make sure to test a small area of your carpet first to make sure the hydrogen peroxide won't just color your carpet if you decide to purchase store bought your own cleaner. Be sure to look for an enzymatic cleanser specifically designed to remove pet urine enzymes or proteins that break up your urine molecules and dissolve odors with the most enzyme cleansers. You'll need to spray the area and allow it to sit for a few minutes before scrubbing and cleaning the area.\n\nIf the stain is really set in. You may have to repeat the cleaning process several times if odors are still present after cleaning. You may have to rent a carpet cleaning device or enlist the help of a professional cleaning service. Now it's important to avoid using products that are formulated with ammonia dog urine contains ammonia and if you use an ammonia based cleaning solution.\n\nIt may actually encourage your pup to mark the same spot in the future. Also don't use steam cleaners to remove urine from carpets and upholstery. Steam will actually help set the scene in odor into the fibers. So avoid steam cleaning at all costs.\n\nIf you practice using proper cleaning techniques and work on potty training using positive reinforcement methods you can cut down on pet accidents in your home in no time.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/evr_dg_tips-for-removing-dog-urine-smell-from-carpet?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Get Rid of Dog Pee Smell", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/carpet-cleaning.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/carpet-cleaning.jpg"}, "author": {"@type": "Person", "name": "Tiffany Tupler, DVM, CBCC-KA", "url": "https://www.petmd.com/author/dr-tiffany-tupler"}, "keywords": "Dog, General Care, Peeing house dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_tips-for-removing-dog-urine-smell-from-carpet"}, "datePublished": "June 30, 2020", "dateModified": "August 30, 2022", "description": "Is your dog having potty accidents in the house? Dr. Tiffany Tupler, DVM, explains how to get rid of dog pee smell in your home.", "articleBody": "Whether you’re practicing potty training for a new puppy or noticing accidents with an older dog, one thing is certain: that dog urine smell isn’t pleasant. Accidents happen—it’s natural. Practice patience and use positive reinforcement with puppies and dogs that are being housetrained. If your dog is already potty trained but has started to have accidents, take them to the vet to see if there is a medical cause. In the meantime, here’s how to get rid of dog pee smell around your home. What Neutralizes Dog Urine Smell? The pheromones in dog urine are part of a complex system dogs use to communicate. Pheromones teach dogs boundaries and respectable places to urinate; however, once a dog has had an accident in the house, smelling those pheromones may encourage your dog to urinate again in the same spot. You may smell a foul odor, aka dog urine smell, caused by bacteria in the urine that produce ammonia. If you’re not sure exactly where the urine odor is coming from, try using a UV or black light to find the areas of urination and ensure proper cleanup. So what neutralizes dog urine smell and its pheromones? Enzymatic cleaners denature (destroy) the proteins and enzymes that make up the pheromones in dog pee. This not only helps to get rid of the dog urine smell, but it also decreases the chances of your dog being a repeat offender in that same spot. Products containing accelerated hydrogen peroxide can help decrease the foul odors. Use a contact time of 15 minutes for all odor and stain remover products, and test each product on a small space before using. How to Get Rid of Dog Pee Smell and Stains in Carpets and Couches For carpets, couches, or other areas that cannot be machine-washed, follow these steps: First, manually soak up excess moisture with a towel. Next, soak another towel with a hydrogen peroxide-based cleaner. Leave the towel and cleaner on the wet spot for 15 minutes. After 15 minutes, blot and soak up the remaining moisture with a dry towel. Finally, apply an enzymatic cleaner, such as Nature’s Miracle, to the spot. Leave the enzymatic cleaner on the spot for another 15 minutes. If you can’t remove the smell using this method, try contacting a professional carpet cleaner or using a steam cleaning machine. How to Remove Dried Dog Urine Stains From Hardwood Floors or Carpets For old and/or dried urine stains on hardwood floors or carpets, follow these steps: Soak a towel with a hydrogen peroxide-based cleaner. Leave the towel and cleaner on the stain for 15 minutes. Repeat the first step using an enzymatic cleaner.  How to Get Rid of Dog Urine Smell in Rugs, Pillows, Dog Beds, and Sheets If the soiled item can be put into the washing machine, use an enzymatic cleaner with laundry detergent to effectively get rid of urine stains and smells. If you still see stains along with a lingering dog urine smell, consult with a professional dry cleaning company. How to Deal With Stains and Smells in Larger or Heavily Soiled Areas For heavily soiled areas in the house, consider getting a high-quality mini wet vac. Look for the companies that include an enzymatic cleaner in their base. This will help tackle the dog urine smell and stains. If name-brand products aren’t working or the space is too large, consider calling your local carpet cleaning company for assistance. Dealing With Chronic Issues Troubles with potty training or chronic leaking may be a sign of a medical or behavioral concern. Frequent urination, urinary tract infections, submissive urination, and urinary incontinence are just a few of the issues that could be affecting your dog. When dealing with a chronic issue, consult with your veterinarian for a potential diagnosis and treatment plan. If your veterinarian rules out medical concerns, consider consulting with a Certified Professional Dog Trainer (CPDT) to address behavior modification. Featured Image: iStock.com/harunhalici"}]