[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What To Do When You Find a Stray Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/stray%20dog%20looking%20back%20on%20road.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/stray%20dog%20looking%20back%20on%20road.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Adoption, Shelters and rescue", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/what-do-when-you-find-stray-dog"}, "datePublished": "April 21, 2016", "dateModified": "August 30, 2022", "description": "Each year, as many as 7.6 million animals are expected to enter shelters—that’s about 3.9 million dogs and 3.4 million cats—and only about 649,000 of the lost pets are eventually returned to their original owners. For those who want to step up and help lost pets, we have some advice from professionals. Read more.", "articleBody": "By David F. Kramer Pet homelessness has been a sad epidemic in the United States for many years. A close look at the statistics paints a bleak picture of the state of our four legged friends that are forced to fend for themselves. According to the ASPCA, approximately 6.5 million companion animals enter shelters in the United States every year. That’s about 3.3 million dogs and 3.2 million cats. Of these, a staggering 1.5 million—670,000 dogs and 860,000 cats—are euthanized. While approximately 3.2 million animals are adopted each year from shelters, only about 710,000 of those who come in as strays are eventually returned to their original owners.  With those types of numbers, it’s almost inevitable that you’ll eventually come across a stray animal yourself. What’s the best way to proceed when that happens?  The Risks of Helping Stray and Lost Animals It’s a sad fact that even the friendliest of dogs can bite when scared, hungry, sick, or hurt. Stray dogs may also be carrying diseases that are potentially contagious to other pets and even to people. Loose dogs who appear to be healthy and willingly approach their rescuers can be leashed and taken to a safe location, but if approaching the dog could put you at risk, it’s best to call your local animal control agency. Or as Jack Griffin, director of Shelter Services at the Women’s Humane Society in Bensalem, Pennsylvania says, “We recommend that if a person comes across a stray animal, that they bring the animal to a local animal shelter for medical assessment and to check the database should their owner be looking for them. Should they be unable to capture the animal easily, we suggest that people contact the local authorities.” How to Get a Stray Dog to Trust You Sometimes, however, a particular situation might make you come to a different decision. Many animal control agencies have experienced drastic budget cuts in recent years and are no longer available 24/7.If you feel that personal action is necessary and that you can proceed safely, how can you get a wary stray dog off the streets yourself?  According to Lauren Nucera, a pet advocate and rescuer for Chester County Dog Tails in Pennsylvania, there are many steps you can take to gain the trust of a lost dog. “Getting a dog to trust you can be a waiting game; it takes time and patience,” says Nucera. “Take a spot low to the ground or somewhere close by to where the dog is roaming. A loop leash makes it easier to get the dog if he or she has no collar. Don’t face the dog head on, as it might see that as a challenge, but rather sit to the side so that you aren’t eye to eye with it.” A loop leash is a type of leash can be slipped over the dog’s head like a lasso without having to put your hands too near the dog’s mouth.  “It’s always a good idea to have plenty of dog treats handy,” says Nucera. “Allow the dog to just sniff you and gather your scent. With an open hand, allow the dog to takes treats from you. Eventually you should be able to loop him. Then, in a calm and gentle way, guide the dog to where you want him to go.” But the best intentions of dog lovers and rescuers can sometimes be misguided, warns Griffin. “Building trust is dynamic, fluid, and can change rapidly. Chasing stray animals is dangerous for all parties involved,” says Griffin. “Traffic, potential wildlife, uneven ground, etc., can all end with an unintended injury for both humans and dogs. Trust comes with relationships and is always fragile, as well as not knowing this particular animal’s behavioral background. It is a risk that may be best left to professionals.” The Difference Between Stray, Feral, and Lost Animals While it’s important to establish if a found animal is indeed a lost pet or possibly feral, this determination is often difficult to make in the field. Identification collars can come loose and be lost, and even the best kept dog might be haggard and dirty by the time you come across it. “A stray animal would be defined as any animal without a known owner. Any animal at large can show a fear of strangers or have a positive association with strangers who feed them,” says Griffin. “There are perfectly social feral dogs and there are owned animals that are very fearful of unknown people. So we, along with most animal shelters, operate on the assumption that every found animal has an owner looking for them. Otherwise it would be guesswork at best to identify who was or who wasn&#039;t once owned.” Is it Safe to Take a Stray or Lost Pet Home With You? A concerned animal lover might opt to bring a dog home to try to track down the pet’s owner on their own or even just to feed it before handing it over to the authorities. However, doing so is not without its risks to the rescuer, as well as to their own pets and families. “There would be an assumed risk for all involved (including pets) when bringing an unknown animal home,” says Griffin. “You may unknowingly bring home parasites such as fleas, ticks, worms, or other more harmful things, such as parvovirus or even rabies. Some of these represent a risk to humans, while others are specific to animals or other dogs. Nonetheless, an animal with an unknown medical history brings a level of risk.” “Secondly, unknown behavioral history can carry a different kind of risk. With the introduction of food, toys, couch space, etc., we could see a lot of behaviors not present when we met the animal out in the world.” How to Find a Lost Pet The advent of social media has been a boon for returning lost pets to their families. In less time than it takes to staple a single flyer to a telephone pole, a dog’s photo and information can be shared with thousands of animal lovers and any number of dedicated organizations that deal with strays. Animal shelters also utilize social media to forward their cause and showcase animals that are up for adoption. “If someone loses their pet, the onus is on them to contact any and all local shelters in order to make a report. It is also imperative that they go directly to the shelter to perform a walk through,” says Griffin. Calling in and getting descriptions of found pets is not reliable, said Griffin. “One person&#039;s tan is another&#039;s brown, so it is best to go through local shelters, including animal control facilities, to attempt to make a visual identification of your pet.” &#039;No-Kill&#039; vs &#039;Kill&#039; Shelters - What is Best for the Animal? Some animal lovers might be hesitant to take a stray dog to a shelter because of the possibility that it might be put down. They might believe that they are taking the best route by holding onto a stray animal to find a home for it themselves, even if they don’t have the resources or ability to care for it properly. Shelters are often referred to as “kill” or “no kill,” and while these terms seem to be polar opposites, in reality, that’s not always the case. “A ’no-kill’ shelter is a shelter that euthanizes less than 10% of its population. A ‘kill’ shelter is any one that euthanizes more than 10%,” says Griffin.   It is important to learn about the facility’s philosophies. “Do they work with other rescues in the area? What criteria do they use when deciding on euthanasia? It’s not a fair assumption that every animal brought to a facility that euthanizes at &gt;10% faces certain death or that an animal brought to a facility that euthanizes"}]