[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pets and Newborns: Myths You Shouldn’t Believe", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-pet-newborn.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-pet-newborn.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, Training, Behavior, Aggression", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/pets-and-newborns-myths-you-shouldnt-believe"}, "datePublished": "February 19, 2018", "dateModified": "August 30, 2022", "description": "When you’re a new parent, it can seem like everyone has advice. One area that’s especially confusing? Newborns and pets. Although you’ll likely hear them from well-meaning friends and family, these common myths about pets and babies simply aren’t true.", "articleBody": "By John Plichter When you’re a new parent, it can seem like everyone has advice. From how to feed your baby to how to put her to sleep, there are plenty of opinions out there—and many of them sound a little suspect.  One area that’s especially confusing? Newborns and pets. Although you’ll likely hear them from well-meaning friends and family, these common myths about pets and babies simply aren’t true.   Pets Can “Sense” a Baby Is On The Way We love our pets, and we like to think we have a deep, special bond with them. While this may be true, there is no sixth sense to alert them that there’s a baby in that bump. The only thing your cat or dog knows is that changes are happening at home—and changes can be scary. “The vast majority of our pets notice our behavior change more than any physical change,” says Shanna Rayburn, a certified veterinary technician who specializes in behavior. “Different things like schedule changes due to doctor’s appointments are the start of things. Then, when new items start showing up in the house, the big awakening begins.” With this in mind, it’s important to transition your house and routine as soon as possible. “One of the biggest things you can do to help prepare is to get the new schedule in place well before baby comes,” says Rayburn. “If your dog is fearful of new items or has separation anxiety, it is really important to start the changes as soon as you know you are expecting.” Litter Boxes Are No Big Deal One of the biggest debates surrounding babies and pets is the cat litter box. But anyone who tells you that cleaning the litter box while pregnant is perfectly safe, is not telling the whole truth. Litter boxes can host Toxoplasma, a parasite that is a threat to unborn babies. Pregnant women can be exposed through ingestion of feces from an infected cat. Even the microscopic amounts that might get on your hands while cleaning a litter box can pose a threat. While some sources advise simply washing your hands, Berger recommends that expectant mothers keep their distance. Whenever possible, “pregnant women should stay away from dirty cat litter and should not clean the box.” she says. If your partner is new to cat litter duty, make sure he or she knows how to keep it clean and up to your cat’s standards. Cats and Babies Don’t Mix Ever since Lassie rescued Timmy on television, dogs have had the family stamp of approval. Cats, however, never quite made it to the baby mainstream—on the contrary, there’s an ugly rumor that cats, attracted to the scent of milk, intentionally smother infants in their cribs. While your cat might attempt to get into the crib, his motivation isn’t sinister. “Many cats love to snuggle up and lay right next to the baby,” says Dr. Jeannine Berger, a veterinarian and vice president of Rescue and Welfare at the San Francisco SPCA. “The bed is soft and the baby is warm.” However, she cautions that pets and babies should never be left alone, regardless of how well they seem to get along. Your Baby Will Be Treated As &quot;Part Of The Pack&quot; Just as cats get a bad rap, we tend to give our dogs too much credit when it comes to children. Just because you love your new baby doesn’t mean your dog will see her as “part of the pack” and instinctually accept her. In fact, newborns are inherently unsettling to dogs. “Babies are loud, smelly, and fling their limbs around without thought,” says Rayburn. “This is all fear-inducing [behavior] for dogs. Even the best dogs can snap if they are afraid.” Introductions between babies and dogs should be gradual and all interactions should be supervised."}]