[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Alternatives to the Cone of Shame", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cone-of-shame-alternatives.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cone-of-shame-alternatives.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Surgery, General Care, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/alternatives-cone-shame"}, "datePublished": "May 6, 2016", "dateModified": "August 30, 2022", "description": "If your dog or cat is frustrated with the cone of shame, also known as an E-collar, there are alternatives on the market. But are these cone of shame replacements worth the additional cost? Find out more.", "articleBody": "By Kerri Fivecoat-Campbell Most pet parents of four-legged fur kids will at some point have an experience with an Elizabethan collar—more commonly known as the “cone of shame.” The traditional plastic cone, which is also sometimes called an E-collar or pet cone, is a sized plastic cone that keeps dogs and cats from turning their bodies to lick or chew on surgical sites, hot spots, or injuries. The E-cone has been called many things, including the “lampshade” and “pet radar dish,” but is currently called the “cone of shame” by many due to the somewhat bad reputation it receives from pet parents, social media, and animals, too. “Everyone hates it,” says Jeff Werber, DVM, a veterinarian to celebrity pet parents at Century Veterinary Group in Los Angeles, Calif. “Animals hate it, and for pet parents, dogs especially are like bulls in a china shop—running into things and knocking things over.” The cone plays an important role in the healing process, however, but if your pet just can’t stand the traditional collar, there are alternatives. History of the E-Collar Joel Ehrenzweig, DVM, and a corporate consultant in Richmond, Va., says that when he started practicing 40 years ago, there was no such thing as a pre-made E-collar. “We made them from X-ray film or cardboard for our patients and made a cushion for them out of adhesive tape.” “When our pets started making the transition from the barnyard to backyard to bedroom, more products began coming out for our pets’ comfort,” Ehrenzweig says. Around the same time the E-collar was becoming popular, surgical procedures advanced and more topical treatments for wounds helped pets to heal faster. The combination of the E-collar and shortened healing times helped veterinarians and pet parents accept the short-term inconveniences of the E-cone, says Ehrenzweig. “There are many products out now that can be an alternative to the plastic E-collar, but the trick is finding one that works best for your pet,” he says. Alternatives to the Cone of Shame Erin Preiss, DVM, and veterinarian with The Vet House Veterinary Hospital in Richardson, Texas, says that there are several variations of the E-collar: Pillow collars Like E-collars, these fit around the neck of your pet, but are made of cloth or inflatable materials. Advantages: They look better than the E-Collar and are likely more comfortable. Disadvantages: If not fitted properly your pet may still be able to turn its body and chew or lick his wound. Padded rings, neck bands and donuts These are large, padded collars. Advantages: More attractive and more comfortable for pets. They also improve a pets’ peripheral vision while wearing it. Disadvantages: The rings must be much larger in diameter to prevent the pet from turning around. Not desirable for animals that are left alone or for overnight as they make it hard for the pet to lie down. Cloth cones These cones are made of cloth and are sturdy to a certain extent, but are also collapsible. Advantages: Most likely a lot more comfortable for pets, and they look better Disadvantages: Some of these collapse too easily, making it all but a sure thing that a pet will scratch, lick, or bite an incision or wound if not being supervised. All of these alternative collars are generally more expensive than the traditional plastic E-collar.   Some pet parents use commercial belly bands to protect surgical areas or wounds, but Preiss says that belly bands should only be used by a veterinarian to contain bleeding or if the vet has a concern about a pendulous abdomen after surgery. “The ones we use are custom fit to the need of the patient and are made from flexible bandaging material,” says Preiss. “A store bought belly band would trap moisture around the surgical site.” Veterinarians Prefer the E-Collar While some of the alternatives to the plastic E-collar might work for your pet, Werber and other experts say the most reliable protection for your fur kid is typically going to be the plastic E-collar. “Most pets will get used to it and do fairly well—even cats,” says Werber. But, he says, “some pets may not do well, and some cats sometimes just shut down with it on. At that time I would start looking at alternatives.” Werber says the inconvenience of the collar is only temporary. He says that many patients will only have to wear it for seven days, but some may have to go as long as ten days or as few as five, depending on the nature of the surgery or wound site. “If the pet is in a multi-pet household, the other pets may have to wear one too, or be kept away from the injured pet so they do not lick the wound site of the injured pet,” says Werber. “We also tell our clients to keep that cone, as they will likely need it again at some point in their pets’ lives.” The most important tip he gives is to make sure the collar is fitted properly. “If it’s too big, the pet cannot eat or drink. If too small, your pet will be able to turn around, defeating the purpose,” he says. He says it’s also very important that you follow your veterinarian’s recommendations requiring your pet to wear a collar. "}]