[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Traveling by Air With Your Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_150618770.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_150618770.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/traveling-air-your-dog"}, "datePublished": "July 12, 2013", "dateModified": "August 30, 2022", "description": "With the season for vacations fast approaching, it’s time to consider whether you will be traveling with your dog or leaving her behind.", "articleBody": "Image Sergey Nivens / Shutterstock By Victoria Heuer  With the season for vacations fast approaching, it’s time to consider whether you will be traveling with your dog or whether you will be leaving her behind. Some people find they worry too much when their dog is left behind, but the hassle of air travel with a dog can be overwhelming unless you’ve ironed out all the details. Before You Decide It is a good idea to first check on the status of the city, town or state you will be visiting for conditions such as weather advisories (which can vary by time of year and location), disease outbreaks that are endemic to the area, or disease risks that your dog may be unprepared for (e.g., water parasites, heartworm, ticks, rabies). In addition, some countries and states do not allow for animals to be transported into their territories at all. Dog-Friendly Hotels Again, before you even make a firm decision to take your dog along, if you are not going to be staying with friends or family you will need to make sure that your destination has pet-friendly hotels. However, pet friendly does not always mean dog friendly, and dog friendly does not always mean large-dog friendly. These are very important details to check on when vacation planning begins. If you cannot make arrangements for lodgings, you will need to make arrangements for your dog’s care at home, before you’re left scrambling for a sitter or open kennel space. Veterinarian Away from Home Whether your dog has medical issues or not, it is a good idea to know where the animal doctors are before you get there, just in case. Just as we can often come down with intestinal (or other) issues while away from home, our dogs can have issues too. Do research. If you have friends in the town you are visiting, have them ask their friends with pets where they go. There are also some great review sites where you can see how other patients have fared with the respective vets in their towns. And call ahead. Ask the vet his or her policy on walk-ins and new patients. Ask about the base charges for visits and other costs. Ask your current vet if he or she would be able to fax relevant files in case of urgent care.   Choosing a Pet-Friendly Airline Different airlines have different allowances. Some will allow dogs to be taken into the cabin as long as they fit under the seat. Others will only allow dogs to be kept in the cargo hold. Yet others will allow both. In almost all cases, airlines will restrict the breeds that are allowed to travel (no brachycephalic breeds), the age of the dog (more than eight weeks and in some cases more than 15 weeks), whether the dog is a barker or whiner (i.e., disruptive), and how many pets will be allowed into the cabin at the same time. Make sure to get there early to assure your place in the cabin. And almost every airline requires certificates of vaccination and good health (most, but not all — check ahead). Choosing the Dog Crate for Air Travel Not all dog crates are created equal. Some are better for home use, some for car travel use, and some are specifically designed for traveling by plane. Verify with your airline that the dog crate you intend to use is in accordance with all their rules and regulations."}]