[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Estate Planning for Pets: Why You Should Do It", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-estate-planning.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-estate-planning.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, End of life", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/estate-planning-pets-why-you-should-do-it"}, "datePublished": "February 24, 2017", "dateModified": "August 30, 2022", "description": "While it’s still not commonplace for owners to include a pet provision in their will or trust, the practice just might be catching on. Learn the basics of estate planning for pets.", "articleBody": "By Cheryl Lock As hard as it may be to contemplate your own mortality, most people make sure to plan out their wills and estates in advance, so that loved ones are taken care of after their death. People with spouses and children likely have this on their immediate to-do list, but what about those of us with other family members…the kind of the furry persuasion? While it’s still not commonplace for an owner to provide for pets in his or her will or trust, the practice just might be catching on. “More and more often, people are making provisions for their pets in their estate plans,” says Miriam Davenport, senior director of development with spcaLA. “However, it is much more common for an owner to pass away without provisions made for the care of the animal.” In fact, a recent Rocket Lawyer survey conducted by Harris Poll found that only 18 percent of respondents would include a pet provision in their estate plan, with millennials more interested in having pet provisions than baby boomers (at 23 percent compared to 14 percent). Why You Should Include Your Pet in Your Will Perhaps part of the problem is not understanding what including your pet in your will would look like (or that it’s even an option), but experts can help. Attorney Jason Turchin, who operates a law firm in Weston, Florida, says he has handled pet estate questions before and has pondered the issue as a dog owner himself. If you don’t provide for your pet in your will, your animal could be treated as “property” under the will, Turchin explains. When you don’t have a will, your state’s intestacy laws could determine what happens with your property, he adds. Estate Planning for Pets: What to Do So what’s a pet owner to do? “One option is to designate in your will who you wish to care for your pet, like you would with any other specific property bequeaths,” says Turchin. “Another option is to create a pet trust, which may be either written into the will or as a separate document and referred to in the will, depending on the state laws.” A pet trust could designate someone as the pet’s trustee—or your pet’s guardian/owner—and could provide for certain assets to go into the pet trust to help pay for the pet’s care, as well. “Another consideration is to take out a small life insurance policy and list the trust as the beneficiary,” says Turchin. “If the life insurance company will allow this, your pet trust would then have this asset to help care for your pet once you die.” If, however, you fail to make accommodations for your pet and nobody is able to care for her, your pet could ultimately be turned over to the state or local animal control board. “Some of these are kill shelters,” says Turchin. “So it is definitely something to think about when planning an estate.” Besides dealing with a lawyer and a will and trusts, your local SPCA may have programs that can help you make provisions in your estate for the care of your pet, Davenport suggests. Whatever your plans are for your pet after you go, remember to also discuss them with whomever you plan to leave your pets to in your will or trust. “Assuming your executor or a family member will care for your pets isn’t fair to anyone—allergies, resident pets, pet care costs, and other complex factors come into play,” says Davenport. “While cats and dogs typically live between 10 and 15 years, certain pets, like some tortoises and parrots, can live for 60 years or more. Pet care is a lot to assume without a plan.”"}]