[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "3 Reasons to Microchip Your Dog Today", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/frame-with-a-beautiful-girl-with-a-beautiful-dog-in-a-park-on-green-picture-id1127312764.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/frame-with-a-beautiful-girl-with-a-beautiful-dog-in-a-park-on-green-picture-id1127312764.jpg"}, "author": {"@type": "Person", "name": "Sarah Wooten, DVM", "url": "https://www.petmd.com/author/dr-sarah-wooten"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/3-reasons-microchip-your-dog-today"}, "datePublished": "April 26, 2019", "dateModified": "August 30, 2022", "description": "A veterinarian explains why pet parents shouldn’t procrastinate on the microchipping of dogs.", "articleBody": "Microchipping can potentially save your pet’s life, so why would you wait? For pets that aren’t microchipped, there’s no better day than today for pet parents to get it done. Here’s how they work and some reasons why you should microchip your dog. What Is a Dog Microchip and How Do They Work? A dog microchip is a tiny piece of technology—about the size of a grain of rice—that is implanted under a dog’s skin, usually in between a dog’s shoulder blades. These microchips are encoded with a unique number that is recorded in the manufacturer’s database. Each manufacturer will have a website where you can attach your personal contact information—name, address, phone number and email—to the microchip number. So how do dog microchips work? All veterinary offices and shelters have a microchip reader, and by simply waving the reader over the microchip, an animal healthcare professional can noninvasively read a dog’s microchip number. They can then run that through a search database, where—as long as you’ve registered—your information will show up. Now that you know how microchips work, here are three great reasons why you shouldn’t hesitate to get your dog microchipped. Dog Microchips Save Lives In the unfortunate event that your dog ever gets separated from you, a dog microchip will ensure that your pup can be identified and returned to you as soon as possible. If your dog gets lost, stolen or ends up at a shelter, they will have a permanent form of identification that ensures that they can find their way back to you. You just need to make sure to keep your information current in the online database. “Stray” dogs that are not microchipped are at risk of euthanasia in kill shelters, so getting your dog microchipped and keeping the information updated in the online database could literally save your dog’s life. Implanting a Microchip Is Quick and Easy The microchipping of dogs is a simple outpatient procedure that takes less than 5 seconds and can be done during a veterinary appointment. After cleaning the injection site with alcohol, a microchip is injected with a needle, just like a vaccination. Some dogs don’t notice or react to the injection; other dogs may yip and jump in response to being injected. If you know that your dog might cry a little, then you can mentally and emotionally prepare yourself to be calm, which can help to calm your dog. Veterinary professionals appreciate relaxed clients, and it will be over before you know it! Dogs that are distracted by treats may not notice the injection at all!  You can bring some tasty dog treats to distract your dog, or ask the veterinary staff if they have treats that you can use. Once implanted, microchips are not considered to be painful and have a very low incidence of side effects. Microchips usually cannot be felt under the skin, unless your dog is very small or very thin-skinned. Microchipping a Dog Is Inexpensive How much is your peace of mind worth? Turns out you can buy a little peace of mind for your dog for $25-$50. If you are looking to keep costs down, keep in mind that June is National Pet Microchipping Month, which means that local shelters, vaccine clinics, veterinary offices, and other pet health care agencies are running cost-saving specials on microchips. And year-round, you can search online to find local mobile pet clinic events where they will microchip your dog for a reduced cost. Dog microchips are guaranteed to work for the life of the pet and do not require any batteries or any maintenance, aside from updating your information on the online registry if you move or change your phone number. Every dog parent deserves the peace of mind that comes with microchipping. Don’t delay—get your pet chipped today! By: Dr. Sarah Wooten Featured Image: iStock.com/stadret"}]