[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Breeds Prone to Ear Infections", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-ear-infections.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-ear-infections.jpg"}, "author": {"@type": "Person", "name": "Hanie Elfenbein, DVM", "url": "https://www.petmd.com/author/dr-hanie-elfenbein"}, "keywords": "Dog, Breed, Ear health, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/dog-breeds-prone-ear-infections"}, "datePublished": "October 30, 2017", "dateModified": "August 30, 2022", "description": "Ear infections are one of the most common reasons pet parents bring their dogs to the veterinarian. While any dog can develop an ear infection, some breeds and types are more prone than others.", "articleBody": "By Hanie Elfenbein, DVM Ear infections are one of the most common reasons pet parents bring their dogs to the veterinarian. They aren’t just uncomfortable for your dog and frustrating for you. When they are chronic, ear infections can be very painful and can lead to vertigo and deafness. Dogs tell us they have ear infections by scratching at their ears. You may also notice a yeasty smell or redness. Ear infections are usually due to bacteria or yeast. Ear mites can also lead to ear infections but are easily prevented with most monthly flea and tick medications. The body responds to ear infections by increasing ear wax production to try and expel the infection. Unfortunately, that sometimes makes the infection worse instead of better. Dogs Prone to Ear Infections While any dog can develop an ear infection, some breeds and types are more prone than others: Cocker Spaniels With their heavy, floppy ears and thick hair, Cocker Spaniels are at high risk for ear infections.   Labrador Retrievers Retrievers love to play in the water, which means there is more opportunity for their ears to get moisture in them. Yeast and bacteria thrive in moist environments, leading to ear infections. Pit Bulls Pit Bulls are prone to skin and ear infections, which are often related to allergies.  Poodles Dogs with very hairy ears are prone to ear infections. When the hair works right, it keeps debris out of the ear. But when there is infection, the hair may make it more difficult for the material to exit the ear canal.   Shar-Peis Shar-Peis and other dogs known for heavy skin folds often have very narrow ear canals. This means that even a small amount of debris can clog the canal and cause significant discomfort. Narrow canals also means it’s harder for material to exit once it gets in.   Allergic Dogs Dogs with allergies tend to develop ear infections. There are two ways this happens. The first is that they become itchy and scratching the ears disrupts the normal defenses against infection. The second way allergies lead to ear infection is that part of the dog’s allergic response is an overgrowth of the normal yeast or bacteria in their ears. These dogs often develop chronic or recurrent ear infections. The only cure is to address the underlying allergies.   Treating Ear Infections in Dogs When you take your dog to the veterinarian for a suspected ear infection, the doctor will perform an otoscopic exam, in which he or she will look deep into the ear canal with a magnifying glass. Your veterinarian will look under a microscope at material from the ear canal, also known as an ear cytology. He or she can prescribe a medicated ointment, based on what the exam and cytology show, and provide recommendations on cleaning. It’s typical for dogs to get rechecked in two to four weeks to make sure the medication worked or to decide to continue treatment. As with any infection, it may persist after your dog stops showing signs.  It&#039;s important to note that some ear infections can cause the ear drum to rupture. If the ear drum is ruptured, many medications used to treat ear infections can cause deafness and other serious side effects. Your veterinarian can determine whether the ear drum is intact and prescribe appropriate medication.   Keeping Your Dog’s Ears Healthy Use a towel to dry the hair on both sides of your dog’s ears when he gets out of the bath, pool, lake, or other water body. Clean the ears with a gentle ear cleaning solution when you bathe your dog. To use the cleaner, squirt a small amount into the ear canal and rub the ear tissue between your fingers. This helps to get the liquid down into the deep ear canal. It is normal for your dog to shake his head when you do this. Simply wipe off any of the cleaner that has come out. It is safe to use a standard cotton swab to remove debris in the folds of tissue. You will not rupture the ear drum using gentle pressure to remove any debris you see (do not stick the cotton swab down into the ear canal). See your veterinarian at the first sign of itchiness.   Read more:    5 Tips for Preventing Ear Infections in Dogs   Natural Treatments for Ear Infections in Dogs"}]