[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Signs a Dog With Diabetes Is Dying", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/dog-with-diabetes-dying.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/dog-with-diabetes-dying.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, General Care, End of life, Diabetes, Disease", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/signs-a-dog-with-diabetes-is-dying"}, "datePublished": "November 17, 2022", "dateModified": "November 17, 2022", "description": "Dr. Coates talks about signs of advanced and untreated diabetes, and complications of diabetes as well as how to determine your dog’s quality of life.", "articleBody": "It’s true that a dog can pass away within a month or two of beginning to show signs of diabetes, but many will live for a year or two after diagnosis with appropriate treatment. Some do very well for even longer, particularly if they have a dedicated pet parent who can continue to provide the care they need. Dogs with diabetes usually require insulin injections, dietary management, and close monitoring for the rest of their lives. Sooner or later, it’s normal to start to worry about your pet’s quality of life. It’s difficult to know when it’s time to think about euthanasia if your pet is no longer enjoying a reasonable quality of life. What Are the Signs That a Dog With Diabetes Is Dying? Most dogs with diabetes get a form of the disease where their own immune system attacks and destroys insulin-producing cells within the pancreas. Eventually, these dogs won’t produce enough insulin to survive without treatment. Early signs of diabetes in dogs include increased thirst and urination as well as weight loss, despite a normal or even increased appetite. These symptoms will worsen relatively quickly if the dog doesn’t receive insulin. Signs of advancing diabetes include: A dramatic increase in thirst and urination Dehydration Lethargy and weakness Severe weight loss Repeated infections, especially bladder infections Urine that is sticky and smells sweet Cataracts Diabetic neuropathy (a type of nerve damage more common in cats than dogs) The final stage of untreated or poorly treated diabetes is often a condition called diabetic ketoacidosis, which will be fatal unless the dog quickly receives aggressive veterinary treatment. Undiagnosed and Untreated Diabetes Most dogs who develop diabetic ketoacidosis have diabetes that has either not yet been diagnosed or is not being treated with insulin. Insulin is needed to move glucose (a type of sugar) out of the bloodstream and into cells, where it is used as an energy source. Without enough insulin, a dog’s blood glucose levels rise to dangerous levels while their cells are simultaneously being starved for glucose. To compensate for the lack of glucose inside cells, the body begins to break down muscles and fat to produce energy. The body produces ketone bodies when fat is used as an energy source. This works in the short term, but over time, high levels of ketone bodies in the bloodstream make the body too acidic, hence the term diabetic ketoacidosis. Prolonged acidosis leads to electrolyte imbalances, muscle damage, heart failure, fluid buildup in the lungs, kidney damage, or death. Signs that a dog might be suffering from diabetic ketoacidosis include all of the symptoms associated with diabetes, plus: More severe lethargy and weakness Mental dullness Rapid breathing Breath that smells like acetone (think of nail polish remover or paint remover) Vomiting Diarrhea Seizures Death Dogs can recover from diabetic ketoacidosis. They will need several days of hospitalization to be given intravenous fluids, insulin injections, medications to correct electrolyte abnormalities and acidosis, and symptomatic care. Treated Diabetes With Complications Dogs who are being treated for diabetes can also develop ketoacidosis, often because they have another health problem that has made them need a higher dose of insulin than they are getting. The opposite problem—getting too much insulin—is just as dangerous. Dogs whose insulin needs have declined (maybe they’re not eating well or are getting more exercise than normal) or dogs that have been accidentally overdosed with insulin can develop dangerously low blood sugar levels (hypoglycemia). Signs of hypoglycemia in dogs include: Sleepiness Hunger Shivering Unsteadiness Disorientation Seizures Coma Death If you think your diabetic dog might be hypoglycemic, do NOT give them more insulin. Rub corn syrup, honey, maple syrup, or a sugar solution on their gums if they will let you, and more importantly, get them to the nearest veterinarian immediately. When Should You Euthanize a Dog With Diabetes? Monitoring a diabetic dog’s quality of life is extremely important. Using a pet quality of life scale will help you identify parts of your dog’s life that might be causing them distress. Quality of life scales should help you assess six important factors: Eating Drinking Peeing Pooping Joy (mental health) The well-being of human family members You may be able to improve the problems you uncover. For example, if your dog is showing signs of discomfort, adding a pain-relieving medication (or additional pain-relieving medications) to their treatment plan could help. Or maybe the time and financial commitments of your pet’s care are taking a toll on you. Financial assistance or respite care may be available. Talk to your veterinarian if you are worried about your dog’s quality of life. They are your best resource for information about treatment options and help that might be available in your area. If your dog’s quality of life is poor and there isn’t a reasonable expectation that it will improve, your veterinarian can talk to you about euthanasia. While end-of-life decision-making is always difficult, euthanasia is often the humane way to prevent more suffering. Featured Image: iStock/Chalabala"}]