[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Safety Tips for Pet-Proofing Your Home", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Pet-Proofing-Tips-for-Pet-Safety-750963856.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Pet-Proofing-Tips-for-Pet-Safety-750963856.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/pet-safety-tips-pet-proofing-your-home"}, "datePublished": "September 7, 2018", "dateModified": "August 30, 2022", "description": "Our pet’s safety is always on our minds, even while inside of our homes. Here are some tips for pet-proofing your home to make it safe for your pets.", "articleBody": "Image via Monika Wisniewska/Shutterstock By Linda Rodgers Maybe you think pet safety is something you only have to worry about when you have a puppy or kitten at home. But no matter their age, cats and dogs can get into serious trouble with ordinary household objects—from the medicine in our cabinets to the flowers on our mantels. In fact, many pet parents can put their pets’ health at risk without even knowing it. So here is your cat-and-dog safety primer to help you pet-proof your home and prevent accidents from happening. Pet Safety Risk: Medications “One of the number one dangers in the home for pets is medications—either pet medications or human ones,” says Dr. Ann Hohenhaus, a veterinarian at Animal Medical Center in New York City. That’s because medicine containers—whether they’re over-the-counter, prescription or even vitamins—are often left out where dogs or cats can knock them down and find a way to eat what’s inside. Pills and supplements can also drop on the floor, where pets can scarf them up. Next thing you know, your pet is seriously ill, and you have to take him to the ER. Pain relievers like acetaminophen and ibuprofen, anti-depressants and sleeping pills are of particular concern to both cats and dogs. But even something as seemingly harmless as cough drops can sicken a dog who eats too many, says Dr. Hohenhaus. And because of their small size and the fact that they are physiologically unable to handle some human or dog medications, cats are at especially high risk of poisoning. Pill Pet Safety Precautions Separate prescription pet medication from human medications so you don’t mix them up. If you keep meds in a pill box, shut it and stow it away; otherwise, your pet may think it’s a toy. And don’t leave bags or your purse on the floor—any drug or interesting item they find is fair game for curious furry critters.   Pet Safety Risk: Electrical Cords “Chewing on electrical cords can certainly cause electrocution,” says Dr. Bruce G. Kornreich, associate director of Cornell Feline Health Center at Cornell College of Veterinary Medicine. And while chewing on cords is more common among puppies and kittens, even older animals can be attracted by electrical cords that dangle and swing. Electrical Pet Safety Precautions Bundle up or tie cords together—or cover them up, advises Dr. Hohenhaus. You can spray the area around cords with a pet repellant or you can use something like the PetSafe SSSCAT deterrent cat spray. It emits an odorless spray into the air to startle pets when the motion-detector senses a pet near a forbidden area. Or line the area around the cords with tinfoil or newspapers—cats hate stepping on both, Dr. Hohenhaus says. Pet Safety Risk: Food While certain foods may be safe or simply result in a mild  stomachache, others pose more of a danger. Onions (or anything in the onion family, like chives and garlic), for instance, increase the risk of anemia in dogs and cats. Grapes and raisins can also cause kidney failure (again, in both dogs and cats). Another toxic substance is xylitol, an artificial sweetener that is found in many products, including mints, gum and certain diet foods. In dogs, xylitol can damage the liver and cause blood sugar levels to plummet. While felines tend to turn up their noses at chocolate, dogs love the stuff. Unfortunately, they are quite sensitive to two of its ingredients, caffeine and theobromine. Dark chocolate and cocoa powder are the most toxic, especially for older dogs and dogs with heart conditions. Symptoms can include vomiting, diarrhea, restlessness, agitation, irregular heart rhythms, tremors and seizures. Food Pet Safety Precautions Bar your pet from the kitchen by installing dog gates to keep the kitchen off-limits. The Regalo Easy Step extra tall walk-through gate can keep out even the largest dogs, and it has a latch to make it easier to walk through. Most cats, though, will find a way to climb up and jump over a gate, says Dr. Hohenhaus, so she uses a large piece of plexiglass instead, and that seems to do the trick of keeping a cat out of a room. You can also use a pet-proof trash can so your pet can’t tip over the garbage and scarf up whatever spills onto the floor. If you have kids, remind them not to leave candy or other food items lying around or on the floor, where a hungry pup can sniff out the goodies. Pet Safety Risk: Plants Plants toxic to cats include philodendrons, tulips and hydrangea. But the “number one plant that sends cats to the hospital is the lily,” says Dr. Hohenhaus. “Any plant from the lily family can damage a cat’s kidneys.” Your cat doesn’t even have to eat that much to suffer life-threatening damages. Plants toxic for dogs include tulips (especially the bulbs out in the garden) and sago palms (the whole plant is toxic, but the seeds are the most dangerous). Sago palms can cause blood clotting disorders and other problems that are potentially fatal without prompt veterinary treatments. Plants toxic for both dogs and cats include such holiday favorites as mistletoe and holly, but not so much poinsettia. Cyclamen, a pretty pink flowering houseplant, can give your cat or dog diarrhea and even seizures and abnormal heart rhythms if they eat a lot of it. Plant Pet Safety Precautions Get rid of toxic plants and replace them with pet-friendly ones, which include African violets, ferns (like Boston ferns), orchids and spider plants. Before bringing plants or cut flowers home, always research whether they are plants that are toxic to dogs or cats. Pet-Safety Risk: Falling From High Places Pet owners may not realize that their furry family members can fall from a number of high places, both indoors and out, says Dr. Kornreich. Windows, decks, balconies and even stairs can present challenges for dogs and cats. Cats who are intent on chasing something can shoot through an unscreened window or slip through balcony or deck railings, as can small dogs. Falling Pet Safety Precautions Until your pup learns how to clamber down the stairs, put a dog gate at the entrance to staircases. Do the same for senior dogs, who may not be as agile as they once were. (This Safety 1st wide doorways fabric pet gate may do the trick.) You can’t count on traditional window screens to hold back heavy, fast-moving or determined pets. Secure high windows so they can only be opened a few inches, or make use of window grilles or bars. If you have a deck or balcony, you can buy plastic netting that ties onto the railings and acts like a shield. Acrylic sheets also work well. And even if you’ve pet-proofed, always supervise your pet. Pet Safety Risk: Allergens “Both cats and dogs are susceptible to health problems when they inhale allergens,” says Dr. Kornreich. Pets can become itchy or develop other health problems from a number of triggers, including mold, pollen and dust mites. “[Allergens] can also exacerbate respiratory problems, such as asthma, in cats,” he adds. Another concern, according to Dr. Kornreich, is secondhand smoke, which can cause respiratory problems and even cancer. Allergen Pet Safety Precautions Close your windows if outdoor allergens are a problem, and keep your house as clean as possible. Make sure your vacuum has a high-efficiency particulate air (HEPA) filter, which can be effective at minimizing allergens in the home. This can help with pet allergies and people allergies, too. Don’t forget to launder pet bedding, and tell any smokers who visit that they must light up outdoors, away from your pets."}]