[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Boarding Your Dog (and Cat)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/5072314042_8ffc846a07.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/5072314042_8ffc846a07.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Boarding", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_boarding_your_dog"}, "datePublished": "March 17, 2011", "dateModified": "August 30, 2022", "description": "Every day people face the question of what to do with their pets when travel, illness, or family emergencies disrupt normal care. Fortunately, the majority of pet owners who find themselves in need of substitute pet care utilize the services of professional boarding kennels.", "articleBody": "Courtesy of the American Boarding Kennels Association, the non-profit trade association for the pet boarding industry in the United States and around the world. ABKA offers information, publications, education, and facility accreditation. Introduction Every day people face the question of what to do with their pets when travel, illness, or family emergencies disrupt normal care. Some pet owners attempt to solve this problem by taking their pets with them, only to discover that hotel restrictions, travel-induced pet illness, and runaway pets can turn their trip into a disaster. Other pet owners turn over the care of their animals to well-meaning but untrained neighbors or friends. Again, the results are often unsatisfactory. Pets entrusted to such part-time custodians frequently escape or become seriously ill because of lack of reliable, frequent, and knowledgeable supervision. Fortunately, the majority of pet owners who find themselves in need of substitute pet care utilize the services of professional boarding kennels. Annually, more than 30 million pet owners recognize that full-time, knowledgeable, and experienced boarding kennel operators provide the most dependable, secure, and safe pet care available. Because competent, ethical boarding kennels are an important part of your pet care program, and because the selection of a boarding kennel can be a confusing and disconcerting process for pet owners, the American Boarding Kennels Association (ABKA) has assembled this data to assist you in evaluating, selecting, and working with your local boarding kennel. Our goals are twofold: 1. To give your pet a happy and safe boarding experience. 2. To enable you to enjoy your time away from home content that your pet is receiving the best care possible. What is a Boarding Kennel? Throughout the United States and Canada, there are approximately 9,000 boarding kennels offering their services to more than 30,000,000 pet owners annually. Boarding kennels are businesses designed and operated specifically to care for pets, as distinguished from breeding kennels, which are devoted to producing puppies; training kennels, which take in dogs for hunting, protection, and other types of specialized training; and veterinary hospitals, which are designed to care for sick and injured animals. Most boarding kennels provide a variety of pet services, such as boarding, grooming, training classes, pet supply sales, and pet shipping. Although the vast majority of boarded pets are dogs and cats, many kennels also offer boarding for horses, birds, reptiles, and exotic pets. What is the American Boarding Kennels Association? A characteristic common to all boarding kennel operators is a deep love and respect for animals. This is their basic motivation for establishing their kennel. In 1977, however, a dedicated group of kennel operators recognized that the love of animals, by itself, was not enough to guarantee the development of professional standards of pet care within the industry. What was also needed were educational opportunities for kennel operators, to enable them to stay abreast of developments in pet care and to establish a method for promoting a high level of ethical conduct within the industry. To achieve these goals, these concerned kennel operators founded the American Boarding Kennels Association (ABKA). Today the ABKA has a membership of almost 1,600 kennels throughout the U.S. and Canada. By means of its publications, conventions, seminars, regional meetings, ethics program, certification program for kennel operators, accreditation program for kennels, and industry committees, the Association helps member kennels to develop and maintain the highest professional and business standards. This in turn enables ABKA members to offer you, the pet owner, the most knowledgeable, ethical pet care available anywhere. Successful Boarding The goals of the ABKA member kennels are happy, healthy pets and satisfied pet owners. This requires a cooperative effort from kennel owner and pet owner. In the following pages, the ABKA, in response to numerous requests from pet owners, lists the features you should look for in selecting your kennel and suggests what you can do to ensure that your pet receives the best care possible. Let&#039;s start at the beginning. There are several ways of locating the kennels that are convenient to you: 1. Yellow Pages: Yellow page advertising is the primary method of kennel advertising. Remember though, the size of the ad is no indication of the facility&#039;s quality. 2. Recommendations of friends: Satisfied customers are the best recommendation that a kennel can receive. Ask your friends and neighbors about their experiences. Check with your veterinarian or ask the kennel in question for references. 3. Better Business Bureau: If your community has a better Business Bureau, a phone inquiry about your local kennels is appropriate. Ask about a specific kennel&#039;s reputation and if any complaints have been lodged against them. Evaluating a Kennel After finding your local kennels, you can determine the one to use by: 1. Telephoning the kennel. Call to see if the kennel can accommodate your pet. During peak times such as the Christmas season and summer vacations, many kennels are booked up and cannot accept your pet. Also, because some pets require special handling or accommodations (very young puppies, animals on special medication or feeding schedules, or giant breeds, for example), all kennels may not accept them. While you are on the phone, make an appointment to visit the kennel. 2. Making a personal visit to the kennel. A personal visit is essential to determine whether the kennel will be satisfactory. During your visit, observe or ask about the following ...  General Appearance of the Kennel Proper Following regular daily clean-up procedures, the kennel should look (and smell) neat and clean. Kennel operators are proud of their kennels and like to show them off, but some of them do not permit visitors in areas where animals are housed. There are two key reasons for establishing a &quot;No Visitors&quot; policy. First, some dogs react unpredictably to strangers (They become excessively fearful or aggressive). As a result, the presence of strangers in the kennel can cause such dogs to injure themselves or develop intestinal problems. Second, visitors do not follow the same stringent disinfecting procedures used by kennel personnel and can transport contagious agents (bacteria, viruses) into the kennel. However, kennels with a &quot;No Visitors&quot; policy should provide you some type of viewing window so that you can see where your pet will be staying. In visiting your local kennels, you will observe that there are several types of kennel designs currently in use. Some kennels have indoor/outdoor runs; some have totally enclosed facilities; and some house pets inside, but utilize outside exercise areas. Each of these designs has its own advantages, and you should ask the kennel operator to explain the advantages of the system in use at that kennel Security When you are on a trip, your pet may decide to try to &quot;find&quot; you. Because of this tendency, and because very few homes are designed with pet security in mind, pets can escape from inexperienced individuals who might be asked to watch your pet. Boarding kennels, on the other hand, are designed to prevent this kind of accident. During your kennel visit, look for sturdy, well-maintained fencing and gates, and dividers between runs. If your dog is a climber, digger, or some other type of &quot;escape artist,&quot; tell the kennel operator so that extra precautions can be taken (wire covered runs, locks on gates, etc.). Cats always require covered facilities. Safety Kennel areas where your pet will stay should be free of sharp objects, harmful chemicals, and objects your pet might swallow. Primary enclosures (sleeping quarters) should provide solid dividers between your pet and the other boarders, both for reasons of safety and so that your pet will be able to relax and sleep without feeling challenged by his or her neighbors. Exercise areas should include barriers between runs high enough to prevent male dogs from urinating into adjacent runs. Surfaces should offer good traction even when wet. Firefighting equipment should be readily available. Supervision Proper supervision is the key to good boarding. Pets should be checked frequently during the day by someone who is trained to recognize the signs of illness and distress. Experience and practical knowledge are required to detect or interpret such symptoms as lethargy (&quot;I thought he was just sleeping&quot;), severe intestinal disorders (friends or acquaintances rarely check the backyard for bloody stool), urinary problems (it is almost impossible to detect blood in urine when pets urinate on grass), loss of appetite, coughing, sneezing, or discharges from the eyes or nose. Yet, all of these signs can be significant. Competent kennel personnel are trained to recognize and evaluate such signs and to seek veterinary assistance when needed. Therefore, you should try to evaluate the competence of the kennel personnel. One good indication that the kennel operator is keeping abreast of the latest developments in pet care is his or her ABKA membership. Check for a current ABKA membership plaque on the office wall. If your kennel operator has been awarded the CKO (Certified Kennel Operator) designation by ABKA, it means that his or her competence and ethical fitness have been acknowledged publicly by the Association. If the CKO plaque has been awarded, it will be displayed proudly along with the kennel&#039;s ABKA membership certificate. Accredited kennels will display a certificate which attests to the fact that the kennel has been inspected and accredited by ABKA and has met over 200 standards of excellence. Sanitation The kennel should be free of dirt, fecal accumulation, odors, and parasite infestation (flies, fleas, ticks). There should be a strict schedule of disinfecting with effective chemicals. Note: Since 1978, there have been worldwide outbreaks of an intestinal disease called canine parvovirus. This disease is spread when dogs come into contact with a contaminated surface (clothing, shoes, grass, carpeting, etc.). New vaccines are now available to combat this disease, but until the dog population develops immunity to the disease it will remain a potential problem. Several professional disinfectants, including bleach at a 1:30 solution, are effective against parvo virus. Therefore, if there have been any reports of parvovirus disease in your area, your kennel should be using one of these products for routine disinfecting in addition to requiring the parvovirus immunization. Health Care Inquire about the following ... 1. Water: Individual containers filled with clean drinking water should be available to each animal. 2. Food: Feeding procedures vary from kennel to kennel. Some kennels supply preferred brands of feed, which they serve to all boarders. However, they usually allow you to bring your pet&#039;s favorite food, if you wish. Other kennels maintain a stock of the most popular brands and feed whatever you request. Still others require that you bring your pet&#039;s food when you check in. Determine the kennel&#039;s policy and whether there are any additional charges for special feeding arrangements. 3. Veterinary services: Ask about the procedure for obtaining veterinary service, if required. Some kennels retain a veterinarian on the premises. Others prefer to use your pet&#039;s veterinarian so that there will be a continuity of care. Remember that it is customary for you to be financially responsible for any veterinary care required for your pet while it is being boarded. 4. Immunization requirements: Dogs should be immunized against rabies, distemper, hepatitis, leptospirosis, parainfluenza, parvovirus (DHLPP), and bordetella. Cats should be vaccinated against rabies, panleukopenia or distemper, feline rhinotracheitis, calici virus, and pneumonitis (FVRCPP). 5. Medication policies and procedures: If your pet is taking medication, advise the kennel operator of the nature of the problem and the type and frequency of medication. Many kennels will not accept animals requiring excessive medication (more than three times per day or nighttime medication, for example) or animals requiring potentially dangerous medication (diabetes shots, for example). Remember, it is essential that heartworm preventive medication be continued during boarding, if your dog is presently taking such medication. Inquire whether the kennel provides such medication or if you should bring a supply. Ask if there is an additional charge for medicating. 6. Parasite control: If you live in an area in which fleas and /or ticks are a problem, your kennel should utilize procedures for controlling these parasites (pre-entry examinations for boarders, sprays, dips, etc.).  Provision for Animal Comfort 1. Temperature control: The kennel should be able to maintain temperatures within healthful, comfortable limits for your pets. If you have an older pet, or a pet that requires warmer or cooler accommodations than are normally provided, determine if special arrangements can be made. 2. Protection from the elements: Exercise areas should provide shelter from wind, rain, snow, and direct sunlight. 3. Ventilation: Good ventilation (no drafts) helps minimize the spread of airborne bacteria and viruses. 4. Light: Lighting should be at comfortable levels during the day. 5. Bedding: Find out what arrangements are made for pet bedding. Some kennels provide resting platforms, bedding, or newspaper. Others require that you bring bedding from home. Check if there are any restrictions on owner-provided bedding (wicker beds and feather pillows, for example, may not be accepted). 6. Sleeping Quarters: As you know from observing your pet, most of his or her time is spent resting or sleeping. Your kennel should provide a place for this purpose (a primary enclosure). It should be clean and dry, and roomy enough for your pet to stand up comfortably, turn around easily, and stretch out. 7. Exercise Area: All animals require exercise, but the requirements for dogs and cats are different. Let&#039;s discuss their requirements for exercise individually: DogsCatsDogs should have enough space to enable them to break into a run. Exercise time will depend upon the kennel&#039;s layout.  In some kennels, dogs are allowed free-access to their own individual exercise runs during the day. In such kennels, you may want to make arrangements to limit your dog&#039;s exercise time, if there is any reason he or she should not be allowed to exercise at will (an older dog with a heart condition or a &quot;hyper&quot; dog who tends to run too much weight off, for example).  Other kennels use a &quot;time-sharing&quot; method for scheduling exercise. In such kennels, make sure that the time allowed and the frequency of exercise periods are adequate for your dog.Because cats exercise isometrically (by stretching), and because they are not &quot;pack animals&quot; that need or enjoy the company of other animals (as dogs do), they do not necessarily require separate exercise areas, but are content when housed in roomy primary enclosures. However, some kennels also provide &quot;play areas&quot; for those cats that appear to enjoy the additional space. Whether or not your kennel provides such play areas, your cat&#039;s primary enclosure should be large enough to permit stretching and moving around, and should contain a regularly cleaned litter box.8. Additional services: Many pet owners find it convenient to schedule grooming, bathing, or training for their pets while they are in the kennel for boarding. Ask if such services are available. If you are in the process of moving, the kennel may even be able to take care of shipping your pet. Such a service can save you time and trouble, and helps ensure the safety of your pet. Business Procedures As a customer, you are entitled to be treated in a friendly, business-like manner. Furthermore, a kennel&#039;s customer-handling practices are a reflection of their awareness of their responsibilities to you, the customer, and to themselves as professionals. Therefore, you should observe the following: 1. Personnel: Kennel work is physically demanding and difficult. Nevertheless, kennel personnel should appear clean and neat. They should also demonstrate a high level of understanding and concern for your pet by their questions, their animal handling techniques, and their attitude. 2. Appearance of kennel grounds and office: Kennel property should be neat and well maintained. 3. Rates: Rates should be available in the kennel office. Be sure that you understand the method of calculating boarding charges. Some kennels have a checkout time, after which you are charged an additional day. Others charge by the night or day. 4. Boarding agreement or contract: Your kennel should have some type of boarding agreement which clearly states your rights and the kennel&#039;s responsibilities. This type of form protects you and the kennel from any misunderstandings in these areas. 5. Hours of operation: Days and hours of business should be clearly posted. If your kennel is closed on weekends or holidays, note and respect that policy. On those days all pets are fed and exercised and the facilities are cleaned and maintained, but the kennel office is closed and there is no one in the office to meet customers. 6. ABKA Membership Certificate: Your kennel&#039;s membership in ABKA is a public commitment to ethical practices, and is your assurance that the kennel is subject to the ABKA Ethics Program. As a pet owner patronizing an ABKA kennel, you also can call on the ABKA for information and assistance should you experience a problem with a member kennel. If the kennel also displays an ABKA accreditation certificate, you can be assured that they have met the stringent standards of the Voluntary Facilities Accreditation Program, which inspects over 200 areas of kennel operation. The ABKA Code of Ethics and the Bill of Rights for Boarded Pets should also be posted in your kennel&#039;s office for your inspection. It is a public statement of the standards by which your kennel should be judged. Using the information listed above, you have now located, evaluated, and selected your boarding kennel, and have completed most of the steps necessary for successful boarding. However, there is still one thing required to assure that your pet receives the best care possible, and that is that you fulfill your part of the boarding. Even the best kennel in the world cannot take proper care of your pet unless you assist them by observing the following recommendations ... Preparing For Boarding 1. Make your reservations early: Most kennels are booked up on holidays and during vacation times. If you wait until the last minute to make your reservations, you may be disappointed. As you make your reservations, verify those items which you should bring with you to the kennel (immunization records, special food, medication, bedding, and toys). Make arrangements for any special services you wish to have performed while your pet is in the kennel (grooming, training, or shipping). As you make your reservations, find out what type of payment arrangements are acceptable (credit cards, personal checks, money orders). 2. Prepare your pet for boarding: Remember that pets, like people, usually appreciate a vacation in new surroundings with new friends. Dogs, once they become familiar with their new surroundings, have a marvelous, exciting time, almost like kids at summer camp. (If your dog has never been boarded before, you might consider short, overnight stays at the kennel prior to an extended boarding stay to help him or her get used to boarding. Every time you return, your dog is less likely to affected by &quot;separation anxiety&quot; and can enjoy boarding more.) As a rule, kittens take to boarding easily and have a wonderful time. Adult cats usually display a very nonchalant attitude towards boarding and prefer to sit quietly and observe the daily kennel routine. They don&#039;t seem inclined to make new feline friends or participate in group play, but seem content to rest, eat, make friends with the help, and purr. Make sure that all immunizations are current (and have immunization records, if your kennel requires them). Don&#039;t overfeed your pet right before going to the kennel. The extra food is not really necessary and the result might be an upset stomach. Finally, because pets sense and reflect our emotions, DO NOT allow any member of the family to stage an emotional &quot;farewell&quot; scene. Your pets can be made to feel unnecessarily anxious about the kennel visit if they are subjected to this kind of dramatic display. 3. Check in during business hours: Bring all agreed upon medications, etc. Make sure that medications list the prescription number and name of the pharmacy so the kennel can obtain a refill if your return is unexpectedly delayed. Allow enough time in the kennel office to fill out the necessary paperwork. The kennel needs to know such things as: name, address, phone number, return date, additional services requested, where you can be reached in case of an emergency, the name of a local contact, your veterinarian&#039;s name and phone number, special feeding instructions (if any), medication instructions, etc. If your pet has any special problems that are not covered on the check-in forms, such as fear of thunder, epilepsy, or deafness, point them out to your kennel operator. All of this information helps your kennel take better care of your pet, especially if there is any type of emergency requiring special action. And this is what professional care is all about. Anyone can feed your pet, as long as nothing goes wrong. But what you want for your pet is supervision by someone who can assess and respond properly to emergencies. Don&#039;t be surprised if your kennel operator asks you to leave your dog in the kennel office rather than allowing you to place your dog in his run. This is done so that your dog will see you leave and will realize that you have entrusted him or her to the care of the kennel operator. It also eliminates the possibility of your dog getting the erroneous impression that you are placing him in the run to &quot;guard&quot; it. When dogs get that impression, they sometimes become aggressive. 4. Relax and enjoy your trip: Remember that you are leaving your pet in the hands of capable professionals. Pets in the kennel probably receive more care and attention than they would at home. Picking Up Your Pet When you return from your trip, here are some things that can help you and your pet to have a happy homecoming: 1. Pick up your pet during the kennel&#039;s normal business hours: Attempting to conduct business after hours is not only an imposition on the kennel operator and a possible disruption of sleep for the boarding animals, but can also result in a wasted trip to the kennel (because all personnel may be working in the kennel area and unable to hear the doorbell). For these reasons, many kennels assess an additional charge for after-hours pickup to discourage the practice. 2. Ask about your pet&#039;s stay at the kennel: Did your pet adapt well to kennel food, routine, and environment? Did he or she display any unusual behavior or require any special handling? This information will be entered on the kennel&#039;s records to assist kennel personnel in caring for your pet during the next stay, but you should also be aware of it in the event that you move or use the services of another kennel in the future. 3. Do not feed or water your dog for at least four hours after returning home: Cats adapt to their return home with the same easy acceptance with which they adapt to boarding, but dogs can become very excited when you return. And when dogs become excited, they tend to gulp food and water, which frequently triggers vomiting and/or diarrhea. Even if you normally provide unlimited access to either food or water, do not do so immediately after returning home. If your dog appears to be thirsty, provide a few ice cubes rather than water. Let him or her calm down for about four hours before offering food. 4. Contact your kennel operator if you have any questions about your pet&#039;s behavior after returning home: Sometimes pet owners become unnecessarily concerned about their dogs&#039; behavior, which is completely normal. (For example, many dogs tend to sleep almost continuously for a day or two after returning home. This is usually a result of being back in a relatively calm environment after the excitement of the kennel). However, if you observe anything that appears to be out of the ordinary, contact your boarding kennel operator to discuss your observations. Your ABKA kennel operator wants you to understand the boarding process and your pet&#039;s reaction to it, and will be happy to discuss any questions you might have. Conclusion ABKA member kennels have an investment in their profession. Through their participation in the educational programs of their association, they advance their knowledge and skills. Through their participation in ABKA&#039;s Ethics Program, they demonstrate their commitment to high quality, ethical pet care. To you, the pet owner, this is your assurance that your pet&#039;s time away from you will be as safe and enjoyable as possible. Your ABKA member kennel is a valuable member of your pet care team, which includes your pet, your veterinarian, your kennel, and you. ABKA members invite you to stop by for a visit. They would like to get acquainted with you and your pet, and they would be pleased to explain their services to you. They are proud of their kennels, and of ABKA, their trade association, which serves the boarding industry through Education, Encouragement, and Example. Developing a good relationship with a boarding kennel will make things a lot easier for your pet, your family, and you. Taking a few of the precautions mentioned in this booklet before and after you board your pet will result in a pleasurable (and economical) vacation for every member of your family. Do your homework in advance and trust your kennel owner to provide a safe, happy homecoming when you return. Have a good trip! Image: Loren Javier / via Flickr"}]