[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Smelly Pets and Seven Ways to Deal with Them", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/grassrolling3.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/grassrolling3.jpg"}, "author": {"@type": "Person", "name": "Patty Khuly, DVM", "url": "https://www.petmd.com/author/dr-patty-khuly"}, "keywords": "Dog, General Care, Grooming", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_smelly_pets_and_seven_ways_to_deal_with_them"}, "datePublished": "July 1, 2011", "dateModified": "August 30, 2022", "description": "Nonetheless, there is something you can do about her chronic malodor, especially if she falls into one of the following categories of stinkiness. Read up on the concern and, for best results, internalize their listed solutions.", "articleBody": "By Patricia Khuly, DVM Got a pet who’s conditioned you to believe that his loving presence is worth all his foul odors? If your pet smells nasty then you probably know exactly what I’m talking about (though some of you may be in denial). Everyone else thinks he stinks and stays away. But you? You love him, aroma and all.  Nonetheless, there is something you can do about her chronic malodor, especially if she falls into one of the following categories of stinkiness. Read up on the concern and, for best results, internalize their listed solutions. 1. The skin sufferers   If the surface of your pet’s skin’s smell is reminiscent of rotting fruit, something freshly dug up from deep underground, or just plain dogginess, you’ll know what I mean.  Solution: Whether this happens year-round or is limited to certain seasons, pets with certain skin conditions such as allergic skin disease and keratinization disorders (characterized by greasy and/or flaky skin), treatment of the underlying disease is generally effective in reducing or eliminating the odors associated with skin infections that accompany it.  Medicated shampoos and antibiotic and/or antifungal treatments are often necessary, at least at first and/or periodically, to tamp down the offending bacteria and/or yeast.  2. The gaseous ones   You know who you are.    Solution: Determining whether your pet has a condition such as intestinal parasitism, IBD (inflammatory bowel disease) or a pancreatic malfunction (as in EPI or “exocrine pancreatic insufficiency”) is crucial. But most pets who suffer excessive flatulence are merely exhibiting a mild intolerance to one or more ingredients in their diets.  Treatment of the primary dysfunction depends on the disease process, of course, but for those who suffer simple digestive intolerances may be helped either with probiotic supplements or through a process of trial and error with respect to diet choices. Carefully switching diets with varying ingredients until a minimum of flatulence is achieved is often fruitful in this regard.  3. The wildlife devotees These are the pets that stop, drop and roll at the sights and smells of a rotting carcass or raccoon feces (the foulest smelling scat on the planet). Maybe she’s a chronic, stray cat poop consumer (like my Sophie), or a skunk tracking wonder-dog.  Solution: Restriction of a pet’s yard-based or hiking activities is usually not advisable. They need an outlet for their natural drives––and the exercise, of course. Picking up scat in your yard is helpful, as is special fencing to reduce encroachment by certain wildlife species (if you must).  Alternatively and/or additionally, treating the resulting foul odors can be achieved through an excellent, freshly brewed mix of hydrogen peroxide (1 quart), baking soda (1/3 cup) and a dash of a grease-cutting dish soap like Dawn (my favorite).    4. The bad-breath breakfast club Oral breath, usually secondary to periodontal disease, can lay low a whole crowd of dinner party guests who might otherwise truly enjoy your pet––and their meal.  Solution: Regular brushing (at least twice a week, but daily for some pets) and routine anesthetic dentistry (as often as every few months for severe sufferers) is the mainstay of bad breath resolution.  But some pets just have bad breath that arises chronically from their mouths and/or stomach gases––not necessarily from their teeth. These latter pets may be helped by adjusting the ingredients in their food and possibly by adding parsley to their diet (available in capsules). “Fresh breath” water supplements are not helpful, in my opinion, but some pet owners beg to differ. 5. The anal gland leakers The two anal glands, found on either side of the anus in dogs and cats occasionally have the propensity to fill up and spill out when over-full. The characteristic stench is perhaps the nastiest odor pets are capable of emitting. Solution: Getting this under control is usually achieved by expressing the anal glands manually on a regular basis. Veterinarians and experienced groomers are best suited to this task, though many of my owners are willing to learn and manage quite well on their own. A hydrogen peroxide wipe to the backside is very helpful once the odor becomes apparent. 6. The otic stink-bombs Ear infections are almost always skin infections. But their specific challenges mean very specific odors distinct from that of the rest of the skin. A fruity-smelling yeast infection that may or may not progress to a stinking bacterial infection is the usual finding. Solution: Allergic skin disease is the primary cause of external ear infections in both cats and dogs. Infections can be dealt with by treating the underlying condition. Antibiotics and antifungals are used to tackle the infection––and the stink––but it will return (I promise), sometimes even after treating the allergy. After all, not every allergy is 100% treatable.  Cleaning the ears regularly with a mild disinfectant solution is always advisable. 7. The wet dog crowd Does your dog spend his life in the pool? Here in Miami that’s not uncommon––especially with Labs. Problem is, that also means wet dog smell that chronically lingers.  Solution: Keep your outdoor dog indoors, fence off the pool or invest in a proper canine blow-drier. Additionally, I recommend that you “Furminate” your dog daily to relieve her of some of the undercoat that traps moisture.  ***   Have any more examples and their solution? I’m all ears.   This was originally published on Fully Vetted, a petMD blog.      Image: lucianvenutian / via Flickr"}]