[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Scoop on Poop: Facts on How to Dispose of Dog Poop", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog_8.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog_8.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/scoop-poop-facts-and-fiction-about-disposing-it"}, "datePublished": "May 6, 2014", "dateModified": "August 30, 2022", "description": "As a pet owner you have to clean up after your pet, but do you know how to dispose of dog poop properly? Get the scoop on poop &amp; learn the facts on petMD.", "articleBody": "by Bryant, Carol Every dog poops. And every day, pet parents go through the task of cleaning up and disposing of feces. But do you know how to dispose of dog poop properly? Whether you scoop it with a shovel or pick it up with a poop bag, there are a few things that pet parents need to know about the daily ritual.  Let&#039;s separate the fact from the fiction about disposing of pet poop. Fact Flushing dog poop down the toilet – without a bag, only the waste – is perhaps the best disposal method, says the U.S. Environmental Protection Agency and the National Resources Defense Council. Leaving pet waste on the ground increases public health risks by allowing harmful bacteria and nutrients to wash into storm drains, and eventually into local waterbodies. But cat feces should never be flushed, as it may contain Toxoplasma gondii, a parasite that can infect people and animals. Municipal water treatment systems do not always kill this parasite. Fiction Leaving dog poop behind is good for the soil. Reality: In order for feces from a carnivorous animal to be used as an effective fertilizer, it has to be fully composted with other materials such as egg shells and grass clippings and allowed to break down over time. Fact America&#039;s 78.2 million dogs collectively deposit 10 million tons of waste per year, according to waste clean-up service, Doody Calls. That’s enough to fill some 268,000 tractor trailers. Fiction Dog waste cannot harm your health. Reality: Dog feces can carry a host of disease and worms -- including heartworms, whipworms, hookworms, roundworms, tapeworms, parvovirus, giardia, salmonella, and even E. coli. This is why it’s imperative to clean it up after Fido does his duty. Fact If not flushing (again only bagless dog poop, never cat waste), it’s best to use a biodegradable bag and place in the garbage. Fiction Bagged poop can be flushed. Reality: It can clog home plumbing and stress sewer systems."}]