[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/qfoekthohr", "@type": "VideoObject", "duration": "PT5M10S", "name": "pet-euthanasia-dr-villalobos", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/a59ac8c3649835c7bcde25bc3db7def766b398cc.jpg?image_crop_resized=640x335", "embedUrl": "https://fast.wistia.net/embed/iframe/qfoekthohr", "uploadDate": "2019-12-12", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/2d9fa0f6676c99f57679e41b9030666ab7bc6ce7.m3u8", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/when-to-put-dog-down?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Do You Know When to Put a Dog Down?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/woman-cuddling-with-dogs-on-bed-picture-id1394774841.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/woman-cuddling-with-dogs-on-bed-picture-id1394774841.jpg"}, "author": {"@type": "Person", "name": "Liz Bales, VMD", "url": "https://www.petmd.com/author/dr-liz-bales"}, "keywords": "Dog, Senior, General Care, End of life", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/when-to-put-dog-down"}, "datePublished": "August 8, 2019", "dateModified": "October 27, 2022", "description": "This is the most difficult decision you’ll ever have to make as a pet parent. Get some objective guidelines from a vet on how to tell when it’s time.", "articleBody": "I had the best dog. She saw me through veterinary school, marriage, and the birth of my first child. We grew up together. But by the time she was 14 years old, Veena was suffering from painful arthritis in her hips and back, along with GI problems, and was having difficulty seeing. As a veterinarian, I knew that there were many options for her, including hospice and palliative care, but as a pet parent, I could only see the difficult, heart-wrenching decision in front of me. Like all my clients, I wished that when things got too hard for her, my dog would pass away painlessly in her sleep. I wanted to be spared the heartache of having to make that choice for her. Unfortunately, nature seldom provides this luxury, so it’s up to us to do this for our pets. When Veena suddenly got much sicker and was in constant pain, I had to make that very personal decision of what was right for my pet. I had to humanely end her suffering by putting her down. This type of decision is difficult, and you should talk with your veterinarian to determine what’s best for you and your pet. To help you prepare for when that time comes, here’s what you need to know about putting a pet down. When Is It Time to Put a Dog Down? When your dog is suffering, euthanasia is a gift. It may be very difficult to think of it this way, but it is the kindest thing you can do for your pet. But how do you know when it’s the right time to say goodbye? Have an open and honest discussion with your veterinarian about your dog’s health and quality of life. They are uniquely qualified to offer some objective guidance based on their knowledge of your pet’s condition. Here are some questions you can ask yourself and your veterinarian: Does my dog have a good quality of life? Are they eating and drinking? Are they able to urinate/defecate? Do they enjoy human interaction? Does my dog have more good days than bad? Is it possible for my dog to recover with a treatment plan that I can commit to both financially and personally? Your veterinarian may be able to provide you with medications, treatment options, and changes that you can make at home that may help improve your dog&#039;s quality of life. However, it may be that there are no additional medical or home interventions that will cause enough improvement to bring your dog back to an acceptable level of comfort. If that is the case and you answer “no” to one or more of these questions, it’s time to talk about euthanasia with your veterinarian. Dog Quality of Life Scale To make the process easier on pet parents and to provide a clear structure for how to evaluate your dog’s current life experience, veterinary oncologist Dr. Alice Villalobos created a Quality of Life scale. Her scale is also called the HHHHHMM or H5M2 scale. These letters stand for categories that you can use to assess your pet’s quality of life. Each section is to be given points on a 0 to 10 scale, with 10 being ideal. If the total is less than 35, it may mean that your dog’s quality of life is suffering. HHHHHMM includes: Hurt – This relates to a pet&#039;s ability to breathe easily without distress and assesses whether their overall pain is well-controlled. Hunger – Is your pet able to safely and comfortably take in adequate nutrition to maintain their body condition? Hydration – Can your dog take in enough water on their own or with help from subcutaneous fluids to maintain their hydration? Hygiene – Can your dog be kept clean without getting sores from lying in one place too long? Happiness – This is more than just guessing whether your dog seems happy. Are they engaging with people and toys that they have enjoyed in the past, or do they seem withdrawn, sad, less social, or depressed? Mobility – Is your dog able to get up and move about freely on their own, are they at risk of stumbling or harming themselves when walking? More good days than bad – Does your dog have more overall good days than bad (keeping a calendar or diary can help you answer this question). Lap of Love, a nationwide network of veterinarians dedicated to end-of-life care, also has several important resources that can help you determine your pet’s quality of life: Quality of Life Assessment Tool Quality of Life Scale Quality of Life Daily Assessment Calendar Who Provides Dog Euthanasia Services? Veterinarians are the only providers of euthanasia services. Your veterinarian will help you to finalize any decisions that are left to be made and will walk you through the process to try to make this time as peaceful for you and your pup as possible. You can elect in-home pet euthanasia services, or you may bring your pet to the vet’s office. Alternatively, your local ASPCA/Humane Society may offer low-cost euthanasia options.  The cost of euthanasia varies widely depending on the size of your pet, your location, the services provided, including aftercare, and where the procedure is performed. Deciding What’s Right for Your Dog With the integration of hospice care into veterinary medicine, we now have dedicated ways to provide supportive care geared toward maintaining a dog&#039;s quality of life above all else. Hospice care focuses on maintaining a dog&#039;s comfort and quality of life when they are approaching the end of their life, but it also provides emotional support for their human caregivers. Palliative care is very similar to hospice care, but with palliative care, direct medical care is still given to address your dog&#039;s medical condition. Part of hospice and palliative care is having a plan to say goodbye when the time comes to ensure that your dog has a peaceful passing. How you choose to spend the last moments with your pet and memorialize them afterward is a very personal decision. If you have questions or concerns about your pet’s quality of life and how to improve it, or about the euthanasia process or aftercare, let your veterinarian know, as they are there to help. Featured Image: iStock.com/AnnaStills"}]