[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Travel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/pet-travel-articleimg.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/pet-travel-articleimg.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_pet_travel"}, "datePublished": "June 14, 2011", "dateModified": "August 30, 2022", "description": "Making it Easy, Simple, Safe ... and Fun! By Yahaira Cespedes Travel planning, whether for business or pleasure, can be a challenge to organize. Let’s say for example you’re planning a summer family vacation. In the midst of mapping out where to go, where to stay, and planning fun activities suddenly your pets come to mind. Will your travel plans involve taking your pets along or leaving them behind? Your pets are part of the family too, after all.", "articleBody": "Making it Easy, Simple, Safe ... and Fun! By Yahaira Cespedes Travel planning, whether for business or pleasure, can be a challenge to organize. Let’s say for example you’re planning a summer family vacation. In the midst of mapping out where to go, where to stay, and planning fun activities suddenly your pets come to mind. Will your travel plans involve taking your pets along or leaving them behind? Your pets are part of the family too, after all. What factors go into deciding your travel plans? When vacationing, do you revisit a familiar destination, or does the lure of the open road appeal more? Whatever the preference, many people unwillingly leave their pets out of vacation plans, citing limited accommodations and pet-restrictive destinations. If traveling by air, car or other methods, the idea of transporting pets to the destination alone is enough to put most people off. Without proper information and prior planning, traveling with pets quickly turn a dream vacation into a nightmare. And this is without factoring in a sudden medical pet emergency. The hospitality, travel and tourism industries realized people want to travel with their pets. There is a much wider selection of places now that offer pet-friendly vacation packages, lodging and destinations. Not only can you bring your pets with you, but they can enjoy vacation fun, too! Read on to learn how to transport your pets with little hassle, regardless of which way you choose to travel (including international destinations). We&#039;ll also give you tips on planning pet-friendly activities, selecting pet-friendly lodging accommodations or a pet sitter, and what to do if your pet becomes ill while traveling. Happy travels! Packing Up and Heading Out On the Road Preparing to embark (pun intended) on a road trip and want to bring your pets with you? There are some essentials you’ll need to bring along if you want your pleasure trip go smoothly.  When packing up your things, include a copy of your pet’s I.D. (you wouldn’t leave your home without yours). And try to make your pet as comfortable as possible during the trip by bringing along a pet bed, extra water for them, and toys. It is safest for cats (and everyone else in the car) if they’re kept secured in a crate. In a mad-dash attempt to find safety, a cat might injure itself or anyone who tries to hold onto them if they’re suddenly startled. Read &quot;Traveling with a Crate&quot; for more information on what to expect when traveling with a cat and how to properly use a crate. Dogs should be taught as early as possible how to behave in a car. In fact, acclimating them to their new environment and responding to your commands is the best way to train a pup for car travel. Being patient and calm will also help prevent puppy mishaps and stress. As with crating cats during car travel, placing your dog in a carrier is the safest option when transporting them. This petMD guideline provides important tips on preventing accidental injury, and a &quot;pet travel first aid kit&quot; to take along when you decide to hit the open road. In the Air Prior to departing for travel with your pet, always make sure they have proper I.D. tags. The American Veterinary Medical Association (AVMA) recommends you also keep your pet’s medical records up-to-date, and carry a copy with you. And they recommend you check with the airline to see if they require an acclimation certificate for your pet. If you’re planning to travel internationally, the Center for Disease Control (CDC) provides helpful information such as contacting the visiting nation’s embassy or consulate to find out what their customs policies are. The Federal Aviation Administration (FAA) also provides a listing of what to prepare for when traveling with a pet by air. If planning to travel by air with your pet becomes too confusing, some companies like Pet Airways or PetAir travel agents can help you find a pet-friendly flight. Whether you plan your air travel from start to finish, or want an agent to handle it for you, you have options to choose from.   Destinations and Activities Pet-friendly Accommodations and Services Finding lodging that will accommodate the entire family is much easier than it used to be. In fact, there are lodging options available to suit almost any taste. You can easily find a place to stay with your pets anywhere in the United States by browsing though sites such as HotelsAllowingPets.com. If you prefer more upscale hotel lodging, the Hotel Monaco boutique chain (part of Klimpton hotels and restaurants) offers pet concierge services such as pet walkers and sitters. AAA also publishes a AAA PetBook, which includes pet-friendly planning information and thousands of pet-friendly vacation accommodations and destinations. The AAA book can be purchased at AAA offices or select bookstores. If your travel plans require spending some time away from your pet and you’d like to find a pet sitter, The National Association of Professional Pet Sitters (NAPPS) can help you locate a sitter in the anywhere in the United States. International travelers can locate a pet sitter at the Pet Sitters International (PSI) site. Pet-friendly Outdoor Destinations If your vacation involves camping, note that the National Park Service (NPS) imposes rules limiting pets from roaming around freely. Consider that dogs and bears are natural antagonists, and suddenly the idea of keeping your pet leashed doesn’t sound unreasonable! Contact the park destination ahead of time to learn if any additional pet precautions need to be made, and once you arrive, always keep your pet on a leash. Safety While Traveling Healthy Precautions Prior to Travel It is highly recommended your pet have all their shots and vaccinations up to date prior to travelling with them. Depending on the destination, it may be a requirement to show proof of current vaccinations from transmittable diseases such as rabies. Your veterinarian may also recommend a microchip for your pet, in case you become separated during travel. Obtain a copy of your pet’s vaccinations to keep with your pet’s travel items. Finding a Veterinarian Far From Home Fido or Kitty is happily traveling with you when suddenly they fall ill hundreds of miles from home. What can you do? If you have an up-to-date copy of your pet’s medical records handy, you can visit the American Animal Hospital Association’s (AAHA) website and find the nearest facility. Organizations such as the American Society for the Prevention of Cruelty to Animals (ASPCA) provide a national veterinary locator for anyone, even if the pet is not insured through them. Overseas, veterinary assistance can be found in the United Kingdom at the British Veterinary Association (BVA), or the Ordre National Des Veterinaires in France. Just remember: whether it&#039;s a vacation tour of the Caribbean or a business trip to the Midwest, you don’t have to leave your pets behind. Like any trip preparation, with a little planning you can take your pets along just about anywhere."}]