[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Effect Back to School Has on Family Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Back-to-school-effects-on-dogs-153695291.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Back-to-school-effects-on-dogs-153695291.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Anxiety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/effect-back-school-has-family-dogs"}, "datePublished": "August 21, 2018", "dateModified": "August 30, 2022", "description": "The transition to the back to school schedule can be difficult for pets. Find out how the shift in routine can affect the family dog, and how you can relieve dog separation anxiety.", "articleBody": "Image via Pressmaster/Shutterstock By Kerri Fivecoat-Campbell For many households, fall means getting ready for the kids to go back to school. But what does that mean for family dogs? It might leave them confused, and it can lead to boredom or dog separation anxiety. “The reaction dogs have to the back to school schedule really varies a lot from dog to dog,” says Dr. Melissa Shyan-Norwalt, PhD, certified applied animal behaviorist, professor at the University of Cincinnati and owner of Companion Animal Problem Solvers in Cambridge City, Indiana. “Many dogs go back into a routine with no problem, but if a dog has a predisposition to separation anxiety, they might have issues.” Dr. Shyan-Norwalt points out that once everyone has settled in to the routine, it gets easier. “If a schedule gets more predictable, animals can develop routine expectations and it can be easier on most dogs,” she says. However, it may be the transition itself that creates an issue in the beginning.   Planning Ahead Is Key for Back to School Success “It’s really just a matter of planning ahead,” says Dr. Christopher Pachel, a board-certified veterinary behaviorist and owner of the Animal Behavior Clinic in Portland, Oregon. Dr. Pachel says pet parents should begin planning ahead for the back to school routine by assessing what will be different from their dog’s perspective and trying to anticipate if their dog will be alright with the coming changes. Haylee Heisel, a behavior consultant with Best Friends Animal Society in Kanab, Utah, says you can test leaving them alone by setting up a family activity outside the home. “Structure it similar to the routine that will be coming, such as leaving the family dog home alone, and see how the dog responds,” says Heisel. If your dog is healthy enough, Heisel suggests giving the dog as much exercise as possible in the morning before leaving for your day and in the evening when you return. “Dogs are most active at dusk and dark, so the more energy they burn off in the morning, the more likely it is that they will just sleep while you’re gone,” says Heisel. Heisel also suggests teaching the family dog to associate being home alone with fun activities.  “There are all kinds of enrichment activities such as puzzles or toys that dispense treats, or even forage feeding, which happens when food is hidden around the house and dogs use their natural instincts to forage or find the food,” says Heisel.   Heisel adds that forage feeding may not be possible if there’s more than one dog, but dog interactive toys that allow dogs to work to get food out can help keep your dog entertained for hours. Some interactive dog toys include the Pet Zone IQ treat ball and Trixie Activity Poker Box interactive dog toy. Dr. Liz Stelow, veterinary behavior specialist at the William R. Pritchard Veterinary Medical Teaching Hospital at UC Davis in Davis, California, says one of their favorite dog toys is the Starmark Treat Dispensing Pickle Pocket dog toy. Dr. Shyan-Norwalt says that one of her favorite enrichment toys is the OurPets Buster Cube, which rewards dogs by dispensing dog food pieces as a dog rolls it. “Not every dog likes those types of toys, but if they do, it only takes a couple of minutes to teach a dog to use it,” says Dr. Shyan-Norwalt. She suggests sitting with your dog on the floor and allowing them to push the cube a couple of times, and then angle it so the treats come out. Dr. Shyan-Norwalt also suggests using frozen peanut butter or frozen canned food in toys like the KONG Classic dog toy so your dog has to work for the food. She says you can also leave your dogs other interactive toys or safe chew bones. The Jolly Pets Teaser Ball dog toy teases dogs with a smaller ball inside they cannot access. If the dog gives up, it’s also a chew toy. Dr. Pachel cautions to always ensure that any toys or chews you leave with your family dog while away from the home are safe by allowing the dog to test them first you’re at home.      Distinguishing Between Boredom and Separation Anxiety Dr. Shyan-Norwalt says that dogs who suffer from boredom will typically chew on furniture or may turn over the trash, but dogs with separation anxiety will typically will be more destructive near points of entry in the home, such as the door jam on the front door or near window sills. “Most separation anxiety issues are in an attempt to get out of the house, although a dog may suffer from both,” says Dr. Shyan-Norwalt. She adds that leaving a T-shirt or something with your family’s scent on it may help in mild cases of separation anxiety. Dr. Stelow says that more severe cases of dog separation anxiety may require dog anxiety medication. “Other support can come in the form of day boarding at a quality doggy daycare, hiring pet sitters for times owners must be gone, or taking the dog to work,” says Dr. Stelow. She adds that due to safety concerns, dogs should never be allowed to remain outside in the yard when the family is not home. Dr. Pachel says that if your dog seems to be suffering from boredom or separation anxiety and you cannot remedy the situation with the aforementioned suggestions, you should consult your veterinarian. You should never try to diagnose the problem yourself or place the dog on pet prescriptions without consulting your veterinarian, even if it is supposedly natural or over-the-counter. If your veterinarian doesn’t know how to deal with behavioral issues or diagnose anxiety, you can always consult a board-certified veterinary behaviorist or a certified dog behavior consultant. "}]