[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Your Dog Etiquette Checklist for Having Dogs at Work", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS-Dogs-at-work-etiquette-378770638.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS-Dogs-at-work-etiquette-378770638.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/your-dog-etiquette-checklist-having-dogs-work"}, "datePublished": "June 27, 2018", "dateModified": "August 30, 2022", "description": "Follow this expert guide for having dogs at work to make Take Your Dog to Work Day safe and fun for everyone.", "articleBody": "Image via Kuznestov Alexey/Shutterstock By Monica Weymouth Although seeing dogs at work used to be rare, these days more employers are allowing pets in the office. According to a recent study by the Society for Human Resource Management, around 8 percent of workplaces are now pet-friendly—and for good reason. Numerous studies have shown that animals decrease stress, boost morale and increase worker productivity, leading to better bottom lines. Want to get in on the dogs at work trend? Before you invite your furry friend along for the day, make sure to check out these expert etiquette tips. If he makes a good impression, he may just be offered a full-time position. Review Your Dog’s Resume Like many people, not all dogs are cut out for office life. “For a dog to thrive in the workplace, they have to be able to relax and adjust to people coming and going, and to really enjoy the company of people—and, likely, other dogs,” says trainer Leigh Siegfried, CPDT-KA, owner of Opportunity Barks Behavior &amp; Training in Philadelphia, Pennsylvania. “Dogs that are territorial, protective or have a bite history are best kept at home.” Even if your dog is a perfectly well-behaved, keep in mind that, as hard as it is to believe, not everyone likes dogs, and many people have allergies. Before surprising your office, discuss your plan with your coworkers (and, obviously, your manager). Specialize Your Dog Training If you’re planning to bring your dog to work, make sure he’s properly trained to be comfortable around a wide range of personalities. Can he handle Carol from HR’s high-pitched “Who’s a good boy?” shrieks? What about Joe from IT’s constant hair tousles? Good dog training can go a long way. “I always recommend teaching the dog really solid manners and practicing with a variety of silly greetings from a variety of people to mimic real life,” says trainer Marisa Sam, canine training and behavior specialist of Philly Dog Training in Philadelphia, Pennsylvania. “This way, even with the giddiest of human greetings, the dog is able to remain calm and look to his owner for guidance if things get particularly rowdy.” Sam also recommends asking coworkers for help in setting your dog up for success. After all, as your boss likes to say, there’s no “I” in “team.” “Having a little jar of dog cookies on your desk with a sign that says ‘please ask Jumpy to sit and toss him a treat’ could be a fabulous way to provide some guidance for both dog and coworkers,” she suggests. Schedule a Spa Day You wouldn’t go to work without taking a shower and brushing your teeth. Similarly, you’ll want to make sure your pup is smelling his best before meeting the team. Treat him to a spa day at the groomer’s, and keep supplies on hand to keep him clean during the workday. Disposable grooming wipes, like the Earthbath hypo-allergenic wipes, are great for freshening up on the go. Minty dog treats, like Merrick Fresh Kisses grain-free dental dog treats, can combat doggy breath, to make sure everyone enjoys your pup’s friendly kisses. As always, check with your veterinarian before introducing a new product to your pet’s routine.   Be a Good Supervisor Dogs are like interns—while great to have around, they require constant supervision. For the comfort and safety of your dog and coworkers, plan to be with your dog at all times, especially as he adjusts to your workplace. “I would recommend limiting the space the dog is able to go,” says Sam. “As the dog adjusts to the environment and spends more time relaxing without being disruptive to other employees or the space, the dog can gradually be given more space.” Sam suggests using a dog pen, gates or a leash to confine your dog to your immediate office space, as well as taking your dog with you when you leave your desk. The Frisco dog exercise pen will provide your dog with his own space while also ensuring he doesn’t invade your neighbor’s. Be sure to dog-proof your space, securing all wires, computer equipment and other potential hazards. Stock Up on Dog Toys Office life isn’t always the most exciting. With this in mind, make sure your pup has dog toys to distract him when that 3 p.m. slump rolls around. Otherwise, you may find that your desk becomes a chew toy. “You need good enrichment options for your dog,” says Siegfried. “Access to hard, long-lasting chew toys is a necessity. Then, throw in some edible chewies and food dispensing toys during the day for meals or recreational chewing.” Make Time for Exercise If your dog is accustomed to an afternoon romp at the park, try to find a way to work some exercise into the day to keep him in good spirits. “Long durations of doing the same thing, or not much at all, can be really hard for dogs,” says Sam. “If the work environment lends itself to frequent breaks, and there is some good space to play or take a walk, then this can be a good way to break up the day.” That said, if your dog tends to be a lounger and previously spent the day relaxing while you worked, he may be more content to snooze under your desk. For a smooth transition, keep your dog’s individual needs and personality in mind. "}]