[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can I crush medication in my dog&#039;s food?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/crushed-pills-medicine-shutterstock_97413656.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/crushed-pills-medicine-shutterstock_97413656.jpg"}, "author": {"@type": "Person", "name": "Jessica Vogelsang, DVM", "url": "https://www.petmd.com/author/dr-jessica-vogelsang"}, "keywords": "Dog, Medication, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/can-i-crush-medication-my-dogs-food"}, "datePublished": "August 20, 2015", "dateModified": "August 30, 2022", "description": "By Jessica Vogelsang, DVM Getting a pet to take their meds is one of the great challenges in veterinary medicine, and difficulty in pilling is one of the number one causes of non-compliance. Oftentimes people ask if crushing their pet’s medication up in their food is an option. The first thing to consider is if the medication can be crushed in the first place. Tablets with an enteric coating and capsules are usually meant to be absorbed further down in the GI tract.", "articleBody": "By Jessica Vogelsang, DVM Getting a pet to take their meds is one of the great challenges in veterinary medicine, and difficulty in pilling is one of the number one causes of non-compliance. Oftentimes people ask if crushing their pet’s medication up in their food is an option. The first thing to consider is if the medication can be crushed in the first place. Tablets with an enteric coating and capsules are usually meant to be absorbed further down in the GI tract. Even if you can crush a pill without affecting its potency, you may not be able to get your pet to eat it. Have you ever accidentally bit down on an aspirin? Blech! Mixing that into food that wouldn’t fool anyone.  With bitter medicines, most pets realize what’s going on after a few bites and then refuse to eat the rest of the food, leaving owners to wonder what percentage of the dose the pet actually got. Owners usually find it far easier to hide the pill whole in food or a pill pocket. For pets who don’t like treats, owners can purchase a pill gun or ask the veterinarian for instruction as to pilling techniques. If none of those tricks work, another option is to have the medication made at a compounding pharmacy, who can create many medications with a very strong flavoring like cheese, chicken, or beef powerful enough to fool even a finicky pet. Image: Roger costa morera / via Shutterstock"}]