[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Coping With Your Pet&#039;s Death: An Important Guide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-coping-loss.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-coping-loss.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, End of life", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/coping-your-pets-death-important-guide"}, "datePublished": "April 10, 2017", "dateModified": "August 30, 2022", "description": "The days and weeks surrounding a pet’s death are never easy. Here’s what pet parents can expect as they navigate the healing process.", "articleBody": "Animals bring so much joy to pet parents’ lives. This special bond makes the inevitable loss of a pet extremely painful to handle. The days and weeks surrounding a pet’s death are never easy, but caring professionals and fellow animal lovers can help ease the burden. Here’s what pet parents can expect as they navigate the healing process. Making the Decision to Euthanize Your Pet In many cases, pet parents must decide whether to euthanize an ill or aged pet. It is a difficult choice, even when an animal is suffering. Circumstances are typically fraught with uncertainty for the pet parent, says Dr. Lisa Moses, a palliative care and pain specialist at the Massachusetts Society for Prevention of Cruelty to Animals’ Angell Animal Medical Center in Boston. “There really is no other decision we make in life that is similar,” Moses says. “People expect to feel clear about it and to know when it will feel right. But if you wait for that moment, you may prolong unnecessary suffering.” However difficult the decision, euthanasia may be the kindest option for an animal who is suffering, says Michele Pich, a veterinary grief counselor and instructor at the University of Pennsylvania’s Ryan Veterinary Hospital in Philadelphia. “Think about it in terms of the give and take of the human-animal bond: Sometimes they are here for us more, and sometimes we are there for them more,” she explains. “Euthanasia is the pet owner deciding to take on the emotional pain of letting their loved one go, to help prevent their pet from feeling any more physical pain.” There is a difference between knowing intellectually that an animal’s life is at its end and feeling ready to choose euthanasia, Moses describes. Not surprisingly, most people put it off. In a 30-year career, Moses has had only three people tell her they felt they euthanized their pet too soon. Pet parents often hope the pet will die peacefully in his or her sleep, but this rarely happens, and the pet usually suffers, Moses says. “I can’t make the decision for them. But I can, when needed, be an advocate for my patient, which is my first priority.” Consider Your Pet’s Quality of Life For Moses, decisions about euthanasia come down to quality of life. “When I meet a new patient for palliative care or a pain consultation, we always start with a quality of life assessment and come to a mutual agreement about what is in the best interests of the patient,” she says. “I think of that as a separate issue from what I might want or what the pet owner might want. What the pet wants can be different.” To reach the best decision, Moses helps pet parents identify particularly important elements of the pet’s life and recognize that when those are lost, quality of life is greatly diminished. For example, Moses had an 18-year-old patient who always loved car rides, but the rides became physically uncomfortable for her, causing anxiety. “It no longer brought her the same pleasure,” she says. Moses advises pet parents to be aware of subtle changes in their pet’s behavior and demeanor as clues that quality of life is declining. Such shifts can include standing apart on the edge of the dog park, no longer enjoying being petted, sleeping all the time, or altered sleep patterns (e.g. being awake at night and asleep during the day). It is particularly important to have a good relationship with a trusted veterinarian, who can offer a valuable perspective, she advises. “Talk to people who care about you and your animal to maintain perspective,” Moses says. “When people who care about you are telling you things are changing, pay attention.” When a Pet Dies Unexpectedly For some pet parents, an unexpected or natural death is easier, because they do not have to make the decision to euthanize. For others, the shock only makes the loss more difficult. “People tend to feel guilt either way,” Pich says. “When an animal dies naturally, some people tend to feel that maybe they should have caught the symptoms earlier and that they could have saved their pet. When an animal is euthanized, the guilt tends to center around whether the timing was right.” Talking to Children About the Death of a Pet Moses believes it is often an appropriate—and even positive—experience for children to be present when a pet is euthanized. “If you are honest and straightforward, they handle it pretty well—if they are at an age to understand why it is happening and won’t worry that it might happen to a person,” she says. Pich agrees that it is important to be as honest as possible with children. Do not use the term “put to sleep” with children under 8, as they may associate this with their bedtime and not want to go to sleep, she advises. “If kids are old enough to have a bond with the pet, they are old enough to hear about the loss,” she says. Whether the pet was euthanized or died naturally, Pich advises parents to avoid telling children the pet ran away or went to a farm to spare their feelings. These white lies may cause children to spend years looking for their pet rather than being allowed to grieve the loss, she says. Also, it can be good for children to see their parents grieve so they learn that being sad over a loss and expressing those feelings is normal, she adds. Emotions Following a Pet’s Death Regardless of the circumstances of the pet’s death, the immediate aftermath can be an emotional rollercoaster. “There is often a sense of numbness, and even sometimes relief that the animal is no longer suffering,” Pich says. Moses says pet parents often have difficulty leaving the body after the animal dies, or they want to preserve a body part (an ear or piece of a tail), which is particularly distressing to the hospital staff. Pich, who facilitates pet loss support groups at the University of Pennsylvania, says people often describe the house as being very quiet after a pet dies, even if there are others at home. People may initially find comfort staying busy or getting out of the house to avoid reminders. “The emotional pain often starts to feel worse a few days to a few weeks in than it did on the first day,” Pich says. “This is surprising to many owners, but it means that the reality and the permanence of the situation are starting to set in.” Grieving the Loss of a Pet Pich says the stages of grief after losing a pet are similar to what people experience when losing a human loved one. The initial stage, denial, can come at the time of a terminal diagnosis, resulting in putting off vet visits. It can also occur after the loss, in staying away from home to avoid confronting the pet’s absence. Anger comes next and can be directed at oneself or the vet (for not being able to save the pet) or even toward the pet for not surviving. It can come out indirectly, too, Pich says, as impatience with family, friends, or coworkers. Pet parents also may feel guilty, replaying events that led to the pet’s death and second-guessing themselves. Feelings of depression might follow, regardless of whether the person has a history of depression, as the pet parent realizes the loss is permanent. Finally, people reach acceptance, where healing occurs, Pich says. This stage includes grieving and sadness but with appreciation for all the joy their pet’s life brought. Finding Ways to Cope With Pet Loss Talking to others who understand the loss and are supportive and patient can help, says Pich. Journaling, yoga, meditation, art projects, or travel may also be beneficial. “The most important thing is [for pet parents] to be patient with themselves and to make choices that are kind to themselves,” she advises. Sometimes the loss of a pet can result in “complicated grief,” or intense and lingering feelings of sadness that interfere with daily life. This type of grief can manifest after the deaths of loved ones occur in close succession, when a new loss reminds a person of an older one, or when caregiver demands complicate the death, she says. Pet loss support groups, where people talk with others who understand their pain, can help normalize the grief process, Pich says. Individual or family counseling also may be needed. Pet grief support hotlines can connect callers with a compassionate listener. “Don’t be afraid to ask for help,” she stresses. Memorializing a Deceased Pet Some people choose funeral services or memorials that acknowledge the significance of the loss, Pich says. For example, friends or family might gather to share a story or picture of the animal. These efforts honor the pet and may help people cope, especially for owners who did not have a chance to say goodbye to the pet, Pich notes. Children may want to be involved, giving them a healthy way to express their feelings, she adds. To keep a pet’s memory alive, consider framed photos, paintings, or drawings; create scrapbooks or shadowboxes; get clay paw prints made at the vet; or keep ashes in a special place at home or scatter them, Pich suggests. Others might choose to donate money in a pet’s name to an animal charity or give no-longer-needed pet supplies to an animal shelter. Getting a New Pet After Loss Moses does not advise getting a new pet as soon as one dies. “It’s very tempting, but I was never a person who could do that. I felt like it was disrespectful to the relationship with the animal I lost,” she says, adding that it is ultimately an individual decision. Her advice is to wait and try to be with the pain, however uncomfortable. Pich agrees that there is no “right” time to get a new pet. One person might be ready a week later, while another might need a year. Some people dip their toes back in by fostering a pet. A woman in one of Pich’s support groups summed it up by saying, “You know you are ready when you can bring a new pet home and not expect them to be the one that died.”  By Carol McCarthy"}]