[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Oral Medication for Dogs: What&#039;s the Difference Between Tablets, Chews, Liquids and Suspensions", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-medicine-shutterstock_277951358.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-medicine-shutterstock_277951358.jpg"}, "author": {"@type": "Person", "name": "Patrick Mahaney, VMD, CVA, CVJ", "url": "https://www.petmd.com/author/dr-patrick-mahaney"}, "keywords": "Dog, Over the counter medication, Prescription medication, General Care, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/oral-medication-for-dogs-whats-the-difference"}, "datePublished": "September 2, 2015", "dateModified": "August 30, 2022", "description": "", "articleBody": "By Patrick Mahaney, VMD Does your pet regularly take any medications?  If so, in what format does the medication enter your pet’s body?  There are multiple forms in which drugs are manufactured or compounded, with the primary options for owners being oral or topical.  There are further subdivisions of these options, so there are many formats available to best fits the needs of our canine and feline companions. A pet’s willingness to be medicated plays a big role in selecting a medication’s format.  Such cooperation creates an ease-of-use issue will affect whether a cat or dog’s illness improves or resolves pending if any refusal to be medicated occurs. No one-size-fits-all approach exists pertaining to the way medications gets in or on the bodies our canine and feline companions.  As a result, it’s best to consult with your veterinarian about the means of medication delivery that best suits your pet. Oral medications Very cooperative canines and felines may voluntarily consume medications.  Your typical, food-loving Labrador Retriever comes to mind as being an easy dog to medicate.  Yet, small dogs, cats, and pets that aren’t good eaters, are prone to refusing to eat medications with food or treats, have digestive tract upset (vomit, diarrhea, etc.), or do not like to have their mouths handled can create quite a challenge for owners. Oral medications can be found over the counter or are prescribed by veterinarians.  A wide variety of options exists for owners to utilize when administrating oral products, including tablets, capsules, liquid, an even transmucosal sprays that are absorbed from gingival tissues (gums) and don’t need to be swallowed. Tablets often come in a chewable format that is readily consumed by willing pet.  On other occasions, tablets have to be thoroughly disguised in treats or meals or have to be directly administered down a pet’s throat (“pilled”) by an owner’s finger or a pet pill dispenser (“pill gun”).    Capsules are similar to tablets, but they don’t come in chewable format and must be consumed out of a treat or food or be given directly by mouth (“pilled”).  Liquids are easy to mix into moist foods, but can create an aversion if they lack an appealing flavored.  Transmucosal sprays are the new frontier for medications due their ease of use, but there aren’t a huge variety of drugs that can be administered this way; allergy desensitizing products and pain-relieving drugs (Buprenorphine, etc.) are some of the most commonly used transmucosal mediations. Some flea, tick, and heartworm preventatives can be administered orally.  For owners having children or other family members who may be prone to touching a pet then putting their hands in their mouths, an oral parasite preventative may be a better route so the product doesn’t inadvertently end up on the hands or in the mouth of an unsuspecting person. Yet, once a medication is given orally it really can’t be “taken back.”  Should your pet show an adverse response to a product, then clearing the body of that substance having a toxic effect becomes quite challenging.  I recently encountered such a circumstance when a senior, canine patient exhibited seizure activity after taking Spinosad, an oral flea preventative.  This was the first time one of my patients had any neurologic side effects to Spinosad, but the experience has made me even more cautious in using this product with geriatric or seizure-prone pets. Topical medications Topical medications exist as creams, ointments, gels, or liquids that stay on the skin surface or are absorbed into the bloodstream and can be veterinary-prescribed or over the counter. Topical medications have a few advantages over oral medications in that they don’t have to enter a pet’s mouth and can be rinsed/washed off if needed.  Fractious pets, those suffering from ailments affecting the appetite and digestive tract (cancer, inflammatory bowel disease, kidney and liver failure, etc.), and ones refusing to have their mouths handled are candidates for products that are administered topically.  Such patients can still be appropriately medicated if the topical route of administration is chosen over an oral route. In my practice, transdermal Methimazole, a drug for hyperthyroidism, has helped my clients to consistently medicate cats that otherwise would hide or fight back when oral medicated.  After all, a few milliliters of gel-based Methimazole that absorbs through the skin is much simpler to apply to the inner ear flap than into the mouth of a cranky, hyperthyroid cat. Flea, tick, and heartworm preventatives can be applied to the skin to achieve a desired effect.  Fipronil, Imidacloprid, and others rely on skin oil to distribute over a large surfaces beyond the site of application and prevent ectoparasites (fleas, ticks, etc.).  Selamectin and Moxidectin are absorbed from the skin into the bloodstream and circulate throughout the body to have a broader effect in preventing infection by endoparasites (parasites inside the body, like heartworm, hookworm, etc.). Regardless of if your pet needs a single dose or a course of treatment, it’s crucial that you discuss your role as the mediation provider with your veterinarian.  After all, if you can’t get your veterinarian’s prescribed treatment into your canine or feline companion, then treatment will fail, your pet’s condition won’t improve, and all involved parties will experience frustration. Happy medicating! See Also: Image: Linda Vostrovska / via Shutterstock"}]