[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Become a Veterinarian", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4226550024_8e1695d06a.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4226550024_8e1695d06a.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_how_to_become_a_veterinarian"}, "datePublished": "March 15, 2011", "dateModified": "August 30, 2022", "description": "By T. J. Dunn, Jr., DVM Many are the times someone, usually a person in high school, will inquire &quot;How do I go about becoming a veterinarian?  What do you have to do to become a veterinarian?&quot;  My answer always seems to be inadequate, partly because veterinarians are engaged in such a wide variety of activities and disciplines within the profession.  When the eight years of college study are completed and the degree &quot;Doctor of Veterinary Medicine&quot; is earned, the individual has numerous types of employment niches awaiting his or her skills.", "articleBody": "By T. J. Dunn, Jr., DVM Many are the times someone, usually a person in high school, will inquire &quot;How do I go about becoming a veterinarian?  What do you have to do to become a veterinarian?&quot;  My answer always seems to be inadequate, partly because veterinarians are engaged in such a wide variety of activities and disciplines within the profession.  When the eight years of college study are completed and the degree &quot;Doctor of Veterinary Medicine&quot; is earned, the individual has numerous types of employment niches awaiting his or her skills. The AVMA (American Veterinary Medical Association), which is one of many veterinary medical associations, has a very informative free brochure called Today&#039;s Veterinarian; you can access it here (PDF). The statistics below are from the AVMA website. It shows the various &quot;kinds&quot; of veterinarians that are engaged in diverse occupations.  I, for example, chose to become a &quot;Small Animal Practitioner,&quot; which means I work mostly with small companion animals such as dogs and cats. Some small animal practitioners also work on birds, snakes and other reptiles, and pocket pets such as hamsters, and other caged pets. A &quot;Large Animal Practitioner&quot; refers to those who work with farm animals such as cattle, horses, Llamas and some large wildlife. Zoo practitioners are responsible for the health of a wide variety of reptiles, mammals, birds and fish that populate zoos. A &quot;Mixed Animal Practitioner&quot; works with both small and large animals. Veterinarians work in academic settings, too, and many are employed by universities to teach both human medical and veterinary medical students.  Many do research within the university setting and publish their findings in medical journals. &quot;Industry Veterinarians&quot; work for corporate employers in various roles including research, drug development, instrument design and development, food science, and other activities relating to Research to improve medications is done by veterinariansthe animal industries.  Many veterinarians are government employees, too, working to safeguard the nation&#039;s food supplies and the &quot;farm to home&quot; food chain.  Analysis and evaluation of animal diseases that could impact human health, such as Rabies and Avian Flu are an important part of our national security. Military veterinarians are part of the US Military and are responsible for keeping military dogs healthy and they care for the military personnel&#039;s family pets while on active duty. If you are planning to become a veterinarian someday, keep in mind that due to the limited number of universities that offer a DVM (Doctor of Veterinary Medicine) degree. It may be difficult to obtain acceptance to even one of approximately 23 Universities in the USA that offer the DVM curriculum. It is said that for every seven qualified applicants for veterinary school only one will be accepted. I gave the following answers to a high school student&#039;s questions for a report on what it is like to be a veterinarian ...   Common Questions About Being a Veterinarian What made you decide that you wanted to become a veterinarian? I really enjoyed studying sciences, especially Biology. Veterinary medical school required studying many courses in the biological sciences. Plus, I was really interested in being able to help animals recover from diseases and injury. Also, being self-employed seemed attractive to me and as a small animal practitioner I could start my own business of running an animal hospital. How many different types of veterinarians are there and give a brief description of each? There are veterinarians engaged in pet animal practice, called Small Animal Medicine and Surgery, and others in farm animal practice. There are zoo animal veterinarians, veterinarians in research and pharmaceutical companies, military veterinarians, teachers, private practitioners, and more. The AVMA website has a good list of all the different categories of veterinary medical work that is being done today. See www.avma.org. Is there a specific certification needed to become a veterinarian? A veterinarian, in order to practice veterinary medicine, needs to graduate from an accredited College of Veterinary Medicine (there are less than thirty-five in the U.S.) and pass certifying exams in order to be licensed in any state in which the doctor wants to practice. So specific advanced education and a state license is required. On average, how much money does a veterinarian make each year? Veterinary assistants and technicians can make anything from $45k to $200k per year depending on the kind of practice a veterinarian is in (see more statistics here). Being an employee usually indicates less income potential than a veterinarian that owns numerous practices and employs many veterinarians. What is the difference between a veterinarian assistant and a veterinarian? To be a veterinarian the person has to be a graduate of the doctoral program at a college of veterinary medicine, which usually takes eight years of college study. A veterinary assistant refers to anyone the veterinarian trains to assist with the veterinarian&#039;s activities. Veterinary assistants are limited by state statutes in how and what they are allowed to do with animals.  A licensed Veterinary Technician needs to graduate from a two-year college level course of instruction in order to receive a certificate indicating the individual is a Certified Veterinary Technician. It would be best to attend an accredited Veterinary Technician school. Why is it important to society to have licensed veterinarians? Licensure protects the society from anyone who might pose or practice as a veterinarian and who does not possess the training and education required to perform expected tasks and make accurate diagnoses for animal diseases. Since animal health issues often impact human health, the general public is entitled to competent veterinary care so specific regulations are in place and are enforced by state law. Which classes would be most beneficial for a student wishing to become a veterinarian? Becoming proficient in mathematics and science courses will be very helpful. Studying Biology and Chemistry and English will prepare the student for college work. Does being a veterinarian involve long working hours on a daily basis? Usually a veterinarian in private practice will put in a full 8 to 10 hours a day. Often, too, weekends are taken up working on emergency cases or caring for sick patients. Other fields of veterinary medicine, such as teaching, may have less demanding time schedules. What is the hardest thing about being a veterinarian? As a small animal practitioner, the fact that your patients often need help 24 hours a day can be the biggest strain. There often is a lack of personal free time. On occasion communicating with the animal&#039;s owner can be difficult and providing every patient&#039;s owner with lots of information and alternatives for care and treatment can be a challenge as well. Every pet owner should be enlightened about the care given by a veterinarian... this is termed informed consent, and provides the animal owner with full disclosure regarding the pros and cons of any medical treatment or protocol. What makes it worth going to work everyday? There is substantial satisfaction knowing that you are helping an animal patient regain optimal health. Along with that, very appreciative and thankful pet owners can brighten up a veterinarian’s day. Image: Jeffrey Beal / via Flickr"}]