[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Properly Pick Up a Puppy or Kitten", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-hold-puppy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-hold-puppy.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cat, Puppy, Kitten, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-properly-pick-puppy-or-kitten"}, "datePublished": "January 19, 2018", "dateModified": "August 30, 2022", "description": "What is the correct way to pick up a puppy or kitten? Our experts weigh in on proper technique, practices to avoid, and how to tell if you’re picking up a puppy or kitten the wrong way.", "articleBody": "By Paula Fitzsimmons Who doesn’t jump at the chance to pick up and hold a puppy or kitten? “They are so cute, and they look like little stuffed toys,” says Dr. Robin Downing, hospital director at The Downing Center for Animal Pain Management in Windsor, Colorado. Pick one up incorrectly, however, and you risk causing injury or losing her trust. “It is important to remember that they are delicate creatures who need us to be careful as we pick them up and carry them around,” she adds. So what precisely, is the correct way to pick up that little ball of fluff? Our experts weigh in on proper technique, practices to avoid, and how to tell if you’re picking up a puppy or kitten the wrong way.   Best Practices for Picking Up a Puppy or Kitten Learning to properly pick up a puppy or kitten makes handling easier as time passes, says Pam Johnson-Bennett, owner of Nashville-based Cat Behavior Associates. “For cats and smaller breed dogs, being picked up will be necessary throughout their lives, so take the time now to do gentle training,” she says. “Using the proper technique, do short training sessions that end on a positive note. Soon, the puppy or kitten will see that being picked up and held has a purpose and is a part of the bond you share.” The safest way to pick up a puppy or kitten, Downing says, is the one most comfortable for them. “Slip one hand between the front legs from the front of the body, and slip the other hand between the rear legs from behind,” she recommends. “Then lift them as a unit with their spine relatively straight.” If working with a tiny animal that can fit in one hand, she says you can slip your hand under the middle of the chest with your fingers facing the head so that the chest cavity fills your palm. “This supports them at the largest part of their torso and helps them feel both safe and secure,” Downing says. Heights can be scary for baby animals. “Once you have them off the ground, tuck them into your body to reassure them that they will not fall,” she says. Dr. Susan Jeffrey, a veterinarian at Truesdell Animal Care Hospital in Madison, Wisconsin, says she likes to “scoop up” pets when she picks them up. “The motion allows me to put my hand underneath the abdomen and chest, giving them support and stability.” Sitting down at floor level is another suggested way to protect those fragile bones from falls, while helping them feeling secure. “Especially for kids, it’s best that they pick up a puppy or kitten while sitting on the ground,” says Dr. Jason Nicholas, chief medical officer at Preventive Vet, based in Portland, Oregon. “That way, if the puppy or kitten wiggles out of their arms, it’s a much shorter distance that they’ll drop.” Should you let kids pick up a puppy or kitten? It depends on the child’s age, our experts agree. “If you have young kids, do not allow them to pick up (young or old) animals,” Jeffrey says. “It may be dangerous for both the child and the pet.” What to Avoid Puppies and kittens don’t like surprises, Nicholas says. “Be careful not to startle a puppy or kitten or pick them up too quickly, as this can cause them to panic and fall, or even turn and bite.” Knowing which areas not to pick them up by is also essential. “You definitely don’t want to pick a puppy or kitten up by their legs, and even sometimes picking them up by their armpits can be uncomfortable and less secure,” he says. “And yes, never pick up by their collar or tail.” Picking up an animal by the leg or tail can result in a dislocated limb or broken leg, says Downing, who has dual board-certification in pain management, and veterinary sports medicine and rehabilitation. “Also, this will be uncomfortable enough for the pet that they may decide that humans hurt them, and they may actually learn to resent being handled at all,” Downing says. “This can completely undermine the human-animal bond, and fracture the loving relationship between pet and family.” You may have seen images of cats being carried by the scruff, but this is innaprorpaite and could cause significant harm to the pet. “Carrying by the scruff of the neck is something only the mother cat should do,” advises Bennett. How to Know If Your Technique Is Wrong Cats and dogs naturally wiggle when picked up, says Jeffrey, whose professional interests include preventative care. “But if they are uncomfortable, they may cry out, try to bite or scratch, or even growl,” she says. “They may also try to escape, but that doesn&#039;t always mean they&#039;re uncomfortable. It just may mean they don&#039;t want to be held.” Do not repeteadly attempt to pick up, chase, or grab an animal after she has given you signs that she does not want to be held. This can cause more overt evasive behavior or fear. Flaying or crying out can also indicate pain or a sense of not feeling feel safe, says Dr. Patti Iampietro, a staff veterinarian at Best Friends Animal Society. “When this happens, put them down immediately,” she advises. “Let the puppy or kitten calm down and relax. Then try again in a different manner being more gentle or supportive. Every puppy and kitten is different and each will have a preferred method of being picked up and held.” “It is tempting to pick up a puppy or kitten just any old way,” Downing says. But doing this can have serious consequences. Learning the correct way to pick up and hold a puppy or kitten can help prevent injury and fatality—and help strengthen your bond for years to come."}]