[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Choose an Experienced Dog Breeder", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/9k7b791z_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/9k7b791z_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Adoption", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_breeders"}, "datePublished": "November 4, 2008", "dateModified": "October 20, 2022", "description": "Are you in search of a purebred puppy? Picking the right breeder is the first and most important step. Remember, a healthy puppy is a beautiful puppy.", "articleBody": "Are you in search of a purebred puppy? Picking the right breeder is the first and most important step. Remember, a healthy puppy is a beautiful puppy. You really want a puppy. In fact, owning a puppy is something you’ve been dreaming of ever since your evil stepmother cruelly denied you one at the age of 10. So after years of therapy, you’ve suddenly realized the cure: get yourself a puppy. Perhaps that isn’t the reason (although it does make for good dinner party conversation), but you do really want a puppy. If you&#039;ve already decided against adopting a dog, choosing an ethical, reputable breeder is important. Your first task should be making a list of breeders who deals with your desired breed. Do a little research to see what their reputations are. Dog societies, friends with dogs, and vets are good sources of information. Then it&#039;s as easy as crossing off breeders with bad reviews off your list. If there are reviews, do they come with pictures and stories of the dogs as adults? Sites that aren’t geared towards breeders (but geared towards offering a pet owner an unbiased and broad spectrum of information about animals) are another wealth of knowledge. People will often post about both good and bad experiences through such sites. When you chat with a breeder, have questions lined up. Are they registered? Do they offer a guarantee against genetic defects? How do they keep defects to a minimum in their breeding? What documentation do they have to prove pedigree? Whatever your questions might be, do your research first and ask the things that are important to you. Are They Registered? If a breeder is registered, you are more likely to get a healthy, well-conditioned puppy with pure bloodlines. And while most breeders love dogs passionately, those merely in it for the money will often breed and keep their dogs in squalid and inhumane conditions. So a visit to each breeder is highly recommended. You may also want to make sure the dogs and puppies are kept in clean, comfy and safe surrounds. Otherwise, you may end up paying more than you bargained for in unforeseen vet bills. Often, you can get a quick impression by taking a look at the breeder&#039;s home or place of business, or by chatting with the breeder. If by some chance the breeder seems cagey or does not want to give you a tour of the place, you should probably steer clear. Someone with nothing to hide will gladly talk to you or show you around. A breeder who interviews you to make sure you can provide a good home is another good sign of a qualified breeder. Something worth remembering, however, is purebreds may have congenital defects. Research your chosen breed using petMD&#039;s Breedopedia and become familiar with it before you arrive to interview the breeder. Ask about how they avoid or keep defects to a minimum. A good, honest breeder will tell you about defects and faults in a breed. Once you have found someone you trust, someone who fits your criteria and has met all your requirements, go pick out your puppy. And please, for humor&#039;s sake, name him Dogzilla. You know you want to. Image: Eddy Van 3000 / via Flickr"}]