[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Five Common Methods of Pet ID", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/flickr_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/flickr_.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cat, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/care/five-common-methods-of-pet-dog-ids"}, "datePublished": "April 18, 2012", "dateModified": "September 7, 2022", "description": "Thanks to modern technology, our methods of finding lost pets have come a long way from relying on neighborhood posters.", "articleBody": "If you or someone you know has ever lost their beloved pet, then you have experienced the anxiety of worrying about them while hoping they’ll be returned safely. Thanks to modern technology, we’ve come a long way from relying just on blanketing the neighborhood with lost posters. The following are five of the most common ways to ensure you and your lost pet will be safely reunited. The most common, cost-effective way to ID your pet is to put a collar on them with a metal or plastic tag that has their name and your phone number on it. Unfortunately, relying solely on this method of ID leaves too much to chance — your pet may break free of its collar, or someone may not actually call to let you know your pet has been found. This method of ID for your pet is typically a simple and quick process. It involves having your pet tattooed with a unique number and/or number sequence by a professional. This sequence is then placed into a registry with general pet information along with how to contact you in case the pet gets lost. The National Dog Registry, one of the oldest pet tattoo registries, strongly advises against tattooing your pet without the supervision of a veterinarian. More importantly, do not place an unregistered tattoo on your pet, as it is untraceable. The Humane Society defines microchips as “a tiny transponder about the size of a grain of rice that uses radio waves to transmit information about your pet.” If you and your pet should become separated and it ends up in a shelter, the employees will use a scanner to detect the registry information and phone number of the microchip company your pet is registered with. A microchip is usually placed between your pet’s shoulder blades. Do you have a Smartphone that you use to scan QR bar codes of favorite products? Some have adopted that technology for use in identifying your pet. The QR code is engraved onto a pet tag with a laser. When your pet is found they can simply scan the code to help reunite you with your pet. Some companies that provide this service are QR Devices, PetQRTag, and PetHub. There are now several companies dedicated to locating a lost pet. Some send out a sort of &quot;Amber Alert&quot; to the surrounding area (FindToto, PetAmberAlert) with information on how to identify your pet, while others are more preemptive and involve utilizing a tag with a unique ID and 1-800 number, which can be used by anyone who should find your lost pet, 24 hours a day, seven days a week (Help4Pets). Ask your veterinarian and friends if they have had any experience with these or similar services and choose one that fits your needs."}]