[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What are the stages of parvovirus?", "acceptedAnswer": {"@type": "Answer", "text": "The four stages of parvovirus are: Infection Incubation Illness Recovery"}}, {"@type": "Question", "name": "Do only puppies get parvovirus?", "acceptedAnswer": {"@type": "Answer", "text": "Because puppies have a less developed immune system, they are more susceptible to all infections, including parvovirus; however, unvaccinated adolescent or adult dogs can also get parvovirus."}}, {"@type": "Question", "name": "Can dogs get parvovirus twice?", "acceptedAnswer": {"@type": "Answer", "text": "Once a dog has recovered from parvovirus and/or has been fully vaccinated, it cannot get parvovirus again. Featured Image: iStock.com/Group4 Studio"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Know: Adopting a Dog After Parvovirus", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/parvo.dog_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/parvo.dog_.jpg"}, "author": {"@type": "Person", "name": "Krista Seraydar, DVM", "url": "https://www.petmd.com/author/dr-krista-seraydar"}, "keywords": "Dog, Adoption, Viruses, Shelters and rescue, Zoo Rescue Animal Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/what-know-adopting-dog-after-parvovirus"}, "datePublished": "August 8, 2022", "dateModified": "September 8, 2023", "description": "When adopting a pup that survived parvovirus, it&#039;s important to know what to ask, and other helpful insights before bringing your dog home.", "articleBody": "What Does It Mean if a Dog Has Parvovirus? Parvovirus is a highly contagious virus that affects young and/or unvaccinated dogs causing diarrhea (sometimes bloody), vomiting, and secondary infection or sepsis. If untreated, parvovirus is often fatal. Parvovirus usually affects younger dogs that are more susceptible to disease because their immune systems are not fully developed. Parvovirus can also affect unvaccinated or incompletely vaccinated adolescent and adult dogs but its usually less severe in nature. Younger pups are more likely to be severely affected, but any unvaccinated pet can become sick from parvovirus. How Are Dogs Treated for Parvovirus at Shelters? Most animal shelters do not routinely test each incoming dog for parvovirus; however, they do vaccinate them for parvovirus upon admission as well as providing booster vaccines while living in the shelter. If a dog shows symptoms of parvovirus (bloody diarrhea, vomiting, lethargy, etc.), it is tested and placed in isolation to be treated and to avoid spreading this contagious disease to other animals. Treatment of parvovirus typically consists of: Intravenous fluid therapy Antibiotics Pain medication Glucose and electrolyte supplementation Anti-nausea medication Gastrointestinal (GI) protectants Plasma or blood transfusions (in severe cases) Treatment ensures hydration and the pup’s glucose, and electrolytes are regulated to prevent severe infection and manage pain. Without hospitalization and continued monitoring, sick dogs can become dehydrated or attract a secondary infection which can be lethal. A dog that has tested positive for parvovirus is not available for adoption until it has been treated and subsequent tests are negative. This is to ensure that it is no longer ill and at minimal risk of spreading the virus. Adopting a Dog Post-Parvovirus If you are adopting a dog that was previously treated for parvovirus, it’s important to ask the shelter team about: Any known infection history, including previous diagnostics, treatments, and medications. Necessary follow-up care, upcoming appointments, or medications (antibiotic, anti-emetic, anti-diarrheal) that your new pet should receive once at home. Any special diet the pup is currently on. Your dog may be sent home with a special GI-friendly diet or instructions for a bland diet. Avoid table scraps, treats, and other foods while your dog continues to heal. Any normal or abnormal side effects. Soft stool may be normal for 3 to 5 days after discharge, but you should continue to monitor your dog for vomiting, diarrhea, or decreased appetite and contact your veterinarian if you have any concerns. Recovery and Life Post-Parvovirus As your new pup continues to recover, keep up with its vaccination schedule and avoid contact with unvaccinated pets. Be sure to vaccinate other pets in the household that are new to the home, or that are due for their parvovirus booster. Because parvovirus can remain in the environment for a prolonged period, it is important to avoid bringing unvaccinated pets into the home. While most dogs that recover from parvovirus live a normal, healthy life, one study found that some dog patients were more likely to develop chronic GI issues. For this reason, it is important that your recovered pet is receiving a complete and balanced diet. Monitor your pet for any vomiting, weight loss, or diarrhea and have it examined by your veterinarian if signs of parvovirus are noted. Bi-annual wellness examinations (with fecal exams and bloodwork) will keep your pet healthy as it grows. Probiotics may also be helpful for maintaining gut health. Congratulations on the new addition to your family, and thank you for giving a pup a second chance through adoption!"}]