[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "When is the best time to give my pet their medication?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-medicine-shutterstock_221154205.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-medicine-shutterstock_221154205.jpg"}, "author": {"@type": "Person", "name": "Jessica Vogelsang, DVM", "url": "https://www.petmd.com/author/dr-jessica-vogelsang"}, "keywords": "Dog, Medication, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/when-best-time-give-my-pet-their-medication"}, "datePublished": "August 20, 2015", "dateModified": "August 30, 2022", "description": "By Jessica Vogelsang, DVM Generally speaking, the timing of medication administration will be relayed to you by your veterinarian when you get your prescriptions.", "articleBody": "By Jessica Vogelsang, DVM Generally speaking, the timing of medication administration will be relayed to you by your veterinarian when you get your prescriptions. Sometimes a drug will be labeled to administer a certain number of times per day- once a day, three times a day, or so on. More accurately, a drug can be labeled to give every x number of hours. Each drug has a different duration in the bloodstream after administration, so it’s important that a drug labeled for three times a day is given as close to every 8 hours as possible. Missed doses should not be doubled up with the next dose unless instructed to do so by the veterinarian. Some drugs have specific time-of-day dosing instructions; insulin, for example, is usually given after a meal. If the drug isn’t reliant on mealtimes, when and how to best give the drug is up to you. Many owners give medications around mealtimes because it’s easier for them to remember, and having food in the stomach can alleviate some common GI upsets associated with certain drugs. Unless a medication must be given on an empty stomach, this is fine. If a medication is topical, such as many flea and tick medications, check with the label to see if there is any instruction about bath time. Since topical flea and tick medications rely on the oils in the skin to spread the medicine, it’s best to avoid baths or swimming within a day or two either before or after using these medications. Image: Donna Ellen Coleman / via Shutterstock"}]