[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Price of the Spay (or Neuter) Procedure", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/spay-neuter-procedure-cost-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/spay-neuter-procedure-cost-dogs.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, Spay, Neuter", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_price_of_spay_or_neuter"}, "datePublished": "March 4, 2011", "dateModified": "August 30, 2022", "description": "The following is a copy of a &quot;letter To The Editor&quot; by Dr. T. J. Dunn, Jr. It was published in a northern Wisconsin newspaper in 1990 ...  over 20 years ago! But is still is relevant today. It is in response to a reader who was complaining that veterinarians charged too much for spaying and neutering dogs and cats, and that veterinarians were actually contributing to the numbers of unwanted and orphaned pets due to excessive surgery fees. Regarding the price of surgery on dogs and cats for spaying and neutering. Dear, Sir:", "articleBody": "The following is a copy of a &quot;letter To The Editor&quot; by Dr. T. J. Dunn, Jr. It was published in a northern Wisconsin newspaper in 1990 ...  over 20 years ago! But is still is relevant today. It is in response to a reader who was complaining that veterinarians charged too much for spaying and neutering dogs and cats, and that veterinarians were actually contributing to the numbers of unwanted and orphaned pets due to excessive surgery fees. Regarding the price of surgery on dogs and cats for spaying and neutering. Dear, Sir: I would like to express some personal opinions relative to the pet population problem present locally and nationally. These opinions have been formed throughout my 25 years as a veterinarian, working daily with dogs and cats and interacting with their owners. There are a number of pet owners who believe that veterinarians are part of the problem and are actually one of the causes for so many excess, unwanted pets. The reasoning behind this belief stems from the perception that &quot;The vets charge too much to get my pet spayed or neutered.&quot; This self-serving criticism asserts that since the pet owner cannot afford the surgery, it means, therefore, vets are charging too much. I am frequently involved in discussions that begin with, &quot;I&#039;ve got six cats that need to be fixed and I sure can&#039;t afford all that surgery -- but they keep having litters. What kind of a bargain can you give me if I get &#039;em all fixed?&quot; Now I begin to feel like I&#039;m partly responsible for any future litters these cats might have! How does one perform &quot;bargain priced surgery&quot; where each patient&#039;s life is on the line during the procedure? It is not acceptable to me to ever lose a patient during this type of surgery; and yet the owner is looking for a bargain... Also, there are responsible pet owners who ask a perfectly honest and reasonable question, &quot;Why does it cost so much?&quot; Well, I&#039;m going to tell you why. 1. Education: There are only 27 universities in the United States that provide Doctor of Veterinary Medicine (D.V.M.) degrees. They accept only one out of ten qualified applicants. Students may be accepted for the four years of professional veterinary school only after three to four years of pre-veterinary studies. Therefore, there are seven to eight years&#039; minimum of college preparation, studying such topics as biochemistry, physics, comparative anatomy, microbiology, genetics, pharmacology, surgery, etc., etc. No home correspondence courses here! According to the Association of American Veterinary Medical Colleges the costs incurred by a student to achieve a D.V.M. degree in Wisconsin (Ed. note: these are 1990 figures) is $8,000.00 per year tuition ($11,500.00 if you are from out of state), $4,300.00 per year for room/board, and $1,800.00 for books and supplies. These figures are only school related costs! Not everyone is able or willing to make the educational/financial sacrifice to earn the B.S., D.V.M. degrees. I&#039;m one of the lucky ones! 2. Licensure: After graduation the veterinarian may only practice if a license is obtained through intensive examinations for a particular state. I am licensed to practice in Wisconsin and Florida; I cannot simply move to any state and start a new animal hospital. There are regulations I must follow and minimum requirements of knowledge and expertise I must possess. 3. Business: An animal hospital owner is generally self-employed. For me that means that I am responsible for payback of the loans I took out to establish the business. For example, real estate, hospital equipment, inventory suppliers, employee wages, advertising, insurance, telephone bills, etc., etc., are all my responsibility. Nobody provides me with insurance benefits, paid vacations, retirement funds, bonuses for hard work or pats on the back for maintaining a positive attitude. There are no corporate expense accounts or perks, no government grants or subsidies. Every small business owner is in business to make a profit, and profit is what&#039;s left over AFTER all the expenses (supplies, equipment, rent, wages, etc.) are paid. Then with that profit the self-employed business owner has to take care of personal expenses such as car, house, insurance, food, utilities, etc., just like everyone else. If the self-employed business owner is fortunate, a little profit is left over after all those ordinary expenses for savings or retirement. In general, people do not perceive veterinarians as small business owners, but we really are no different from the shoe store operator, the dentist, the plumber, or carpenter. We get paid for our ability to perform a service. I chose to become a veterinarian; nobody told me I had to do this. I spent seven years in college gaining the ability to perform a service and expected to make a good living through conscientious application of the skills I acquired. I don&#039;t know how to repair a ruptured water pipe though; and I don&#039;t have the tools to do it if I did. So, I&#039;ll call a plumber and expect to pay him for his knowledge and skill. In return, he&#039;ll provide for me a service I request. Likewise, pet owners call me to apply my abilities to safely prevent their pets from reproducing.   So why is spaying and neutering so expensive? First of all, and I don&#039;t apologize for this fact, you now realize I must make a profit during my sometimes very busy hours at work. Secondly, a dog or cat spay is major abdominal surgery performed under general anesthesia in a locally sterile environment. If it is not done properly, the pet may not survive the procedure or may develop internal adhesions or develop life-threatening infections. I have seen botched surgeries and believe me, they&#039;re not a pretty sight! And as can be expected, the pet owner is very unhappy. Most people cannot fix a ruptured water pipe in the basement. Most people cannot perform major abdominal surgery, removing both ovaries and the uterus from 5-pound cats to 220-pound St. Bernards. Really, the only difference is nobody&#039;s pet is going to die if the repair job on the water pipe doesn&#039;t go well! Here&#039;s a brief rundown of what we do when a pet needs spaying (ovaries and uterus removed) or neutering (testicles removed). 1. The client calls and we schedule an appointment time and give pre-admission instructions. Later, when the patient is presented at the animal hospital, presurgical and postsurgical instructions are discussed with the pet owner. The pet is placed in a clean cage or pen. 2. Just prior to surgery the pet is examined by the surgeon to be certain the patient is reasonably healthy. Often, blood tests are performed if the patient is older than eight years of age. 3. With the assistance of the veterinary technician, the intravenous followed by the gas anesthetic is administered. An endotracheal tube is inserted into the trachea (&quot;windpipe&quot;). The surgical site must be carefully and precisely cleaned and antiseptic applied. 4. The surgeon opens a sterile surgical pack containing various instruments, and adhering to sterile techniques, completes the procedure while the level of anesthesia is regulated at a safe but effective rate so that the patient perceives no discomfort. 5. The spay procedure entails incising the skin, subcutaneous tissue, and midline abdomen, then through the peritoneum to enter the abdomen. The right and left ovaries are located near the kidneys; their blood supply and ligaments are isolated and ligated to prevent bleeding. The ovaries and broad ligament suspending the uterus are incised free of their attachments and the base of the uterus is located. Here too, blood vessels and surrounding tissue are ligated with surgical suture material and then both ovaries and the uterus are removed. Any intra-abdominal bleeding is identified and corrected. The abdominal lining, muscles, subcutaneous tissue and skin are carefully sutured together again at the end of the procedure. 6. After surgery, the patient is placed on a clean blanket in a clean cage or pen and is monitored as it recovers from anesthesia. 7. Prior to going home, very specific post-operative instructions are given to the owner. The pet is given a bath if necessary prior to being discharged. 8. The cage or pen is cleaned and readied for the next patient. Some of my expenses (Ed. note: again, 1990 prices) for this service entail little things like telephone service, paying employees for their time, hot water, and laundry. Larger expenses include gas anesthesia, a 4 oz. bottle of Isoflourane costs me $97.00; and sutures, a box of 36 costs me $123.00; and I use 2 to 4 per surgery. I refuse to buy cheap suture material for obvious reasons. My fee for a dog spay is $90.00 and a cat spay is $75.00.[These are 1990 prices... TJD] Neutering is slightly less complicated surgically, however, from the first telephone call to dismissal all the other links in the chain are the same as a spay. According to Veterinary Economics Magazine, the national average for a dog spay is $88.00.   Pet Population, Veterinarians and the Pet Owner: The choice to obtain a pet presupposes some forethought concerning it&#039;s care. Nobody forces or requires you to own a pet. Neither is pet ownership a preconferred right, but rather a responsibility and commitment freely undertaken; and any reasonable person knows pet ownership will require expenses for food, shelter and occasional medical care. One aspect of pet care involves &quot;planned parenthood&quot; for your pet. There are medical advantages for the pet and sociological advantages for us humans if the pet is spayed or neutered. Unfortunately, sterilizing the pet requires surgery. Unfortunately, not everyone has the skill to do this safely. Unfortunately for the pet owner, they will have to actually pay someone to do it who does know how … just as you world to repair a water leak in your basement. It is self evident that this surgery never comes as a surprise to the pet owner. It is not an unplanned emergency. It is not something that suddenly presents itself as a huge medical/financial disaster. I fully appreciate the fact that there are people who desire to own a pet and also desire to responsibly curtail their pet&#039;s reproductive ability but have severe financial constraints. To these people we extend credit with no interest and a payment plan is set up. I personally believe it is unfair and illogical to assert that &quot;If you vets truly had humanitarian feelings for pets like you&#039;re supposed to, you wouldn&#039;t charge so much for &#039;fixing&#039; them. That&#039;s why there are so many unwanted pets. And maybe if you did it for free, all those animals wouldn&#039;t be put to sleep in animal shelters.&quot; Sometimes I&#039;ll respond to these questions with equally illogical statements of my own like, &quot;Why don&#039;t the dentists give away free tooth reconstructions to people who can&#039;t afford it; or the shoe store owner give away basketball shoes to kids whose torn shoes affect foot care and posture? Or why doesn&#039;t the heating specialist fix that furnace for a bargain price for old folks on a fixed income; or why doesn&#039;t the guy who runs the clothing store sell winter coats at cost to people who &quot;just can&#039;t afford&quot; warm winter clothes? After all, we&#039;re talkin&#039; HUMAN HEALTH here! If these business people had any humanitarian empathy toward their fellow human beings, they wouldn&#039;t charge so much for those things!&quot; Somehow the veterinarian has been singled out to give their time and labor away for &quot;humanitarian reasons&quot; in order to stem the tide of homeless, unwanted pets. I speculate it&#039;s in keeping with the currently fashionable fixation on blaming someone or something else for our own personal challenges. If all the veterinarians in the USA did nothing but spays and neuters all day long for a month, it would barely dent the surface of the pet over-population problem. The responsibility for animal population control lies squarely on the shoulders of the pet-owning public. Veterinarians, through their understanding of medicine and surgery, are available to assist and promote pet population control. And, like any other service provider, they charge a fee for your use of their knowledge, skill, and time... just like a plumber, cab driver or neurosurgeon. I&#039;ve raised the fees I charge only once in the last eight years. Can you think of ANY other business whose fees have gone up less often than that? I believe other area veterinarians are also holding steady regarding the fees for spays and neuters. Plus, all the veterinarians I know in northern Wisconsin donate their services at no charge for spaying/neutering animal shelter pets in order to increase the animal&#039;s chances of adoption. So, if pet owners in my neighborhood are looking for a bargain for surgical sterilization of their pets, look no further … you&#039;re already getting one! Respectfully,T. J. Dunn, Jr. DVMFebruary, 1990"}]