[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What is a Veterinary Technician?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/RubinDog0210_high%28AVMA%29.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/RubinDog0210_high%28AVMA%29.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Wellness exam, Preventative health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_what_is_a_veterinary_technician"}, "datePublished": "March 15, 2011", "dateModified": "August 30, 2022", "description": "When you drop your pet off at the veterinary hospital, have you ever thought about who besides the veterinarian is involved in their care? The answer to that question is the veterinary technician. They provide the veterinarian with technical support for all aspects of patient care.", "articleBody": "When you drop your pet off at the veterinary hospital, have you ever thought about who besides the veterinarian is involved in their care? The answer to that question is the veterinary technician. They provide the veterinarian with technical support for all aspects of patient care. Sandy is a veterinary technician who works at a local animal hospital. In order to become a veterinary technician Sandy attended a college program that is accredited by the American Veterinary Medical Association. The curriculums at these accredited programs is very thorough -- educating Sandy in all aspects of animal care. Additionally, Sandy may have taken an examination offered by the state where she works. This test will help to ensure that your pet will be taken care of by a qualified and certified professional. What is Sandy&#039;s role in your pet&#039;s care? As a veterinary technician, Sandy can be involved in all aspects of patient care except the performing of surgery, the making of a diagnosis, and the prescribing of medications. A Day in the Life of a Veterinary Technician As you come into the hospital, it may be the veterinary technician who greets you and your pet and escorts you to the exam room. There the technician may listen and make notes while you describe the reason for your pet&#039;s visit. S/he may give your pet a physical exam -- look at the pet&#039;s  eyes and ears, listen to the heart, and take the temperature. All of this information will be passed along to the veterinarian for their evaluation. If your pet is to have lab tests run, such as a check for heartworm, a Complete Blood Count (CBC), or a check for parasites, it will be the veterinary technician who takes the appropriate samples and using high tech instruments will document the results for the veterinarian&#039;s interpretation. When further testing is required, such as X-rays, the veterinary technician will take the X-rays and deliver them to the veterinarian. Is your pet at the hospital for surgery? If so the veterinary technician may perform a physical exam on your pet prior the the procedure, will run the appropriate lab work, and will ensure that all equipment is ready for the veterinarian&#039;s use. S/he may, under the supervision of the veterinarian, administer the anesthetic agent to your pet to protect your pet&#039;s comfort during any surgical procedure. During the procedure your pet&#039;s heart rate and respiratory rate will be closely monitored by the veterinary technician to ensure the patient&#039;s safety during this time. Or the veterinary technician may actually assist the veterinary surgeon during the procedure by passing instruments and other items to the surgeon. The veterinary technician will be with your pet during its recovery from the anesthesia and will be responsible for administering medication at the veterinarians direction to manage any pain.  Veterinary technicians are trained to respond to all of your pet&#039;s needs that may arise after the surgical procedure. Bad breath? As you may know, your pet can have bad breath due to a number of oral hygiene abnormalities. The veterinary technician in most hospitals will be able to discuss with you the causes of bad breath and ways to treat the problem. Just like the dental hygienist that you may visit, s/he has been trained to clean your pet&#039;s teeth using a machine called an ultrasonic cleaner.  The veterinary technician will also evaluate your pet&#039;s teeth, taking any concerns she may have to the veterinarian.  From the moment your pet arrives at the hospital, aren&#039;t you glad to know there is someone of education and qualifications to provide the excellent nursing care that your pet deserves? The next time you take your pet to the animal hospital, ask to meet the veterinary technician. Ask them from which of the over 80 AVMA-accredited programs they graduated. Meeting the veterinary technician on staff at your local animal hospital will give you a sense of comfort knowing that your pet will be in the hands of a dedicated pet health care professional -- a caring and qualified veterinary technician. Image: Courtesy of the AVMA"}]