[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/syigr6ls1b", "@type": "VideoObject", "duration": "PT1M55S", "name": "5327107206001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/1247a67c3f3b0023bf8e3c17aa89461053213176.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/syigr6ls1b", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/507af54bc3ac507717a3591a3eaa0ec37135b09e.m3u8", "transcript": "How did parasites get on my pet keeping parasites such as fleas, ticks and heart worms off of your pet is an important step in ensuring the health of your dog or cat in order to protect your furry friend against each parasite. It's vital to know how these pests are transmitted to our pets. Unlike many other pests ticks don't fly or jump. They are arachnids and crawl onto pets from grass shrubs or bushes.\n\nOnce they attach to the fur ticks crawl upwards and look for a place to begin feeding. Almost 300,000 dogs in the US are infected with heart worms each year. Heart worms are transmitted to dogs or cats through infected mosquitoes. When a mosquito bites a pet the heart worm migrates to the heart and large blood vessels of the lungs, heart worms can grow up to 16 inches in length.\n\nEar mites live on the surface of ear canal skin in pets and are barely visible to the human eye while most mites are naturally occurring some dogs and cats are susceptible to troublesome infections ear mites are highly contagious and spread through social interaction with other infected dogs fleas are the most common external parasite found on dogs and cats. They use their strong back legs to jump from their environments or another host onto our pets fleas may be transported into your yard by wild animals, including raccoons squirrels and other small rodents tapeworms are long flatworms that attach themselves to a pet's intestines Diffie lithium candy name is the most common type of tapeworm that is transferred to dogs through the ingestion of infected fleas because fleas are an intermediate host of these parasites.\n\nIt's important to use year round flea prevention.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/camping-with-your-dog-vet-tips?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Camping with Your Dog? Read These Vet-Approved Tips", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/campingdog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/campingdog.jpg"}, "author": {"@type": "Person", "name": "Patrick Mahaney, VMD, CVA, CVJ", "url": "https://www.petmd.com/author/dr-patrick-mahaney"}, "keywords": "Dog, Safety, General Care, Hot weather", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/camping-with-your-dog-vet-tips"}, "datePublished": "January 26, 2015", "dateModified": "August 30, 2022", "description": "Camping is a common way for people and their dogs to get away from the stressors of life and relax in the great outdoors.  Here are some important ways to prepare.", "articleBody": "By Patrick Mahaney, VMD Camping is a common way for people and their dogs to get away from the stressors of life and relax in the great outdoors. It also helps strengthen the bond between person and dog. There are, however, important considerations to be made. After all, removing a dog from the safe confines of your house or yard creates a variety of potential dangers that otherwise would likely not be faced if the pet were to remain home. Pending the location, time of year, climate, degree of insect infestation, proximity to wildlife, general health of your pet and other factors, camping can either be a great activity or a significant health and safety challenge for all parties involved. Are You Safely Transporting Your Pet? Most owners transport pets in their own cars, trucks, or even Winnebago-style campers. When taking a dog from your home to the campsite, common sense practices should always be taken to ensure safe travels. The first step: choosing the right travel harness. Some dogs wear harnesses for day-to-day walks, but that same harness may not be suitable to attach to a seat belt and securely restrain him to the seat. According to the Center for Pet Safety (CPS) many harnesses don’t fit the bill to keep your pet secure in case of a crash. &quot;Pet travel harnesses come in two forms, those that only prevent distraction and those that provide actual crash protection… select a quality crash-tested harness to protect your pet and also protect your family if an accident occurs.&quot; My top recommendation is to use a sturdy crate with rigid plastic walls. Firmly attaching the crate to your car’s interior keeps a pet better restrained and reduces the likelihood that the pet-in-crate combination will be tossed around the car during a sudden stop or accident. The CPS suggests putting &quot;the small carrier on the floor of the vehicle behind the front passenger or driver seat.&quot; Additionally, make sure your pet wears a collar or chest harness adorned with an identifying tag and/or embroidered with the pet’s name and your phone number. This will increase the chances your dog is returned should he or she get lost on the way to or at the campsite. Dogs which are microchipped have an even greater rate of return should they go missing and enter the shelter system. So have your veterinarian implant a microchip before your planned departure, and make sure your pet’s ID number is registered with your current contact information. Take Temperature Safety Precautions Most people camp during warmer months, but a few souls brave cold climates during outdoor excursions. Both the heat and the cold pose their own type of dangers for your dog. The cold can subject your dog to issues like hypothermia (extremely low core body temperature) and frostbite. The heat, meanwhile, can cause havoc with your dog&#039;s thermoregulating mechanisms. Unlike humans, dogs can’t clear heat in a manner that permits the body to cool to a safe level when exposed to indoor or outdoor climates greater than room temperature (68-77 ºF). Dogs’ primary means of heat loss is through the respiratory tract, which is less efficient than humans, who sweat through our less-haired skin. This is one reason why dogs pant when exposed to warmer climates. Pets lose some heat through their paw pads and skin, but not enough to efficiently permit cooling to a normal body temperature. The hair coat adorning most dogs and cats is thick and covers the body, so heat gets trapped inside pets’ bodies and can lead to hyperthermia (elevated core body temperature). Brachycephalic (short-faced) cat and dog breeds are more prone to suffering from heat-related illnesses. These breeds and their mixes don’t move air as well through their respiratory tracts as their longer-faced (dolichocephalic) counterparts. Juvenile (puppy and kitten), geriatric (older than seven years), sick, overweight, obese, and mobility-compromised pets are also more prone to heat-induced health problems. Never leave your pet in the car for even a few moments without the accompaniment of a responsible person.  Is Your Chosen Camping Site Safe For Your Pet? Wherever you choose to set up camp, keep your pet&#039;s safety at the forefront of the planning process.  Many parts of the country harbor insects that live to feed from your dog’s blood and potentially spreading life-threatening bacterial, parasitic, or viral infections. Ticks commonly spread bacterial pathogens like Lyme Disease, Ehrhlichia, Rocky Mountain Spotted Fever, and others.  Mosquitoes may carry parasites like heartworm (Dirofilaria immitis). It&#039;s essential to properly and thoroughly protect your pets from these arthropod-disease carriers (vectors) to ensure that their long-term health will persist. Consult with your veterinarian to establish the most appropriate parasite-prevention strategy for your pets. A single medication or multiple products having the ability to deter fleas, ticks, and mosquitos may be needed to protect your pet. Additionally, your pet may become prey for another animal, depending on the density of wildlife populations at your chosen camping spot. Humans tend to attract wildlife to homes and camp sites through their habits of bringing food to areas commonly not having such delicacies. Keep food supply and trash in secure containers inside your vehicle to deter the scavenging attempts of wildlife. Coyote, hawks, bears, wolves, and others could track, snatch, and kill your dog. Raccoons, possum, and other smaller animals could fight with your pet, create significant bite-wound trauma, and spread potentially fatal disease (Rabies, oral cavity bacteria, etc.). Always walk your dog on a short, flat lead (not an extendable lead) when going out for bathroom breaks and never leave a dog tied up at your campsite unobserved. When Was Your Dog&#039;s Last Vet Checkup? If you plan to take your pet camping, schedule a physical examination with your veterinarian within a few weeks before your departure date. This way, he or she can determine if your dog is healthy enough to travel and camp. An anti-parasite protocol and other strategies can also be discussed to ensure your dog has the safest camping experience possible. Related Video: Image via Shutterstock "}]