[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What You Need to Know About Contact Voltage to Keep Your Pets Safe", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-leash-post-265648201_51c9ed840e_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-leash-post-265648201_51c9ed840e_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_keeping_pets_safe_from_contage_voltage"}, "datePublished": "December 3, 2012", "dateModified": "August 30, 2022", "description": "Incidents involving contact voltage may be more common than you think and may even harm your pets.", "articleBody": "By Cheryl Lock When Roz Rustigian heard about the 4-month-old puppy that had been electrocuted by an energized sidewalk in Providence, Rhode Island in January of 2011, she had enough. “At the time I owned three dogs, and I found the prospect of walking dogs on a city street that was potentially lethal to be terrifying,” said Rustigian. “This was about two miles from my house in a pedestrian dense, retail neighborhood. It wasn’t good.” Tragic stories of deaths that occurred like that of the puppy in Rhode Island had been happening before 2011, though. In fact, Jodie S. Lane lost her life in 2004 because of stray voltage, and the parents of Deanna Camille Green founded Deanna’s Lyric Foundation after their daughter lost her life in 2006 through what has come to be known as “contact voltage” by touching a fence. What is contact voltage and how can you keep yourself, your family and your pets safe from it? Rustigian is hoping to answer all those questions, and to spread the word about the issue, through the Contact Voltage Information Center. “The Contact Voltage Information Center is a central information system where anyone interested in finding out about this issue can go to learn about what contact voltage is and where it has made an impact in terms of striking people or harming pets around the nation,” said Rustigian, who is founder and executive director of the CVIC. “It’s built so that anyone in the U.S. can zero in and find their own legislators to contact, as well as use our resource guide to find out what, if anything, has happened with contact voltage in their own state.” Here are a few of the basics Rustigian and her colleagues would like people to know about the issue: What exactly is ‘contact voltage’? Contact voltage is a condition caused by the deterioration of insulation on underground cable. These power lines have an estimated useful life of roughly 30 years, but any number of factors can intervene and cause the protective coating to be compromised. This damage can result in uncontrolled electrical power energizing of any and all surrounding surfaces, including manhole covers, fences, storm drains, sidewalks, light poles, traffic control boxes, metal handrails and metal bus shelters. Contact voltage is most common in areas where residents and businesses have their electricity distributed through underground electric cables and equipment. How can it harm my pets, or me? Energized surfaces surrounding the fault can deliver a potentially lethal shock to humans or pets that come in contact with them. Fortunately humans have some greater protection against this shock when they’re wearing rubber soled shoes, but the fact that dogs always have all paws on the ground makes them particularly vulnerable to contact voltage. What can I do to prevent my pets from being harmed? Some standard ways to prevent your pet from coming into contact with contact voltage include: Avoid putting your dog in a metal collar or using a metal leashAvoid having your dog step on manhole coversRestrain your dog from urinating on objects with a conductive surface, like electrical boxesNever tie your dog up to something metal In addition to prevention, every person who walks a pet should try to at least have a passing familiarity with what electrocution looks like, says Rustigian. “People often don’t know what’s happening to their pets in these stories, and that’s a problem” she said.  A dog that gets an electric shock may yelp for what appears to be no apparent reason, or may even appear burned. The electric shock may cause irregular heartbeat, involuntary muscle contractions of the dog’s jaw, or it may cause dogs to cough, have difficulty breathing or drool. “If you believe your dog may have been electrocuted, it’s important to never directly pull the animal away from the source,” says Rustigian. “Preferably you’d be able to use something like a broomstick, or something else with a nonconductive surface, to separate them and take them to the vet.” How can I make a difference? Check out the CVIC Resources page for educational information about contact voltage in your specific area, and for links to critical resources and updates about what’s being done. You can click on your state in the map for links to key decision makers in your area, and write, email or call them with any specific questions or concerns. Image: Aaron_M / via Flickr"}]