[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vaccinating Your Own Dog: What You Should Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, Vaccine, General Care, Preventative health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_vaccinating_your_own_dog"}, "datePublished": "March 7, 2011", "dateModified": "August 30, 2022", "description": "Though discouraged by many veterinarians, there are a few things you should consider before choosing to vaccinate your own dog (or cat).", "articleBody": "By T. J. Dunn, Jr., DVM Though discouraged by many veterinarians, there are a few things you should consider before choosing to vaccinate your own dog (or cat). First, any animal can have an adverse reaction to any vaccine. The probability is small, but if it happens, your pet could be in big trouble -- fast! To see an actual case of a vaccine induced urticarial reaction in a Dachshund, look here. Adverse reactions from vaccinations are rare but do happen. The worst case scenario occurs when the dog or cat has what is termed an anaphylactic reaction. These hypersensitivity reactions cause a number of physiologic disturbances within the body that result in low blood pressure, slow heart rate and depressed breathing rate. Because the brain is starved for oxygen due to the low blood pressure, unconsciousness can occur. In thirty years of vaccinating pets nearly every day (over 200,000 doses administered!) I have witnessed three of these anaphylactic reactions. They are very scary and require immediate life-saving measures to prevent an unpleasant outcome. Fortunately for my three patients the reactions occurred right there in the animal hospital and I was able to reverse the shock. Had these reactions occurred at someone&#039;s home where no anti-shock medications and fluids were immediately available, those three pets would certainly not survived. Some animal hospitals will sell vaccine to breeders, physicians and nurses, and other pet owners who wish to vaccinate their own pets. A release form may be required to be read and signed prior to selling vaccines. (NOT including Rabies vaccine. This is always administered by a veterinarian and should never be sold or distributed to anyone for use by someone other than a licensed veterinarian.) Read the sample release form below and you will have a better appreciation for the variables that you should be aware of prior to making the decision to vaccinate your own dog (or cat). Release Form - Vaccinations I have read and understand the following (9) points relative to vaccinating my own animal(s). I fully accept all responsibility for the use and effects of the vaccine(s).Date:Name:Vaccine:1. A severe, life-threatening anaphylactic reaction can occur after a vaccination. The reaction may require rapid medical intervention to save the animal&#039;s life.2. Improper handling of vaccines or syringes can result in infections at the injection site as well as post-vaccine fibromas.3. If a vaccine intended for subcutaneous administration is accidentally delivered intravenously, or an intra-nasal vaccine given parenterally, a life-threatening reaction may occur.4. The vaccine may not be effective for any of the following reasons:(a) It is outdated(b) Left unrefrigerated too long(c) Mixed with diluent and then not promptly administered(d) The syringe has residue or contaminants in it(e) Alcohol is swabbed on the skin prior to vaccinating(f) Vaccine is exposed to sunlight, heat, or freezing9. The proper route of administration is important. If the vaccine is administered in the skin rather than under the skin when the subcutaneous route is indicated or if given in or under the skin when the intra-muscular route is indicated ... the vaccine may not be effective in inducing immunity.5. Some brands of vaccines are more effective than others.6. No vaccine manufacturer guarantees that every animal vaccinated will produce protective antibody. There is a wide range of responses possible to each vaccination.7. If you vaccinate your own animal for rabies, state public health and law enforcement officials do not recognize your vaccination as valid. You and the animal will be treated as if NO rabies vaccine was administered. To be recognized as a legal and valid vaccination, Rabies vaccine must be administered by a currently licensed veterinarian in accordance with established state protocol.8. If you vaccinate someone else&#039;s animal and they pay you for the favor, you are considered by state statutes to be in violation of the law. Only a licensed veterinarian may legally receive a fee for administering vaccinations.9. Syringes and needles are considered hazardous waste and may be disposed of only in accordance with local or state regulations. They may NOT be disposed of with ordinary garbage nor in a landfill. As your pet&#039;s primary guardian you must make an informed decision whether or not to vaccinate your own pet or to have your veterinarian do it in a medical environment. There are many advantages for you and your pet to have the vaccines administered within an animal hospital setting -- from a record keeping standpoint, physical examination by the veterinarian prior to vaccination, convenience of picking up medications and supplies, being updated by the animal hospital staff about new products and procedures, and the availability of life saving medications in the event that an anaphylactic reaction results from a vaccine injection. Image: Zaldylmg / via Flickr"}]