[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Build a Dog Kennel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4781554621_0a66103e97.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4781554621_0a66103e97.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_building_kennel"}, "datePublished": "September 18, 2008", "dateModified": "January 31, 2023", "description": "Impress your friends, and your doggy, with your mad hammer skills. A little planning and work will go a long way to make your dog castle the envy of the neighborhood dogdom.", "articleBody": "Impress your friends, and your doggy, with your mad hammer skills. A little planning and work will go a long way to make your dog castle the envy of the neighborhood dogdom.   Does your dog sleep outside under the stars? Maybe its old house is crumbling to pieces. Well, you&#039;ll want to impress your friends and neighbors and most importantly, Fido, by getting your dog the best in designer doggy housing -- a custom built kennel made by you. If you’re good at wielding a hammer and nail, then go ahead and get started. Chateau Dog will soon be the envy of every mutt on the block.   Here are 10 tips to help you on your way:   When it comes to working out the dimensions of the kennel, think Goldilocks and the Three Bears: not too big, not too small, but just right. Basically, it should be large enough for your dog to lie down, stand and turn around. But snug enough for your dog to retain body heat for warmth in colder weather.Take your dimensions for Chateau Dog down to your local hardware store and pick up the wood. We recommend exterior grade plywood and chipboard, all non-toxic, of course. Also, ask the employees at the store. They&#039;ll help you make the right purchase.Order flooring material to size. Flooring that provides extra padding and warmth is another great idea.To prevent moisture seeping through a wood flooring, raise the kennel a few inches above the ground. You can use stilts, a hollow platform, or, if you’re feeling adventurous, make a concrete base.Cut the sides and roof to fit your dimensions (unless you were wily enough to get the people at the hardware store to do it for you). And don’t forget to either build a door or cut a door hole, so the dog can get in and out.Start wielding that hammer. Or you can use your electric drill; they’re fun, too.Put the sides together first, making sure there are no rough edges or bits of nail/screw sticking out for your dog to snag itself on.A hand-made kennel that allows for easy cleaning is a smart kennel (and that makes you smart).Think of options that will allow you to clean the kennel quickly, easily and efficiently. Having a slight slope to the kennel allows for easy drainage, while a detachable roof gives you easy access for washing.Outdoor furniture cushions make for brilliant bedding. Not only are they comfy for your dog to sleep on, but they’re easy to clean, and more sturdy and weather resistant than the indoor kind.A well built kennel will last for years, and will not only make your dog feel like king (or queen) of its own castle, but may make your friends envious they didn&#039;t build one for their dog. And that’s always a good thing. Happy kennel building!    Image: brittgow / via Flickr"}]