[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/ijttz55c7w", "@type": "VideoObject", "duration": "PT1M19S", "name": "5327102554001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/4f43707bba660354dacd4426fb0d17876146cb7e.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/ijttz55c7w", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/0bdbbc5d46bb02f9ca7cef54a4db8b0572c62ee3.m3u8", "transcript": "For tech myths busted myth one you should wiggle a tic to remove it moving it takes a body from side to side or twisting it can cause its mouth parts to break off and remain in the skin. The correct way to remove a tick is to pull upward with steady, even pressure myth 2. You can suffocate a tick by smothering it with petroleum jelly or nail polish ticks. Breathe slowly.\n\nNeeding only three to 15 breaths per hour. So by the time it dies from suffocation it may have passed disease causing pathogens into your Dog system. The best solution is to act fast and remove the tick as quickly as possible. Myth 3 your fingers are the most effective method for removing ticks trying to remove a tick with your fingers can lead to more problems for both you and your pet.\n\nStudies worldwide have found that people who use tweezers to remove ticks are far less likely to experience complications including secondary skin irritation rashes and bacterial infections. Myth 4 you can burn off a tick with a match using heat to make a tick detach from your pet skin is ineffective and can easily burn your pet skin or your own. Never use an open flame near your pets fur. Instead remove the tick quickly using tweezers or a tick remover tool.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/10-questions-everyone-should-ask-their-veterinarian?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "10 Questions Everyone Should Ask Their Veterinarian", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-at-veterinarian-shutterstock_137712743-MD.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-at-veterinarian-shutterstock_137712743-MD.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Wellness exam, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/10-questions-everyone-should-ask-their-veterinarian"}, "datePublished": "December 2, 2014", "dateModified": "August 30, 2022", "description": "Bringing pets to a veterinarian can be nerve-wracking experience, but it doesn&#039;t have to be. Here are 10 things everyone should ask their veterinarian.", "articleBody": "Bringing pets to a veterinarian for a wellness exam can be nerve-wracking and frustrating for some people. Often it isn&#039;t even the vet&#039;s fault — we just don&#039;t know the right questions to ask. Here are 10 things everyone should ask their veterinarian. 1. Is My Pet at a Healthy Weight? More than half of the dogs and cats in the U.S. are overweight, according to a recent survey by the Association for Pet Obesity and Prevention. Even worse, many pet owners with overweight dogs or cats deny there is even a problem with their pet. Ask your veterinarian if your pet is within the appropriate weight range for her breed, size and stature. Then, if there is a problem, you can work in tandem on how to solve the issue. This also applies if you suspect your pet is underweight, though it&#039;s less typical. 2. Could I be providing a more appropriate food? Good health begins with proper nutrition, and who best to ask what is appropriate for your pet than your veterinarian. Once they evaluate your pet they can recommend diets that are appropriate for your pet&#039;s life stage, lifestyle and any other factors or underlying health conditions that apply. 3. Is That [Insert Odd Behavior Here] Normal? Don’t automatically assume that your pet wheezing after a bout of exercise is normal, or that it’s common for pets to itch every time they go outside. An annual pet wellness exam is a great time to ask your vet about any peculiarities you’ve noticed in your animal over the past year. Keep a running list as these things happen so you can note to your doctor exactly what the issue was, when it first occurred and how often it has occurred since. 4. Is My Pet Up to Date on Shots? It never hurts to make sure your furry friend is totally up-to-date on all his or her vaccinations and immunizations—it’s something that can easily be overlooked. 5. Does My Pet Need a Dental Cleaning? Dental disease is a common problem among pets. In fact, it&#039;s estimated that 80% of dogs and 70% of cats over the age of 3 years suffer from some degree of periodontal disease. If left untreated, this can lead to other more serious health complications such as issues with the kidney, liver, even the heart. Ask your veterinarian if Fido or Fluffy is due for a dental cleaning. &quot;Rather than wait for a problem to develop,&quot; says Dr. Ashley Gallagher, a veterinarian at Friendship Hospital for Animals, &quot;it is best to perform a teeth cleaning when only mild gingivitis and/or tartar are present. This will maintain good dental health and prevent disease before it becomes a problem … which in turn helps you save money and keep your pet healthy!&quot; 6. Does My Pet Need a Blood Test? Blood tests screen for a variety of issues, including kidney and liver disease, diabetes, cancer and a variety of other issues that can be treated if caught early. Regular blood tests will also give your veterinarian a baseline to compare against over time. 7. What Flea/Tick Meds Do You Recommend for My Pet? Fleas and ticks are not only a nuisance; they can also transmit deadly diseases to you and your pet. Fortunately, there are many options when it comes to killing and preventing fleas and ticks. Ask your veterinarian about the differences between popular medications on the market (for example, topical versus oral medications) and which suits you and your pet&#039;s lifestyle the best. There are even some oral medications which protect against both fleas and ticks for up to 12 weeks with just a single dose. 8. What are these Lumps and Bumps? It&#039;s not unusual for lumps and bumps to develop as pets age. However, unusual skin changes can also be an indication of cancer. Point out any new lumps, bumps or strange moles that have appeared since your last visit. The veterinarian can then determine if a biopsy is warranted. 9. Does My Pet Need a Rectal Exam? Every veterinarian has a different way of doing things, but he or she may not perform a full rectal exam on your pet if you don&#039;t ask for one. Rectal exams screen for prostate and rectal cancer, which can be treatable if caught early enough. 10. Can You Please Explain my Bill? If you ask nicely your veterinarian will be much more likely to explain why a short visit and routine procedures cost what they do. It may seem like a lot of money, but these line item expenses are probably keeping your pet healthy and happy for many years to come. Image: XiXinXing / via Shutterstock"}]