[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Top 5 Boarding Options for Your Pet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/boarding-shutterstock_7172107.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/boarding-shutterstock_7172107.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel, Safety, Boarding", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_top_pet_boarding_options"}, "datePublished": "September 14, 2012", "dateModified": "August 30, 2022", "description": "Before heading out of town, think about the best boarding option for your pet. Here, 5 ideas for all pet personalities.", "articleBody": "What to do with Pets while on Vacation By Vanessa Voltolina It may seem as though pets have a sixth sense when it comes to travel -- especially when they’re not invited! Kitty may cozy up to you the second suitcases are packed, or your dog may start looking depressed during the pre-vacation hustle and bustle. Before going away, one of the biggest decisions for pet owners is what to do with their pets. Here, there are five options for where to board your pet while you’re away. 1. Pet Sitting Using a pet sitter is one way to fuse the personal with professional. Many cats and dogs feel comfortable in their own environments, so having an experienced pet sitter come by for feedings, walks and playtimes is a solid option. Decide whether you want a sitter to simply visit your home on a daily basis (or perhaps multiple times per day) to spend some QT with your pet, or have them stay in your home for the duration of your trip. 2. In-Home Pet Boarding While enlisting a pet sitter is a good option, so is in-home pet boarding. In-home boarding involves you bringing your animals to a pet sitter’s home in your area before leaving on vacation. Whether to in-home board or hire a pet sitter to come to your home depends on the needs of your pet. In-home boarding gives dogs the opportunity to socialize with other dogs under the supervision of a responsible pet owner, as well as individualized attention and more daily interaction. In-home boarding can be more affordable than pet sitters that come to the home, too, and there is the added security of not giving up your house keys. National services such as DogVacay.com and SleepoverRover.com allow you to search for pet sitters that offer in-home boarding near you. 3. Traditional Boarding (Dog Kennels/Catteries) One standard option is placing pets in boarding kennels or catteries while you’re away. If this is your preferred choice, call ahead and arrange in advance and confirm that it has a Pet Care Services Association (PCSA) certification and the licensing of the caretakers. If you have a cat, choose a boarding facility where cats do not come into contact with each other. As a pet parent, it’s important to search for boarding options that are feline-only. Cats do much better in this type of environment. Unless the cats are from the same family, they should not be put into a room with other unfamiliar cats. This is an important health and safety precaution to ensure that cats won’t fight or mate. Ask about a nice, large confinement area (aka a “kitty condo”) and that cats will have a litter box, toys and food puzzles, as well as a hiding place within the area. On the flips side, dogs are pack animals and sociable, so ensure that they will have enough activity time to play and run with other dogs. Find qualified boarding facilities by searching the International Boarding and Pet Services Association. 4. Family Friend/Neighbor Good friends or neighbors go gaga every time they see your pet? Next time you take a vacation, consider asking them to stop in to feed and play with your four-legged family member. Of course, confirm that this person is responsible and knowledgeable about the basics of pet care. Be equally cautious if your dog is off-the-wall, or your cat has a history of marking “new territory,” as it may put a strain on your friendship. If this friend or neighbor is a pet owner, offer to return the favor someday, and consider bringing them back a small token from your trip as a thank you! 5. Take Them Along It can be fun to travel with your pet in certain situations, and is becoming more feasible as the number of pet-friendly hotels grows. If an activity like camping is on the agenda, your canine may enjoy being with your family in the great outdoors. Double check that your vacation is pet-friendly, though, as many places, including parks and beaches, are known for “no dogs allowed” policies. But if your pet loves to travel, a pet-friendly vacation could be a nice change of pace. Search sites like Petswelcome.com and Officialpethotels.com to find establishments that love your pet as much as you do. Image: hagit berkovich / via Shutterstock"}]