[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What is Normal Earwax for Pets?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Excessive-Ear-Wax-In-Pets-335716268.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Excessive-Ear-Wax-In-Pets-335716268.jpg"}, "author": {"@type": "Person", "name": "Sarah Wooten, DVM", "url": "https://www.petmd.com/author/dr-sarah-wooten"}, "keywords": "Dog, Ear health, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/what-normal-earwax-pets"}, "datePublished": "January 30, 2018", "dateModified": "August 30, 2022", "description": "How much ear wax is too much for a dog or cat? Is it safe to clean ear wax from your pet’s ears alone, or do you need to see a veterinarian? Find answers to these questions and others, here.", "articleBody": "Cerumen, what we call earwax, is a normal, natural component of all dog ears. Earwax is secreted by special glands in the ear, and functions to collect dirt, debris, dead cells, microbes, pollen, etc. Earwax then slides and glides its way slowly out of the ear canal, carrying all the unwanted items with it and cleaning the ear naturally. Is Earwax Normal for Pets? A common question asked by pet parents is how much earwax is too much, and if they see earwax, if they should clean it from their pets’ ears. If the ear appears normal and healthy on exam and there is no sign of infection, then there is no reason to clean the ear. In most dogs and cats, the ear is a well-balanced organ that has a good system in place to take care of itself. If you start cleaning ears, you could upset the balance within the ear (literally—you can change the pH of the ear by cleaning it!), which can predispose the ear to infection. If your pet has normal ears, you can leave them alone. If you aren’t sure whether your pet’s ears are healthy or if there is too much earwax, consult with your regular veterinarian, who can give you accurate information on your pet’s ear health. Breeds Prone to Excess Earwax Some dog and cat breeds are more prone to excessive levels of earwax that is unhealthy. Some Cocker Spaniels have a genetic condition that causes the glands in their ears to create excessive earwax. Dogs with very long ear canals, Bassets for example, can experience excessive wax build-up. English Bulldogs can have excessive earwax trapped in the folds of their ears. Skin conditions and allergies, which are not limited by breed but which Bulldogs are particularly prone to, can lead to excessive wax buildup and ear infections as well. Poodles or poodle crosses grow hair in their ear canals, and because they do not shed their hair like other breeds, they can suffer from earwax getting trapped in the hair, creating a big hairball that blocks the ear. Aside from breed, pets with allergies may have excessive wax buildup due to swelling in the ear canals, and dogs that swim or spend time in water are more likely to develop excessive earwax. How Do You Clean Wax Out of a Dog&#039;s Ear? All of these conditions can predispose pets to painful recurrent ear infections, antibiotic-resistant ear infections, chronic changes in the ear, and loss of hearing. If your veterinarian has noted excessive earwax, anatomical features in the ear that can predispose a pet to excessive earwax, or if your pet suffers from recurrent ear infections, talk with your vet about routine biweekly cleaning of the ears as part of healthy dog ear care and cat ear care. Your veterinarian can either prescribe or recommend specific medications made for removing excessive wax, drying the ear, and balancing the pH of the ear. Sometimes dirt in the ear can look like excessive wax and fake you out. Conversely, a yeast infection can fake you out by creating dark brown debris that looks like dirt. You may need your veterinarian to identify exactly what it is. Watch for Signs of Ear Infection Dogs and cats are known to develop bacterial ear infections, fungal ear infections, and ear mite infestations. If you notice what appears to be excessive wax in the ears, use a cotton ball to wipe the wax out of the ear and then take a look in the ear. If there is any odor to the ear, or if the ear is red, swollen, painful, warm to the touch, or looks different than the other ear, there is a high likelihood that your pet has an external ear infection. Other signs to watch for are: Sensitivity and reluctance to having the ears touched, which can signal pain Excessive scratching or digging at the ears Rubbing the ears against the ground or furniture Schedule an appointment with your veterinarian as soon as possible for testing and treatment, as these infections are uncomfortable at best, and at worst, horribly painful and permanently injurious if allowed to progress. Image via Suda Productions/Shutterstock.com"}]