[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Determining the Best Age at Which to Spay or Neuter a Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/spaydog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/spaydog.jpg"}, "author": {"@type": "Person", "name": "Margaret Root-Kustritz, DVM, PhD", "url": "https://www.petmd.com/author/dr-margaret-root-kustritz"}, "keywords": "Dog, Spay, Neuter", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_determining_best_age_to_spay_or_neuter"}, "datePublished": "February 14, 2011", "dateModified": "August 30, 2022", "description": "  When Should You Get Your Dog Spayed or Neutered? This article is courtesy of AKC Canine Health Foundation. By Margaret Root-Kustritz, DVM, PhD University of Minnesota", "articleBody": "  When Should You Get Your Dog Spayed or Neutered? This article is courtesy of AKC Canine Health Foundation. By Margaret Root-Kustritz, DVM, PhD University of Minnesota In many parts of the world, due to cultural or economic prohibitions, bitches and dogs are not spayed or castrated unless they have reproductive tract disease. However, in the United States, virtually all bitches and dogs are rendered sterile by surgery at some point in their life. This better allows for reproduction control in animals no longer capable of or not considered desirable for breeding, and eliminates behaviors and physical changes related to presence of reproductive hormones that dog owners find objectionable. The surgeries most commonly performed are ovariohysterectomy (removal of the uterus and both ovaries), commonly called spaying, and castration (removal of both testes and the associated epididymes). Castration is commonly also called neutering, although that term most correctly can be used for surgery of either gender. Collectively, these surgeries can be referred to as gonadectomy, removal of the gonads or reproductive organs. Removal of the ovaries eliminates secretion of the hormones estrogen and progesterone. Removal of the testes eliminates secretion of the hormone testosterone. Elimination of these hormones obviously leads to decreases in behaviors and physical changes associated with their secretion, such as heat behavior, swelling of the vulva, and estrous bleeding in bitches, and mounting and roaming in dogs. However, reproductive hormones have effects on other tissues in the body and removal of those hormones may inadvertently impact those systems negatively. Other, less obvious, hormone changes also occur after gonadectomy, including persistent elevation in hormones that control the secretion of estrogen, progesterone, and testosterone. Whether these other hormone changes affect other systems positively or negatively often is unclear. This paper is a review of what has been demonstrated in the veterinary literature regarding effect of gonadectomy on the animal as a whole. This discussion does not address the societal problem of pet overpopulation. The author feels that animals with no owner or guardian should be spayed or castrated before adoption into a new home as one of many initiatives necessary to decrease the number of dogs euthanized in the United States annually. This discussion instead refers to dogs with responsible owners or guardians who maintain dogs as household pets, do not allow the animals to roam free, and provide the animals with regular veterinary care. Evidence in this context is defined as credible information from peer-reviewed research. Studies involving more dogs are more valuable than reports of single cases. Multiple studies documenting a given phenomenon are more valuable than single papers. Incidence in this context is reported as a percent; this is the number of affected animals out of a random sample of 100. In veterinary medicine, any condition with an incidence greater than 1% is considered common. Readers are encouraged to carefully read all manuscripts of interest and to ask their veterinarian for clarification if needed. This paper is condensed from a more detailed, extensively referenced manuscript that may be available through your veterinarian (Root Kustritz MV. Determining the optimal age for gonadectomy of dogs and cats. Journal of the American Veterinary Medical Association 2007;231(11):1665-1675). Why do we perform spay or castration at 6 months of age? Most veterinarians in the United States recommend bitches and dogs be spayed or castrated between 6 and 9 months of age. This is not based in science; no one has performed a large-scale study in which bitches and dogs underwent gonadectomy at various ages and were tracked throughout life to determine what abnormalities developed relative to age at gonadectomy. It is thought that the current age recommendation arose after the World War II, when increasing affluence of American families first permitted them to treat animals as household pets and were, therefore, more interested in controlling manifestations of reproductive hormone secretion and very interested in making sure the animal survived surgery. Anesthetic and surgical techniques available at that time necessitated the animal be at least 6 months of age. With current anesthetic agents, anesthetic monitoring equipment, and surgical techniques, it has been demonstrated in multiple studies that bitches and dogs can safely undergo gonadectomy when as young as 6 to 8 weeks of age. Surgical complication rate does not vary between groups undergoing surgery when very young compared to those undergoing surgery at the more traditional age, with overall postoperative complication rate reported as 6.1%. The vast majority of these post surgical complications are transient and do not require veterinary care. Effects of gonadectomy on behavior Behaviors that are most likely to be affected by gonadectomy are those that are sexually dimorphic (seen primarily in one gender). Examples of sexually dimorphic behaviors include flagging in bitches, and mounting and urine marking in dogs. Incidence of sexually dimorphic behaviors decreases after gonadectomy in bitches and dogs, with the decrease in incidence not correlated with length of time the animal has shown the behavior prior to gonadectomy. Those behaviors that are not sexually dimorphic, including most forms of aggression, are not decreased in incidence by gonadectomy. One behavioral consequence of spaying that has been documented in several studies is an increase in reactivity towards humans with unfamiliar dogs and increased aggression toward family members. This may be hormonally related; there may also be a breed predisposition. There is no evidence documenting a decline in trainability of working female or male dogs after spay or castration. One study documented an increase in development of senile behaviors after gonadectomy in male dogs. However, that study had very few dogs in the intact male group and other studies, looking directly at changes in brain tissue, are not supportive of that finding.   Effects of gonadectomy on health NeoplasiaNeoplasia, or cancer, is abnormal growth of tissue. Benign tumors tend to stay in one location and cause disease by altering the single tissue involved and compressing tissue around it. Malignant tumors tend to spread in the area from which they arise and to spread to distant tissues, causing widespread disease. Virtually all tumors are more common in aged than in young animals, with average reported age at time of diagnosis of about 10 years. For the tumor types described below, exact cause-and-effect relationship between gonadectomy and development of tumors is unknown. Mammary neoplasia, or breast cancer, is a very common disorder of female dogs, with a reported incidence of 3.4%; this is most common tumor type in female dogs. Of female dogs with mammary tumors, 50.9% have malignant tumors. Risk factors for mammary neoplasia in female dogs include age, breed (Table 1), and sexually intact status. Multiple studies have documented that spaying bitches when young greatly decreases their risk of developing mammary neoplasia when aged. Compared with bitches left intact, those spayed before puberty have a 0.5% risk, those spayed after one estrous cycle have an 8.0% risk, and dogs spayed after two estrous cycles have a 26.0% risk of developing mammary neoplasia later in life. Overall, unspayed bitches have a seven times greater risk of developing mammary neoplasia than do those that are spayed. While the benefit of spaying decreases with each estrous cycle, some benefit has been demonstrated in bitches even up to 9 years of age. The exact cause-and-effect relationship between intact status and development of mammary neoplasia in female dogs has not been identified. The genetic and hormonal causes of breast cancer identified in women have not been consistently identified in female dogs despite extensive research. Prostatic cancer in dogs is uncommon, with a reported incidence of 0.2 to 0.6%. Prostatic adenocarcinoma is a highly malignant tumor that cannot be cured medically or surgically. A 2.4 to 4.3 times increase in incidence in prostatic neoplasia with castration has been demonstrated, with that information verified in multiple studies. Testicular neoplasia is a very common tumor in dogs, with a reported incidence of 0.9%. Unlike in humans, testicular tumors occur late in life in dogs, are readily diagnosed, and are rarely malignant. Ovarian and uterine tumors are very uncommon in bitches. Several tumors of non-reproductive tissues have been reported to be increased in incidence after gonadectomy. Transitional cell carcinoma, a malignant tumor of the urinary tract, was reported in two studies to occur 2 to 4 times more frequently in spayed or castrated dogs than in intact female or male dogs. Exact incidence is not reported; estimated incidence is less than 1.0%. A breed predisposition exists (Table 1). Surgical removal of transitional cell carcinoma may or may not be possible, depending on site of the primary tumor. Osteosarcoma is a low incidence (0.2%), highly malignant tumor of bone. It is reported to be more common in large breed dogs with some specific breeds predisposed (Table 1). Two studies have documented a 1.3 to 2.0 times increased incidence of osteosarcoma with gonadectomy. However, one study evaluated solely Rottweilers, a breed with a reported genetic predisposition. Treatment often includes limb amputation and radiation or chemotherapy. Hemangiosarcoma is a malignant tumor of vascular tissue, including the heart, major blood vessels, and spleen. Large breeds in general are at increased risk with some breeds specifically predisposed (Table 1). Two studies have documented increased incidence, from 2.2 to 5 times, in gonadectomized males and females compared to intact animals. Overall incidence of hemangiosarcoma is low, at 0.2%. Surgical removal is the treatment of choice, if possible. Orthopedic abnormalitiesLong bones grow from growth plates on either end. The growth plates close after exposure to estrogen and testosterone, explaining why growth in height is largely completed after puberty. In bitches and dogs, removal of the gonads before puberty slows closure of the growth plates, leading to a statistically significant but not overtly obvious increase in height. There is no evidence that after gonadectomy some growth plates will close on time and some late, however most studies have only examined long bones of the forelimb. No studies have demonstrated increased incidence in fractures or other abnormalities of the growth plates associated with age at time of spay or castration. Hip dysplasia is abnormal formation of the hip joint with associated development of arthritis. Genetic, hormonal, and environmental factors, including diet, are involved (Table 1). In the one study describing increased incidence of hip dysplasia in female or male dogs spayed or castrated before 5 months of age, it is not clear that the diagnosis of hip dysplasia was made by a veterinarian in all cases. The paired cruciate ligaments form a cross within the knee (stifle) joint. The cranial cruciate ligament (CCL) undergoes tearing or complete rupture when the stifle is stressed from the side, especially if the animal twists while bearing weight on that limb. CCL injury is very common, with reported incidence of 1.8%. Large breed dogs are generally at risk, with some breeds predisposed (Table 1). Overweight female and male dogs also may be at increased risk. It has been demonstrated that CCL injury is more common in spayed or castrated animals than in intact animals. The basis may be hormonal, as it has been demonstrated that CCL injury in humans is more common in women than in men with incidence varying with stage of the menstrual cycle. A very recent study documented change in anatomy of the stifle joint of female and male dogs with CCL injury with gonadectomy prior to 6 months of age; further research is pending. CCL injury is treated with surgery and rehabilitation; treatment is costly and recovery protracted. ObesityObesity is very common in dogs, with reported incidence of 2.8% in the general dog population; incidences of 34% of castrated male dogs and 38% of spayed female dogs were reported in one study. Multiple risk factors exist, including breed (Table 1), age, and body condition and age of the owner. A very commonly reported risk factor for development of obesity is gonadectomy. In cats, it has been demonstrated that gonadectomy causes a decrease in metabolic rate. There are no reports documenting metabolic rate in female or male dogs relative to gonadectomy. Obesity is itself a risk factor for some forms of cancer, CCL injury, diabetes mellitus, and decreased life span. Obesity is controllable with appropriate diet and exercise. Urinary incontinenceA very common form of urinary incontinence, formerly termed estrogen-responsive urinary incontinence and now more commonly called urethral sphincter mechanism incompetence, occurs in spayed female dogs. Urine leaks from the spayed female dogs when they are relaxed and so most often is seen by the owners as wet spots where the dog sleeps. Reported incidence ranges from 4.9 to 20.0%, with female dogs weighing more than 44 pounds and some specific breeds predisposed (Table 1). While multiple studies have documented correlation between gonadectomy and occurrence of this disorder, only one has demonstrated a correlation between incidence and age at gonadectomy. In that study, it was demonstrated that spaying before 3 months of age was significantly more likely to be associated with eventual occurrence of urinary incontinence in a given female dog than was spaying later. Urethral sphincter mechanism incompetence is easily controlled medically in most female dogs. PyometraPyometra is uterine infection overlying age-related change in the uterine lining. Incidence increases with age; 23 to 24% of dogs developed pyometra by 10 years of age in one Swedish study. Specific breeds are at increased risk (Table 1). This very common disorder of aged intact bitches is treated surgically. Benign prostatic hypertrophy/prostatitisBenign prostatic hypertrophy (BPH) is age-related change in prostate size. By 6 years of age, 75 to 80% of intact male dogs will have evidence of BPH; by 9 years of age, 95 to 100% of intact male dogs will have evidence of BPH. The increased size of the prostate is associated with increased blood supply. The most common clinical signs are dripping of bloody fluid from the prepuce and blood in the semen. Development of BPH predisposes the dog to prostate infection (prostatitis). Medical therapy for BPH can be used to control clinical signs but surgical therapy (castration) is curative. Diabetes mellitusOnly one study has demonstrated a possible increased incidence of diabetes mellitus in dogs associated with gonadectomy. That study did not consider the effect of obesity, a known risk factor for diabetes mellitus. HypothyroidismTwo studies have demonstrated increased incidence of hypothyroidism in female and male dogs after gonadectomy. Genetic factors also are involved (Table 1). Cause-and-effect has not been described, nor has a specific numerical factor for increased incidence been reported. Life spanSeveral studies have demonstrated that spayed and castrated female and male dogs live longer than do intact bitches or dogs. Cause-and-effect has not been described. It is possible that gonadectomized dogs are less likely to show risky behaviors or that owners who have invested in animals by presenting them for spay or castration continue to present them for consistent veterinary care. Conclusion So how do you reconcile all this information in helping make decisions for individual animals? Considerations must include evaluation of incidence of various disorders, breed predisposition, and health significance of the various disorders (Table 2 and Table 3). For female dogs, the high incidence and high percentage of malignancy of mammary neoplasia, and the significant effect of spaying on decreasing its incidence make ovariohysterectomy prior to the first heat the best recommendation for non-breeding animals. The demonstrated increased incidence of urinary incontinence in bitches spayed before 3 months of age and possible effect of CCL injury in bitches spayed before 6 months of age suggest that spaying bitches after 6 months of age but before their first heat is most beneficial. For bitches of breeds predisposed by ovariohysterectomy to highly malignant tumors and for breeding animals, spaying at a later age may be more beneficial. For male dogs, castration decreases incidence of disorders with little health significance and may increase incidence of disorders of much greater health significance. For non-breeding animals, evaluation of breed and subsequent predispositions to disorders by gonadectomy should guide when and if castration is recommended. As dog breeders, you are a source of information for people seeking a dog for companionship, to show or work as a hobby, or to grow up with their children. As veterinarians, we are one of the guardians of safety and good health for all animals in our society. It behooves all of us to thoughtfully consider why we recommend spay or castration for dogs, to ensure we are not putting our own convenience above their good health. For every individual bitch or dog, careful consideration of their breed, age, lifestyle, and suitability as a breeding animal must be a part of the decision as to when or if they should undergo gonadectomy. Tables Table 1. Breeds predisposed to various disorders CONDITIONBREEDS PREDISPOSEDMammary neoplasiaBoxer, Brittany, Cocker Spaniel, Dachshund, English Setter, English Springer Spaniel, German Shepherd Dog, Maltese, Miniature Poodle, Pointer, Toy Poodle, Yorkshire TerrierTransitional cell carcinomaAiredale Terrier, Beagle, Collie, Scottish Terrier, Shetland Sheepdog, West Highland White Terrier, and Wire Fox TerrierOsteosarcomaDoberman Pinscher, Great Dane, Irish Setter, Irish Wolfhound, Rottweiler, Saint BernardHemangiosarcomaBoxer, English Setter, German Shepherd Dog, Golden Retriever, Great Dane, Labrador Retriever, Pointer, Poodle, Siberian HuskyHip dysplasiaChesapeake Bay Retriever, English Setter, German Shepherd Dog, Golden Retriever, Labrador Retriever, Samoyed, Saint BernardCranial cruciate ligament injuryAkita, American Staffordshire Terrier, Chesapeake Bay Retriever, German Shepherd Dog, Golden Retriever, Labrador Retriever, Mastiff, Neapolitan Mastiff, Newfoundland, Poodle, Rottweiler, Saint BernardObesityBeagle, Cairn Terrier, Cavalier King Charles Spaniel, Cocker Spaniel, Dachshund, Labrador RetrieverUrinary incontinenceBoxer, Doberman Pinscher, Giant Schnauzer, Irish Setter, Old English Sheepdog, Rottweiler, Springer Spaniel, WeimeranerPyometraBernese Mountain Dog, Cavalier King Charles Spaniel, Chow Chow, Collie, English Cocker Spaniel, Golden Retriever, Rottweiler, Saint BernardDiabetes mellitusMiniature Poodle, Miniature Schnauzer, Pug, Samoyed, Toy PoodleHypothyroidismAiredale Terrier, Cocker Spaniel, Dachshund, Doberman Pinscher, Golden Retriever, Irish Setter, Miniature Schnauzer, Pomeranian, Shetland Sheepdog  Table 2. Conditions associated with ovariohysterectomy (spay) CONDITIONINCIDENCEHEALTH SIGNIFICANCEINCREASED OR DECREASED WITH GONADECTOMYMammary neoplasiaHighHighDecreasedOvarian and uterine neoplasiaLowLowDecreasedPyometraHighHighDecreasedTransitional cell carcinomaLowHighIncreasedOsteosarcomaLowHighIncreasedHemangiosarcomaLowHighIncreasedCCL injuryHighHighIncreasedObesityHighModerateIncreasedUrinary incontinenceHighLowIncreasedDiabetes mellitusHighLowIncreasedHypothyroidismHighLowIncreased  Table 3. Conditions associated with castration CONDITIONINCIDENCEHEALTH SIGNIFICANCEINCREASED OR DECREASED WITH GONADECTOMYTesticular neoplasiaHighLowDecreasedBenign prostatic hypertrophyHighLowDecreasedProstatic neoplasiaLowHighIncreasedTransitional cell carcinomaLowHighIncreasedOsteosarcomaLowHighIncreasedHemangiosarcomaLowHighIncreasedCCL injuryHighHighIncreasedObesityHighModerateIncreasedDiabetes mellitusHighLowIncreasedHypothyroidismHighLowIncreasedUsed with permission from the AKC Canine Health Foundation, a nonprofit organization dedicated to advancing the health of all dogs and their owners by funding sound scientific research and supporting the dissemination of health information to prevent, treat, and cure canine disease.  Image: Jeff / via Flickr"}]