[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Safe Are Secondhand Used Pet Supplies?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cute-8-weeks-old-pied-french-bulldog-puppy-resting-in-her-bed-picture-id949234550.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cute-8-weeks-old-pied-french-bulldog-puppy-resting-in-her-bed-picture-id949234550.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, Crates and beds", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-safe-are-secondhand-used-pet-supplies"}, "datePublished": "October 11, 2018", "dateModified": "August 30, 2022", "description": "Do you love finding bargains on used pet supplies? Find out from the experts whether or not secondhand pet supplies are safe for your pet.", "articleBody": "Image via iStock.com/gollykim By Nancy Dunham It’s not unreasonable to want to save some money by shopping for used pet supplies, but it might not always be wise to buy secondhand dog houses, cat trees, pet apparel and other items. Almost anyone who visits a yard sale will find all types of used gear for dogs, cats and other pets. And of course, there are websites where you can buy and sell secondhand cat trees, dog houses and other pet supplies. Some veterinarians think it’s fine to buy such supplies, while others have an opposing viewpoint. The vets interviewed for this piece agree that it’s vital to take some precautions if you opt for secondhand pet goods. “I’m a vet, so I’m well versed in the subjects of microbiology, parasitology and transmission of disease. Excuse me if I appear to be a germophobe, but I would tend to err on the side of caution,” says Dr. Jeff Levy, DVM, of House Call Vet NYC, New York. “I would prefer to start with items that are as hygienic as possible. We have to be careful about introducing fleas, ticks, mites and pet illnesses and diseases.” Does that mean you shouldn’t ever use secondhand pet supplies and projects? No, but some precautions are necessary to keep your pet safe, and some items should just be avoided. Consider these cautions from veterinarians: Thoroughly inspect seemingly solid objects. Before you buy a small pet carrier, dog crates or other items, make sure that the item is in good shape. “I think as long as the integrity of dog crates is checked, all screws or securing devices seem stable, and there are not any obvious cracks or other damage to the crate, they should be fine to purchase secondhand,” says Dr. Taylor Truitt, DVM, founder and CEO of The Vet Set, New York, adding that the items must be thoroughly cleaned and disinfected before use.  “I would advise purchasing crates used for plane travel to be purchased new,” she says. Crates and carriers take extra beatings during travel, so new is preferred. And, of course, make sure your carrier is approved for boarding. Thoroughly clean items before use. If you find a secondhand dog crate or similar solid object (like hard plastic pet carriers) that is in good condition, take Dr. Truitt’s advice and disinfect it before your pet uses it. Start by wiping it down thoroughly with a detergent to clean organic material and debris from the surface, says Dr. Justin Shmalberg, DVM, whose affiliations include clinical associate professor at the University of Florida. “The owner should then … disinfect the item for pathogens. If the object can be left outside, placing it in direct sunlight can also reduce the levels of some pathogens,” he says.   Make sure that the cleaning agents you use are safe for pets. Nature’s Miracle Oxy Pet Stain &amp; Odor Remover and Weiman Carpet Cleaner are just two of the many available pet-safe products. Look twice at used food dishes and water bowls. “Bowls, especially metal and ceramic, will generally be fine [if they are cleaned] with detergent, but bleach or another disinfectant is not a bad idea if used recently,” says Dr. Shmalberg. Of course, you need to thoroughly rinse the items to ensure no residue from the detergent or other cleaning agents remain. It’s likely best to avoid used plastic dishes and bowls as a rule. These can collect debris that can seep into the food and water. Take extra care with clothes. Sure, dogs and cats look cute in little costumes and collars. Still, Dr. Truitt advises owners to first wash them in hot water and detergent before trying them on your pet. You want to make sure these items are free of fleas, ticks and other parasites. Pay attention to items with porous materials, such as carpet or fabric. “I’d first apply an odor test to the item and make sure it isn’t obviously soiled (remember some cats and dogs have a habit of marking objects, which may be why something is by the side of the road!), says Dr. Shmalberg. “If it passes the odor test and has a solid surface without a lot of nooks and crannies, then it’s probably ok to pick up the item.” Don’t forget, though, that viruses, such as those that cause upper respiratory tract infections, can persist in their environment for as long as 30 days without cleaning or disinfection, he added. Parasites favor carpet and fabric because they are tough to detect in those places. “Used objects that have carpet or recessed areas can be a haven for fleas, and that’s not something fun to bring into your house or yard,” says Dr. Shmalberg. “Long story short, if the item isn’t coveted for its unique style, it might not be worth the effort.” Another reason to avoid used cat trees and similar items is that they may cause adverse reactions in your cats and other pets. “I wouldn&#039;t use cat trees secondhand as they&#039;ll have the odor of the other cat, and the cat now using it could start urine marking it,” Dr. Truitt says. “No one knows how common it is for pet parents to bring in something that might have virus, bacteria or fleas, but it certainly does occur,” says Dr. Shmalberg.  “It’s better to be safe.” When in doubt, don’t buy or use the item. If your pet can get an illness or disease from such an item, that’s clearly no bargain."}]