[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Top Three Cat-Like Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_86667322-slide1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_86667322-slide1.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/care/top-three-cat-like-dog-breeds"}, "datePublished": "November 1, 2011", "dateModified": "September 7, 2022", "description": "Maybe you really want a cat but are simply too allergic to get one or you are just plain curious about dogs that behave like cats. Whatever your reasoning for perusing this list, here are the top three cat-like dog breeds.", "articleBody": "Maybe you really want a cat but are simply too allergic to get one or you are just plain curious about dogs that behave like cats. Whatever your reasoning for perusing this list, here are the top three cat-like dog breeds. This doggy came about from crossing a Whippet with a cross-breed terrier, and is, in fact, a great ratter. Like most cats, the &quot;Rat Terrier&quot; is not a good listener and must be taught from puppyhood that they are not rulers of the world or, at the very least, their domain. Also, remain vigilant. The Manchester is a very clever escape artist! Do not confuse him for Benji, the famous Silky Terrier mix. The Basenji is a hunting dog from Central Africa. Like cats, this dog lacks an odor and is a fairly quiet dog. It also likes to climb and is known to clean itself just like cats! The Italian Greyhound is also meant to be an odorless dog and can even be trained to use a litter box! This dog enjoys sunbathing like kitties, and really hates getting wet. And, just like cats, the Italian Greyhound loves being up on elevated surfaces, hates obeying commands, and can become the ruler of the roost if you&#039;re not careful."}]