[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Are You Ready to Care for Foster Animals?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS_FosterAnimals_456753478.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS_FosterAnimals_456753478.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Adoption, Shelters and rescue", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/are-you-ready-care-foster-animals"}, "datePublished": "May 14, 2018", "dateModified": "August 30, 2022", "description": "Are you thinking about fostering a pet? Check out this article to find out what fostering entails.", "articleBody": "By Nancy Dunham It’s difficult to imagine a downside to fostering dogs, cats or any other animals. Just looking at the many social media photos of foster pet parents cuddling the dogs, cats and other foster animals entrusted to their care is enough to prompt anyone to want to volunteer now and ask questions later. Even though you want to help, that’s one of the worst plans for foster animals, not to mention for you and your family. Fostering a pet without considering how you’ll meet the animal’s needs may disrupt your life and sabotage adoption efforts. Think you have what it takes to be a foster parent? Consider these points from animal experts before you commit to taking care of foster pets. Understand Where Foster Pets Are Coming From  “It’s a good idea to think of a foster pet as coming from a war zone,” says Russell Hartstein, certified pet behaviorist and CEO of FunPawCare in Los Angeles. “They generally haven’t had the love and care they needed; they often didn’t have exercise or proper food. They are under incredible emotional strains.” Such psychological scarring can cause foster animals to adopt behaviors that don’t reveal their true temperaments.  “When a dog or cat is in a shelter, their true personalities do not shine through,” says Nicole Ellis, author and certified professional dog trainer in Los Angeles. “The animals have likely been moved around a lot, and that is scary for them. They don&#039;t know what to expect, and it takes patience and work to allow their energy, confidence and true personalities to emerge.” In the best-case scenario, foster pets morph into loving, playful companions. There are examples, though, of pets that exhibit aggression and other negative behaviors when they aren’t properly fostered.  Know the Time Commitment Involved “It’s very difficult to assess a pet’s personality when you first meet it,” says Dr. Sabrina Castro, DVM at Vetted PetCare in Los Angeles. “That’s why it’s important to gather as much information as possible and observe it as long as possible in various environments. One key to proper fostering is trying to understand the pet’s psyche and allowing foster pets to recover at their own pace. “It will often take several weeks for the animal to decompress and become accustomed to the atmosphere of the foster home,” says Hartstein. His tactic with foster animals is to let them have plenty of space, allowing them to decide when to approach him. “Once they start to do that, they have begun to recover, and we can form a bond.” Before fostering an animal, it’s imperative to consider everyone else in the home— both people and resident pets. “Fostering takes a much larger time commitment than many people realize,” said Hartstein. “Once [the pet] is in your home, it’s vital everyone is on board and prepared to get along.” Consider Health Issues and Ask for Health Records Ask the rescue or shelter for the animal’s health records. Are the foster animal’s vaccinations up to date? Are there any illnesses or disabilities? Was the animal spayed or neutered? “Oftentimes even the best shelter or rescue group will have pets with [undiagnosed illnesses],” said Hartstein. That can prove dangerous to those with immunosuppressed systems, such as cancer patients. Even such maladies as kennel cough, which might take time to develop once the pet is in a home, can be dangerous for other pets. Potential foster parents should insist on vital tests such as heartworm screenings for dogs and FeLV/FIV testing for cats. “It’s very important to understand the health status, especially when you have other pets,” Castro said. “If you have a healthy cat, it’s not suitable to have an FIV-positive [foster cat]. But if you already have an FIV-positive cat, you might provide the perfect foster home.” You also need to ask if you should take the pet to a specific veterinarian for care. Who pays for the care? What should you do if the pet has a health emergency? Ask these questions before you agree to foster. Preparing Yourself and Your Home Prepare for the expenses. It can cost $2,000 or more each year to take care of a dog, cat or other pet, Hartstein estimates. Even if there are no health issues, pets require pet food, litter, toys, shampoo, leashes and other items. Ask the shelter or rescue which costs are covered and which they might pay for or reimburse you for. Ensure that your home is appropriate. Do you have enough room for a pet? Most foster pets should have a room to themselves until they acclimate to a home. Do you rent your home? If so, your landlord may forbid foster animals due to insurance and liability issues. Check with your landlord before you agree. Determine your role in adoption. Are you required to take the pet to adoption events on certain days or at certain times? How often will potential adoptees come to your home to see the pet? Do you need to transport the pet to potential adoptees’ homes? What happens if the pet is deemed unadoptable? Consider various foster roles. Sometimes foster parents are needed for pets that are already adopted and are waiting for their new pet parents to retrieve them. Other times, foster parents are needed for a year or more. Ask about different options and opportunities. Know the possible adoption outcomes. Are you allowed to adopt the pet? Some rescues or shelters discourage adoption because they don’t want to lose a foster parent. And sometimes, foster parents find out that the pet they have is unadoptable. Understand all possible scenarios. Don’t be afraid to say no. If you don’t think a certain pet—or any pet—is the right match for your home, it’s important to walk away. Doing otherwise can turn into a negative experience for you and the animal. Pet rescues and shelters everywhere welcome foster pet parents who offer stress-free environments for foster pets awaiting adoption. Potential foster parents can start the process by educating themselves on the needs of foster pets and assessing how or if they can fulfill them. Image via Shutterstock"}]