[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Veterinary Specialists: Who Are They, Really", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4014616895_9d3dc8ffa8.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4014616895_9d3dc8ffa8.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_veterinary_specialists_who_are_they_really"}, "datePublished": "March 9, 2011", "dateModified": "August 30, 2022", "description": "By T. J. Dunn, Jr., DVMTuesday, September 15, 2009 Veterinary Specialists are an important asset in total pet health care. Thirty-five years ago there were 389 veterinarians who could ethically call themselves a specialist. Divided among four specialty boards, these veterinarians, through extensive training and studying, passed rigorous certification requirements that led to their being accepted into an elite group of dedicated veterinarians.", "articleBody": "By T. J. Dunn, Jr., DVMTuesday, September 15, 2009 Veterinary Specialists are an important asset in total pet health care. Thirty-five years ago there were 389 veterinarians who could ethically call themselves a specialist. Divided among four specialty boards, these veterinarians, through extensive training and studying, passed rigorous certification requirements that led to their being accepted into an elite group of dedicated veterinarians. Today, according to the American Board of Veterinary Specialties, there are 20 specialty boards boasting 6,921 certified veterinary specialists. That speaks volumes about the veterinary profession’s drive to excel, to practice the highest standard of care and to find new ways to treat animal diseases. (According to the American Veterinary Medical Association there are over 65,000 licensed veterinarians in the U.S. today.) When a general practitioner such as I face an especially challenging case and has done what is considered to be a full case workup consisting of a thorough patient history and examination, radiographs, and blood and urine tests and still has not been able to reach a definitive diagnosis … it’s time to call a specialist. Obscure disorders such as Secondary Renal Hyperparathyroidism, Discoid Lupus Erythematosis, Fibrocartilaginous Ischemic Necrosis, or Lymphocytic-plasmacytic Enteritis may have elusive diagnostic signs. It may take specialized diagnostic techniques and instrumentation, in addition to the routine workup, in order to achieve an accurate diagnosis. One thing needs to be made clear to dog owners, though. And that is what the term “specialist” really means. Whenever you hear the phrase that a doctor &quot;kind of specializes&quot; in skin problems, or &quot;specializes&quot; in purebred show dogs, or is a &quot;specialist in correcting back problems,&quot; be cautious. In fact, no matter how famous or adept or focused on a certain topic or procedure he/she may be, it is unethical for any veterinarian to refer to themselves as a &quot;specialist&quot; without actually having been accepted into a specialty board via the certification process. In other words, only a board certified veterinarian can properly be called a specialist. And certification is no easy matter! For example, to become a Board Certified Veterinary Dermatologist a licensed veterinarian needs to successfully complete the following protocol: A minimum of one year of internship, either in private practice or at a University Veterinary Teaching Hospital, perfecting skills in small animal surgery and medicine.Two to three years of residency in Dermatology. Most residencies are conducted at university Veterinary Teaching Hospitals. Skin diseases of all species of animals are studied, including dogs, cats, horses, farm animals, small exotic mammals, zoo animals, birds, reptiles, and even some human diseases.To become a &quot;Diplomate of the American College of Veterinary Dermatology&quot; (i.e., board certified), the doctor must: See a specified number and variety of cases during his/her residency.Perform a research project in an area of skin disease that advances knowledge in the field.Have the results of the research published in a refereed medical or veterinary medical journal.Pass a rigorous series of exams in order to prove competency in all areas of Veterinary Dermatology.And the rigorous qualification process in no easier for such specialty boards as Ophthalmology, Surgery, Radiology, Pathology, Nutrition, Cardiology or any of the twenty specialty boards. If at any time you have your dog examined by a practitioner who purportedly is a specialist, make sure that you see the doctor’s certificate of acceptance into the American College of Veterinary (Specialty). A general practitioner may state that he or she has a &quot;special interest&quot; in treating certain disorders or has a &quot;practice limited to treating&quot; specific disorders or species. But without an official certificate of acceptance into a certified specialty board, the veterinarian is not a &quot;specialist.&quot; The growth of the specialty boards and numbers of veterinarians willing and able to qualify for certification as a specialist is driven by animal owners willing and expecting to obtain the very highest degree of diagnostic and therapeutic expertise. And with the rapidly advancing state-of-the-art of modern veterinary practice, animal owners demand highly skilled, experienced and knowledgeable veterinarians who are equipped with the techniques and instrumentation needed to make an accurate diagnosis. Appropriate therapy for any disease or disorder absolutely requires an accurate diagnosis first! Fortunately, for dog lovers and the general veterinary practitioner, specialists are today much more accessible than they were a few years ago.   How Specialists Assist the General Practitioner A wonderful example of how specialists contribute to the welfare of our canine companions involves a seven-year-old Labrador Retriever named Spanky. He was referred to the Veterinary Specialists of South Florida (VSSF) in Cooper City, Florida, when he began having trouble supporting weight on his back legs. Board Certified Specialist in Neurology, James Cook, DVM, decided after a thorough neurological exam that Spanky should have special contrast radiographs taken of his spinal canal. The results showed a mass was present in a lumbar disc space! Subsequently, a Veterinary Specialist in Pathology identified the surgically removed tumor as an unusual Plasmacytoma. Dr. Cook then referred Spanky to another specialist at the VSSF group, Oncology (cancer) Specialist Stephanie Correa, DVM. She performed a bone marrow exam, chest radiographs, and plasma electrophoresis; and much to Spanky’s relief no evidence of metastasis was detected. However, since these types of tumors tend to reoccur at the original site, Spanky was sent to another specialist at the VSSF group, Ronald Burk, DVM, a Specialist in Veterinary Radiation Oncology. Burke began radiation therapy consisting of a series of treatments over five weeks. Thanks to the specialized skills and advanced treatment options available today, such as at the VSSF group, Spanky is alive and well seven months after his surgery. My own dog needed help from a specialist, too! A tiny Poodle we call Cissy had an unusual, progressively worsening case of head pain; she lacked interest in her environment and became withdrawn and disoriented. After my own rigorous workup including radiographs, blood, urine, and neurological tests I was still unsure of what was causing her very worrisome signs. So off we went to a Specialist in Veterinary Radiology who was equipped with a CT Scanner and a full complement of computer interfaced diagnostic instrumentation. After assisting in a few hours of state-of-the-art veterinary medical diagnostic imaging we had our diagnosis. Cissy had abnormally formed bones near the base of her skull that was affecting the cerebrospinal fluid circulation and was causing a buildup of pressure deep within her brain. The specialist suggested a plan of therapy and within days we had our little princess back to normal. Without the assistance of that Specialist in Veterinary Radiology no amount of effort on my part, or reliance on 32 years of experience dealing with hundreds of thousands of patients, would have enabled me to make the proper diagnosis. I encourage every dog owner to take control of their dog’s health care by discussing fully with your veterinarian any questions you have about your dog’s health; you should expect, and deserve to get, understandable responses. Always be ready to seek the advice of a specialist if it seems that your veterinarian has reached an impasse in establishing a diagnosis for your dog’s condition. Each day I practice veterinary medicine I feel comforted by the thought that if I am presented with another Cissy or Spanky, there are veterinary specialists able and willing to back me up and take on challenging and difficult cases. And all I have to do is make the call. Image: Tony Alter / via Flickr"}]