[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Problems Common to Purebred Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_purebred_dogs_complications"}, "datePublished": "November 4, 2008", "dateModified": "August 30, 2022", "description": "Nothing is cuter in this world than a puppy, especially one from impeccable lineage. But as many a princess has learned throughout history, keeping it in the family does not always end happily.", "articleBody": "Nothing is cuter in this world than a puppy, especially one from impeccable lineage. But as many a princess has learned throughout history, keeping it in the family does not always end happily.   Purebred dogs frequently suffer from the effects of inbreeding; and while purebred dogs and puppies are much-coveted for their beauty, there are many problems that come with a pure lineage. The main problem with purebreds stems from the simple fact that to create a purebred puppy you need two dogs from the exact same gene pool. This gene pool is already limited, but many breeders will use dogs from the same family gene pool to create more dogs (inbreeding). Dog clubs often require that their dogs be bred within the same club, which again ends up severely limiting the gene pool variety. As many of these gene pools are limited or closed, the risk of genetic defects rises significantly with each successive coupling. Defects include a higher risk of cancer and tumors; eye and heart disease; joint and bone disorders; skin, immune system and neurological diseases; and even epilepsy. There is no need to panic, though. You just need to be aware of the risk of defects in your prospective new purebred puppy, a risk that is much higher than in a mix-breed puppy. While quality breeders do test prospective parent dogs for defective genes -- and avoid breeding them if there are defects -- the broad problem of defects continues to grow as current breeding practices narrow the gene pool ever further. If you insist on a purebred puppy, then by all means, you should have one. But if you cannot afford the potentially heavy veterinary bills that might come with your new puppy, perhaps it’s time to think about getting a mixed breed from your local dog rescue. Whatever you choose, happy puppy times. Image: Gianmaria / via Flickr"}]