[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Risks of Treating Your Pet at Home", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-treating-home.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-treating-home.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, Condition, General Care, Over the counter medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/8-risks-treating-your-pet-home"}, "datePublished": "January 8, 2018", "dateModified": "August 30, 2022", "description": "When treating your dog or cat at home without consulting a veterinarian, you could be putting your beloved pet’s health in jeopardy. Consider these eight risks before treating your pet at home.", "articleBody": "By Paula Fitzsimmons With an abundance of pet care advice flowing freely online, it’s tempting to enter a few search terms, read the first article that seems legit, then proceed to treat your pet. Convenient, yes. But in doing so, you could be putting your beloved pet’s health in jeopardy. “The internet is a powerful tool, and when you find appropriate websites, it can be the source of very good information,” says Dr. Anne Stoneham, a veterinarian with University Veterinary Specialists in McMurray, Pennsylvania. “However, there is also a wealth of misinformation on Google—or Dr. Google, as many of us in the vet biz call it—and from your non-veterinarian friend.” If you’d like to treat a minor ailment at home, do so only after consulting with your vet. In contrast to the few minutes you spent reading that article, your vet has gone through undergraduate education, four years of rigorous vet school training, and perhaps an internship and residency as well. “You should trust that they do have a great deal of knowledge and have your pet’s best interest at heart,” says Stoneham, who is board-certified in veterinary emergency and critical care. “If you do not trust your veterinarian for whatever reason, get a second opinion from another veterinarian, not from Aunt Sylvie, who raised Otterhounds for 15 years or had a cat once.” Consider these eight risks before treating your pet at home. 1. Giving Over-the-Counter Drugs Not Intended for Companion Animals Some human medications work for pets, but unless you’ve talked to your vet first, you’re inviting trouble. “A person and a dog have different physiologies, a person and a cat have different physiologies, and all that needs to be taken into account,” says Dr. John Gicking, a veterinarian with BluePearl Veterinary Specialists in Tampa, Florida. Sometimes the same medicine can benefit both pets and people, he says, “but there are a lot of differences.” That’s why a vet should always be consulted. Take over-the-counter pain relievers, for example. Pet parents might be tempted to reach for their own old standbys like ibuprofen or acetaminophen, but Stoneham says that in dogs “their use is rarely recommended because side effects (kidney failure, liver failure, stomach ulcers) are seen so frequently.” And Stoneham warns, “Both of these medications are very toxic for cats—even low doses are life-threatening.” Other over-the-counter medications can be just as dangerous. Gicking, who is board-certified in veterinary emergency and critical care, has treated dogs with severe gastrointestinal problems, including perforations in the stomach, and kidney failure, after their owners gave them naproxen (Aleve). Aspirin falls in the same category. “We see so many owners who give pets aspirin. It can cause gastric or intestinal ulceration. Just don&#039;t do it,” says Dr. Susan Jeffrey, a veterinarian with Truesdell Animal Hospital in Madison, Wisconsin. “Instead, talk to your vet about pain control designed for pets.” Even if a drug is deemed safe for animals, you also need to consider additives, which Jeffrey says can be toxic to animals. “An example of this is the additive xylitol. It&#039;s used as a sweetener, but can cause low blood sugar levels and liver toxicity in dogs.” 2. Giving the Wrong Dosage of Over-the-Counter Drugs Even a product considered safe for animals can do damage if it’s misdosed. Dosage requirements vary greatly (by species and even between individuals of the same species), says Dr. Nicholle Jenkins, an emergency veterinarian with University Veterinary Specialists. “Most humans, with the exception of children, are dosed the same. This is not the case with pets,” she explains. “For example, a 3-pound Chihuahua will not use the same dose as a 100-pound Great Dane. When these medications are incorrectly dosed, they are either useless or harmful.” Take Benadryl, for instance. “The dosing is different for pets than it is for people,” says Jeffrey, whose professional interests include preventative care. “Although it&#039;s fairly safe, it can cause sedation. If it is given with other medications that have sedative effects, then it may make a pet too sleepy, which could be dangerous.” 3. Giving a Product that Interferes with Prescription Drugs Over-the-counter products can also adversely interact with vet-prescribed medications, says Jenkins, who specializes in emergency veterinary medicine. Aspirin is one of these. “If an owner starts using this before bringing their pet in to see the veterinarian, it limits which medications can be used.” When given in combination with a prescribed nonsteroidal anti-inflammatory, aspirin increases the risk of stomach and intestinal ulceration, she says. For these reasons, she stresses the importance of telling your vet about any over-the-counter drugs and supplements your pets are taking. 4. Treating the Wrong Ailment That article or friend you consulted may mention symptoms that seem similar to your pet’s, but only vets are trained to detect subtle differences.  “For example, there have been many instances of pet owners administering medications for musculoskeletal pain when in reality their pets are suffering from gastrointestinal pain,” Jenkins says. “Those medications may make the original problem worse. This may also delay a pet from getting proper treatment and being on the road to recovery.” Although it’s a secondary consideration, treating the wrong ailment can lead to financial losses. “Sicker pets are probably going to require hospitalization instead of care at home,” Stoneham says. “They will likely need a longer time in the hospital than they would if they were not so sick, and all of this generally means a higher cost of care.” 5. Giving Medications Prescribed for Other Pets Giving a pet a drug prescribed for another pet—even for the same breed—can result in several complications, Stoneham says. “For example, metoclopramide may be prescribed for a pet that is vomiting once the doctor has ruled out the possibility of an intestinal blockage,” she says. “But if you use metoclopramide on your pet at home who does have an intestinal blockage, it could lead to intestinal rupture (and a much, much sicker patient).” It’s also a bad idea to give products intended for one species to another. “Some over-the-counter flea medications that are safe for dogs are highly toxic to cats and that mistake is easy to make,” Gicking explains. “People will buy a big dog’s dose and they’ll split it among multiple cats, causing a big problem.” 6. Using Natural Products Incorrectly Natural does not necessarily mean safe. Herbal remedies, homeopathy, essential oils, and other natural products are being used more frequently in veterinary medicine, says Stoneham. She says most medications have been derived from something natural—like atropine from the belladonna plant and digoxin from the foxglove plant—but have been processed to a more pure product. Stoneham recalls how, about 15 years ago, dogs started presenting with severely high blood pressure and tremors. It turns out they had gotten into their owner’s bottle of herbal weight loss pills. “It contained ephedrine, a stimulant that is very toxic for dogs,” she says.  Another consideration is that these products are often not regulated, and may not contain the ingredients specified on the label, Jeffrey says. “Also, many of the homeopathic medications haven&#039;t been evaluated in conjunction with other medications, so the side effects of the medications combined are unknown. Just because it might be good for a human, doesn&#039;t mean it is good for a pet.” 7. Accidentally Ingesting Natural Oils While essential oils are often used to treat skin irritations or as a flea and tick repellant, animals can accidentally ingest these oils, says Stoneham. “Because dogs and cats groom themselves and each other, any animal in the home is at risk, not just the ones who are treated,” she says. “Some essential oils can be absorbed through the skin.” For example, oil of wintergreen is not only absorbed through the skin but is metabolized to aspirin, which can be toxic to both cats and dogs, Stoneham warns. Improper dilutions of essential oils can be toxic for pets, which is why it’s important to consult with a veterinarian first. According to Stoneham, dogs treated with pennyroyal oil have ended up in liver failure, and animals treated with tea tree oil and citrus oil can develop neurologic problems that can manifest as depression, unsteadiness, tremors, and coma. 8. Waiting Too Long to See a Vet If your cat or dog is sick, waiting to see a vet is a bad idea. “If, for example, a pet has an intestinal foreign body and it is stuck, it could result in perforation of the intestine,” Jeffrey says. “This requires emergency surgery and can even kill a pet.” If you think your pet has swallowed something other than food, it is very important to call the veterinarian, she says. You should also call your vet if your pet won’t eat. “Cats who don&#039;t eat for a few days can develop a life-threatening condition called hepatic lipidosis (fatty liver),” Jeffrey says. “Taking the cat to the vet at the onset of a poor appetite can save a kitty&#039;s life.” Another example is vomiting in cats. “Many owners think vomiting is a normal occurrence for a cat when it is not,” Jeffrey says. “Cats should not vomit more than once every few months.” Cats who vomit more frequently than this may have conditions such as chronic renal disease, inflammatory bowel disease, hyperthyroidism, or even lymphoma. “In addition, kitties who have lost a lot of weight over a period of time are not ‘just getting old.’ Many of these kitties can have the same diseases as noted above.” When in doubt about your pet’s health, call your veterinarian, advises Jenkins. “Most veterinary clinics would prefer for a pet owner to call and ask questions instead of administering a medication or supplement without direction.”"}]