[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Care for Your Dog&#039;s Cracked and Dry Paws", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_396256162.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_396256162.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cold weather, Winter, Skin health, Foot health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-care-your-dogs-cracked-and-dry-paws"}, "datePublished": "November 3, 2016", "dateModified": "August 30, 2022", "description": "When we head out for a hike or a run with our dog we put on our most supportive pair of athletic shoes. But our dogs are equipped with their own built-in sneakers. Their paw pads provide support and traction as well as shock absorption for their bones, tendons and ligaments.", "articleBody": "By Katherine Tolford When we head out for a hike or a run with our dog we put on our most supportive pair of athletic shoes. But our dogs are equipped with their own built-in sneakers. Their paw pads provide support and traction as well as shock absorption for their bones, tendons and ligaments. But Dr. Donna Raditic, a veterinarian who specializes in nutrition and integrative medicine, says that a dog’s paw pads can also be an important indication of your dog’s overall health. “The cells in a dog’s paw pads have a high turnover rate. They require a lot of nutrition and a lot of blood supply. If something isn’t perfect in the body it can show up there first. But we tend not to think that way. It can take something drastic before we notice there’s something wrong with our dog’s health.” Injuries If your dog is limping or he is favoring one foot over the other it may be easy to spot an injury such as a cut or puncture that may have occurred from stepping on a thorn or a sharp object. Another common paw pad injury develops when dogs exercise for an unusually long period of time or on rough, sharp or hot surfaces. You may notice loose skin (like a blister) on the bottom of your dog’s paws or even a raw ulcer. On rare occasions dogs may develop wounds like these even without an abnormal amount of activity because of split paw pad disease, a condition with an unknown cause. It’s important to get your dog to the vet right away but if you can’t, Raditic recommends washing the wound by squeezing out a clean cloth that’s been soaked in warm water and laying it on the affected surface. The warmth and moisture takes off surface debris and draws blood flow down to the injured tissues to help prevent infection. Let the paw air out and then protect the wound by covering it with a sock and securing it with sturdy tape. Be sure not to apply tape too tightly to avoid cutting off circulation. Schedule a visit with your vet as soon as possible. Healthy dogs should be able to grow new cells easily. But because paw pads are made up of tough keratinized epithelium the healing process can take up to three weeks. Liver issues Although Raditic says the pain subsides pretty quickly with proper healing it’s still important to keep track of your dog’s progress. “If it takes longer than three weeks, it’s a chronic problem.” She cites one of her clients who attributed her high energy Labrador’s daily routine of running multiple laps around the pool as the reason for his worn down and bleeding pads. But Raditic was suspicious because paw pads are typically resistant to injury when a dog is used to the activity. “They’re durable and rugged. A healthy dog should be able to hike and run around without splitting or cracking his paw pads. It’s rare for most dogs other than working dogs or hunting dogs.” After running tests on the Lab she discovered he had liver disease, which can be caused by toxins, medications, cancer, bacteria, viruses or autoimmune and degenerative issues. Liver disease may manifest in the paw pads as non-healing lesions that consist of chronic infections, crusting, thickening, erosions, ulcerations as well as blisters. While there’s no definitive reason for a dog’s pads to be a symptom of liver disease Raditic says it most likely has to do with the significant role the liver plays in digestion, nutrient absorption and metabolism. “Paw pads really need good nutrition to keep replacing dead cells with new healthy cells. If nutrient metabolism (i.e. iron, copper, zinc, vitamins A and D, etc.)is not normal due to a diseased liver, then skin/paw cells will not make enough new cells and/or the new cells will not be healthy and be a normal surface barrier.” Depending on the cause, treatment for liver disease may include surgery, corticosteroids, antibiotics, special diets, nutritional supplements and more.   Allergies Allergies are a common cause of chronically irritated feet in dogs. Allergies to pollen, mold, mites, ingredients in food, etc. can make a dog’s feet very itchy. In response, dogs lick and chew and the skin becomes red, even itchier, and oftentimes infected. Treatment may involve avoiding potential allergens (if possible) and/or medications or immunotherapy that decrease the allergic response. Endocrine issues Dogs who suffer from endocrine issues have a hormonal imbalance, which affects the regulation of body functions including normal skin and hair production. If your vet suspects that your dog’s chronic paw pad lesions or infections stem from endocrine issues she will run a panel of tests.  The most common canine endocrine issues that can affect a dog’s paws are Cushing’s disease and hypothyroidism. Cushing’s disease usually occurs in middle age to older dogs. Symptoms may include thinning of the skin, which can become easily damaged and slow to heal as well as hair loss, chronic infections, panting, a pot-bellied appearance and excessive appetite thirst, and urination. Treatment may include surgery or medications such as lysodren or trilostane In hypothyroidism a dog produces very low levels of thyroid hormone. Symptoms may include weight gain, lethargy, an unhealthy coat and recurrent infections. Hypothyroidism can be managed with life-long thyroid hormone supplementation. Autoimmune issues If your dog is excessively licking his paws and experiencing swollen or cracked, reoccurring lesions or blisters that spread to more than one paw it could be an autoimmune disease. Dogs, like humans, have an immune system that’s responsible for fighting off foreign cells within their body. With autoimmune disease the immune cells turn on the healthy normal cells and try to destroy them. While autoimmune issues are rarely curable they can be kept under control with corticosteroids or other immunosuppressive medications. Secondary bacterial infections may be treated with antibiotics and medicated baths.  Although it may seem like a simple thing, regular examination of your dog’s paw pads can be a revealing and effective element in maintaining your dog’s health. Raditic encourages dog owners to pay attention to even small changes in their dog’s health. She recommends that owners make a point of looking over their dog’s feet when they’re healthy so they will know the difference if there’s a change. “It’s like us looking at the bottom of our shoes. You’ll notice that they probably don’t wear the same because you may not be bearing your weight the same on both feet. That can have an effect on how your hips and joints are supported which can lead to greater problems down the road. The sooner we catch things like this the better chance we can prevent something more serious.”"}]