[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "At What Age Do Dogs Stop Growing?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Miniature-schnauzer-puppy-running-in-grass.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Miniature-schnauzer-puppy-running-in-grass.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/what-age-do-dogs-stop-growing"}, "datePublished": "September 18, 2019", "dateModified": "August 30, 2022", "description": "How can you tell when your dog will stop growing? Here’s a general guideline on the ages when dogs stop growing.", "articleBody": "Reviewed for accuracy on September 18, 2019, by Dr. Katie Grzyb, DVM “At every new puppy appointment, people always ask how fast they will grow and when they will stop growing,” says Dr. Meghan Walker, a veterinarian at Weddington Animal Hospital in Matthews, North Carolina. The truth is, even your veterinarian can’t say for sure. There is no one single, exact answer for when a dog will hit their full-grown weight. That’s because several different factors affect your dog’s growth, including their breed and genetics. Factors That Determine When Your Dog Stops Growing Your veterinarian will consider several factors when trying to estimate the adult size of a dog, and a few general estimations of full-grown sizes for different breed sizes. “Genetics are the number one factor that affect growth rate,” says Dr. Walker. “We have an idea, based on breed, but there are a lot of factors that determine it, such as the size of the parents. It’s really guesswork, and the idea that a puppy’s paws will determine their size really is just a myth,” explains Dr. Walker. Dr. Sara Redding Ochoa, a veterinarian at White House Veterinary Hospital in White House, Texas, adds that growth hormones come into play. Dr. Ochoa explains that growth hormones affect the size that dogs will grow to. Dr. Walker cites a study in which a large breed dog’s growth may also be affected by neutering before one year of age. This can affect dogs of any size, but in small dogs, their growth is only affected by a few millimeters, while in large breeds, it can be centimeters.    Average Ages When Dogs Reach Adult Size Dogs of different sizes are going to mature differently. In general, smaller breeds will hit their full-grown weight earlier than larger breeds. This is because “it takes more calcium to reach the bones and longer for that development,” says Dr. Ochoa. “The body and bones in larger dogs need more time for the calcium to build up.” Here are some averages ages for maturation of different breed sizes. Small Breed Dogs Dr. Walker classifies small breed dogs as those under 25 pounds when fully grown. Small dogs include breeds such as the Dachshund, Maltese, Yorkshire Terrier, Toy Poodle, Chihuahua and Bichon Frisé. Dr. Walker says that small breed dogs typically start growing rapidly at 4-6 months and reach their full size between 10-12 months.    Medium Breed Dogs Dr. Walker classifies medium breed dogs as typically between 25-50 pounds when fully grown. Medium breeds include Beagles, Basset Hounds and Miniature Schnauzers. “We expect medium size dogs to double their size between 8-12 weeks,” says Dr. Walker. Medium breeds reach full growth between 12-15 months. “Sometimes, they may grow a little after that,” says Dr. Walker. Large Breed Dogs Large breed dogs are typically over 50 pounds and include breeds such as Labrador Retrievers, Boxers, Pit Bulls, Golden Retrievers, German Shepherds and Collies. “Large breed dogs will also double their size between 8-12 weeks, but then the growth slows,” says Dr. Walker. She adds that large breed dogs will typically reach full growth at 18 months. Giant Breed Dogs Giant breed dogs include the Saint Bernard, Great Dane, Mastiff and Great Pyrenees. These dogs, according to Dr. Walker, take the longest to develop, due to their huge skeletal frame. “They will be at full growth potential by 18-24 months, but could take up to three years to reach their full weight,” says Dr. Walker. “Until that time, they may appear lanky.” By Kerri Fivecoat-Campbell Featured Image: iStock.com/Lunja"}]