[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Losing Weight While Exercising with Your Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_184920371.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_184920371.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise, Weight management, Obesity", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_exercising_with_your_pet"}, "datePublished": "November 9, 2010", "dateModified": "August 30, 2022", "description": "The maxim of “one for me, one for you” has created a nation in which diabetes, kidney disease, heart disease, and respiratory ailments is the norm -- for both people and pets -- and it will have to get better or we could be taking tremendous leaps backward in terms of lifespan and joy of health.", "articleBody": "Breaking the junk food habit is hard to do. In the U.S., this reluctance to sever our ties with large portions and high sugar content has resulted in a growing prevalence of overweight and obese people. According to a 2010 Gallup Poll study on the subject, 6 in 10 American adults are overweight or obese. That&#039;s more than half the population! And studies show that overweight owners generally have overweight pets as well. The maxim of “one for me, one for you” has created a nation in which diabetes, kidney disease, heart disease, and respiratory ailments is the norm -- for both people and pets -- and it will have to get better or we could be taking tremendous leaps backward in terms of lifespan and joy of health. A growing number of studies and anecdotal evidence is finding that in all but the rarest of cases, better health through exercise and controlled food choices can be achieved. It&#039;s all in the Numbers The People and Pets Exercising Together (P-PET) Study, originally published in 2005, was the first to question what effects a weight management program would have if it was aimed at treating both pets and their people coincidentally. A cooperative effort conducted by Northwestern Memorial Hospital and Hill’s Pet Nutrition over the course of a year, the teams chose two control groups for the proposed findings: people and their dogs (PP) who had both been clinically determined to be overweight; and overweight people only (PO - without dogs). The P-PET Study found that the group of people who worked out with their dogs were more likely to commit to the program, with 61 percent of the PP participants completing the program successfully, and 57 percent of the PO group completing the program. During the study, the people with dogs lost an average of 5 percent of their initial body weight, while the dogs lost an average of 15 percent of their initial body weight. While the initial hypothesis -- that the PP group would have a greater weight loss than the PO group because of the inclusion of the pets -- did not hold statistically, the final conclusions still held the best outcome for overweight pets. Advantages of &#039;Buddy&#039; Exercising The conclusions at the end of the study, and what has anecdotally been corroborated since, is that the key difference between people with dogs and people without is that people who exercise with their pets have a continual source of companionship (“buddy”), initiation to exercise consistently, enjoyment and parental pride. Other benefits included increased socialization, as people with dogs tended to talk more to other people while out exercising, and an increased level of mental well-being. These positive side effects served to be strong motivations for staying with the program over the long term, but it was the dogs especially that benefited most by the bonds created by exercising together and the continued adherence to activity, since even a 5 percent decrease in body weight is enough to significantly improve cardiovascular health in a dog.  Tips for Weight Loss  Avoid feeling overwhelmed by beginning slowly. Make an initial commitment to regular exercise by planning a 30 minute walk with your dog, three times a week for the first month. Starting out slowly will allow you and your dog to adjust to the increased activity, gradually increasing your pace and time as you both feel stronger. Plan and arrange your meals with some forethought, with smaller servings several times a day so that between-meal hunger does not catch you off guard and lead you to snack on unplanned foods. Replace the high fat, high sugar treats with sweet fruits for you, and pet-friendly veggies and fruits for your dog. You may want to consult with a veterinary dietician or veterinarian, at the least to get some advice on the best snack for your dog. Also keep in mind that not all foods are safe for dogs -- raisins and grapes, for example, are very toxic. Last but not least, weigh yourself and your dog once a week to chart your progress. Losing weight, for both pets and people, is a commitment that requires patience and time, but with the help of your best furry friend, you can get healthier together, and have fun doing it. Image: Sean Locke Photography / Shutterstock"}]