[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/az5fmqk8ed", "@type": "VideoObject", "duration": "PT1M54S", "name": "5327096694001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/3925fd049761b5b51c54450ceaf7f30f76608ec8.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/az5fmqk8ed", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/779ba92bf29534b6322be13206bb179fe5df71cf.m3u8", "transcript": "Grasslands are known by a number of colloquial names, including Timothy Fox tails cheatgrass June grass and Downy brown an on is a Harry or bristle like a pendant growing from the ear or flower of barley, rye and many types of widely grown grasses a grass on spiky edges serve a purpose to stick and hold fast to surfaces so that they can propagate and spread their seeds to surrounding areas. But the sharp ends cause the ens to act like barbs and they can cause some serious problems for dogs. Generally any contact a dog has with grass ones can be potentially hazardous. Grass ons can be inhaled become lodged in the ears swallowed or even embedded in the coat or the skin when grass horns are not quickly removed or expelled by an animal.\n\nThey have the potential to become problematic if a dog has an on stuck in its nasal cavity. Sneezing is usually among the first symptoms. This can progressive nasal drainage or the dog excessively rubbing its nose. You may also see redness inflammation or draining sores on the skin.\n\nYour dog may lick scratch or chew at the site where the on is present and even have lethargy or a decreased appetite as a result of a stuck grass on grass lawns that are left untreated in your dog's body can migrate to the lungs. The spinal cord, the brain and other organs causing serious problems for your pet. Try to remove any visible grass ons immediately from your dog. If you can visibly see your grass on lodged in your dog's nose consult your veterinarian as soon as possible.\n\nDo not try to remove the on yourself if an on travels internally in your dog's body or gets lodged deeply under the skin. Surgery may be necessary for removal. It's wise to examine your dog after you've returned from a walk or play time outside a grooming brush can help remove a tangled on from a dog's coat. And it's also a good idea to inspect your dog's snout and between their toes for any foreign materials.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/how-protect-your-dog-foxtails?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Foxtail Plants: How to Find Them on Dogs and Why They&#039;re So Dangerous", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Foxtails-and-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Foxtails-and-dogs.jpg"}, "author": {"@type": "Person", "name": "Christina Fernandez, DVM, DACVECC", "url": "https://www.petmd.com/author/dr-christina-fernandez"}, "keywords": "Dog, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-protect-your-dog-foxtails"}, "datePublished": "June 30, 2020", "dateModified": "August 30, 2022", "description": "Did you know that foxtail plants can be very dangerous for your dog? Dr. Christina Fernandez explains why foxtails are dangerous and how to find them on dogs.", "articleBody": "Foxtail plants are a weed-type grass that can cause serious problems for dogs. Flourishing in the summer months, the seeds from these annoying weeds are designed to burrow into the ground. If they attach to your pet’s coat and burrow into the skin, this can lead to pain, infection, and sometimes more serious issues. Foxtails can also be inhaled, lodged in the ears, swallowed, and embedded in the paws. Luckily, there are things you can do to try to keep your dog safe from the dangers of foxtails. Here’s a breakdown of what the foxtail plant is and why it’s dangerous for your dog. What Is a Foxtail? What Do Foxtails Look Like? Foxtails—also called grass seed awns, mean seeds, timothy, cheatgrass, June grass, Downy Brome, or other local names—are an annual summer grass. They start growing in spring and are in full bloom by summer. They will then die during the winter. Shaped like the tail of a fox, the tip has seeds arranged in spikey clusters with backward-facing barbs.1 The spikes and barbs allow for one-way burrowing, which is great news for the foxtail but bad news for dogs. Here are some pictures of a foxtail plant: iStock.com/ma-no iStock.com/baona Here are pictures of the dangerous foxtail awns:  Shown: Common wheat grass awns / Image credit: Smith Veterinary Hospital   Shown: Brittle grass awn breaking into smaller pieces / Image credit: FloridaGrasses.org Where Are Foxtails Found? Foxtails can be found anywhere in the United States but are most common in the West. They are most often found in these places: Hiking trails Parks Flatlands Meadows Open grassy fields While they are less common in urban areas, they can still be found in areas where grass is allowed to grow uncontrolled. When the weather is warm, the foxtail dries out and hitches a ride on anything passing by, including dogs. This hitchhiking behavior is important for foxtail seed dispersal.1 Why Are Foxtails Dangerous for Dogs? Foxtails can attach to any part of your dog’s body and start the burrowing process. This commonly includes:2 Eyes Eyelids Ears Nostrils Mouth Spaces between the toes (in the paw pads) In some cases, foxtails can burrow through the skin, finding their way into the spine or chest and belly cavities. Once inside, the foxtail continues to burrow, bringing bacteria and dirt along with it. This can lead to much more serious conditions because internal organs may be affected. The foxtail will continue to cause problems until it is removed. In some cases, advanced diagnostic tests and procedures may be required to identify and remove the foxtail. What Are the Signs That a Dog Has Foxtails on Them? If you live in an area where foxtails are abundant, here are some signs you can look for: Head shaking Limping Pawing at the face Snorting Sneezing Bloody nose Excessive licking of an area on the body Other signs can show up one to several days later. These may include: Lumps Bumps Draining tracts Areas of redness or tenderness Inflammation Lethargy Depression Decreased appetite In the worst case scenarios, an embedded foxtail can make it to vital organs, including the lungs, spinal cord or brain, heart, and abdominal organs, causing symptoms specific to that organ. In very bad cases, surgery may be required to remove foxtails or treat infection resulting from embedded foxtails. How to Remove Foxtails From a Dog Early removal of the foxtail is important. If you live in a foxtail-prone area, ALWAYS check your dog after being outside. If you see a foxtail on your dog’s fur or skin, you can attempt to remove it with tweezers. If you are seeing any of the signs listed above or signs that a foxtail has penetrated the skin or entered an opening on your dog’s body, bring your dog to the vet. This includes the ears, nose, or mouth. Trying to remove the foxtail yourself from a body cavity may result in an incomplete removal, with pieces of the foxtail still embedded in your dog’s skin and ready to burrow deeper. Foxtails can travel a great distance through body cavities, so it’s important that the full foxtail is removed. How to Prevent Foxtails From Injuring Your Dog There are a few ways you can avoid foxtails and keep your dog safe. Dogs with long coats are more likely to pick up these annoying hitchhikers. Consider a trim for the summer to reduce the likelihood of attachment. Working dogs, or dogs that spend a lot of time in tall grass, may be outfitted with a commercially available vest that covers and protects the chest and abdomen. Avoid foxtail-prone areas to prevent injury to your dog. Use a short leash when walking your dog. If foxtails grow in your yard, make plans to remove them or call a landscaper for assistance.  Check for foxtails frequently and after periods of outdoor play, especially if you hike or spend time in foxtail-prone areas. References: Foxtail (diaspore). (2019, June 2). In Wikipedia. Retrieved from https://en.wikipedia.org/wiki/Foxtail_(diaspore) Brennan KE, Ihrke PJ. Grass awn migration in dogs and cats: A retrospective study of 182 cases. Am Vet Med Assoc. 1983.182(11):1201-1204 Featured Image: iStock.com/MaximFesenko"}]