[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Get an Emotional Support Animal Registered", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-cuddling-woman-on-couch.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-cuddling-woman-on-couch.jpg"}, "author": {"@type": "Person", "name": "Heather Hoffmann, DVM", "url": "https://www.petmd.com/author/dr-heather-hoffmann"}, "keywords": "Dog, General Care, Zoo Emotional Support Animal Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/emotional-support-pets-explained"}, "datePublished": "June 30, 2020", "dateModified": "August 30, 2023", "description": "What is an emotional support animal? Does your pet qualify, and how do you register? Dr. Heather Hoffmann, DVM, explains everything you need to know about emotional support pets.", "articleBody": "Animals have always formed a special bond with humans. This bond has been useful in training certain animals to assist people with physical and medical disabilities. These service dogs have historically been recognized for their loyalty to their owners, but more recently, emotional support animals have emerged as a new category of assistance animals. But what is the definition of an emotional support animal, and how do you get your pet certified as one? What Is an Emotional Support Animal? Emotional support animals (ESAs) provide comfort and emotional support to humans with a diagnosed psychological disorder. Although these animals provide a therapeutic benefit to their owners, they are not required to go through any specific training. Emotional support animals are most commonly used to help people with disorders or mental illnesses such as: Anxiety Depression Post-traumatic stress disorder (PTSD) Autism Bipolar disorder Stress What Animals Can Be Emotional Support Animals? Any domesticated animal can potentially qualify as an emotional support animal. Emotional support dogs (ESA dogs) are among the most common. No matter the species, a licensed psychologist or psychiatrist must provide an official letter recommending the use of an emotional support animal. It is expected for the ESA to behave appropriately in the owner’s presence and not cause any public disturbances. Is There an Emotional Support Animal Certification? How Do I Get My Pet Certified as an ESA? ESA dogs and other emotional support animals can be registered, for a fee, through a variety of online organizations. These websites offer certificates, aka ESA letters, as well as emotional support animal vests and other products to help identify your emotional support pet’s status in public. It is important to do your research when choosing an organization that offers emotional support animal registration, as there has been some controversy regarding the business aspect of these websites. Most online animal registrations cost money but will not afford any legal protection. What Is the Legal Standing of an ESA? Since emotional support pets are not specifically trained, they do not have the same legal protection as service animals. ESAs are supported by federal laws like the Air Carrier Access Act and the Fair Housing Act. This means that they can legally accompany their owner during air travel and live in their home. However, unlike service animals, ESAs are not allowed access to public spaces where pets aren’t normally permitted, such as restaurants and grocery stores.  Resources https://www.avma.org/resources-tools/animal-health-welfare/service-emotional-support-and-therapy-animals Featured Image: iStock.com/Ivan Pantic"}]