[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Do Dogs Try To Communicate?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petMD_Dog-Communication-2.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petMD_Dog-Communication-2.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_how_do_dogs_try_to_communicate"}, "datePublished": "May 9, 2011", "dateModified": "August 30, 2022", "description": "", "articleBody": "By Turid Rugaas Excerpted from the book Barking - The Sound of Language, with permission from Dogwise Publishing. Dogs have many different ways of expressing themselves beyond barking. Most (but not all) dogs communicate in a similar manner and these expressions can usually be easily recognized by other dogs. Some forms of communication are easy for people to understand, but some unique expressions are harder for people to comprehend without taking the time to learn about them. Dogs communicate in many ways including: Distance creating signals used to keep someone away or increase the distance from another individual. Examples are showing teeth, lunging forward, snapping, biting, growling, and barking.Calming signals used to express politeness, solve conflicts, or to show friendliness.Body language that express fear or defense. Examples are tail between the legs, crouching, backing up or taking flight, and of course the stress symptoms like peeing, scratching, and shaking.Signs of joy. Examples are a wagging tail, licking, jumping, wiggling the whole body, and showing a happy face.And then there are all the sounds that dogs make including: BarkingWhiningGrowlingHowlingAll of these are a natural part of what we can call the language of dogs. They are intended to communicate something to the world around them, and to express the feelings the dog has at that moment. Gaining a better understanding of what a dog is trying to communicate and why he may be trying to communicate when he barks will be the focus of the remainder of this book. *** In Barking, author Turid Rugaas, well known for her work on identifying and utilizing canine &quot;calming signals,&quot; turns her attention to understanding and managing barking behavior. If you can identify what your dog is expressing when he barks, you can take steps to minimize the negative effects of barking in cases where you find it a problem. Image: vvvita / Shutterstock and Sari Dennise / Flickr"}]