[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "A Clean Bill of Health", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4033472326_aa15b33095.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4033472326_aa15b33095.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Wellness exam, Preventative health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_clean_bill_of_health"}, "datePublished": "February 25, 2011", "dateModified": "August 30, 2022", "description": "Whether you buy a puppy or adult, or acquire your new dog from a breeder or a shelter, you want your dog to be as healthy as it can be. And even if you&#039;re taking on the responsibility of dog with special needs, you&#039;ll want to know ahead of time what you&#039;re getting into.", "articleBody": "This article is courtesy of AKC Canine Health Foundation. Whether you buy a puppy or adult, or acquire your new dog from a breeder or a shelter, you want your dog to be as healthy as it can be. And even if you&#039;re taking on the responsibility of dog with special needs, you&#039;ll want to know ahead of time what you&#039;re getting into. Talk to your veterinarian, members of the parent breed club, or rescue groups beforehand -- and then give your dog the best of care for the healthiest life he can have. *** &quot;At least you have your health...&quot; That saying is as true for dogs as it is for people. Your dog may be a candidate for an ugly dog contest, may scoff at the idea of fetching a ball, and may be an obedience school dropout, but as long as he has his health, you&#039;re ahead of the game. But with all the hoopla about hereditary diseases in purebred dogs, how do you find a healthy dog? No dog is without threat of health disorders.  The trick is to decrease that threat. So no matter what kind of dog you&#039;re looking for, you need to be a savvy health consumer. What Causes Hereditary Health Problems? Some people think the best bet is to get a mixed breed. Pure breeds arose through limiting the gene pool of populations of similar dogs; unfortunately, in a population with a small gene pool, the chances of identical recessive genes (those that take two copies to express themselves) pairing up in one dog are increased. Although this chance may be lessened in some first generation crosses between two breeds, many such recessive genes are so widespread among breeds that crossing breeds is no guarantee they will not pair up in the offspring. And unfortunately, such pairings sometimes cause health problems. Because inbreeding can increase the chance of recessive bad genes pairing up in the same dog, it&#039;s generally a good idea to prefer a puppy from parents that are not closely related to one another. Some online pedigree programs will compute a Coefficient of Inbreeding (COI) for a pedigree; geneticists advise staying under a 10 percent COI for a 10-generation pedigree for best health. However, this is a rough generalization; inbred dogs have lived long healthy lives, just as non-inbred dogs can have hereditary health problems.  Sometimes certain traits that are desirable in some breeds increase the chance of certain health problems.  For example, the flat faces of some breeds may predispose them to breathing difficulties. Large or heavy breeds tend to be susceptible to hip dysplasia, and toy breeds to knee problems. Unfortunately, these same problems can occur in all flat-faced, large, or toy-sized dogs, whether pure or mixed.  In general, avoiding extremes in body type or any exaggerated features, such as giant size, long backs, droopy skin, or bulging eyes should lessen the chance of some disorders. Health Testing &quot;Shots and wormed&quot; was once the gold standard when shopping for a healthy puppy, but these days it&#039;s just the baseline. Depending on breed, DNA tests, blood tests, eye examinations, or radiographs might be expected of conscientious breeders before  even mating two dogs.  In some other breeds, specialized tests might be standard for each puppy before allowing it to go to a new home. When a breeder says puppies have been &quot;health tested&quot; make sure to get a list of what tests are covered; in many cases, it simply means the puppy has been examined by a veterinarian for parasites and other obvious conditions, not tested for breed-specific problems. Breed-specific health tests: Just what tests you want depends on what breed you&#039;re looking at. For example, you&#039;d ideally want a hearing test (preferably a BAER, or brainstem auditory evoked response) in a Dalmatian puppy (and its parents), a hip dysplasia test in Golden Retriever parents, and a DNA test for progressive retinal atrophy (PRA) in a Miniature Poodle puppy or its parents. But you&#039;d expect none of those in a Greyhound. This doesn&#039;t mean the Greyhound is necessarily a healthier breed; just that its breed-related health concerns don&#039;t yet have reliable screening tests. The easiest way to find out what tests are desirable for your breed is to go to the Canine Health Information Center (CHIC) to see if your breed is a &quot;CHIC breed.&quot; CHIC breeds&#039; parent clubs have agreed upon health screening tests they feel all breeding stock in their breed should undergo before producing a litter. Also check the national parent club website for any additional information on recommended tests and how to understand the results.  The Orthopedic Foundation for Animals maintains statistics and databases for several hereditary disorders; check their website (www.offa.org) to see if your breed ranks high for a particular disorder. Phenotype tests: Some tests are based on the dog&#039;s phenotype; that is, any signs the dog may show. These include joint radiographs, eye examinations, blood tests, cardiac examinations, hearing tests, and even MRIs, among others. Some of these tests can be fairly expensive, and the price of a puppy from tested parents will often reflect that added expense. In most cases, normal phenotypic test results of the parents cannot guarantee your puppy will be clear of the disease, but they will greatly increase the odds.  DNA tests: Genotype, or DNA, tests usually give more definitive results. They are available for a growing list of diseases in different breeds.  In some cases, DNA tests allow a dog who is affected or is a carrier of a recessive disorder to be bred to a dog that does not carry the disorder and be assured of producing unaffected puppies.   Finding a Health-Conscious Breeder The ideal breeder is aware of breed-specific health concerns and performs the appropriate testing. Such breeders are more likely to belong to the national parent club for their breed. To find such breeders, go to www.akc.org/breederinfo/breeder_search.cfm. Many parent clubs have a breeder referral page, or a page with listings for local breed clubs. While a breeder who follows the parent club recommendations for health testing is ideal, in the real world they can be scarce or their puppies may already be spoken for. That doesn&#039;t mean you can&#039;t get a healthy puppy from a breeder who doesn&#039;t test.  In fact, most hereditary health disorders still have no reliable screening tests, so even well-intentioned breeders can do nothing but avoid mating affected dogs. Ask what health problems relatives of your prospective puppy may have had. Don&#039;t discount a litter because some relatives have had health problems; but do be cautious if the breeder shrugs them off as the norm for the breed, or says the breed has no health problems when your research indicates they do. Finally, remember that even health problems that are a concern in a breed are nonetheless uncommon. Even without testing the chance of getting a healthy dog is high in most breeds. Evaluating Puppies Besides evaluating the pedigree and parents, you&#039;ll also want to examine the puppies. Check the following: The skin should not have parasites, hair loss, crusts or reddened areas.The eyes, ears, and nose should be free of crusts and discharge.The nostrils should be wide and open.None of the puppies should be coughing, sneezing, or vomiting.The area around the anus should have no hint of irritation or recent diarrhea.Puppies should be neither thin nor pot bellied.The gums should be pink, not pale.The eyelids and lashes should not fold in on the eyes.By the age of 12 weeks, males should have both testicles descended into the scrotum. Undescended testicles have a greater chance of becoming cancerous, and neutering such dogs is more involved. Avoid any puppy that is making significant breathing sounds, including excessive wheezing or snorting.Puppies should not be limping or lethargic. If they are, ask to see them again the next day in case it is a temporary limp or the puppy is simply sleepy.You should make any sale contingent on a veterinary exam performed within three days. The veterinarian will listen to the heart, test for parasites, and check for more obvious breed-specific problems that may be detectable at that age. Most puppies will come with a short health warranty that may only last a few days. Some breeders may also warrantee against certain hereditary health problems that may emerge at a later date. Understand what a warranty covers, and what remedies it offers. For example, one that requires you to return the dog for a replacement is probably one that you will never take advantage of. At the same time, remember that puppies are living beings, not machines. Although breeders can confidently warrant against problems that DNA testing has cleared, or against problems that would show up in early puppyhood, even the most carefully bred puppies will sometimes develop hereditary problems. Rescue Sometimes we don&#039;t pick our next dog; they pick us. And sometimes all those ideas of health tests and pedigrees and vet checks go out the window when our eyes meet those of a dog in need. Although dogs in shelters or with rescue groups may not always have benefitted from the best of backgrounds or care, they can nonetheless be the best choice you can make.  For a purebred rescue, national parent clubs often have rescue groups that can match you with an in-need dog of your breed. Many rescue groups do extensive rehabilitation and temperament testing, as well as home checking, to make sure the dog will find his forever home with you. Shelters may do less testing and rehabilitation, but are able to offer dogs for lower adoption fees. You can locate dogs of various breeds in shelters throughout the country by searching PetFinder. Be aware that many shelters label dogs as breeds according to their best guess, which is often far from accurate, so don&#039;t put too much credence in labels. Dogs find themselves in shelters or rescue for many different reasons. Very often they are wonderful dogs whose families lost interest or could not keep them. In other cases they were a bad fit between dog and person. In some cases they had health problems that proved too challenging to the former owners. These problems often include allergies, spinal problems, blindness, or problems requiring costly treatment. Often a rescue group will foster such a dog and pay for treatment until it is ready to be placed. Nursing a dog in need back to health is particularly rewarding, but find out ahead of time all that is entailed. Shelters will usually check for parasites, including heartworms, and will spay or neuter the dog before adopting it out. Rescue groups will do the same, but may do more extensive health checks and treatments. Most rescue groups -- like responsible breeders -- are also available to give advice throughout the dog&#039;s lifetime. Along with good luck, good health is the result of good genes and good care...so give your dog, no matter what his genes, the best of care for the best of luck.  Used with permission from the AKC Canine Health Foundation, a nonprofit organization dedicated to advancing the health of all dogs and their owners by funding sound scientific research and supporting the dissemination of health information to prevent, treat, and cure canine disease. Image: Tambako the Jaguar / via Flickr"}]