[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/2ykctswdvr", "@type": "VideoObject", "duration": "PT1M34S", "name": "5327099494001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/4c7c497522256825162426d0e7dfda0cd8498330.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/2ykctswdvr", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/355a0ac4c14fa7cf31bd85f66f471384817b55c8.m3u8", "transcript": "Any dog can potentially have an ear infection but long eared breeds with excessive hair and non erect outer ears like Cocker spaniels or basset hounds are more susceptible to canine ear infections bacteria is the primary disease causing agent that leads to infection and inflammation of the middle or inner ear. Other possible disease causing agents include yeast and ear mites alternate causes include trauma to the body the presence of tumors or polyps in the ear or even foreign objects in the year. The symptoms of ear infections in dogs are largely dependent on how severe and extensive the infection is.\n\nWhile there may be no visible symptoms ear infections are often characterized by head shaking redness of the ear discharge and a foul odor from the ear. Other symptoms of an ear infection may include a dog tilting his or her head pawing at the affected area experiencing pain when opening the mouth or a reluctance to chew. One primary diagnostic procedure is an ear psychology. You're a vet and will swab your dog's inner ear with a cotton swab and examine the contents under a microscope to determine if bacteria yeast or mites are present in case of severe or persistent ear infections your vet marine may order more extensive tests like bloodwork and advanced imaging procedure like a c.t. scan or even surgery to remove a foreign body or a polyp if necessary based on the cause of the infection your veterinarian will prescribe topical and or oral medication.\n\nGenerally this will accompany instructions to clean the ears regularly or clip the fur in the ear canal.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/5-tips-preventing-ear-infections-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Tips for Preventing Ear Infections in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/prevent-ear-infections-in-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/prevent-ear-infections-in-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Ear health, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/5-tips-preventing-ear-infections-dogs"}, "datePublished": "June 19, 2017", "dateModified": "August 30, 2022", "description": "Ear infections in dogs are not uncommon, but using simple, preventive tips can help stop ear infections from developing. Learn some simple ways to help prevent dog ear infections at home.", "articleBody": "By Paula Fitzsimmons If your pup has floppy ears, allergies, or happens to be an avid swimmer, you’re probably no stranger to canine ear infections. Ear infections in dogs are not uncommon, but using simple, preventive tips can help stop ear infections from developing. If you suspect your dog has an ear infection, call your vet. “Prompt veterinary care is essential to avoid more serious consequences such as a ruptured eardrum, middle or inner ear infection, and hearing loss,” says Dr. Alli Troutman, a holistic veterinarian at Integrative Veterinary Service in Brookfield, Wisconsin. Symptoms of ear infections in dogs are hard to miss. “The affected dog is usually shaking his head frequently, may tilt his head with the sore ear usually on the ‘down’ side, and there is often a sour odor coming from the ear,” says Dr. Beth Boynton, Professor of Wellness at Western University College of Veterinary Medicine in Pomona, California. “It may look swollen, red, and full of moist discharge.” Spare your dog some needless suffering and avoid the expense of extra vet trips with these safe and effective vet-approved tips for preventing ear infections in dogs. 1. Rule Out Underlying Causes An ear infection is typically a sign that something else is going on with your dog, says Dr. Alexandra Gould, a veterinarian with Dermatology Clinic for Animals in Tacoma, Washington. “It’s only through treating these underlying causes that ear infections can be prevented.” Causes, she says, include allergies, foreign objects stuck in the ear (like foxtail grasses), hormonal and autoimmune diseases, and tumors. Very often, allergies are responsible. “Skin allergies bring inflammation to the surface of the body which causes irritation and warmth. The confined space of the ear canal breeds yeast and bacterial growth that further increases the inflammation,” and can lead to ear infections explains Dr. Michael Lund, veterinary staff manager for ASPCA’s Community Medicine Department in New York. Like us, dogs can react to any number of allergens in the environment, like pollen, grass, mites, and fleas (another reason to protect your dog with proper flea and tick prevention). And what you feed your dog may be the problem, says Boynton. Some dogs have food allergies or food sensitivities, which can predispose them to ear infections. “Dogs in the United States most often react to beef, dairy products, and wheat,” she says. 2. Keep the Ears Dry “Yeast and bacteria thrive in warm and moist environments—and many dog ears prove to be the perfect Petri dish,” says Lund. This is especially true for breeds like Cocker Spaniels and Retrievers, whose floppy ears trap moisture. He says the best preventive for these types of dogs who are predisposed to ear infections is cleansing and drying the ears every five to 10 days. If your dog is a swimmer or is bathed regularly, clean his ears as soon as possible after water exposure. “This ensures the moisture is adequately removed to prevent yeast and bacteria from getting a chance to colonize the ear canals.” Dr. Jill Abraham, a board-certified dermatology specialist with Blue Pearl Veterinary Partners in Midtown, New York, suggests placing a cotton ball in the ears during bath time to keep them dry. “You don&#039;t have to push the cotton ball in deep, it can rest at the opening of the ear.” After the bath, remember to remove the cotton ball and dry the ears. “After a bath, you can use a dry paper or cloth towel to dry the inside flap and around the opening of the ear canal.” 3. Keep the Ears Clean To clean the ears, Abraham suggests the following routine. Lift up the earflap, then fill up the canal with a vet-recommended solution, or soak a cotton ball with solution and squeeze the liquid into the canal. After gently massaging the base of the ear for 20 to 30 seconds and letting your dog shake his head, use dry cotton balls or soft towels to wipe off debris. “You can use cotton-tipped applicators in the folds inside the ear flap, but don’t insert any into the ear canals,” she says. “This could push wax and infection deeper down and damage the ear drum.” What Is the Best Ear Cleaner for Dogs? Lund advises against home-made ear-cleaning solutions like diluted hydrogen peroxide, vinegar, and rubbing alcohol. “At-home remedies are often half water, and water in the ear is what can predispose many dogs to ear infections.” Instead, ask your vet for a recommendation based on your pet’s specific needs.   4. Consider Supplements Of course there is no substitute for a nutritionally complete diet made from high quality ingredients, but the following supplements may be used as part of your strategy for preventing ear infections. Always check with your veterinarian before feeding your dog supplements. If allergies are at the root of your dog’s ear infections, a daily omega-3 fatty supplement can help. These supplements can reduce inflammation, which may lessen the risk of ear infections, says Lund. Omega-3 fatty acids, like those found in fish oil supplements may  “decrease inflammation associated with skin allergies that often appear in a dog’s ears and feet.” A malfunctioning immune system can make your dog more prone to infections, so maintaining balance is essential. A probiotic supplement can balance the normal bacterial flora within the intestinal tract and promote an appropriate immune response. “A healthy gut is a happy gut, and a happy gut is a healthy immune system,” says Troutman. 5. Reconsider Plucking Ear Hairs Plucking your dog’s ear hair can be beneficial, but it’s not appropriate for every dog. “I stick by the old adage, ‘If it ain&#039;t broke, don&#039;t fix it,’” says Abraham. If a dog has healthy ears and has not had infections, she often advises pet parents not to pluck. “But, if a dog with very hairy canals keeps getting ear infections then it can help to keep the canals free of hair.” If you do decide to pluck hair from your dog’s ears, this is probably not something you want to try at home, unless you’re experienced. Overly-aggressive plucking could lead to pain and cause more ear problems. “I don&#039;t advise pet owners try plucking ear hairs at home on their own. This is best performed by a groomer or veterinary professional.” Learn More:"}]