[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Adoption: Should You Rename Your Dog or Cat?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-naming-pet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-naming-pet.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Adoption, Shelters and rescue, Zoo Rescue Animal Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/pet-adoption-should-you-rename-your-dog-or-cat"}, "datePublished": "January 22, 2018", "dateModified": "August 30, 2023", "description": "It&#039;s a conundrum faced by almost all prospective pet owners who visit shelters nationwide: Is it OK to rename an adopted pet? And what are some tips for making the new name stick?", "articleBody": "By Helen Anne Travis Every year, the Michelson Found Animals Foundation helps thousands of animals in the Los Angeles area find their forever homes. The majority of pets are strays, which means shelter staff and volunteers have to come up with new names for thousands of cats and dogs each year. Sounds like fun, doesn’t it? “It is for the first few hundred,” says Aimee Gilbreath, executive director of the rescue organization. “But then it gets a little challenging.” To make the process as easy and fun as possible, the volunteers and staff use shortcuts. They might name a litter of puppies after the characters on Game of Thrones or Star Wars. Sometimes they’ll take their inspiration from the season (there are a lot of white kittens named Snowflake each winter). If the animals have distinct personalities or physical features, those traits might influence their names. The foundation once worked with a local shelter that was trying to find a home for an older pup with only three legs, Gilbreath says. They named her Eileen (get it?). But what if you had a horrible boss named Eileen and don’t want to be reminded of her every time you see your new dog? That is a conundrum faced by almost all prospective pet owners who visit shelters nationwide. Is it OK to rename an adopted pet? And what are some tips for making the new name stick? Why Shelters Name Pets Naming shelter animals helps potential adopters form a bond, says Gilbreath. It’s a lot easier to fall in love with “Snowflake” than “Cat Number 3,298.” “There are so many animals looking for homes,” says Jme Thomas, executive director of the Motley Zoo Animal Rescue in Redmond, Washington. “Anything you can do to better market an animal to an adopter is essential to saving their lives.” At Motley Zoo, most animals are named after musicians or celebrities. Right now Celine Dion, Mario Batali and John Mayer are all looking for forever homes. To further appeal to potential adopters, the animals are sometimes photographed with their celebrity namesakes, like Gin and Juice, two cats who got to meet Snoop Dogg. “It gives the animal an identity,” says Thomas. But what if the animal comes to the shelter already named? Say a dog’s owner died or a cat had to be surrendered because a landlord didn’t allow pets? For the most part, the name stays, says Thomas. Gilbreath agreed that’s standard practice. “At most shelters, if an animal has a name you keep the name unless there’s a good reason not to,” she says. Good reasons to change a pet’s name include instances of past abuse. Shelters will also rename pets whose current name might prevent them from finding a forever home. Gilbreath remembers working with a rescuer who was trying to find a home for a dog named Killer after his owner passed away. The dog was renamed Keller, something that sounded like his original name but was perhaps more appealing to potential adopters. Can You Rename Your Pet After Adoption? Even if a pet has had a name for years, if you don’t like “Keller”, “Gin,” or “Juice”, the Motley Zoo staff and volunteers tell adopters it’s okay to come up with a new name for your new pet. “I feel like 99 percent of the time it’s completely okay to rename your pet,” says Thomas. “It’s a fresh start for you and them, and it can be a bonding experience.” Gilbreath agrees, especially when it comes to kittens and puppies who have only had their shelter name for a few days or weeks. But when it comes to renaming an adult cat or dog who may have had a name for almost a decade, she warns there might be some confusion during the transition. But that shouldn’t hold you back, says Gilbreath—especially if it’s a name you dislike. “If the name is going to interfere with your relationship with the pet then by all means rename it,” says Gilbreath. How to Teach Pets Their New Name It could take a few days or a few weeks for the pet to understand their new name, says Gilbreath. You may have to use their old name a few times during the transition, Thomas says, especially if your pet is unknowingly ignoring you because she thinks she’s still Snowflake. But both agreed that if you consistently pair the new name with positive reinforcement like treats, pets and praise, the animals will start to understand and respond to the new name. Even cats, who get a reputation for being untrainable, will start to get the hint if you say their names when it’s dinner time, says Gilbreath. “Pets are really good at reading us,” she says. “They will quickly learn that the new name makes you happy and they will adapt to that.”"}]