[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Protect Your Pet from Coyotes", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-coyotes.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-coyotes.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-protect-your-pet-coyotes"}, "datePublished": "January 15, 2018", "dateModified": "August 30, 2022", "description": "News headlines have highlighted the tragedy that can unfold if a hungry coyote crosses paths with a small, unattended pet. But how common are coyote attacks in urban and suburban areas? Find out whether coyotes are a danger to pets and how to keep your pets safe.", "articleBody": "By Nicole Pajer In recent years, we have been hearing more and more about wildlife posing a threat to dogs and cats. News headlines have highlighted the tragedy that can unfold if a hungry coyote crosses paths with a small, unattended pet. People have reported coyotes snatching their pups from their backyards, causing mass hysteria. But how common are coyote attacks in urban and suburban areas? Is this really something to lose sleep over? We asked the experts to answer burning questions about coyotes, and offer advice on how to keep your pets safe. Are Coyotes a Danger to Pets? While coyotes once lived on untouched lands, the species has spread into heavily populated areas. And this is ultimately why we are hearing more about their growing urban presence today. “Coyotes are found pretty much everywhere now, including urban centers,” says Dr. Shari Rodriguez, assistant professor of human dimensions of wildlife at Clemson University, noting that she has seen “an incredible photo of a coyote that got onto a subway car in Portland and curled up and went to sleep on a seat.” “As we increase human populations and develop formerly green space, wild areas, we are coming face to face with more wildlife, like coyotes,” explains Camilla Fox, founder and executive director of Project Coyote, an organization that strives to foster coexistence between people and wildlife. “Things like habitat encroachment, habitat alteration, and food can be an attraction for different species.” Rodriguez adds that coyotes are generalists, which means they don’t have narrow requirements for habitat, food, and such, like specialist species do. “This means they can live off their natural prey (smaller mammals like rabbits, squirrels, and even deer fawn, as well as insects, fruits, birds, amphibians, and reptiles), but they can also do fine preying on domestic pets and small livestock, human refuse, and agricultural crops,” she says. And demographic wise, she notes that coyotes have been found “everywhere from Central America to the Arctic.” So, will a coyote attack a dog? Though everyone seems to have a “coyote ate my friend’s pet” story, Rodriguez says that these occurrences are still relatively low. “It does happen from time to time, but it’s not all that common,” she explains. “When it does happen, it’s typically because humans are engaging in risky behavior—e.g., leaving/letting their pets outside alone, walking pets at night in urban centers.” And even then, Rodriguez explains that we can’t really place the blame on the coyotes. “I like to think of it this way: A coyote is just being a coyote,” she says. “So it’s going to do whatever it can to make a living at the lowest possible cost.” Even in urban areas, a coyote will prefer to eat its natural diet of rodents and fruit but may snatch up a pet if the opportunity presents itself as an easy one, Fox adds. “If a coyote is in an urban area and there is a fat fluffy [pet] that doesn’t have a lot of defense mechanism, cats could be considered prey,” she says. “Once you allow your pets to roam, they basically become part of the ecosystem, so they may be perceived as prey by any given species.” How to Protect Pets From Coyotes “Coyotes are here to stay,” Rodriguez says. The key to ensuring pet safety is for owners to adjust to their behavior and to take extra steps to keep their animals out of harm’s way. “Humans need to avoid risky behaviors if we are to avoid interactions and conflict with coyotes,” she explains. Here are a few precautions you can take: Be aware that some dogs may be drawn to coyotes: To ensure your dog’s safety in a coyote-ridden area, it’s essential to be aware that coyotes and dogs can be attracted to one another, Fox points out. “A dog and a coyote are genetically similar enough where they can interbreed, though interbreeding is not very common,” she notes. “There is an attraction often between dogs and coyotes and it’s often the dog that starts the chase behavior. But if an incident occurs, then the coyote gets blamed.” Do not feed wildlife: One of the biggest reasons that coyotes are infiltrating neighborhoods is the attraction of people food, Fox says. “We encourage people to not intentionally or unintentionally feed animals if they are trying to deter them from their yards and neighborhoods.” Do not leave your pet unattended: Keep an eye on your pet when you open the back door to let him out and do not let him stray too far away from you. Whenever possible, take your dog out on a dog leash. “You should use a 6-foot leash, not a retractable leash,” recommends Dr. Kate Magers, a veterinarian at Pennfield Animal Hospital in Missouri. “Those give little to no control if your pet encounters a coyote. Also avoid walking your dog during twilight hours.” Rodriguez adds that coyotes are more active at night, so it’s best to keep an extra eye on your pet when you let him out after the sun goes down. “Carry a headlamp or flashlight when walking your dog at night,” she says. Do not feed your pet outside: As food can be a big attractor of coyotes, giving your pet his dinner indoors is always a good idea. “If you feel you must feed your pet outside, feed midday at a set time and pick up leftovers immediately,” Magers says. Be extra mindful during coyote breeding season: “April is when the coyotes are going to have their young and April through August is when they are going to be more protective of their young,” Fox says. “Be extra careful during this time. Walk a dog on leash and be cognizant of coyotes in the area.” Remove any kind of attractants around the exterior of you house: Attractants for coyotes include compost, dirty grills, and birdseed, Fox says. “Birdseed, for instance, can attract rodents and, therefore, attract coyotes.” Fallen fruit should also be cleaned up, as Fox notes that coyotes consume large amounts of fruit during certain points in the year. Magers adds that you should secure garbage cans and refuse. Make your yard a less attractive habitat: “Keep trees and shrubbery trimmed to reduce cover, which makes great hiding places for coyotes,” Magers recommends. “Install coyote-proof fences (these are typically quite high) or use motion-triggered deterrents like light or sprinkler systems.” Fences should be at least 6-foot high and buried at least 6 inches underground or fitted with a mesh apron on the outside of the fence extending 12 inches out from the bottom of the fence and secured with landscape, she adds. Try a coyote-deterring gadget: “There are lots of new items on the market for protecting pets, such anti-coyote collars and jackets,” Rodriguez says. “The vests are made of Kevlar and have spikes on the back of the jacket and the collars also have spikes on them.” While both products should help deter attacks, Rodriguez notes that she hasn’t seen any convincible statistics that would allow her to tout their effectiveness. So don’t skimp on the precautions mentioned above. If you see a coyote in your yard, “stand tall and maintain eye contact with the coyote,” Magers advises. “You should haze the coyote by yelling, clapping your hands loudly, making loud noises, flashing a flashlight, tossing rocks or sticks near the coyote, and anything else that will frighten it off. Move toward the coyote quickly and aggressively and do not run away from it.” Rodriguez adds that if you see a coyote while walking your dog, maintain eye contact with it and back up until you and your pet are a safe distance from it. What Do You Do If a Coyote Attacks Your Dog? If your pet gets bit by a coyote, it requires immediate veterinary attention. “See your veterinarian to have the wounds cleaned, get some antibiotics started, and booster the rabies vaccine if indicated by vaccine records,” Magers says. Although rare, coyotes can carry rabies, Fox notes. “That is very geographically dependent on which species of wildlife are actual rabies vectors. For example, in California, we haven’t had a case of rabies in coyotes since the early ’90s. A coyote may become rabid, but it’s much more prevalent in bats, skunks, and raccoons than coyotes in terms of a rabies vector species.” Per Rodriguez, any attacks should be reported to your state’s wildlife agency as soon as possible. “Sometimes coyotes get habituated to humans, and thus become more brazen,” she explains. While coyotes can pose a threat to pets, it’s important for people to recognize the fact that these animals are native to North America and a very crucial part of the country, Fox says. “They play an important role in helping to keep ecosystems healthy and diverse. Coyote management is largely about people management,” she says. “By taking a few precautions, there is no reason why the two species can’t live together peacefully.”"}]