[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "3 Must-Know Dog Commands for Visiting Family", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Dog-Sitting-11-14-16-shutterstock_158179946.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Dog-Sitting-11-14-16-shutterstock_158179946.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/3-must-know-dog-commands-visiting-family"}, "datePublished": "November 11, 2016", "dateModified": "August 30, 2022", "description": "As you plan to visit relatives, make sure your dog has a firm grasp of the following commands and behaviors and help the whole family get invited back!", "articleBody": "By Jessica Remitz While you may be ready to bring your pup with you to every family barbeque or outdoor party this summer, your dog may not be. As you plan to visit relatives, make sure your dog has a firm grasp of the following commands and behaviors and help the whole family get invited back! A common, but embarrassing, issue dog owners have when visiting unfamiliar homes is basic house training mistakes, said Sarah Westcott, CPDT-KSA and owner of Doggie Academy in Brooklyn, New York. Even if your dog understands that it is not acceptable to go potty in your home, he may not realize this includes the homes of your friends and family. To avoid unwanted accidents, take your dog out as soon as you arrive at your destination and give him extra praise for doing his business. Utilize your “go outside” or “go  potty” command often by letting him out immediately after drinking or eating. You’ll also want to supervise your dog just as closely as you did when you were first house training them, Westcott said. Jumping Before attending asocial gatherings, your dog should already know how to greet people politely, but these manners can be forgotten when a dog gets excited and begins jumping for attention. Dog owners and their friends frequently handle their dogs jumping up on people incorrectly, which can lead to repeat offenses. “Owners and their friends will tend to inadvertently reward a dog for jumping by using their hands to move the dog off — which can seem like petting — talking to the dog, or moving around — which can seem like really fun play,” Westcott said. Unfortunately, all of these reactions will give your dog exactly what he wants: more attention. The better response? Ignore your dog completely and withhold your attention until he has all four paws on the floor, Westcott said. Or, if he knows the “off” command, make sure he listens to it and has all four paws on the floor before getting a reward. The No. 1 Command: Sit Sit is by far the most important behavior for a dog to know before visiting other people, and is the exact opposite of nearly every obnoxious behavior they may exhibit during your stay, including jumping on people or furniture, wandering away or knocking things over, Westcott said. You dog should also have an understanding of how to control their mouths and voices, with a “sit” command helping to curb any inappropriate chewing, biting and barking. To teach your dog to hold a sitting position, as for the “sit” and withhold your reward for a few seconds, Westcott said. After having success with a few seconds, begin withholding the reward for longer intervals of time. Continue this pattern until your dog understands that “sit” means, “sit down” but also “sit and calm down.”"}]