[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Small Dogs Be Picked Up By Hawks and Birds of Prey?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS-Bird-Of-Prey-1941591.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS-Bird-Of-Prey-1941591.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/can-small-dogs-be-picked-hawks-and-birds-prey"}, "datePublished": "August 7, 2018", "dateModified": "August 30, 2022", "description": "Keep your small dog safe from hawks and other birds of prey with these pet safety tips.", "articleBody": "Image via Ronnie Howard/Shutterstock.com By Kerri Fivecoat-Campbell Birds of prey such as hawks and owls attacking very small pets is uncommon, but there are reports of such incidents. Before Nancy Pistorius brought Minnie, her 8-week-old, 1-pound Yorkshire Terrier home this past March, she had never seen any birds of prey near her Lawrence, Kansas suburb. However, it wasn’t long after Minnie arrived at the Pistorius home that a hawk began hovering above it. “One of the first times I had her outside, she was on the ground about 6 feet away from me when I noticed a large shadow passing over her,” says Pistorius. “She noticed it too, and looked up about the same time I did. A very large hawk was directly over her head, coming down.” Pistorius was recovering from a serious illness, and using her cane, got up as quickly as she could, waving the cane and screaming. “Thankfully, that was enough to deter the hawk. However, the hawk kept watching for my puppy to come out again. He’d be up in the backyard or sitting right on the railing of my deck, right next to the back door where I carried Minnie out of the house.” Dr. Pete Lands, the director of emergency and critical care for Saint Francis Veterinary Center in Swedesboro, New Jersey, also tells of an incident in which a colleague describes when a hawk picked up a client’s small dog and carried it away. “The owner (of the dog) got into his truck to try and follow the bird, but quickly lost sight,” says Dr. Lands. Luckily, the dog was recovered two days later in a fenced yard about a mile away with only some mild scrapes and scratches. Types of Birds of Prey to Look Out For Birds of prey include hawks, eagles, owls, osprey, kites and falcons. Vultures are also sometimes included as birds of prey. “Birds of prey are really any bird that has a curved beak and talons, and they are also carnivores,” says Laura VonMutius, education manager for the Audubon Center for Birds of Prey in Maitland, Florida. VonMutius says that birds of prey generally eat a lot of small mammals, including squirrels, rabbits, voles and sometimes reptiles, amphibians and insects. However, eagles and osprey typically prefer fish. “They have great eyesight—that’s why you tend to see them sitting on top of street signs, lights poles and fence posts. They stay very still and wait for their prey to come to them and then swoop down,” says VonMutius. Pat Silovsky, director of the Milford Nature Center in Junction City, Kansas, explains that while there have been reports of hawks and owls attacking and carrying off very small dogs, the reason it is such an uncommon occurrence is that birds of prey cannot carry anything that weighs more than their own body weight. Red-tailed hawks, which are the most common of the hawk species, only weigh between 2 and 2.5 pounds. “They cannot swoop down and carry off more than their weight, although they may come and attack something larger on the ground and eat it there,” says Silovsky. Silovsky says it is also possible for small dog owl attacks to occur, especially from great horned owls—a larger species. “The predator that is most tenacious is the great horned owl, which can take small foxes. If someone is missing chickens, it would typically [be] an owl.” VonMutius says that birds of prey are generally also very territorial, so even if they don’t view your small dog, or even a cat, as an opportunistic meal, they may be swooping in just to protect their territory. Pet Safety Tips for Protecting Small Dogs From Birds of Prey Homeowners and businesses have tried many ways to keep birds of prey away from their property. Silovsky says that people put up reflective tape, hang pie pans from trees, and use owl decoys and machines that produce loud booms to scare away the birds. “We’ve even tried using the big booms here with varying degrees of success,” says Silovsky. “They get used to it and we have to keep changing things up.” Jme Thomas, executive director of Motley Zoo Animal Rescue in Redmond, Washington, says she’s had issues with hawks zeroing in on her 3-pound Fox Terrier and a 7-pound Chihuahua. She solved the problem by building a special enclosure that allows the dogs to be on the ground under the deck, enjoying the outdoors while remaining safe. She compares it to outdoor enclosures used for cats, known as “catios,” but calls hers a “pupio.”   Pistorius found that reflective silver streamers and owl decoys worked to a certain extent. “The hawk did come back to the backyard a few times, even roosting in a backyard tree while the puppy was out in the backyard,” Pistorius says. “I&#039;m not sure the hawk has given up, but he hasn&#039;t been around as much lately. I keep hoping he will move on.” Pistorius always accompanies her Minnie outside and is ever vigilant. Silovsky says this is probably the best policy. “Individual birds of prey may become familiar with a dog and its habits,” she says. Lands says that if a bird of prey makes contact with your small dog, you should look for puncture wounds to the sides. He also explained that your dog may also suffer head trauma, lung contusions and other internal injuries if she was dropped. In some cases, it may appear as if your dog emerged from her encounter with a bird of prey without injury, only to develop potentially serious problems within a few hours or days. If your small dog is attacked or dropped by a bird of prey, Lands advises that you call or visit your veterinarian to make sure your dog is healthy and uninjured."}]