[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Guide to Washing a Dog Bed", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/How%20Often%20do%20you%20Wash%20Dog%20Beds.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/How%20Often%20do%20you%20Wash%20Dog%20Beds.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Crates and beds", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_guide-to-washing-dog-bed"}, "datePublished": "March 1, 2016", "dateModified": "August 30, 2022", "description": "Your dog’s bed can get germy, without a doubt. The good news is that you can properly clean it. Learn more about how to clean a dog bed properly.", "articleBody": "Image via Patryk Kosmider/Shutterstock.com By Jill Fanslau You come in contact with germy places on a daily basis, like public restrooms, the break room refrigerator door, gas pumps and grocery carts. Unfortunately, another thing to add to your list is your dog’s bed. Sure, you’re not the one sleeping there, but you likely come in secondhand contact with your dog’s bed multiple times a day, every day. Whenever your dog moves from his bed to your couch or comes over to you for a quick pat, he’s dragging an invisible cloud of germs everywhere he goes. Fortunately, dog beds and mats are one germy area you can control the cleanliness of. Learn more about how to properly wash a dog bed or mat, below. How Dirty Are Dog Beds? Domestic animals carry disease-causing organisms including bacterial, viral, parasitic and fungal species, according to the International Scientific Forum on Home Hygiene (IFH). Although your pet may not seem ill, infections can be passed from animals to people when you pet their fur or come in contact with their feces, vomit, saliva, urine or other bodily discharges, and many of these disease-causing organisms can live in the environment—including on your dog’s bed—for up to 12 months without a host. How to Quickly Clean a Dog Bed Unfortunately, there’s no quick way to thoroughly clean your dog’s bedding. While vacuuming will minimize hair and dirt, it&#039;s not enough to get rid of harmful microbes on your pet’s bed. The only way to reduce your risk of infectious disease transmission is to launder your pet&#039;s bed once a week, according to the IFH. In between washings, remove hair with a vacuum or rubber gloves or place a sheet over the dog’s bed. As for cleaning different types of dog beds, follow the directions indicated on the bed’s label, as washing instructions may differ depending on the type of fill the bed has or if it has a removable cover. The water temperature and time of washing, however, should remain the same regardless of the bed. How to Clean Dog Beds Properly A good guideline to follow: wash your dog’s bed once a week or once every two weeks at minimum, said Kathy Backus, DVM, Holistic Veterinary Services, in Kaysville, Utah. When determining how often to wash your dog’s bedding, however, you should also consider your pet’s activity level, how much they shed, the amount of time they spend outdoors and if they (or you) have allergies. If those factors are high, you may want to increase the number of washings to twice a week, she said. The longer you go between washes, the harder it will be for your washing machine to remove all the potential pathogens from the bedding. All pet bedding—including any dog blankets or cushion covers a pet may come in contact with—should be laundered at a temperature of at least 140 degrees Fahrenheit using detergent and chlorine bleach, if the fabric can stand it, said Sally Bloomfield, an honorary professor at the London School of Hygiene and Tropical Medicine. If your washing machine doesn’t gauge temperature, choose the highest setting to help kill as many germs as possible. And for pets with sensitive skin, opt for a natural detergent and an extra rinse cycle. Dry your pet’s bed at the highest possible temperature setting, being careful to hang-dry fill or matting so that they don’t clump in the dryer. After you touch your pet, his dog food, or his bedding, thoroughly wash your hands with soap and running water to cut down on any risk of infection. Always use gloves and paper towels to clean up any feces and regularly clean floor surfaces around your pet’s bed."}]