[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/tlguvxmb72", "@type": "VideoObject", "duration": "PT2M8S", "name": "5327109401001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/0fc5c4efd531148ef9fd8acb7c1ff32da977cc0a.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/tlguvxmb72", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/7e6f75af1b1a0288923d3cf72d2d10109154e6f3.m3u8", "transcript": "Why do dogs shed a dog's fur helps control his body temperature and protects his skin against the sun and other environmental elements. When a dog's hair stops growing he will naturally lose it by shedding the amount and frequency will depend on several things, including the dog's health condition. Breed and sometimes the season and environment. How much shedding is normal.\n\nDogs especially double coated breeds typically shed their under coats during the spring and fall heavy shedding breeds include border collies Labrador retrievers beagles and German shepherds. What might seem like heavy shedding can be completely normal for some dogs. Abnormal causes of shedding if there's been a big change in your dog's environment. The amount of hair they shed can increase.\n\nDogs that are experiencing an increase in shedding due to stress or anxiety may benefit from your loving comfort. Additionally consult your veterinarian to see if medications or supplements may help the situation. Certain skin disorders may also lead to hair loss and bald patches. For example, an infestation of parasites like fleas lice or mites can cause excessive hair loss ringworm dermatitis and certain types of fungal infections autoimmune diseases and cancers can cause hair loss too.\n\nIf you notice skin irritations like bumps scabs or a rash in addition to hair loss speak with your veterinarian immediately hormonal changes and allergies are another cause of shedding certain foods medications household cleaners and grooming supplies may trigger allergic reactions in dogs. How can I manage my dog shedding while you can't prevent a healthy dog from shutting normally. You can ask a groomer or veterinarian for product recommendations that will work with your dog's fur type and can help reduce the amount of loose hair in your home. Work with your veterinarian to pinpoint the issue and treated appropriately.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/why-do-dogs-shed?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Shed?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Grooming", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/why-do-dogs-shed"}, "datePublished": "January 6, 2016", "dateModified": "April 19, 2023", "description": "Even though shedding is normal for nearly all types of dogs, sometimes excessive hair loss can be a sign of a something more serious. Here’s a look at why dogs shed, what’s considered “normal” shedding, and the warning signs of a potential problem.", "articleBody": "Even though shedding is normal for nearly all types of dogs, sometimes your dog’s hair loss can be a sign of a something more serious. Here’s a look at why dogs shed, what’s considered a “normal” amount of shedding, and the warning signs of a potential problem. Reasons Why Dogs Shed Their Coats A dog’s fur helps control their body temperature and protects their skin against the sun and other environmental elements. When a dog’s hair stops growing, they will naturally lose it by shedding. The amount and frequency of shedding will depend on several factors, including: A dog’s health condition A dog’s breed Season and environment Although dogs naturally shed, hair loss can also be caused by stress or health issues. Here are a few of the most common causes of shedding in dogs and what you should look out for. Seasonal Shedding Dogs, especially double-coated breeds, typically shed their undercoats during the spring and fall. Heavy-shedding breeds include: Border Collies Labrador Retrievers Beagles German Shepherds What might seem like heavy shedding can be completely normal for some dogs, but it can also be the result of an underlying health condition. If you notice excessive shedding, contact your veterinarian to set up an appointment. Stress-Induced Shedding If there’s been a big change in your dog’s environment, the amount of hair they shed can increase. Dogs also tend to shed more when in stressful situations, like going to the vet’s office. If you think your dog may be experiencing stress- or anxiety-induced shedding, talk with your veterinarian. They can refer you to a qualified, board-certified veterinary behaviorist. These vets are experts in the treatment of behavioral issues. Additionally, they can help you find solutions like anti-anxiety medications or over-the-counter supplements. Skin Issues Certain skin disorders may also lead to hair loss and bald patches. For example, an infestation of parasites, like fleas, lice, or mites, can cause excessive hair loss. Ringworm, dermatitis, and certain types of fungal infections, immune diseases, and cancers can cause hair loss, too. If you notice skin irritations, like bumps, scabs, or a rash, in addition to hair loss, speak with your veterinarian immediately. Allergies Allergies are another cause of shedding in dogs. Certain foods, medications, household cleaners, and grooming supplies may trigger allergic reactions in dogs. Allergies fall into four categories: Atopy (genetic) Environmental or seasonal allergies Food allergies Flea allergies These allergies can result in hair loss or shedding. Your veterinarian can help pinpoint the offending allergen and find the most effective treatment. What Is a Normal Amount of Shedding? There is no “normal” amount of shedding. There are so many variables that can change and affect the amount of shedding a dog does. The best way to find out if your dog’s shedding is a sign of a health issue is to make a vet appointment and talk with them. They will do a complete health check and diagnostics to rule out any potential health reasons that could be causing or contributing to your dog’s shedding. How Can I Manage My Dog’s Shedding? While you can’t prevent a healthy dog from shedding normally, you can ask a groomer or veterinarian for product recommendations that will work with your dog’s fur type and to help reduce the amount of shedding and loose hair in your home. If you are concerned that your dog is experiencing hair loss due to a pest infestation, a skin condition, stress, or a medical issue, work with your veterinarian to pinpoint the issue and treat it appropriately. "}]