[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/jmswq79vgw", "@type": "VideoObject", "duration": "PT2M34S", "name": "5327109419001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/509530cc125392a8ad3bb53dd823a8d0c60cb400.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/jmswq79vgw", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/ae375cde8f7cb5f2f7e91d20d932204a91aa3317.m3u8", "transcript": "If a crisis strikes you when your pets don't get caught off guard. Create an action plan and follow these six emergency preparedness tips to protect your pets. Pack a two go pet emergency kit. Don't wait until the last minute to gather everything your pet might need.\n\nPutting together a portable to go kit for emergencies and storing it in a safe spot will save you time if you need to evacuate quickly. Your kids should be waterproof and contain important items such as a supply of pet food a safety harness bottled water waste cleanup supplies and any medications or first aid supplies or pet may need pack. Proof of ownership documents in recent medical records as well. Update your pets identification information.\n\nIf your dog or cat has a microchip. Make sure your contact information, including your address and phone number is correct. Many pet parents forget to update this information if they move or change phone providers. If your pet doesn't have a microchip double check the information on your pets colored tags so that someone can reach you.\n\nIf your pet becomes lost. Prepare a list of pet from the accommodations because of health and safety regulations. Many disaster relief shelters do not allow pets to stay with their owners in temporary boarding facilities do research ahead of time and check in with local officials to get a better idea of shelter resources that can accommodate you and your pet in the event of an emergency. Keep a list of pet friendly hotels handy in case of emergency shelters do not allow pets.\n\nIt's also a good idea to check in with local animal shelters rescue organizations and veterinarians to understand their emergency protocols for boarding displaced pets connect with pet friendly neighbors identify fellow pet parents in your community and agree to help each other out during any emergency. If for some reason you're unable to get your pets when a disaster occurs, your neighbors can act as the first line of defense to rescue your pets. Provide trustworthy neighbors with your pet's name, your phone number and an evacuation plan Offer to provide the same assurances for their pets in return display a rescue decal on your home.\n\nPut a D on your front door or window so that emergency responders or neighbors know that you have pets that need to be rescued. Put your pet's name in your phone number on the sticker so that rescuers can easily contact you if the Savior pets. If you are able to get your pet out in time before rescue crews arrive. Make sure to write the word evacuated on the decals so that everyone knows your pet is safe keep a picture of your pet handy.\n\nIf you do get separated from your pet during a disaster or emergency having the current picture to show to shelters and put on flyers will be important. Take a new photo every year and keep it in your wallet, purse or your emergency to go get it. Always have it available.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/evr_multi_disaster_planning_for_pets?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Natural Disaster Planning for Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-in-flooded-waters.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-in-flooded-waters.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_disaster_planning_for_pets"}, "datePublished": "July 27, 2012", "dateModified": "August 30, 2022", "description": "A few simple tips on how to protect your pets should your area be struck by a tornado, hurricane, flood or fire.", "articleBody": "As pets have become a more important part of our family units, so has their safety and wellbeing. Yet, few of us are prepared for the event of a natural disaster. In order to make things a little easier, we’ve put together a few simple tips on how to protect your pets should your area be struck by a  hurricane, tornado, flood, or fire. One important thing to note is that in all of these disaster scenarios it is safer to evacuate with your family and pets. However, keep in mind that boarding facilities, kennels, and animal shelters require that your pets have all their vaccinations up to date, or you might be turned away. Also, many emergency shelters do NOT accept pets for health and safety reasons, so pet-friendly shelters will fill up fast.  Hurricanes   Although hurricanes have seasons (Jun.1-Nov.30 in the Atlantic and May15-Nov.30 in the Eastern Pacific), weather experts still have trouble predicting just how many storms regions will get each year and what their paths will be. Here’s what you can do: Hurricane Preparation Designate a hurricane-safe location that will accommodate your entire family, including pets. A windowless room nearest to the ground floor is recommended.If you live in an area affected by hurricanes, get in the habit of doing &quot;drills&quot; with your family and pets during the off season to ensure they will all know what to do in the event of an emergency.Prepare a pet emergency kit and keep enough crates to hold each pet in the event of a storm in the designated area for each pet. Panic can give rise to out of the ordinary behaviors in pets and fast confinement will be required.If you can evacuate, don’t leave your pets behind. Take proper pet identification and emergency kits for your pets as well as your family.During a Hurricane If your family is weathering the storm inside the home, make it to your &quot;safe room&quot; and crate your pet as soon as possible. If you can, place the crates under heavy, durable furniture.After a Hurricane Always be extra careful when going outdoors following a hurricane. Only exit the home after you and your family are certain the storm has passed.Keep your pets secured at all times. Cats should remain in their carriers, and dogs on a leash.Don’t allow your pets to go near water or other liquids on the ground; debris from the hurricane may have contaminated the area or live power lines may be laying in the water.Keep everyone (including yourself) away from downed power lines.Back to top Tornadoes Occurring at a moment’s notice, tornadoes can sweep through a neighborhood indiscriminately and wreak havoc in a short period. Here’s what you can do: Tornado Preparation Designate a tornado-safe location that will accommodate your entire family, including pets. A windowless room nearest to the ground floor is recommended.If you live in an area affected by tornadoes, get in the habit of doing &quot;drills&quot; with your family and pets during mild weather to ensure they will all know what to do in the event of an emergency.Stock your tornado-safe area with a pet emergency kit and keep crates in the designated area for each of your pets. Panic can give rise to out of the ordinary behaviors in pets and fast confinement will be required. Know where your pets&#039; hiding spots are, so you can grab them and take them to safety as quickly as possible. Limit their access to any unsafe spots it may be hard to get them out of.If you can evacuate, don’t leave your pets behind. Take proper pet identification and emergency kits for your pets as well as for your family.During a Tornado If your family is weathering the storm inside the home, make it to your &quot;safe room&quot; and crate your pet as soon as possible. If you can, place the crates under heavy, durable furniture. After a Tornado Always be extra careful when going outdoors following a tornado. Only exit the home after you and your family are certain the storm has passed.Keep your pets secured at all times. Cats should remain in their carriers, and dogs on a leash.Don’t allow your pets to go near water or other liquids on the ground outside; debris from the tornado may have contaminated the area or live power lines may be laying in the water.Keep everyone (including yourself) away from downed power lines.Back to top Floods   Flood conditions can also encroach rapidly and sometimes without much notice. Here’s what you can do: Flood Preparation If you live in an area affected by floods, get in the habit of doing &quot;drills&quot; with your family and pets to ensure they will all know what to do in the event of an emergency.Know where your pets&#039; hiding spots are, so you can grab them and take them to safety as quickly as possible. Limit their access to any unsafe spots it may be hard to get your pets out of.Prepare a pet emergency kit and, if you can, evacuate with your pets.During a Flood If your family gets stuck in your home during a flood, move to the upper floors or into your attic. During sever flooding, such as what occurred in New Orleans during Hurricane Katrina, move onto your roof until help can arrive.Keep your pets either on a leash or in a crate so that they do not run away in a panic.After a Flood Stay indoors until after the water has receded.Don’t allow your pets to go near water or other liquids on the ground; in addition to debris and live power lines, the water may be contaminated with infectious diseases and parasites.Keep everyone (including yourself) away from downed power lines.Back to top Fires Wildfires can begin quickly and spread rapidly, especially during the driest seasons. Here’s what you can do: Fire Preparation If you live in an area affected by fires, get in the habit of doing &quot;drills&quot; with your family and pets to ensure they will all know what to do in the event of an emergency.Know where your pets&#039; hiding spots are so you can grab them and take them to safety as quickly as possible. Limit their access to any unsafe spots it may be hard to get your pets out of.Prepare a pet emergency kit and have a crate available so that you can evacuate with your pets as quickly as possible.During a Fire Wildfires move quickly but will often give you enough time to evacuate. Household items can be replaced, family and pets cannot.After a Fire Upon returning to your home be aware that wildfires may leave surrounding structures unstable and dangerous for wandering pets. Also, wild animals from the surrounding area may have been pushed into more residential areas, which pose a danger to your family and pets.Keep your pets on a leash or in a crate.Back to top In an emergency situation, your family pets will need you more than ever. Take charge and be prepared. Here are some other great emergency preparation resources: The Humane Society of the United StatesReady.gov (for you and your pet)AVMAUnited Animal NationsFEMA"}]