[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/9xcg0q5cmw", "@type": "VideoObject", "duration": "PT2M6S", "name": "5327122911001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/c13790f9a50cd0a97877938dd4fbd37d3611eaab.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/9xcg0q5cmw", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/abb705282b1b9e40cfc76d2d7eb0664a4c0c04b8.m3u8", "transcript": "Hi I'm Dr. Katy Nelson and today I'm here at by the way a 110-year-old animal welfare organization based right here in New York City. Oftentimes when a veterinarian is recommending medications to small dogs and cats they give you the option of administering a liquid medication. This may be because of the ability to give a more precise dosage or it may be for ease of administration as it's often difficult to give pills to our pets.\n\nWhatever the reason while it may sound easier he may be quite messy. If your pet is resistant or if you don't have a plan. First things first. Have your medication ready to go.\n\nRead closely to see if you need to shake it first or if it needs to be refrigerated and always know exactly how much to administer. Once you've figured all that out and you've pulled up the proper amount into the dosing syringe or the dropper it's time you get ready to administer it in animals that are amenable to it. You may be able to simply slip the tip of the dosing syringe into the cheek pouch and slowly and steadily administer the medication while your pet is swallowing. However, in pets like curly here who aren't so excited about taking their medicine it may be time to grab an assistant and a bath towel.\n\nI call this the kiddie burrito though as you'll see it works well in small dogs to gently wrap your pets body in the bath towel and make them into a little burrito enabling you to be able to gently hold them in place and decrease their ability to scratch you or struggle away. As I mentioned earlier it may be easier to have someone assist you in especially difficult animals while you're holding them in place. Someone else can slip the administration device into the cheek pouch while gently administering the medication always administer liquid medications slowly allowing them time to swallow small amounts at a time so you don't overwhelm your pet and cause them to aspirate the medication into their lungs and always, always give them loads of praise and encouragement while you're giving them the medications followed by a treat or two afterwards.\n\nIf you make this into as low stress of an event as possible you can safely and easily make it through the medication period without a scratch. For more information, visit M.D.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/evr_dg_animal_hospital_pharmacy_understanding_whats_in_your_pets_medicine?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Animal Hospital Pharmacy: Understanding What&#039;s in Your Pet&#039;s Medicine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/1156480243_fe9af19e93.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/1156480243_fe9af19e93.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, Medication, General Care, Prescription medication, Over the counter medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_animal_hospital_pharmacy_understanding_whats_in_your_pets_medicine"}, "datePublished": "March 10, 2011", "dateModified": "August 30, 2022", "description": "New medications are constantly being made available for our pets to help improve the safety and efficacy of veterinary medicine. But do you really know what goes on in the animal hospital&#039;s pharmacy?", "articleBody": "By T. J. Dunn, Jr., DVM New medications are constantly being made available for our pets to help improve the safety and efficacy of veterinary medicine. But do you really know what goes on in the animal hospital&#039;s pharmacy? It&#039;s important to first note that pet medications and prescriptions need to be used with an understanding of their effects and side effects. Animal hospital pharmacies should only use fresh, quality pet medications -- and then used only as directed. Additionally, not all medications or drugs are safe and/or effective for every individual dog (or cat) taking that substance. Here&#039;s an example from human medicine: Aspirin is widely available without a prescription and billions of aspirin tablets are consumed worldwide every year. On rare occasions someone will have a bad reaction from taking aspirin. Does that mean that aspirin is &quot;bad&quot; and that it shouldn’t be available to anyone? Does it mean that no one should ever take an aspirin just because a few people shouldn&#039;t? Likewise with pet medications.  We need to be vigilant of undesirable side effects and should keep in touch with the dog&#039;s (or cat&#039;s) veterinarian when any questions arise regarding pet medications and their use. Another important step in understanding an animal hospital pharmacy and its medication use is understanding the common terms used for medication. Expiration Date Veterinarians frequently get calls about &quot;expired&quot; medications. The expiration date indicates the date in which the product should stop being sold or dispensed by the pharmacy. It does NOT mean that the product becomes ineffective or useless on that date. For example, if you purchased a box of flea medication with nine tablets in it on January first, and you see an expiration date on the box of April of that year, your impression might be that you have only four useful tablets in the box of nine. However, what the drug companies must do is set the expiration date well in advance of the time when any effectiveness might drop off in order to take into account the time it takes the consumer to use the medication. Essentially, the expiration date takes into account the time it will take the purchaser to use up the medication after it is purchased. Side Effects A side effect is any response that is not the desired effect of a drug or medication. For example, if an antihistamine is prescribed in order to decrease nasal congestion due to an allergy and the patient also experiences a sluggish and sleepy mood as well, the drowsiness is considered to be a side effect. Since most dogs (and cats) don’t drive or operate heavy machinery, the side effect of sleepiness may not be an important consideration. In fact, the side effect of the antihistamine might even be good. Maybe an antihistamine would be a good choice to use prior to a trip where the dog (or cat) would benefit from being slightly sleepy instead of barking or yeowling for four hours straight! So, side effects are conditions other than the one intended -- but remember, side effects can be good, bad, or inconsequential. Milligram Take an ordinary raisin. Cut it up into 1,000 equal parts. Each little part will weigh about 1 milligram. There are 464,000 milligrams in a pound. The fact that most drugs are measured in milligrams should alert you to the fact that sometimes very tiny amounts of a substance can be very powerful. Label instructions should be followed very faithfully.   Strength, Dose and Dosage The strength of a medication is the concentration or weight of the substance. For example, if a dog is prescribed an antibiotic, s/he may be given a 50mg (50 one-thousandths of a gram) strength tablet. Medication may also come in other strengths, such as 100mg, 200 mg, 400mg, etc. The dose, meanwhile, is the amount of the medication that an individual should take at one time. For an antibiotic the dose might be 8mg per pound of body weight and for another antibiotic the dose might be 25mg per pound. Finally, the amount of the medication prescribed over a specific period is referred to as the dosage. If, for example, your veterinarian tells you to give your dog two capsules at a time and repeat at eight-hour intervals until all the medication is gone, that amount is the dosage. (And yes, the time interval will vary depending on the type and strength of the medication.) Adverse Reactions to Medication An example of the imperfect world we face in veterinary medicine can be seen when a dog (or cat) experiences a reaction to a vaccination. On occasion, a potentially serious reaction can occur shortly after receiving an inoculation. The patient’s blood pressure drops, heart rate slows and the patient can loose consciousness. These instances may even require drastic measures to save the patient&#039;s life. (I have seen this happen 3 times in 27 years of vaccinating dozens of dogs and cats on a daily basis.) There are those who will flatly state that vaccinations are &quot;bad&quot; for dogs and cats, not just because they can cause serious reactions but they also believe that the vaccines cause future chronic ailments. I wonder how many cases of Canine (and Feline) Distemper, or Canine Hepatitis and Parvovirus I would have seen, and how many dogs (and cats) would have died from these preventable diseases if I wished for a perfect world and didn’t vaccinate all those pets for fear of the occasional imperfection. The holistic community will also differ with some of this information. They have their reasons for believing what they do and we all should keep an open mind when it comes to non-traditional ways to medicate ourselves and our pets. However, historical facts and unemotional data have proven beyond any reasonable argument that some drugs and medications have very powerful health enhancing effects. On the other hand, if you are looking for a perfect world where everything is predictable and 100% safe and effective, you won’t find that perfection in the pharmacy. Then again, you won&#039;t find that anywhere. Image: David King / via Flickr"}]