[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Five Fun Facts About the St. Bernard", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_82533841-slide1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_82533841-slide1.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/care/five-fun-facts-about-the-st-bernard"}, "datePublished": "November 15, 2011", "dateModified": "September 7, 2022", "description": "Everyone knows of the Saint Bernard dog running about the Alps, finding injured skiers, right? Well, here are five fun facts you may not have known about this lovely breed.", "articleBody": "Everyone knows of the Saint Bernard dog running about the Alps, finding injured skiers, and plying them with brandy from their little barrel around their necks, right? Well, here are five fun facts you may not have known about this lovely breed. In a word, no. This is a fallacy. The St. Bernard didn’t actually ever have a small barrel of brandy about its neck. They should be known as the &quot;dog rescuer,&quot; instead.   Gaining their name from the dangerous St. Bernard pass in the Alps between Italy and Switzerland, the breed was famous for rescuing people lost in the snow and in avalanches. This was not an easy or safe job for the St. Bernard, as many perished in the avalanches. Although they’ve only been known as the St. Bernard since the mid-1800s, they are very famous for their rescues. Before that, they were known as &quot;Barry Dogs&quot; and &quot;Noble Steeds,&quot; among others.   The most famous St. Bernard was Barry. He rescued somewhere between 45-100 people (the numbers are sketchy) during his career. Barry even has his own monument and his body rests in the Natural History Museum in Berne, Switzerland. All hail Barry! The St. Bernard is one of the giant dog breeds. He is tall, majestic, masterful, strong and muscular. The first body builder of the dog world? Not exactly, but this dog has energy and stamina, perfect for all his past jobs, including farming, watchdog and, of course, search and rescue. St. Bernards are also very active (you should probably walk yours twice a day) and love to be involved. Sorry, folks. As far as we know, they don&#039;t do laundry? Oh, the St. Bernard is not all looks and muscles. This is a smart dog. He’s famous for being brainy, even-tempered, non-territorial (though he’ll protect you if there’s danger), obedient, very loyal, and great with kids and even other animals. Because of his size, it is recommended he be trained properly from a young pup. Because the last thing you want is a large dog who doesn’t always obey the word &quot;no,&quot; especially when there’s something really interesting to investigate. Definitely not in personality. This is a warm and loving dog. But because his ancestors spent so much time traipsing the Alps and rescuing wayward travelers from certain death, he is now pretty much a cold weather dog. No tropics for him. The St. Bernard doesn’t do well in warmer weather, or even in really warm rooms, so where you live must come into consideration before you get yourself one. There you have it! A few fun facts about one of the famous dogs in the world. Read about other dogs in the petMD Breedopedia."}]