[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Deaf Dogs Rock", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_deaf_dogs_rock"}, "datePublished": "September 20, 2012", "dateModified": "August 30, 2022", "description": "Deaf dogs are often misunderstood and neglected, some are even put to death because of their physical ability. Learn why deaf dogs rock and how to train deaf dogs.", "articleBody": "How Some Dogs Hear with Their Hearts By Vladimir Negron After surveying the available dogs at the animal shelter, you come across what might be the one. She&#039;s sleek, spry, and just the right mix of cute and cuddly. &quot;Oh, that one,&quot; the shelter employee says, &quot;she&#039;s deaf.&quot; Suddenly you&#039;re thinking, &quot;I don&#039;t know anything about deaf dogs. I wouldn&#039;t know how to train them,&quot; and you decide to pass. That was the initial reaction of Christina Lee — before her husband calmed her down and convinced her to adopt an 8-week-old deaf boxer named Nitro from the local shelter. She went on to found Deaf Dogs Rock, a non-profit organization bent on educating people on deaf dogs and finding them homes, Deaf Dogs Rock began humbly in August 2011 with Lee working tireless hours updating the website with training resources and listings of adoptable deaf dogs at local shelters, as well as occasionally transporting deaf dogs from one shelter to another so they could have a chance for adoption. Today the hours haven&#039;t changed much, but her listings and audience sure has grown. DeafDogsRock.com has had as many as 600 deaf dog listings on the website at one time and can boast over 15,000 fans on its Facebook page. Why deaf dogs? &quot;We launched DeafDogsRock.com to talk people off the edge of the cliff,&quot; Lee says. &quot;There just wasn&#039;t that much information out there [about deaf dogs] and now we truly can say we have a great community… Someone, for example, can put up a question [about their deaf dog] on our Facebook page and there&#039;ll be 150 answers from the community. It&#039;s wonderful to see.&quot; &#039;Velcro-Dogs&#039; and Deaf Dog Training As Lee puts it, the connection you make with a deaf dog is like none other. In fact, the community commonly refers to them as &quot;Velcro-dogs&quot; because they are most comfortable stuck to your side. Once you are their out of range of sight or smell, it&#039;s as if you have completely disappeared. Lee says this bond is both a comfort and a caveat, as some deaf dogs develop separation anxiety. Fortunately, there are training methods to condition them to not fear being alone. &quot;Nitro had [separation anxiety],&quot; said Lee, &quot;but he could care less now.&quot; &quot;It just takes time. You do things in mini sessions. Each time you leave [the deaf dog] at the house a little bit longer and a little bit longer. Teach them that good things happen in the crate. They get fed in the crate; they get treats in the crate. The crate is their best friend.&quot; And while Lee stresses the importance of training, she also wants people to know that training a deaf dog isn&#039;t much different than training any other dog. &quot;You train them exactly the same: positive reinforcement clicker training. Except that instead of a clicker you use a quick flash, an open flash of the hand &#039;marks&#039; the behavior. So really you&#039;re just tweaking their training just a little bit (Here&#039;s a YouTube video from a member of the Deaf Dogs Rock community). &quot;Of course you&#039;re going to want and condition [deaf dogs] to look at you. My first two days with [Nitro] he received a treat every time he looked at me. I made sure he made eye contact with me. When I&#039;m walking and he made eye contact with me, he got a treat. Nitro is conditioned that no matter where he&#039;s at he always checks in with me.&quot; Lee uses a variation American Sign Language to communicate with her deaf dog and stresses the importance of signing. &quot;As soon as you get a deaf dog you start signing right away,&quot; says Lee. &quot;And it&#039;s amazing how fast they learn. It&#039;s pretty scary actually.&quot; What else is scary is that many animal shelters around the country don&#039;t even spend the time to find homes for these amazing dogs. &quot;If you&#039;re in a shelter and you&#039;re deaf, you&#039;re gone,&quot; says Lee. &quot;So if I can change them from putting that dog in a gas chamber and really reconsider and start making adopting [deaf] dogs cool, then it has all been worth it.&quot; Deaf Dogs Rock looks to continue fighting common misconceptions about deaf dogs and educating anyone who will listen — school children, animal shelters, would-be adopters. Lisa, well, she&#039;s recently adopted another deaf dog named Bud. If you would like to join in on the adoption fun or read deaf dog training tips, visit DeafDogsRock.com. Image: Kristin Guffey MORE FOR YOU TO EXPLORE: Adopting a Deaf Dog Color Discrimination in Dogs Dog Hearing Loss"}]