[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Ways for You and Your Pet to Give Back", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/volunteer-dog-person.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/volunteer-dog-person.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/10-ways-you-and-your-pet-give-back"}, "datePublished": "January 8, 2014", "dateModified": "August 30, 2022", "description": "Are you look for positive ways for you and your pet to give back to your community? Here are 6 ways you and your pet can give back.", "articleBody": "When you give back, you actually receive much more in return. Whether you’re volunteering your time or donating much-needed funds, helping your community can bring priceless feelings of joy, togetherness and fulfillment. And who better to share these warm and fuzzy sentiments with than your four-legged friend? There are a number of ways to volunteer with your pet, from one-time opportunities to long-term commitments. Here are just a few ways you and your pet can give back. Foster a Pet Fostering is one of the best ways you can help homeless pets. By giving a dog or cat a temporary home, you not only save their life, but you also save the life of another dog that the shelter now has room to take in. “Shelters are always looking for people who can foster a dog or cat,” says Dr. Sara Ochoa, a Texas-based veterinarian and consultant for Dog Lab. “These may be animals who have recently had surgery and need a little extra attention, or puppies and kittens they want to stay away from infectious diseases that are commonly seen in the shelter.”  For many shelter animals, a resident pet can be helpful in teaching good house manners. However, be sure to discuss your current pets with the shelter staff to ensure a good match for your household, says Dr. Ochoa. Consider Letting Your Big Dog Be a Blood Donor Just like humans can donate to blood banks, dogs can give this precious gift, as well. Canine blood transfusions can help pups suffering from a number of medical conditions, and donations are always needed. Similar to humans, dogs must be in good health and meet a number of requirements before donating, says Dr. Ochoa. The process is safe for large, healthy dogs, but smaller breeds aren’t eligible. “Small dogs should never donate blood,” says Dr. Ochoa. “There is only a certain amount of blood you can take from a dog without causing them to be very sick; with small dogs, this is not enough for a blood transfusion.” Become a Therapy Team Does your pup always light up the room? You might want to consider becoming a therapy team. Therapy dogs are used to brighten the mood in various environments, from hospitals to schools. The job requires a special type of pup, says Joan Hunter Mayer, a certified professional dog trainer and therapy dog evaluator for Love on a Leash. Mayer volunteers with her own dog, Ringo Starr, and they’re always looking for other qualified canines.    “As a therapy dog evaluator, I’m looking for dogs who enjoy being pet and socializing with people of all ages, sizes and shapes,” she says. “They need to mind their manners in a variety of environments, from a quiet library to a busy hospital.” Regardless of how well-trained your pup already is, specialized therapy dog training is beneficial. “It’s encouraged to participate in a therapy dog class to help get the dog and handler used to being around other teams, and to learn what is expected of them in a professional setting,” says Mayer. Fundraise for a Rescue Between medical bills, housing and supplies, animal shelters and rescues are expensive operations. If you’d like to help, consider starting your own fundraiser. “Creative fundraising comes when you use your talents for something you are passionate about,” says Kathy Warnick, president of the Humane Society of Missouri.   “For example, if you are good at making videos, sewing pet toys or walking dogs, harness those skills to help shelter pets. Your efforts can raise much-needed funds for homeless animals and make a lasting impact on your community,” says Warnick. For a fun, easy fundraiser, Warnick suggests setting out two donation jars at your business, work or next event: one with a picture of a dog and one with a cat. The friendly competition between cat people and dog people will inspire extra donations. Collect Shelter Donations Shelters and rescues go through supplies quickly. To help, consider donating some of their most urgently needed items. “Most shelters and rescues have a ‘wish list’ of needed supplies posted on their website,” says Warnick. “The wish lists may vary between organizations, but most will agree that they always need towels and washcloths for cleaning; sheets and blankets for dog and cat bedding; toys; and non-retractable leashes for walking dogs.” To maximize your donation, try involving  other pet parents in your area. Post flyers at the dog park alerting pet parents of your local shelter’s most needed items, or create an event where everyone can bring their items to the park. You and your furry best friend will have fun dropping off the donations on your way home. Enter a Charity Sporting Event Want to bond with your pup while supporting animals in need? Consider entering a charity sporting event. From low-key dog walk-a-thons to more intense agility competitions, there are many options that support good causes. For example, Kentucky Gallahue and his Goldendoodle, Derby, are regulars on the southern California dog surfing circuit. They frequently volunteer to help new surfers feel more comfortable on their boards, including children and veterans with disabilities. Additionally, the dog surfing competitions benefit animal charities and rescues. “We don’t make money from this—it actually costs us money,” says Gallahue. “We pay to be in the contests, but it’s all for a great cause.” By Monica Weymouth Featured Image: iStock.com/PhotoTalk  "}]