[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Therapy Dogs Can Improve the Emotional Health of Hospital Patients", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/therapy%20dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/therapy%20dog.jpg"}, "author": {"@type": "Person", "name": "JoAnna Pendergrass, DVM", "url": "https://www.petmd.com/author/dr-joanna-pendergrass"}, "keywords": "Dog, General Care, Zoo Emotional Support Animal Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-therapy-dogs-can-improve-emotional-health-hospital-patients"}, "datePublished": "August 31, 2018", "dateModified": "August 30, 2023", "description": "A veterinarian provides insight on how therapy dogs can provide emotional support to hospital patients.", "articleBody": "Dogs bring immeasurable joy to our lives. They can brighten our day when we’re feeling down, encourage us to exercise, and even help us be more social. Outside of their role as pets, dogs can also serve as therapy dogs. Therapy dogs, as defined by the Alliance of Therapy Dogs, “provide psychological or physiological therapy to individuals other than their handlers.” What Do Therapy Dogs Do? Put simply, therapy dogs can help improve a person’s emotional well-being and physical health. It is important to note that therapy dogs are different from service dogs, who are trained to do a specific task, such as detecting low blood sugar levels, for a person with a disability. Therapy dogs work in a variety of locations, such as hospitals, nursing homes and schools. Some of the types of support they provide include: Visiting hospitalized patients Participating in a patient’s physical therapy Helping college students de-stress during final exams Providing emotional support to a child who struggles with reading out loud Therapy dogs can provide numerous physical and emotional benefits to people. Physical benefits include lowering blood pressure and overall pain, and improving cardiovascular health. Emotional benefits include reduced anxiety and loneliness, increased socialization, and reduced depression. Therapy Dogs in Hospitals For many people, the thought of therapy dogs conjures an image of a friendly dog going from room to room, bringing cheer to hospitalized patients. Therapy dogs who work in hospitals provide what is known as Animal-Assisted Therapy (AAT). AAT broadly describes the use of dogs or other animals to help patients recover from, or better manage, their health challenges. Examples of patients who could benefit from AAT include: Patients with cancer Patients in long-term care facilities Patients with chronic diseases Scientific Evidence of Therapy Dogs Helping Patients Several studies have reported the benefits of AAT. For a study published in PLoS ONE, researchers evaluated the emotional and physical benefits of AAT for pediatric oncology patients. Pediatric cancer diagnosis and treatment can take a huge emotional and physical toll on children and can increase their risk of developing mental health illnesses later in life. A sick child’s caregivers often suffer, too. With AAT, the patients in this study experienced many emotional benefits, including reduced stress and anxiety, improved quality of life, a better mood, and improved depressive symptoms. Similarly, the children’s caregivers had less anxiety and stress with AAT. AAT has also been shown to improve the lives of hospital patients with heart failure. These patients can experience a range of emotional and physical stresses, according to a study published in the American Journal of Critical Care. For this study, researchers analyzed physical and emotional changes in heart failure patients after short visits with therapy dogs. They found that anxiety levels were lower in the patients who interacted with therapy dogs than those who did not. The emotional benefits demonstrated in these studies and others indicate that therapy dogs can often serve as emotional therapy dogs for hospital patients. Even with this scientific evidence that therapy dogs can improve hospitalized patients’ emotional well-being, it is reasonable to wonder just how well therapy dogs are accepted among patients and hospital staff. One study, published in the Western Journal of Emergency Medicine, evaluated the acceptance of therapy dogs in emergency rooms by ER staff and patients. The study’s researchers found that most patients and staff accepted the therapy dogs, with over 90 percent believing that therapy dogs should visit ERs. Less than five percent believed that therapy dogs were a danger to patients. Do Therapy Dogs in Hospitals Pose Health Risks? To prevent hospitalized patients from acquiring an infection, hospitals maintain strict standards on sanitation and cleanliness. It is a reasonable concern that therapy dogs could compromise these standards, especially if the dogs are not fully healthy themselves. To address this potential drawback, therapy dogs undergo thorough health checks to ensure they are healthy before visiting hospitals. For example, Therapy Dogs International (TDI), a well-known therapy dog organization, requires that dogs meet the following health requirements before being registered through their organization: Annual veterinary wellness exam within the past year Mandatory 1-, 2- or 3-year rabies vaccine, administered by a veterinarian Initial series of distemper, hepatitis and parvovirus vaccinations Negative fecal exam within the past year Negative heartworm test within the past year (if not on continuous heartworm prevention) or two years (if on continuous dog heartworm medicine) What Does It Take to Become a Therapy Dog? Hospitals do not want therapy dogs who could threaten patient safety (e.g., if they are aggressive or nippy). Therefore, potential therapy dogs undergo temperament testing to determine whether they have the right disposition to handle hospital work. The right disposition includes the following: Physically calm Nonreactive to noises Comfortable around all types of people, especially strangers Several organizations, such as TDI and the Alliance of Therapy Dogs, work with dogs with the potential to become therapy dogs. These dogs undergo intensive therapy dog training. If they successfully complete the therapy dog training, they will be officially certified and registered as therapy dogs. Therapy dogs can work wonders in the lives of hospital patients. When properly trained and vetted, these dogs provide immense emotional benefits to hospital patients, allowing them to feel better about themselves and better manage their health challenges. Image via Photographee.eu/Shutterstock "}]