[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mobile Vet Clinics: What Are They?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/mobile-vet-clinics.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/mobile-vet-clinics.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Wellness exam, Preventative health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/mobile-vet-clinics-what-are-they"}, "datePublished": "December 15, 2016", "dateModified": "August 30, 2022", "description": "Anyone who has ever transported a panicked cat or dog to their veterinarian’s office knows that having a vet come to them could save a lot of anxiety for all parties involved. That’s why more small animal veterinarians around the country are hitting the road to treat pets in the comfort of the animals’ own homes.", "articleBody": "By Samantha Drake Mobile veterinary services for dogs and cats may be best known for providing low-cost spay and neuter services as well as basic medical care, like those deployed by the ASPCA in underserved communities in New York and Los Angeles. Some private practice vets also make house calls to provide end-of-life services for pets. Anyone who has ever transported a panicked cat or dog to their veterinarian’s office, however, knows that having a vet come to them could save a lot of anxiety for all parties (four-legged and otherwise) involved. That’s why more small animal veterinarians around the country are hitting the road to treat cats, dogs, “pocket pets” (such as hamsters and guinea pigs) and the occasional resident of a farm or petting zoo in the comfort of the animals’ own homes. How Do Mobile Vet Clinics Work? For veterinarians, mobile clinics offer the opportunity to observe and treat an animal in its home, which can result in more comprehensive care. “It’s the best way to get a full view of who your pet is,” says Dr. Lisa Aumiller, the owner of HousePaws Mobile Veterinary Service. She launched the mobile service in 2010 with little more than her family car, a stethoscope and a doctor’s bag of supplies. As the practice, based in Mt. Laurel, N.J., expanded, Aumiller traded in her wheels for a retired ambulance. Six years later, she has a small fleet of mobile clinic vehicles stocked with supplies and equipment, 54 staff members and two traditional veterinary hospital locations. Aumiller is also planning to open a third facility. “I think a mobile service can offer almost anything that a traditional office can,” says Aumiller, with exceptions to this including complicated surgeries and hospitalization. Mobile clinics can offer a wide range of in-home services. HousePaws, for example, provides physical exams, vaccinations, blood work and x-rays, as well as behavioral counseling and consultations on nutrition, weight management, allergies, diabetes management and senior health. HousePaws also offers additional services such as euthanasia and whelping assistance, and will even deliver medication and pet food to clients. Most mobile veterinarians do any procedures that require anesthesia, like surgery or dental work, at their affiliated office or hospital, or refer the client to another vet, but some doctors work out of larger mobile clinics that can support basic surgical and dental care. Perhaps the biggest benefit of a mobile clinic for pets—and their anxious owners—is the elimination of a stressful car ride, exposure to strange people and animals, and treatment in a clinical setting. Mobile veterinary services also offer flexible hours (which may include nights and weekends), accessibility for pet owners who are elderly or have mobility issues and the opportunity to build a lasting relationship with the whole family.   One drawback may be that mobile vet clinics charge an extra fee to cover their travel expenses, such as gas. On the other hand, mobile vets tend to spend more time with each animal and interact more with the family, which can make up for the added expense, says Aumiller. In addition, her practice sets up multiple appointments during “community days” at apartment buildings and retirement homes, which help defray the travel fees, she says. The Benefits of In-Home Treatment The ability to see a pet behaving naturally in its own environment, including what it eats and how it interacts with its people and other animals in the house, is invaluable. “I think you can give more thorough care at home, Aumiller says. “You get to see things that you wouldn’t see in a traditional setting.” For example, while examining a cat living in a multi-feline home, Aumiller noticed another cat having an asthma attack and was able to diagnose and treat the pet then and there. She’s also detected leg problems in dogs by being able to observe the canine walking around its home.  Dr. Lisa J. McIntyre, the owner of Welcome Waggin’ Mobile Veterinary Service, agrees that the opportunity to see first-hand how a pet lives can be very helpful, if only to gauge the accuracy of what pet parents say about how much food they give their pets. “They say, ‘I only feed my dog a cup of food a day,’ and then they show you the size of the cup!” McIntyre launched her practice in 2007 and provides pet care in the Naperville, Ill., area with two additional vets. Because the practice has no brick-and-mortar facility, she refers all surgeries and procedures that require anesthesia to local veterinarians with their own offices. Treating pets in their homes has also helped establish strong emotional connections with the animals and their families because the vets can spend more time with them, McIntyre says. Being able to take her time and assess an animal in a low-stress environment also results in more productive exams, she adds. “In a sense, it’s made us better vets.” All clients are asked to do is provide a well-lit area, preferably with a rug or soft surface, where she can examine the pet. “We try to make it as comfortable as possible,” McIntyre says.   Going The Extra Mile It’s no secret that animals often hide when they’re ill or injured, so sometimes the vets have to go the extra mile, says McIntyre, such as when one of her fellow vets had to climb over a washing machine in order to assess a sick cat. On occasion, mobile veterinarians also get the chance to help not just a pet, but an entire family. McIntyre recounts being called to euthanize a woman’s ailing, 15-year-old Dalmatian. The dog had belonged to the woman’s son who was killed by a drunk driver several years before. McIntyre says the woman’s family and friends filled the home to help her say goodbye to her son’s beloved pet. It was a moving experience that likely wouldn’t have occurred in a traditional vet office. Photo courtesy: HousePaws Mobile Veterinary Service"}]