[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Get Children to Participate in Pet Care", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Kids%20and%20Responsibility.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Kids%20and%20Responsibility.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-to-get-children-to-participate-in-pet-care"}, "datePublished": "November 11, 2016", "dateModified": "August 30, 2022", "description": "Your kids begged for a dog and you obliged, believing their promises they would care for the pet. So, what can you do now that you are doing all of the work? Don’t worry. Our experts have answers.", "articleBody": "By Dorri Olds Your kids begged for a dog and you obliged, believing their promises they would care for the pet. So, what can you do now that you are doing all of the work? Don’t worry. Our experts have answers. The Behavioral Chart One approach — especially for younger children — is to create a behavioral chart. “Children do the best with limits and consequences but not if you become emotional,” notes therapist and author Judith Belmont. “A chart can be a successful tool.” Basically, you give your child very specific responsibilities. “Spell out what you want them to do, for example, walk the dog after dinner Monday, Wednesday and Friday; feed the dog in the morning on Tuesdays and Thursdays. Check off when they’ve done each task. When a certain number of boxes are checked, they have earned something. For example, five checks and you take them to a movie.” Coming Up Against Resistance Okay, so what if they still won’t do what is expected of them? “There needs to be a consequence,” says Janette Sasson Edgette, Psy.D, an author and licensed clinical psychologist who specializes in family counseling. A dawdling child who consistently misses the school bus might be required to pay back her mom for having to drive her to school. For slacking on pet responsibilities, “pay back time can include helping with paperwork at the parent’s office, or donating time to the parent’s favorite charity,” suggests Sasson Edgette. “If they are older, have them run errands such as taking the pet to the vet or going to the grocery store. I call these types of repercussions ‘consequences of inconvenience.’” These repercussions don’t need to be harsh and they shouldn’t be done to punish. “It’s as if you’re saying, ‘Well, that was an unfortunate decision. As you know, here’s what happens now.’ It works to motivate because the next time she’s about to be casual about time in the morning, she remembers having to work over the weekend.” Don’t Pick Up the Slack “If at any time the chores are neglected,” adds psychotherapist Tina B. Tessina, Ph.D., “the penalties should be the same as for not doing homework or neglecting other household chores. Be firm. Until they have completed the tasks do not allow the child certain luxuries, like the use of electronic devices, their smart phone or watching TV. If you pick up the slack you’re teaching your child to be irresponsible.” Positive and Negative Consequences “Children can adhere to a behavior to avoid a negative consequence,” says Belmont. “Avoiding a negative consequence is knowing ahead what to expect. If it is raining and you bring your umbrella, you can open your umbrella and stay dry; if you don’t bring your umbrella, you will get wet. That is a negative consequence directly related to your behavior. You want to teach a child responsibility. You give them a choice. They can avoid a consequence by doing a positive behavior.” What about Teens? “Teenagers always want something and they want it very badly,” notes social worker Tara Kemp. “It may be they want to go to a party, or to the mall for new clothes. So, it is up to you to say, ‘Yes, you can do those things, as soon as you walk the dog.’ It is an unavoidable part of parenting to set limits for your kids. That is your job.”"}]