[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/1xuh3nn9hn", "@type": "VideoObject", "duration": "PT1M59S", "name": "5327091836001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/a2248b93a57dddb2103d20fc8d08f31365c19820.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/1xuh3nn9hn", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/a7abecb161dbc15e8b04339ade60b60bb576cfa2.m3u8", "transcript": "Although it is far from appealing. Still eating or copper aphasia is a relatively common behavior seen in puppies. However, it should be addressed appropriately and quickly to prevent it from becoming a recurring habit as your dog ages at birth. It is natural for a mother to eat her puppy stool both to keep her litters den clean and to protect her puppies from predators.\n\nThat may be drawn to the scent of the puppy stool though she will stop this behavior on her own. Once the puppies are weaned her puppies may pick up on it and continue the behavior as they mature. This combined with a natural puppy curiosity to explore things with their mouths is often how Cooper aphasia begins in dogs. Additionally stool eating can be a sign of other underlying issues, including poor digestion boredom stress, or even hunger.\n\nSome puppies will also eat stool as an attention seeking behavior if their owner has a strong reaction to it either to hide the evidence or to get some extra attention. Ensure that your puppy is consistently fed a high quality food that is formulated for puppies and includes the protein, vitamins, and minerals that he needs for normal growth. Speak with your veterinarian about your puppy's diet, especially if you believe your puppy has any digestive issues. Signs of this might include watery stool or stool with large pieces when they just have food and be diligent cleaning up after your puppy eliminates and never give him a chance to play with eat or inspect his stool after he goes to the bathroom distract your puppy from his stool by rewarding him with verbal encouragement or a treat for a job well done.\n\nAs soon as he goes and if necessary, take your puppy inside before cleaning up his stool. It's also important to keep your puppy on a leash whenever you walk in to prevent him from smelling and eating the stool of other animals. Some parasites and illnesses can be transmitted through stool. So it's important to keep your puppy as far away from it as possible.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/how-should-my-dogs-poop-look?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Should My Dog&#039;s Poop Look Like?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-pooping-shutterstock_194407178.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-pooping-shutterstock_194407178.jpg"}, "author": {"@type": "Person", "name": "Jessica Vogelsang, DVM", "url": "https://www.petmd.com/author/dr-jessica-vogelsang"}, "keywords": "Dog, General Care, Digestive health, Symptom Checker, Normal vs. Abnormal Poop", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-should-my-dogs-poop-look"}, "datePublished": "September 2, 2015", "dateModified": "September 12, 2023", "description": "Since dogs can’t talk, we spend a great deal of time trying to interpret other signs of their health. How is he acting? How is his appetite? And how is his poop? Your dog&#039;s poop can give your vet a tremendous amount of information about your dog’s digestive and overall health, which is why your vet&#039;s office will routinely ask you to bring a fecal sample along to office visits.", "articleBody": "Since dogs can’t talk, we spend a great deal of time trying to interpret other signs of their health. How is he acting? How is his appetite? And how is his poop? Your dog&#039;s poop can give your vet a tremendous amount of information about your dog’s digestive and overall health, which is why your vet&#039;s office will routinely ask you to bring a fecal sample along to office visits. Even if you&#039;re not planning on going to the vet, as a pet parents, it&#039;s a good idea to pay attention to your dog&#039;s poop. Is it changing color or consistency? Does it smell foul, or contain streaks of blood or mucus? Are some variations in a pet’s stool normal? Is there such a thing as a stool emergency? Here&#039;s what you need to know about your dog&#039;s poop. The Four C’s of Poop When it comes to evaluating poop, your vet will be looking for the four C&#039;s: color, consistency, content, and coating. Color Under normal circumstances, dog stool is a chocolate-brown color. During normal digestion, the gallbladder releases bile to aid in the breakdown of food. Bilirubin is a pigment in bile that affects stool color. The stool may have some minor deviations in color due to diet, hydration, or dyes, but you shouldn’t see substantial changes. Abnormal color patterns that should catch your eye include: Black stool: bleeding high up in the digestive tract may result in tar-colored stoolRed streaks: this indicates bleeding in the lower digestive tractGrey or yellow stools: may indicate issues with the pancreas, liver, or gallbladderIf abnormal colors persist for more than two stools, call your veterinarian. Consistency Consistency is closely connected to diet and can tell a lot about your dog&#039;s overall health. When it comes to evaluating consistency, some veterinarians use a numerical system to score the consistency of a pet’s stool. The fecal scoring system assigns a value to the stool from 1 to 7, where 1 represents very hard pellets and 7 is a puddle. The ideal stool is a 2: a firm, segmented stool that&#039;s shaped like a caterpillar and feels like Play-Doh when pressed and holds its form. Formless stool means the large intestine is not properly re-absorbing water; hard stool can be painful to pass and may indicate dehydration. The occasional soft or hard stool isn’t a cause for concern, especially if the pet is normal otherwise, but if it persists for more than a day, call your vet. Content Vets also look at the actual content of your dog&#039;s poop. The inside of a stool shouldn’t look any different from the rest of it, so finding any of the following in your dog&#039;s poop may signal an issue: Worms: including long and skinny roundworms, or little rice-shaped tapeworm segments. Remember, stool that has been outside for hours may have little creatures in it that weren’t there at the outset, so it’s important to collect a fresh sample. Veterinarians run additional fecal tests to check for many parasite species. Even when the fecal sample looks normal, microscopic parasitic eggs may be present.Foreign materials: grass, sock bits, plastic, rocks. Pica, the eating of non-food items, is not uncommon in dogs, and sometimes you don’t know that your dog is digging into the trash until you find a bit of Ziploc in the stool.Fur: big clumps of fur in the stool indicate overgrooming, which can happen secondary to stress, allergies, skin disease, or even boredom.Coating Poop should not have a coating or a film over it. If you’re picking up your pet’s stool off the grass, there shouldn’t be any sort of trail left behind. A coating of mucous often accompanies large bowel inflammation, and often occurs concurrently with diarrhea. Small streaks of bright red blood may also show up on occasion, usually secondary to straining to defecate. A single red streak isn&#039;t a cause for concern, but repeated red streaks should trigger a call to your vet.  Fortunately, the vast majority of issues related to dog poop resolve on their own in 24 hours. If your dog is eating, drinking, and behaving normally, giving her a day to sort herself out should be fine. However, if he or she stops eating, seems depressed, or continues to have digestive symptoms after a day, it’s time to call the vet. You Might Also Like:"}]