[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Give a Dog a Pill Using Foods That Are Safe", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Two-dogs-begging-at-kitchen-countertop.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Two-dogs-begging-at-kitchen-countertop.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Over the counter medication, Prescription medication, General Care, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/how-give-dog-pill-using-foods-are-safe"}, "datePublished": "May 22, 2019", "dateModified": "August 30, 2022", "description": "Learn how to give dogs pills safely so that you can make sure your pup always gets their prescription pet medications.", "articleBody": "Reviewed for accuracy on May 22, 2019, by Dr. Katie Grzyb, DVM When you’re trying to figure how to give a dog a pill, the truth is that there’s no one-size-fits-all solution. Some dogs are very easy to pill, while others will spit out the pill 50 times before you get them to swallow it. Pet parents will often use food to get reluctant pets to take their prescription pet medication. But did you know that certain foods can be unsafe for your dog or inadvertently affect the potency of the medication?  If you need to administer medication to your pet, check out this list of foods to avoid when giving dogs pills. Not All Foods Are Safe for Giving Pills to Dogs While it may be tempting to just use any food you have around to get your pup to eat their medication, that is not always a safe bet. Different types of foods can have different impacts on the efficacy of the medication, and they can have detrimental health impacts for dogs with certain conditions. Always be sure to talk to your veterinarian prior to choosing a type of food for delivering your pet’s medications so that you can be sure it is safe. Bananas Bananas can be an acceptable way to hide pills for your pet, but they are high in sugar, says integrative veterinarian Dr. Carol Osborne, DVM, who owns Chagrin Falls Veterinary Center &amp; Pet Clinic. “If your dog is a diabetic or is suffering from [a particular] illness, bananas may not be the best choice,” Dr. Osborne says.  Bananas should also not be used for dogs that have potassium-regulation problems or are on prescription pet medication for blood pressure or heart disease, says Dr. Jess Trimble, DVM, Head of Health at Fuzzy Pet Health. “The potassium in bananas has a possibility of affecting the effectiveness of certain medications,” Dr. Trimble explains. Dairy Products Cheese might work for some dog medications, especially if you use softer cheeses that you can mold around pills, says Dr. Trimble. “It’s important to give a small amount to your pet first before trying it with a pill—some pets are lactose intolerant or can have vomiting and diarrhea from dairy products,” says Dr. Trimble. “Cheese can also be high in fat too, so remember to use only enough to get the pill covered and decrease [the number of] other treats.”   The same goes for cream cheese. “Cream cheese, as a dairy product, has a higher likelihood of causing stomach upset, so use the smallest amount possible to hide the pill—if you have to use more than ½ teaspoon, find a different method,” advises Dr. Trimble. If your pet should avoid high-fat food as a part of their illness, then you may want to skip the cheese completely. Also keep in mind that dairy products can negatively affect other medications, like dog antibiotics. “Calcium-rich foods, like dairy products, can interfere with some medications,” says Dr. Trimble. “Specifically, some antibiotics can bind to the calcium in dairy products; once bound to the calcium, the antibiotics can no longer be absorbed in the intestines, making the antibiotic useless.” So, if you’re giving prescription pet antibiotics, avoid using cheese, yogurt or other calcium-rich foods to hide the pills.  Creamy Peanut Butter Peanut butter can sometimes be a good option for giving a dog pills, and the creamy kind can be more effective. “Peanut butter especially can be tough for pets to lick off and spit out the pill—just check the label to ensure there is no xylitol or other sugar substitutes starting in ‘xy-,’ as those sugar substitutes are toxic to dogs,” says Dr. Trimble. You should not use peanut butter if your pet needs to avoid high-fat foods, says Dr. Osborne. Raw and Cooked Meat Using meats to hide pills can be tricky. “Never use raw meats to hide pills—the risk of bacterial contamination is high,” says Dr. Trimble. “A bit of cooked, plain chicken or a small meatball made of cooked, drained ground beef or turkey can work well.” Deli and lunch meats, sausages and hotdogs are never good options, as they are very high in salt and preservatives, according to Dr. Osborne. Tips for Giving Dogs Their Pills Safely Giving your dog their medication doesn’t always have to be stressful for everyone involved. Here are a few tips for effectively administering your pet’s medication safely. Don’t Smash the Pills Into a Powder While it may seem logical to grind a pill up into a powder and sprinkle it over your pup’s dog food, this can actually be counterproductive. “Many pills actually taste terrible, [and] some are coated in something to help them not taste quite so awful as your pet swallows them,” says Dr. Trimble. Not only that, but crushing some pills can make them ineffective. “Some also have coatings to allow for extended release, or release into different parts of their intestines—crushing the pill will take away that coating,” says Dr. Trimble. Use Dog Pill Pockets While pill pockets for dogs might not always be the healthiest option, they offer a convenient, pet-friendly choice for many pet owners to hide and successfully administer medications to their pets, says Dr. Osborne. Pill pockets are specifically designed to be tasty and appealing to dogs. They come in dozens of flavors, making it convenient to rotate flavors and find what your pet’s favorite is, says Dr. Trimble. “Plus, with pill pockets, you don’t have to worry about fat, sodium and artificial sugars,” he adds. When choosing a pill pocket, however, Dr. Osborne recommends reading the labels to pick a brand that isn’t too high in calories.  There are products, like Greenies Pill Pockets, that can make the process of giving dogs their pills a lot more efficient and effective. You’ll also have peace of mind in knowing that none of the ingredients will affect your dog or their medication. Try Your Dog’s Usual Wet Food If you have a pet who gobbles down canned dog food without even thinking about it, you can try making a tiny meatball out of their wet food and hiding the pill inside, says Dr. Trimble. However, this can backfire if you have a picky pet or one that is very good at finding pills hidden inside food. “Some pets will become averse to foods when medications are placed in them,” Dr. Trimble says. For pets with an amazing ability to discover hidden pills, avoid using their own food and only give medications outside of the meal to avoid any negative associations with their mealtime or their regular food, advises Dr. Trimble. Work With Your Veterinarian If your dog is a pill-dodging maverick, then it might be time to talk with your veterinarian about working with a pet pharmacy for alternative solutions. Dr. Trimble recommends talking to your veterinarian about compounding pharmacies. “Pharmacies can take pills and turn them into liquids, chewables and other forms that taste like fish, peanut butter, bacon and other delicious flavors,” Dr. Trimble says. By: Diana Bocco Featured Image: iStock.com/fotyma"}]