[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "12 Hurricane Safety Tips for Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/cat.crate_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/cat.crate_.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_hurricane_safety_tips"}, "datePublished": "August 8, 2022", "dateModified": "March 16, 2023", "description": "Hurricanes are stressful for both humans and pets. By creating a plan in advance you’ll be ready to step into action once disaster hits, keeping you and your pets safe.", "articleBody": "Many people who live in areas prone to hurricanes assume these natural disasters will never come their way. However, an average of six hurricanes hit the United States each year and many people are caught unprepared. The news of a looming hurricane is stressful, so it’s important to plan ahead to make things as easy as possible for you and your pets during and after the storm. How To Prepare for a Hurricane with Pets Preparing in advance of a hurricane is key. It’s simple, quick, and will save you worry when it comes time to put your hurricane plan into action. Things to consider when preparing for a hurricane with pets include: A list of miscellaneous supplies you and your pet might need at home or at a shelter in case you need to evacuate. A “bug-out bag” for your pet, or a bag of survival supplies with food, water, and medications. A list of the closest locations of pet-friendly shelters and regional animal emergency centers. What To Include in a Pet Emergency Kit When putting together your pet’s bug-out bag or emergency kit, consider what they will need for at least one week if your home is without power or running water. If you are staying in a shelter, keep in mind that your pets will be confined for a long period of time and may not be able to readily go outside to eliminate. A hurricane emergency kit for your pet should include: Enough food and bottled water to last one week or more Beware of your pet drinking flood water since it’s often contaminated with mold and bacteria, making it unsafe to drink. If you can’t drink it, neither should your pet. Pee pads, litter boxes, poop bags, and paper towels for cleanup. Medical records, name of veterinarian, medication, feeding schedule, and current photos of your pet(s). These items can be particularly important if your pets need to be boarded, or if you become separated from them.  Toys or treats to ease stress. A 1- to 2-month supply of pet medications is needed, as they may be difficult or impossible to find during and after a hurricane.  Roomy carriers that allow your pet to move around, ensure safety, and help them to feel more comfortable during their confinement. Sturdy, extra leashes that have reflective tape or flashlights. A hand-powered can opener to open any food cans. Pet first aid kit to help stabilize your pet in its case if injured, until veterinary care is found. Make Sure Your Pet Is Microchipped Microchipping is a minor procedure (much like a vaccine) implanted at a veterinary office and can provide permanent identification for your pet, which will be critical to finding them when lost during a hurricane.  Microchipping involves inserting a very small chip under your pet’s skin. When scanned with a special reader, the chip provides an identification number. This identification number is entered into a national database allowing the office to contact you. Ensure your pet is microchipped, and double check your contact information to make sure it’s up to date with the microchip company. This will ensure that you are reunited with your animal(s) in case of separation during a hurricane. Make Sure Your Pet Is Current on Vaccinations During a hurricane, your pet might be exposed to contaminated flood waters and diseases such as leptospirosis or respiratory diseases such as Bordetella. Make sure your pets are up to date on annual vaccinations—especially during hurricane season. Ask your veterinarian if there are any additional vaccines that may be appropriate for your pet, especially if you live in an area where natural disasters are more common.  Make Sure You Have Enough Pet Medications Veterinary clinics may be closed after a storm, and delivery may be interrupted. Make sure your bug-out bag includes a 1- to 2-month supply of your pet’s medications, especially if you must spend an extended period of time away from home. Don’t forget your pet’s routine preventative medications for heartworm prevention and fleas and ticks.  Fill Out a Pet Emergency Sticker for Your Front Door After a natural disaster, it’s common for rescuers to go door-to-door looking for people and pets in need of help. If you make it clear to rescuers that pets live inside your home—especially if for any reason you evacuated without them—this may ensure they receive help more quickly. Please keep this important fact in mind: If it’s not safe for you to stay in your home, it’s not safe for your pets either. So, make every possible effort not to leave them behind. Choose a Designated Caregiver Having a backup plan in case of any emergency is always a good idea. You can choose a neighbor or family member to be your pet’s designated caregiver in case something happens to you. Make sure they have a list of your pet’s routine, food, and medications. Know Your Pet-Friendly Evacuation Center Not all evacuation centers accept pets. FEMA offers an app that shows locations of nearby pet-friendly shelters. Don’t assume that all shelters will let you bring in your pet. Know before you go! Keep Your Pets Safe When Evacuating In the chaos and stress of evacuating, pets may be separated from their families. Be sure to load cats and small dogs into carriers in case you need to evacuate. Be sure to tape an envelope to each carrier with your pet’s information and medical records for easy identification. Keep bigger dogs leashed or in crates so they are ready to go if you need to evacuate. Prepare for Possible Injuries Unfortunately, injuries often occur during natural disasters, both to people and pets. Make sure you have a well-stocked first-aid kit and identify local veterinary emergency offices, in case your pet is injured and needs medical attention. Keep in mind that clinics will likely be overwhelmed with caring for other animals injured in the storm, so be prepared to wait. Keep Pets Calm During Storm Storms are typically upsetting to pets. If you usually give your animals anti-anxiety medications during a routine storm, they will likely need them during a hurricane. Be sure to stock up on those in advance. Remember that our pets often look to us for comfort and security. While hurricanes are stressful and chaotic, do your best to remain calm so your pet feels safe too. No one ever thinks they will be caught up in a natural disaster such as a hurricane. However, planning and preparation before the storm will make things easier for you and your pet during and after the storm. Featured Image: iStock.com/Lightspruch"}]