[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pesky Summertime Pests", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-mosquito.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-mosquito.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Hot weather, Flea, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_multi_summer_diseases"}, "datePublished": "May 21, 2009", "dateModified": "August 30, 2022", "description": "Summer is here, and with it comes fun in the sun, camping and hiking, and trips to the lake side. But along with this season of fun and relaxation comes the usual summertime pests: fleas, ticks, and mosquitoes.", "articleBody": "Plan now for a fun and healthy summer without fleas, ticks, and the like.   Summer is here, and with it comes fun in the sun, camping and hiking, and trips to the lake side. But along with this season of fun and relaxation comes the usual summertime pests. Fleas, ticks, and mosquitoes are all visual reminders of the itchy woes we and our pets have to deal with, but there are also the unseen pests. Waterborne parasites and bacterial infections, to mention just two, are also typical summertime plagues. While we don&#039;t want to get your head spinning from worrying too much about all the things there are to worry about, we do want you to know what you and your pets are up against, and what you might be able to do to mitigate any ill effects. As G.I Joe would say: &quot;Knowing is half the battle.&quot; Fleas  These pests are nearly impossible to avoid for an entire season. Even with shampoos, collars, powders and sprays, your pet may still end up with fleas. The flea life cycle includes the adult flea, eggs, larva and pupa. The adult fleas are responsible for the biting that leads to itching, but cannot survive long if they are not on the pet, and once they lay their eggs they fall off the pet. Fleas also lay their eggs in shady areas outside and around the house. Most owners first notice frequent and severe itching and scratching, hair loss, and scabs on their pet. Many times the hind end is affected more than the front of the body or the head. Other side effects include anemia, tapeworm infection (a parasite which finds an intermediate host in the flea), pruritis (intense itching with inflamed skin), and hypersensitivity. There is also plague, and in cats, Rickettsia felis, and Bartonella henselae. The best way to check for fleas is with a flea comb. Frequent bathing and combing are essential components of any flea treatment program. To learn more about some of the natural methods for controllling fleas, see our article here. Ticks  A lovely day out in the woods, communing with nature, breathing fresh air. These are the joys of summer. Unfortunately, ticks like these spots, too, and they don&#039;t mind hanging around to wait for warm blooded travelers like you and your pet to hitch a ride on. Ticks have a hard-backed shield that can be felt as small bumps during regular petting. They are also easily visible when the fur is parted. Side effects include blood loss anemia, hypersensitivity, pruritis, and damage to the lymphatic, immune, and nervous systems. Some of the more serious diseases that ticks can transmit are the Rocky Mountain spotted fever, Lyme disease, ehrlichiosis, and babesiosis. If you will be spending time in grassy or wooded areas with your pet, be sure to do a tick inspection daily so that the tick can be removed before damage can be done. If you don&#039;t know how to remove a tick the proper way, make sure to become familiar with the proper technique before doing it. You don&#039;t want to end up with a worse situation because of improper removal. There are a few natural methods for avoiding ticks. Read more about them here. Mosquitoes  Even your indoor pets are at risk for some of the miseries brought on by mosquitoes, since mosquitoes can still can get inside on occasion and can bite through screens on windows, where cats tend to rest. Of course, mosquitoes cause itchy bumps, and that is painful enough, but there are also some serious and life-threatening diseases to be aware of. Heartworm, a roundworm that can infect both cats and dogs, is a silent killer that can be easily treated if caught in time. Two mosquito-borne diseases that affect both humans and domestic animals are the Saint Louis Encephalitis (SLE), which attacks the brain, and the West Nile Virus (WNV). Tapeworms (Cestodiasis)  These little buggers cause itching in a most unfortunate spot. So if you notice that your dog or cat is dragging its hind end across the floor, or licking its anus more than usual, you may have a case of tapeworms. Tapeworm species can include Taenia, Dipylidium Caninum, Echinococcus, and Mesocestoides. Pieces of the worm may or may not be visible in the feces, so if you suspect an infestation of this parasite, the best you can do is take your pet to the veterinarian to have a fecal examination done. Treatment to destroy tapeworms is critical to avoid transmission to humans (typically children) and to avert damage to your pet&#039;s body. Tapeworms are usually picked up through fleas, when an animal ingests an infected flea, and when animals ingest smaller wild animals that are infected, such as rabbits, birds or rodents.  Botfly  Also called the Cuterebra, the botfly hangs out in grass, latching onto warm blooded animals that are passing through. Symptoms of botfly infection include seizures, aggression, blindness, and warbles (or lumps) in the skin where the botfly has taken up residence. In cats, the cuterebra larva typically travels to the brain. Sarcoptes Scabiei Mite  Most prevalent in the summer months, the condition caused by this mite, also referred to as scabies or mange, is more of a nuisance than a danger. Of course, any condition that results in open wounds is dangerous because it opens the body to bacterial invasion. The most common risk of exposure comes from contact with other animals and outdoor activities. Treatment is the same as treating for fleas, but more aggressive, with quarantining, and thorough baths. Aquatic and Fungal Parasites  At some point in the summer, it gets too hot to do anything but find a body of water to cool the body in. While we would never dissuade you from doing that, we do want you to be an informed swimmer. One type of waterborne parasite, the Heterobilharzia americanum, a flatworm, uses water snails as their intermediate hosts until they are big enough to go out in search of a larger, warmer blooded host. Symptoms can range from relatively mild, like diarrhea and itching, to severe organ and intestinal damage. This is most common in southern waters, and is most likely to affect sporting dogs that fetch game in wet and wooded areas, but it can infect anyone who swims in waters that are contaminated with this parasite. Another type of parasitic bacteria that is picked up in wet, subtropical areas is the Leptospira interrogans, a corkscrew shaped bacteria that burrows into the skin and spreads through the bloodstream. On the other side of the country, where the climate is drier, the Coccidioides immitis is the culprit for a host of nasty conditions. Fungal spores that behave like parasites, they are spread when the dirt they live in is disturbed by rain or digging, and the wind picks them up to disperse them. They are then inhaled or ingested. Diseases that result from this infection include San Joaquin Valley Fever, California Fever, cocci, and desert fever. And last, but not even close to least, is the Aspergillus mold, an opportunistic mold that grows in grass clippings and dust. Like the cocci fungus, it also enters through the nasal passages. - -  Hopefully, this has not scared you into another &quot;stay-cation&quot; this summer. We wouldn&#039;t want you and your pets to stay cooped up for fear of what is out there. With some vigilance and planning, you will find the end of summer coming much too soon again, and we will be here, to help you prepare for the fun of the fall season. Image: ubephot / via Flickr"}]