[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "If Pets Could Talk: A Heartwarming Letter from Dog to Friend", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/evr_dg_if_pets_could_talk"}, "datePublished": "March 1, 2011", "dateModified": "August 30, 2022", "description": "Do pets grieve the passing of their human friends? The answer is easy if you understand the message of this story. If pets could talk, this is what they would say …", "articleBody": "By T. J. Dunn, Jr., DVM  Do pets grieve the passing of their human friends? The answer is easy if you understand the message of this story. If pets could talk, this is what they would say … I’m waiting for you! Where did you go? Since that day when the whole family was upset and crying, and you weren&#039;t there for our evening walk, I’ve had an empty feeling inside me and all I want to do is find you. Now all I have are memories because you just aren&#039;t where you always used to be. I remember how you and I would be the first ones up in the morning … we would take our walk before all the other people and cars would wake up. You and me, the soft morning sunlight and a chorus of birds happily announcing the arrival of another new day … that’s how every day would start. Now I walk alone when the family lets me out. Sometimes we’d go one way, up the hill to the old cemetery under the broad, outstretched arms of the big White Pine trees. Some days you’d pick the other way and down the road we’d hike to Eddy Creek where I could swim and look for frogs. I never knew which way you were going to choose, you always made me guess and sometimes I’d guess wrong and you’d say, &quot;No. We’re going this way today.&quot; Those walks we took were our private times together. I got really excited before our walks because you always let me beI&#039;ll wait here for you. myself. You let me run and follow the scent trails of other animals. You let me dig up things that smelled good. You let me carry sticks in my mouth just because it felt good. I think you knew how proud I was whenever I could prance about with a useless old stick in my mouth. Sometimes I’d drop it at your feet and you’d pretend you didn’t know what to do with it. You’d tease me and ask, &quot;What’s this for?  What do you want me to do with this ole stick?&quot; I’d dance around and bark and crouch really low and you’d say, &quot;Oh, I see&quot; and you’d send it flying through the air for me to fetch. You knew I especially liked it when you’d throw a stick into Eddy Creek and I’d have to do some fancy swimming to retrieve it before it was carried off around the bend. I liked Eddy Creek, even when you’d tell me to lie down under the big willow tree for long naps while you worked your newest homemade trout fly across the water’s surface. I liked those naps and you liked those smelly little trout we’d take home for supper. I liked waiting for you back then because I always knew we’d play again tomorrow. Where did you go? I’m waiting for you! Ever since that awful night so long ago when you didn’t take me for our evening walk through the yard, everything has been so different and strange. Where did you go? The family lets me out the door now, early like when you and I use to have our walks, but now all I do is walk by myself up to the old cemetery.   I’ve given up visiting Eddy Creek in the morning. It’s too quiet there and I don’t see the little trout anymore. For a long time after you were gone I used to think I could still see you there at the water&#039;s edge with your teeth showing, your brown straw hat shading your eyes and your fly line looping over the water. I’d be so happy to see you I’d jump up and run to you… but you’d be gone when I’d get to the creek. I think the birds have left too because I don’t hear their happy songs celebrating the misty mornings like they used to when we were together.   The only place I feel like I’m close to you, where I think I can still feel your hand on my head like I did when I sat next to your reading chair, is when I sit near the stone with your name on it. That’s the only place I feel close to you now, where it feels like you are close to me. But that’s okay because I have lots to think about while I’m waiting for you. Sometimes I think back to my first day with our family. I was happy and afraid at the same time and very curious about my new surroundings that were to be my home. Everyone was busy rubbing my ears and patting my head, picking me up and clapping their hands to get my attention.   Finally, I found you, quietly sitting in your chair reading. It looked safe there by your side, so I sat there, too. I felt your gentle hand rub my cheek and all you said was a soft &quot;Good boy&quot;. Then you said to the rest of the family, &quot;I think he just needs to rest now&quot;.  From then on I always felt safe next to you.  You are my true friend. Maybe that’s why I spend every day here … waiting for you. I know you’re here. I just don’t know why we can’t play anymore. Where did you go? Sometimes I hear myself whine and sigh because I miss you so much … I wonder if you hear me. I can’t see you or hear you or smell you, but you must be near because this is the only place I feel safe. So I’ll keep coming here to be with you, I’ll sit by the rock with your name on it and remember all the fun we had together. Deep inside me I know we will have more walks to take again someday. We’ll turn left at the road and hike down the hill to Eddy Creek. You’ll patiently tie on your newest trout fly and I’ll be lying under the willow tree watching you. Until then, I promise you, with all the loyalty in my heart, I’ll stay right here so you can find me. I&#039;ll be next to the rock with your name on it, waiting for you. ***   Are you struggling with thoughts of having to put a beloved pet to sleep? Take a look at a description of what to expect when &quot;that day&quot; does come, written by Dr. Dunn.   Image: TheGiantVermin / via Flickr  "}]