[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Common Emergencies", "item": "https://www.petmd.com/dog/emergency/common-emergencies"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tinsel Is the Holiday Safety Hazard Pet Parents Need to Know About", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Common Emergencies", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/cat-under-christmas-tree.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/cat-under-christmas-tree.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Emergency, Cat, Christmas", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/common-emergencies/holiday-pet-safety-hazard-tinsel"}, "datePublished": "November 16, 2018", "dateModified": "November 11, 2022", "description": "Keeping tinsel out of your pet’s reach will help you avoid a pet safety emergency during the holidays. Here&#039;s why tinsel is so dangerous to your pet and how you can protect them.", "articleBody": "It’s tempting to go all-out when decking the halls for Christmas, but pet parents need to be mindful of a few holiday hazards. Cats and dogs—especially younger animals—are inquisitive, and the holiday season brings all kinds of new things into the household, from trees and decorations to packaging and new foods. All of these have their own inherent dangers, but one pet safety risk that’s commonly overlooked is tinsel. But what makes tinsel so dangerous? Here’s what you need to know—and why you should skip trimming your tree with this shimmering decoration. What Is Tinsel? Tinsel refers to the strands of shiny plastic or metallic decorations that mimic bits of ice that many of us love to use on our trees and wreaths. Sometimes it comes as individual strands, and other times it comes in longer ropes. Silver used to be the “standard” color, but in recent years gold, blue, red, and green tinsel have become increasingly popular. Why Tinsel Is Dangerous to Pets Tinsel is incredibly dangerous to both dogs and cats, as well as other household pets who might find it intriguing. Often, the animal starts out playing with the shiny tinsel. This exploration then involves the mouth … and then your pet winds up swallowing it. Tinsel strands are difficult to chew and do not break down in the gastrointestinal tract. They are surprisingly strong and can become lodged under the tongue or within the stomach or intestine, where they can cause an obstruction or cut through the lining of the digestive tract. For some pets, tinsel will head down the “wrong pipe,” causing them to choke and cough. With luck, they are able to actually cough it up and out—eliminating the problem. But sometimes the tinsel remains in the respiratory tract, leading to continued coughing and breathing problems. What To Do If Your Pet Swallows Tinsel So, what happens after tinsel is swallowed? If you’re really lucky, nothing, and your pet simply has some shiny poop a few days later. However, if the tinsel gets hung up anywhere along the way—under the tongue, balled up within the stomach, or strung out in the intestinal tract—we have a problem, Houston. This is a situation veterinarians refer to as a gastrointestinal “foreign body”—something stuck in the digestive tract that doesn’t belong there. Some animals will have only mild signs (or no signs at all), at least to begin with, but other pets quickly become markedly ill. Signs of tinsel ingestion can include: Vomiting Poor appetite Abdominal pain Diarrhea Straining to poop or not pooping at all Lethargy or other changes in behavior Call your veterinarian for advice if you think your fur baby may have eaten tinsel. The sooner a vet sees your pet, the better they can help—so don’t waste any time. Your vet will usually do some testing, including an exam, radiographs, and sometimes an ultrasound. If they confirm a foreign body, it will need to be removed through surgery or endoscopy, depending on where it’s located and how much damage it has done. The vet’s goal is to go in, find, and remove the tinsel as quickly as possible before it can cause more problems—and to repair any damage it did while moving through the digestive tract, which sometimes can be quite severe.  How to Keep Your Pet Safe From Tinsel Preventing any tinsel-related blockages is simple: don’t use tinsel in your holiday decorating. Your fur baby isn’t going to eat something that’s not in your house! However, if this decoration is an important part of your holiday rituals, consider using the rope-like tinsel, which is harder for pets to swallow. Placing any tinsel you use—whether the rope form or the strand form—up high and out of your pet’s reach is also helpful. But keep in mind that it can fall off and cats will enjoy climbing the Christmas tree, so you may not even be able to place it high enough to avoid those curious paws! At the end of the day, tinsel just isn’t worth the risk. Featured Image: iStock/golero"}]