[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Know: Adopting a Heartworm-Positive Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/woman-hugging-dog-in-front-of-animal-shelter.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/woman-hugging-dog-in-front-of-animal-shelter.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Heartworm, Adoption, Zoo Adoptable Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/what-know-adopting-heartworm-positive-dog"}, "datePublished": "June 9, 2022", "dateModified": "August 30, 2023", "description": "When adopting a heartworm positive dog there are many things to know, including treatment options, Dr. Michael Kearley breaks down everything you need to know after adopting your new pup.", "articleBody": "What Does It Mean If a Dog Is Heartworm-Positive? It  means that a dog has been found to be infested with Dirofilaria immitis, the organism that causes heartworm disease in dogs. This is a large worm with a six-to-seven-month life cycle that ultimately ends up living in the heart and pulmonary vessels. As the heart becomes clogged with worms, it pushes less blood out to the rest of the body, and heart failure can result. Symptoms of heartworm disease in dogs often include: Cough Lethargy Exercise intolerance Some dogs may show weight loss, difficulty breathing, and even excessive panting. Left untreated, dogs may go on to experience right-sided heart failure. However, other dogs may not show any of the above symptoms. Heartworm disease in dogs is a treatable condition, and dogs can go on to live a healthy life and make exceptional companions and family pets. Adopting a Heartworm-Positive Dog A diagnosis of heartworm disease is not a death sentence, although for reasons not always understood, for some heartworm-positive dogs, the disease is fatal. Heartworm-positive dogs often go unnoticed or unwanted in the shelter, for no other reason than the stigma that they are either extremely sick or have behavior problems. In reality, they typically make great companions and can have a relatively normal quality of life if the condition is treated and managed appropriately.  Heartworm-positive dogs in a shelter are dogs that have been neglected, either as: Strays, lost pets, transfers, or dogs relocated from other parts of the United States Owner surrenders (for reasons including change in owner lifestyle, inability to afford care, or simply no longer wanting the pet) Confiscated animals (often due to neglect or abuse) Survivors of hoarding situations Heartworm-positive dogs pose a concern to other dogs in the environment, as they are reservoirs for propagating heartworms. Mosquitoes can transmit heartworm parasites from one dog to another. Dogs cannot directly transmit heartworm disease to each other. Often, determining the severity of heartworm disease involves identifying the classification of the worm and noting what, if any, symptoms the dog is exhibiting. Most shelters will test for heartworms upon intake if the dog is a stray, or they may have insight into their medical history if they were surrendered. This information will be helpful to understand their baseline before you set up your first veterinarian appointment. Consider the following questions as a guide in the adoption process: What is their past medical history (if known), including any diagnostics or other treatments given, such as baseline blood work and chest x-rays? What is their current medical history? How long has the dog been diagnosed with heartworm disease? What class/stage of heartworm are they in? Have they been treated already? If not, where in the heartworm treatment process are they? If treated, how is the dog faring? Any side effects from the treatment? What type of heartworm preventive medication is the dog currently taking? Does your shelter offer any additional in-house low-cost testing, coupons, or discounted medical care to help with the associated costs, including the treatment itself and future heartworm prevention? Treatment Options for Heartworm Disease in Dogs Once a diagnosis has been obtained, heartworm disease is often categorized into four classes based on severity of infection and risk of treatment. Class 1 Heartworm: Dogs with a positive heartworm test but often show no signs or relatively mild signs like cough. Class 2 Heartworm: Dogs with a positive test and often have moderate signs like exercise intolerance. Class 3 Heartworm: Dogs with a positive test and often are sick and debilitated. Class 4 Heartworm: Often referred to as caval syndrome; these dogs are in a life-threatening situation as worms are blocking blood from exiting the heart (typically requires immediate surgery by a specialist to survive). Additional testing is often recommended and performed to help determine the dog’s heartworm class. Speak with the shelter staff to determine what testing has been performed and the results. If there has been no formal testing outside a general heartworm test at the shelter, make sure a heartworm test is done at the first visit to your veterinarian. The good news is that your dog can be cured of heartworm disease. Treatment often includes the following: Steroids to decrease inflammation created by the worm itself. Antibiotics, such as doxycycline, to kill Wolbachia, a symbiote organism that lives within the heartworm. Without the symbiote, the host heartworm becomes easier to kill and secondary inflammation is minimized. Heartworm preventive to prevent younger worms from developing into adults and to rid the bloodstream of any circulating microfilariae An injection containing the arsenic-based compound melarsomine, a medication designed to kill adult heartworms. This is referred to as the “fast kill” method and is the recommended treatment by the American Heartworm Society (AHS). The “slow kill” method (a combination of doxycycline and a monthly preventive), while not recommended by the AHS, may be an alternative when “fast kill” is not an option. However, because the length of time to a heartworm-disease-free state is longer, continued damage to the heart and organs will occur. It’s important to discuss all options with your veterinarian to determine the best one for your dog. Cost of Heartworm Disease Treatment in Dogs The cost of heartworm treatment typically equates to about 13 years of monthly prevention. Cost can also vary depending on your geographical location. The good news is that as part of the adoption process, most shelters will cover the cost of heartworm treatment, either entirely or at a reduced rate. Pet insurance may be an option, especially if the dog has yet to be diagnosed, though most insurance companies consider heartworm disease a pre-existing condition. If either of the above are not options, seeking treatment with your family veterinarian may cost anywhere from several hundred dollars to $1,800, depending on the size of your dog.  Long-Term Management of Heartworm Disease in Dogs If the pup you are interested in adopting is heartworm positive and has yet to undergo treatment for heartworm disease, note that the treatment is not without risks. Dogs that undergo heartworm treatment as discussed above can suffer from shock, blood clots, or sudden death. However, the degree of severity will affect the prognosis, and the sooner the disease is caught and treated, the greater the likelihood for a good outcome.  Keep in mind that dogs that are successfully treated will continue to make great companions in the future, and if the dog you are interested in adopting has already undergone treatment and if no long-term damage from the worms has occurred, the only thing you need to worry about is giving your pet year-round prevention moving forward. Prevention of Heartworm Disease in Dogs Depending on whether your dog has already received treatment for heartworm disease, going forward, it is important to place your pet on a preventive year-round. There are multiple types and forms of affordable heartworm prevention on the market—tablets, topicals, and even injectable versions that can provide anywhere from a month to a year of protection. Some of the products are combined with flea and tick control to give your dog a more comprehensive preventive profile. If your dog has yet to be treated, speak with the shelter staff and your family veterinarian about the specific type of preventive needed during treatment, as there are only a few that should be given, to minimize secondary complications. Adopting a Heartworm-Positive Dog FAQS Can dogs fully recover from heartworm? Yes. If heartworm disease is caught early and treated appropriately, your dog may go on to have a good-quality life. Unfortunately, some dogs may experience undesirable consequences either from treatment or from the disease itself, and may end up with lifelong complications. And it’s important to note that even if your dog recovers, they can become infected again in the future if certain precautions, such as monthly prevention, are not taken. Does heartworm treatment shorten a dog’s life? The majority of dogs that suffer from heartworm disease receive treatment, recover, and go on to lead a relatively normal life. Can I get pet insurance if my dog has heartworm? For most pet insurance companies, dogs previously diagnosed with heartworm disease would be excluded from coverage, as this would be considered a pre-existing condition unless the dog has insurance prior to diagnosis. Featured Image: iStock.com/mladenbalinovac"}]