[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lumps on Dogs: 4 Ways Veterinarians Diagnose Lumps and Bumps on Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/Dog%20at%20vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/Dog%20at%20vet.jpg"}, "author": {"@type": "Person", "name": "Dr. Rania Gollakner", "url": "https://www.petmd.com/author/dr-rania-gollakner"}, "keywords": "Dog, Adult, Skin health, General Care, Symptom Checker", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/ways-veterinarians-diagnose-lumps-and-bumps-dogs"}, "datePublished": "March 6, 2023", "dateModified": "September 12, 2023", "description": "Not all bumps on dogs are created equal. Dr. Rania Gollakner discusses the most common types of lumps on dogs, how veterinarians might diagnose lumps on dogs, and what to expect when you find a bump on your dog.", "articleBody": "What Are Lumps on Dogs? Lumps on dogs refer to various kinds of growths, tumors, masses, or cysts. While these can happen anywhere in the body, the ones most easily seen are on, in, or under the skin. Normally, cells that make up tissues, organs, and body systems will copy themselves to replace older or damaged cells, and the older or damaged cells will undergo a process of cell death. Sometimes, this process of cell reproduction, growth, and death can become abnormal. If cells reproduce without stopping and/or older cells do not die, then a lump will form. Because any tissue can develop a lump, there are many types. The ones that are more easily seen or felt by pet parents can be divided into four broad categories: Lumps of the skin, the lining or the surface of organs, or the glands: Examples include papillomas and adenomas, which are benign, and carcinomas, which are malignant. Lumps of the deeper tissues, such as fat, muscle, bone, blood vessels, and nerves: Examples include lipomas and hemangiomas, which are benign, and sarcomas, which are malignant. Lumps of cell types found in the blood and lymph nodes: Examples include histiocytomas, which are benign, and lymphoma and mast cell tumors, which are malignant. Lumps of the gonads, such as the testicles in male dogs. Of the skin lumps, the most common in dogs are lipomas, sebaceous gland hyperplasia, mast cell tumors, histiocytomas, and papillomas. What Is the Difference Between Malignant and Benign Lumps? A benign lump is a type of tumor that may grow in the area that it develops but does not spread to any other areas of the body. A malignant lump has the capacity to spread to other areas of the body; this process is called metastasis. As noted, common benign lumps are lipomas and papillomas, and common malignant lumps are mast cell tumors. 4 Ways Veterinarians Diagnose Lumps on Dogs Fine-needle aspiration (FNA): This is the most common method for collecting a sample of cells. A needle attached to a syringe is inserted into the lump. The doctor will then draw a sample into the needle using the syringe. and move the needle around to be sure to get a good sample of cells. The contents are placed onto a microscope slide to be looked at closely. FNA can be done quickly, usually without sedation or anesthesia, because the needle size is the same as those used to give vaccines or draw blood. Biopsies: There are different types of biopsies, and which one is chosen will depend on factors such as the size and location of the tumor, the probable type of tumor, and the pet’s overall health. A biopsy can range from removing a small piece of the lump to the entire lump. Extracted tissues are usually sent to a lab for analysis, but your veterinarian may create an imprint or a scraping of cells from that biopsy to look at cells prior to preserving the larger sample. Fluid cytology: This will most often be used for lumps that are filled with fluid. The fluid is analyzed to see if there are any cells suspended in the fluid that could indicate the type of lump. Blood tests: For some lumps, blood tests can show changes suggestive of a possible tumor, but a definitive and thorough diagnosis ultimately requires a biopsy. What To Do if You Find a Lump on Your Dog Pet parents will usually see a bump, growth, or swelling on or under the skin or feel it while petting, grooming, or bathing their dog. If you notice a lump or bump, pay attention to when you noticed it, whether it changes in size and how quickly, whether it seems painful or bothersome, and where it is located on the body. Unfortunately, while many lumps and bumps are nothing to worry about, there is no easy way for you to know if a lump is a concern just by looking at or feeling it. The safest course of action is to have the lump evaluated by your veterinarian, who will likely suggest starting with a fine-needle aspiration. If a lump is malignant, waiting for a formal diagnosis and treatment will increase the chance of it spreading to other areas of the body. Even lumps that are benign can become a problem if too much time passes, because those lumps can enlarge and cause other problems due to their size. A small lump is generally a minor surgery to remove completely, while a larger lump can become a major surgery with more possible complications. Featured Image: iStock.com/zoranm"}]