[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Dangerous Halloween Candies for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.halloween.candy_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.halloween.candy_.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Poisoning, Holidays, Halloween", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/emergency/most-dangerous-halloween-candies-dogs"}, "datePublished": "September 14, 2022", "dateModified": "August 15, 2023", "description": "A roundup of the most common halloween candies that are dangerous to dogs.", "articleBody": "No matter how much they beg, your dog should not get treats out of the Halloween candy bowl. Generally, it isn’t a good idea to share any candy with your pet for several reasons. Some types of candy (such as dark chocolate and those containing xylitol) can make your dog very ill and can even be fatal. Others are likely to cause an upset stomach. Sweets are not good for dogs and can contribute to many health problems, including obesity. If you believe your dog has eaten some candy, call your veterinarian immediately. Chocolate Chocolate is one of the more common causes for concern, particularly since it is widely available and smells tempting to our canine friends. Eating chocolate can cause an array of concerns for dogs, depending on the type and amount of chocolate eaten. In general, the darker the chocolate, the more toxic it is; milk chocolate is safer than semi-sweet, which is less toxic than dark, which is less toxic than baker’s chocolate. The amount of chocolate and size of the dog matters too. If a chihuahua eats 20 bars of milk chocolate, they are going to be in for trouble, but if a Labrador retriever eats a fun-sized bar of milk chocolate, he is likely going to be okay. When you call your veterinarian, be prepared to provide the weight of your dog and the type and amount of chocolate ingested. The vet can determine the best treatment options. What makes chocolate toxic to dogs but not people? Chocolate contains several active chemicals, including theobromine and caffeine. Dogs are not designed to metabolize these as well as humans, meaning that these chemicals are far more powerful in dogs. Signs of chocolate toxicity vary from dog to dog, depending in part on the type and amount of chocolate eaten. The symptoms may take several hours to develop, so don’t assume that just because your dog looks and acts normally, all is well. In minor cases, a dog with chocolate toxicity may only show: Vomiting Diarrhea Restlessness Panting Excessive thirst Urination High heart rate Some dogs will go on to show more severe signs, including muscle tremors, seizures, heart failure, and death. Even if your dog has eaten a small amount of milk chocolate, contact a veterinarian immediately. Chocolate-Covered Raisins Chocolate-covered raisins unfortunately combine two problems for our pets: the toxicity of chocolate and the risk associated with eating raisins. We don’t know exactly why, but some dogs will become severely ill—and even die of kidney disease—from eating even one raisin or grape. Signs can be very similar to chocolate toxicity, but they often will focus on extreme thirst and urination, poor appetite, vomiting, and lethargy. It is important to have your dog checked out immediately if they have eaten any amount of raisins or grapes, including chocolate-covered raisins. Hard Candies Hard candies can be problematic for dogs, especially the sugar-free varieties that may contain xylitol. Even a very small amount of xylitol can cause a severe drop in blood sugar in dogs, which can also lead to seizures, coma, and death. If you think your dog has eaten even a single sugar-free hard candy, call your veterinarian to be seen immediately. Hard candies can also lead to choking and can result in obstructions if multiple candies “stick together” once they get to the stomach. Because the candy is slippery when wet, it can also easily be inhaled into the windpipe, obstructing breathing. Dogs that eat only a few hard candies may get away with just an upset stomach, but dogs that eat more, or those that contain xylitol, may be in for a much more difficult ride. It can often start with vomiting, diarrhea, and lethargy and progress to lack of appetite, restlessness, panting, and abdominal pain. Severely affected dogs might begin to have seizures and other neurological signs. Call your vet right away and be ready to give the approximate weight of your dog, what types of hard candy might have been eaten, and how many. Candy Corn Candy corn and other sugary candies are often found in high numbers in households, especially around Halloween. Although these are not considered to be toxic to dogs, they can certainly make them sick and severely disrupt their digestive tract. These high sugar treats for humans can result in significant abdominal discomfort in dogs as well as severe gas, bloating, and diarrhea. In sensitive dogs, inflammation (swelling) of the intestinal tract may spread to involve the pancreas, leading to pancreatitis. This is a sometimes-fatal disease in dogs and one that requires treatment. Signs of a problem with these candies are similar to those mentioned above, often starting with vomiting, diarrhea, a painful belly, restlessness, panting, and lethargy. In the case of pancreatitis, however, the signs are often quite severe and persistent, and may even take several days after exposure to become fully evident. Some dogs who get sick from eating candy corn seem to get better, but then get sick again. In these cases, pet parents may overlook the fact that the candy was the underlying cause. Contact your veterinarian for advice if you think your dog has eaten high-sugar candies like candy corn, but less than 2 teaspoons is likely to be safe for a medium- to large-breed dog. Lollipops Lollipops combine plenty of dangers similar to other candies. They can be a choking hazard, block the intestinal tract, get slippery when wet and block the windpipe, and contain a lot of sugar. There are lots of reasons your dogs should not have them. If your dog does eat one or more, the signs are similar to the above candies and the advice is the same: call your veterinarian with information about your pet and what they might have eaten, so they can determine treatment, if any. Candy Wrappers Most dogs don’t unwrap candies before they eat them, and the wrappers can sometimes pose more of a problem than the candies themselves. If eaten in a larger quantity, wrappers may ball together and cause a gastrointestinal obstruction. Even in smaller quantities, wrappers are likely to result in inflammation (swelling) of the gastrointestinal tract, which often results in poor appetite, vomiting, and diarrhea. In severe cases, surgery may be necessary to remove the wrappers. In less significant cases, medication to soothe the intestinal tract may be all that is needed. In either event, while you are talking to your veterinarian about the candy your pup ingested, don’t forget to mention the number of wrappers you believe may have also been eaten. My Dog Ingested Halloween Candy; Now What? If you know that your pet has eaten Halloween candy, it is best to seek advice immediately to find out what actions, if any, are important to take for your pet. It is best not to wait for clinical signs to develop, because once your pet is sick, this means some toxins have been absorbed and treatment is likely to be more difficult and expensive. Particularly if your pet ate dark chocolate, anything containing raisins, or more than one or two candy wrappers, a visit to the veterinarian is likely necessary. Your first phone call should be to your regular veterinarian if they are open, or if not, to your nearest emergency clinic. It is also a good idea to contact poison control. There are several hotlines, including those operated by the ASPCA and Connect with a Vet (Chewy). Be sure you are seeking advice from a veterinary-specific hotline, and that they will report the recommendations directly to the clinic that will be seeing your pet. This could save time in getting proper treatment, but don’t delay your travel to the veterinarian to make the call. If you can call while you are waiting to be seen, however, that could be very helpful. Although it is tempting to induce vomiting, do not do so unless directed to by a veterinarian or by poison control. Some problems can be made worse if vomiting is induced. Perhaps most importantly, don’t panic! Your pet can sense your emotions, and if you are uptight, they will be too. Stay calm and work through the situation with the help of your veterinarian. Keeping Pets Safe During Halloween An ounce of prevention is worth a pound of treatment. Be sure to keep all candy up and out of reach of your pets. It is safest to simply not have anything highly toxic to your pet in the house. So don’t buy dark chocolate or xylitol candy to have at home. Take it to work instead for a treat and leave the leftovers there. Remember, there are all kinds of pet-safe recipes that you can make if you really want to share Halloween treats with your pets. It is helpful to keep emergency information nearby so you don’t have to look it up should you ever need it. Put the numbers in your phone and post the info someplace in the house where everyone can see it. Include your regular vet’s contact information, how to get a hold of the nearest one or two emergency clinics, and your dog’s current weight. With a little care, you can prevent Halloween from becoming a dangerous and scary time for your pets. Don’t share candies with your dogs, and look for pet-safe treats instead! Featured Image: iStock.com/AleksandarNakic"}]