[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Prepare for a Hurricane With Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/aerial-image-of-hurricane.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/aerial-image-of-hurricane.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/emergency/pet-emergency-kit-items-natural-disasters"}, "datePublished": "May 10, 2012", "dateModified": "September 7, 2022", "description": "This hurricane preparation checklist has all the pet items you’ll need to get ready for a hurricane.", "articleBody": "When disaster strikes, making sure you’re stocked up and ready to face a natural disaster is the best way to keep your family safe. But what about your pets?   Your pets can’t fend for themselves and rely on you to protect them from during a natural disaster. Here are 10 items to include in a pet emergency kit so that your entire family can weather the storm safely. When bad weather strikes, the city water supply may become contaminated if the water treatment systems fail because of power outages. So having a supply of fresh water is a top priority.   When you’re calculating how much stored water you’ll need, don’t forget to think of your pet. FEMA&#039;s Ready.gov recommends stocking up on at least a three-day supply of water (one gallon per person per day)—so be sure to count your pets in this calculation. You should also make sure you have an adequate supply of your pet’s food. Three days’ worth of food is the minimum, but it’s always better to have more available and on hand if stores cannot open due to blocked roads and power outages.   If you have bagged, dry food, make sure you have an airtight, waterproof container to keep it sealed and safe from the elements. If your pet suffers from a chronic condition that requires daily or frequent administration of medication to keep them healthy, remember to order ahead.   Speak with your veterinarian to secure an emergency supply of your pet’s medication, and be sure to store it in a waterproof, sealed container.   Place photographs and/or any ownership paperwork for your pets in a sealed, airtight container as part of your emergency kit as well.   If your family has to evacuate to a shelter, you may have to board your pet. Keeping proof of ownership on hand will identify you as a pet owner.   This will also be helpful if you and your pets become separated. You have a photograph to either prove ownership or to give to search-and-rescuers. Some animal clinics and boarding facilities will offer shelter to pets only if your animal has up-to-date vaccinations. Have a digital copy and hard copy of your pet’s vaccination records available.   You can store the hard copy of the vaccine records with the proof of ownership and photograph in a sealed, waterproof container.   Vaccination records will also be required if you need to take your pet to an emergency shelter with you. After a natural disaster, everyone will be in survival mode.   Make a list of contact information for neighbors, family members and/or emergency boarding facilities so you will have them in case you need help. In the event of severe weather, your pet may panic and try to break loose to find a place to hide. Many pets become fatally trapped or injured because of this.   Having leashes and pet carriers at the ready will make it easier to transport and secure your pet.   In addition, the aftermath of a natural disaster usually results in downed power lines, fallen debris and contaminated groundwater. Therefore, it is best to utilize leashes and/or carriers to restrain your pet from running out into unsafe conditions. Whether faced with an emergency situation or not, if you do become separated from your pets, the best way to be reunited with them is to have additional ID tags for them to wear.   Consider getting your pet microchipped or other forms of identification to help ensure you can be contacted if you are separated from each other. Even if they are microchipped, you still need an ID tag because no one in the area will have access to a chip reader.   Just don&#039;t forget to keep your contact information up to date! Along with the telephone number of the nearest emergency animal clinic, you can put together an emergency medical kit for your pets should they become injured.   A few of the items you will want to include are bandages, gloves, plastic syringes, tweezers and antiseptic wipes. This is something you might think to stock up on, but you’ll need to do it well before the immediate threat of a storm. Remember that as soon as a hurricane is on the horizon, all cat owners will be buying cat litter, and supplies can become limited quickly.   If you order it online, it might take several days to ship it, and you might not get it in time before being evacuated or before the storm begins. Plan well in advance of hurricane season. Your pet may spend a lot of time in a carrier while evacuating. Make sure you have a pet bed, clean blankets, towels, a favorite toy, extra cat litter—anything you think you&#039;ll need to keep your pet calm.   Like you, your pets will be nervous and frightened. Soothing them any way you can, will make your pets more likely to stay relaxed until conditions improve."}]