[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What&#039;s the Cost for Euthanizing a Dog or Cat?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/cost-euthanize-pet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/cost-euthanize-pet.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Cat, End of life, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/whats-cost-euthanizing-dog-or-cat"}, "datePublished": "November 2, 2022", "dateModified": "November 2, 2022", "description": "Dr. Jennifer Coates gives costs for in-clinic and at-home euthanasia with breakdowns for local clinics vs. emergency hospitals vs. large chain vets.", "articleBody": "End-of-life decision-making for pets is always stressful, but being prepared can make this difficult time a little easier. Many pet parents don’t have the funds set aside for pet euthanasia and don’t know the costs involved. It’s good to know this ahead of time and also to know what you’re paying for. There’s a lot involved in humanely euthanizing a pet. The cost of pet euthanasia also varies widely because of all the factors involved. For example, euthanizing a large dog in the middle of the night at your home, followed by a cemetery burial, would obviously cost more than euthanizing a cat at the clinic during normal business hours, followed by a home burial. Here’s what you need to know about the cost of euthanizing a dog or cat and how much you should be prepared to pay. Explanation of Pet Euthanasia Costs Let’s look at some typical costs associated with pet euthanasia and aftercare and what they cover. The rates noted here are for a community with a cost of living that is just a little over the national average (Larimer County, Colorado). If you live in an expensive area like Manhattan or San Francisco, you should expect to pay more, while your costs will probably be lower if you live in a cheaper part of the country. After-hours euthanasia services will also cost more. Here’s a breakdown of typical pet euthanasia costs. Appointment Veterinary offices will sometimes charge for an office visit when a pet is euthanized. This is especially true if your pet hasn’t been examined recently by a veterinarian associated with the clinic. If you have seen the veterinarian recently and the request for euthanasia is expected, the office visit charge may be waived. The office visit fee will cover the cost of a physical examination and discussion with the veterinarian to determine if euthanasia is appropriate, and if so, how best to proceed. This will include the time needed to answer any questions you might have about euthanasia and the aftercare of your pet’s body. The veterinary practice may also supply information about grieving and pet loss support resources. Here are some approximate costs for an office visit: Independent Vet Offices: $50-$100Large Chain Vet Hospitals: $58 (Using the Banfield Price Estimator for ZIP Code 80525)Emergency Vet Hospitals: $100-$200Home Visit You can also opt to have a mobile vet or a vet who specializes in home euthanasia come to your house to perform the procedure. This allows you to put your pet to rest at home with other family members and pets, in a familiar environment. The fee will replace the office visit fee but is more expensive because it will account for travel costs and time. It’s reasonable for them to charge for the extra time and mileage involved. Home visit: $100-$200Additional travel fees: $0-$100 depending on the distanceEuthanasia Procedure The next cost covers the actual procedure, which typically includes sedation, placing an IV catheter, and administering the euthanasia solution. Sedation Most veterinarians give dogs and cats a sedative injection (usually into a muscle or under the skin) at the beginning of the euthanasia appointment. This helps relieve a pet’s anxiety and discomfort and makes the procedure less stressful for everyone. There are times when sedation may not be necessary—for instance, if a pet is already on strong pain relievers or sedatives, is not very alert, or has an intravenous (IV) catheter in place. IV Catheter Veterinarians will usually place an IV catheter when they are planning on giving a euthanasia injection into a vein. Gaining reliable access to a sick, injured, or dying pet’s vein can be difficult. By placing a catheter, your veterinarian can be sure that when they inject the euthanasia solution, it will go into the vein and not into the surrounding tissues, which is ineffective and painful. IV Euthanasia Solution The most common pet euthanasia drugs are barbiturate anesthetics that are given at very high doses. They work by first shutting down brain activity, which then causes a pet to stop breathing and their heart to stop beating. This process may take several minutes, but because the brain has been fully anesthetized, the pet is comfortable and unaware of what is happening. Here are some of the average costs for the euthanasia procedure: Independent Vet Offices Small pets: $75-100              Large pets: $100-150Large Chain Vet Hospitals (Using the Banfield Price Estimator for ZIP Code 80525) Euthanasia package: $130Emergency Vet Hospitals Small pets: $100-$150Large pets: $150-$200At-Home / Mobile Vet Services Small pets: $75-100              Large pets: $100-150Pet Aftercare Fees associated with pet aftercare may be included in a veterinary practice’s euthanasia charges or billed separately. The aftercare process begins once the veterinarian has confirmed that death has occurred by checking for a heartbeat. Aftercare includes preparations for handling the body and may include making a clay pawprint or cutting off a bit of fur as a keepsake. The veterinary office can arrange for transportation of your pet’s body to a local pet crematory or cemetery if you choose. Options include: Private Cremation Your pet will be cremated by themselves, and their ashes will be gathered, placed in a container, and returned to you. The remains may be delivered to your home, or you can pick them up from the veterinary office or crematory. Cremation may be done by fire or by other methods, like alkaline hydrolysis, which is also called aquamation or liquid cremation. Aquamation uses water, lye, and heat as an eco-conscious cremation method. Small pets: $100-$125Medium pets: $125-$150Large pets: $150-$200Giant pets: around $1.50 per poundSpecial urns: additional costsCommunal Cremation Your pet will be cremated with other pets, and their ashes are usually spread on private property. Your pet’s ashes will not be returned to you. Small pets: approximately $50Pets over 50 pounds: approximately $1 per poundCemetery Burial You can also pay to have your pet buried, either in a cemetery dedicated to pets or in a “whole family” cemetery that serves both pets and people. The cost includes a burial plot, standard granite marker, opening and closing of the site, and extended care of the site. Special headstones may cost more. All pets: $500-$700 Home Burial In some jurisdictions, it is legal to bury animals on private property. Ask your veterinarian or check local regulations to determine if this is an option where you live. Body Donation It’s sometimes possible to donate a pet’s body to a veterinary school for teaching purposes. After your pet’s body has been used for teaching purposes, the veterinary teaching hospital may arrange for cremation at no charge, but you will not get ashes returned to you. You can also ask that your pet’s body be privately cremated at your own expense. Communal cremation: usually no chargePrivate cremation: $100-$200Are There Low-Cost or Free Pet Euthanasia Options? Local animal shelters and humane societies often offer euthanasia services that can be less expensive than those provided by veterinary offices. For example, the Larimer County Humane Society in Colorado will perform owner-requested euthanasia for a flat fee of $60 for cats and $80 for dogs. Many animal shelters also say that they will not turn away any pet due to a pet parent’s financial constraints. Don’t let your pet suffer due to the cost of pet euthanasia. Providing dogs and cats with a peaceful and pain-free end to their lives is often the final gift we can give them. Talk to your veterinarian or local humane society, or contact an organization that offers financial assistance for veterinary services if you’re struggling to get your pet the care they need. Featured Image: iStockphoto.com/IPGGutenbergUKLtd"}]