[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/b3yt7njk14", "@type": "VideoObject", "duration": "PT1M30S", "name": "5637087142001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/eac6b34091f276a6423ae0c211a8994c5c4f0cc7.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/b3yt7njk14", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/d0de1248f0ab706d8f8ed2a3d8700243b03a3115.m3u8", "transcript": "Does your dog have itchy irritated skin. If so there's a chance he could be suffering from a yeast infection yeast is a fungus that lives on your pet skin. And while it is normally harmless an overabundance of use can lead to skin paw and ear infections yeast infections may also be related to underlying issues, including allergies and hormonal disorders in dogs. The most obvious signs of yeast infection in dogs will include changes in the color and texture of the skin as well as itching and scratching of the affected spot dogs with greasy scaly skin that is pink or red and color may have a yeast infection because the ears are the most common location for a yeast infection.\n\nYour dog may also repeatedly shake or tilt his head to relieve his discomfort additional symptoms of yeast infections include swelling and warmth in the affected area licking of the affected area hair loss and an unpleasant odor. The first thing your vet Noreen will do to treat your dog's yeast infection is to identify and address the underlying cause of the infection. If your dog is suffering from allergies or a hormonal disorder your vet will take steps to diagnose and treat those conditions. First Oral antifungal medications may be prescribed for generalized skin infections while dogs with yeast infections in their ears may be treated with topical cleaners and medications bathing with a disinfecting and decreasing shampoo can also help soothe your dog's skin.\n\nBut your veterinarian will be able to determine the best treatment regimen for your dog.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/general-health/10-signs-your-dog-has-yeast-infection?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Treat Yeast Infections in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/shih-tzu.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/shih-tzu.jpg"}, "author": {"@type": "Person", "name": "Leigh Burkett, DVM", "url": "https://www.petmd.com/author/dr-leigh-burkett"}, "keywords": "Dog, General Care, Infection", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/10-signs-your-dog-has-yeast-infection"}, "datePublished": "November 3, 2020", "dateModified": "September 8, 2023", "description": "Dr. Leigh Burkett discusses yeast infections in dogs, including their symptoms, causes, and the best treatment for this common condition.", "articleBody": "Yeast are spore-producing fungi that are always present on a dog’s skin, usually in low numbers, as part of the normal flora. A yeast infection happens when there’s an excessive amount of yeast in a certain area. Yeast infections in dogs are quite common and can occur anywhere on the skin, including the ears.  Generally, yeast infections are caused by another issue. Anything that diminishes the normal defenses in the skin can make yeast infections more likely.  Dog breeds that are more prone to yeast dermatitis include: Shih TzusWest Highland White TerriersAmerican Cocker SpanielsBasset HoundsEnglish SettersBoxersPoodlesDachshundsAustralian Silky TerriersWhat Causes Yeast Infections in Dogs? Yeast infections in dogs are usually secondary problems. This means that there is some other issue that is weakening the skin’s defense mechanisms to allow the yeast to grow in higher numbers than normal. It is very common to see yeast infections in a dog’s ears or on their skin if they have food allergies or environmental allergies. Other underlying issues that may cause yeast infections in dogs include hormonal problems or other diseases that suppress the immune system. There are no studies to confirm that any of the following cause yeast infections on a dog’s skin: Antibiotics Brewer’s yeast Oatmeal shampoos Carbohydrates or sugar in food What Are the Symptoms of Yeast Infections in Dogs? Yeast infections can cause red, irritated, or itchy skin or ears, and there is often a sweet or musty odor. Chronic yeast infections can cause the skin to become thickened and discolored (gray, brown, or black). Here are the most common areas for yeast infections in dogs and some signs that you can look out for. Skin Yeast infections can occur anywhere on a dog’s skin, including the belly. They are often seen in areas that are moist, such as in skin folds, especially in “wrinkly” dog breeds. The affected skin may be red, irritated, itchy, greasy, or flaky, and there may be hair loss. If the infection is chronic, the skin may thicken and become darker in color. Yeast infections on a dog’s mouth or face can cause extreme itching or face rubbing. Paws A dog with yeast infections on their paws can have red, irritated, and itchy paws. The underside of the paws, between the pads, is affected most often, but yeast can occur anywhere on the paws. Sometimes a brown discharge can be seen in the nail beds. Dogs with yeast infections on the paws usually lick their paws more than normal. There may also be hair loss. Ears Dog ear yeast infections are quite common, and the ears often smell sweet or musty. Usually, you will see redness, which may extend onto the flap of the ear, and the discharge is generally brown. The ear may appear to be greasy, and the hair may be matted. Yeast infections in a dog’s ears can be very itchy, causing dogs to scratch their ears or rub their head excessively. What’s the Difference Between Ear Mites and Yeast Infections in Dogs?  Yeast infections in a dog’s ears generally cause redness, a brown discharge, head shaking or rubbing, odor, and itching. Ear mite infections are extremely itchy and can cause many of the same symptoms. The discharge from the ear is usually dark and waxy or crusty. Ear mites are barely visible to the naked eye and highly contagious to other animals. Your veterinarian can easily determine whether a dog’s ear problem is caused by yeast or mites by taking a swab from their ear and looking at it under a microscope. What’s the Best Dog Yeast Infection Treatment? The best treatment for a yeast infection on a dog depends on the location of the yeast infection. Ears Your veterinarian may perform cytology (taking a swab of the discharge and staining it to look at it under the microscope) to diagnose a yeast infection in a dog’s ears. Prescription treatment may include antifungal drops or ointment, an ear cleaner, and in severe or difficult-to-treat cases, an oral antifungal medication. Skin and Paws Cytology is also used to diagnose yeast on the skin. Treatments for yeast infections on the skin can include topical antifungal creams, wipes, sprays, and shampoos. Topical ingredients that are effective in treating yeast include chlorhexidine, miconazole, and ketoconazole. In difficult-to-treat or severe cases, oral antifungal medications are used. Oral antifungal medications used in dogs include fluconazole, terbinafine, ketoconazole, and itraconazole. These medications should be used only under the direction of a veterinarian.  Human medications should not be used unless under the direction of a veterinarian. Are There Home Remedies for Yeast Infections in Dogs? People often talk about home remedies for dog yeast infections, but most are not proven to be effective. There are no studies to confirm that feeding any of the following is beneficial in treating yeast on a dog’s skin: Yogurt Probiotics Herbs Fermented vegetables Coconut oil “Yeast-free” dog foods “Anti-yeast” dog foods Low-carbohydrate dog foods There are no studies to confirm that topical use of any of the following are useful in treating yeast infections in dogs: Coconut oil Witch hazel Hydrogen peroxide Tea tree oil/herbal shampoo Essential oils (these may be toxic to dogs) Vinegar Rinses Vinegar rinses do have scientific data to support that they may be beneficial in treating yeast. The proper dilution is important to avoid irritation. Vinegar helps to change the pH of the skin to make it less favorable for yeast. This should only be used under the direction of your veterinarian.  How To Prevent Yeast Infections in Dogs Prevention of yeast infections in dogs must include addressing the underlying cause to reduce the likelihood that the infection will reoccur. Routine bathing with an antifungal shampoo may be beneficial. However, for shampoo treatment to be effective, the lather must sit on a dog’s skin for a minimum of 10 minutes before rinsing. Dogs with skin folds may need to have maintenance treatment to keep these areas from becoming too moist, as yeast thrive in moist, dark places such as skin folds and ears. Dogs that have had allergy testing and are determined to be allergic to yeast can be desensitized by including yeast as an ingredient in immunotherapy (allergy vaccine).  If you suspect that your dog has a yeast infection, consult your regular veterinarian for a diagnosis and treatment plan that is appropriate for your pet. Featured Image: iStock.com/nicolesy"}]