[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Reverse Sneezing in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/reverse-sneezing-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/reverse-sneezing-dog.jpg"}, "author": {"@type": "Person", "name": "Shelby Loos, DVM", "url": "https://www.petmd.com/author/dr-shelby-loos"}, "keywords": "Dog, General Care, Sneezing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/reverse-sneezing-dogs"}, "datePublished": "July 31, 2020", "dateModified": "August 18, 2023", "description": "Dr. Shelby Loos shares her insight into what causes reverse sneezing in dogs, whether it’s a serious condition, and what you can do to help.", "articleBody": "Reverse sneezing in dogs can be alarming if you’ve never experienced it before. But, luckily, it’s not quite as scary as it sounds. Reverse sneezing occurs primarily in dogs and much less frequently in cats. Here’s what you need to know about reverse dog sneezing and what you can do to help stop it. What Is Reverse Sneezing in Dogs? Reverse sneezing, or a “backward sneeze,” is a sudden, involuntary respiratory reflex. It can occur if a dog’s soft palate (the soft part of the roof of the mouth that separates the nasal passage from the oral cavity) becomes irritated. The irritation causes the soft palate muscle to spasm, causing a temporary narrowing of the trachea. The dog will extend their neck as they try to expand their chest to breath, but the narrowed trachea will make it difficult for the dog to fully inhale. The dog will then forcefully attempt to inhale through their nose, which causes the dog to backward sneeze. Reverse sneezing can occur in any dog breed, but may be more common in brachycephalic dogs such as Boxers, Bulldogs, Pugs, and Shih Tzus.  While reverse sneezing can sound alarming, but it isn’t a painful or harmful condition. Occasional episodes of reverse sneezing are generally considered normal and not a health concern. While not a medical emergency, any instances of reverse sneezing and how frequently it happens should always be discussed with your veterinarian. Additionally, if your dog is experiencing other respiratory symptoms such as coughing, nasal discharge, choking, or trouble breathing, seek immediate veterinary care.   What Does Reverse Dog Sneezing Sound Like? Reverse sneezing sounds like the dog is actually inhaling their sneezes, hence the name “reverse sneezing.” It’s a loud snorting sound that can sometimes sound like a goose honking or even like the dog has something caught in its nose or throat. The first few episodes of your dog’s reverse sneezing can be scary if you’ve never heard it before. That’s why it’s best to have your dog evaluated by a veterinarian to determine if it’s simply a reverse sneeze or something more concerning such as coughing or choking.  If possible, take a video of the episode to show your veterinarian. And if you have any concern that your dog may be choking, call your vet immediately. How Long Do Episodes of Reverse Sneezing Last? Bouts of reverse sneezing in dogs will usually last only about 30 seconds or less, although it might feel like a lot longer. The dog will act completely normal before and after the episode What Causes Reverse Sneezing in Dogs? Like coughing or normally sneezing, dogs reverse sneeze to expel an irritant. A regular sneeze helps expel an irritant in the nasal cavity. Coughing helps expel irritants located farther down in the trachea. A reverse sneeze is the body’s way of expelling an irritant that’s slightly farther down, at the nasopharynx (the area by the soft palate). Some possible causes of soft palate irritation that results in reverse sneezing are: Allergies Household products (perfume, cleaning products, air fresheners) Pulling on the leash while attached to a collar Overexcitement  Exercise intolerance Objects in the throat (such as a foreign body or a mass) Nasal mites Elongated soft palate (common in brachycephalic breeds) Eating or drinking How Vets Diagnose Reverse Sneezing If a dog has never had an episode before, they should see a veterinarian to ensure that it actually was reverse sneezing and not something else that might be more serious. Your veterinarian will start with a thorough history of any respiratory irritants, seasonal allergies, or ingestion of foreign objects. If you were able to get the episode on video, that’s extremely helpful for the veterinarian in determining if your dog experienced reverse sneezing (chances are, your pup won’t do it again while at the vet’s office).  Your veterinarian will also perform a physical examination to assess your pet’s heart and lungs, and they’ll look for any other respiratory signs such as nasal discharge or an increased respiratory rate or effort. A complete blood count, serum blood chemistry, and urinalysis will all likely be recommended for a baseline evaluation. Additional tests may be performed to rule out other causes of similar snorting noises, such as: Collapsing trachea Nasal tumor or polyps Nasal foreign body Upper respiratory tract infection Inflammation (rhinitis) These tests may include a chest x-ray, a sedated oral and nasal exam, and possibly a rhinoscopy (where a camera is inserted in the nasal cavity and throat) to look for any abnormalities. Treatment for Reverse Dog Sneezing Generally, reverse sneezing does not require medication or treatment and is typically a fairly benign condition—as long as it’s infrequent. In frequent or severe cases of reverse sneezing, your veterinarian may consider prescribing medications to treat the underlying cause or provide symptomatic care.  Commonly utilized medications include anti-inflammatories, steroids, antihistamines, or decongestions such as Guaifenesin.  While rare, if nasal mites are diagnosed, your vet will treat your dog with anti-parasitic to eliminate them. How to Stop Reverse Sneezing in Dogs There are a variety of different tricks pet parents can perform to try to stop a reverse sneezing episode. Some suggest gently blowing in the dog’s face for a few seconds to make them swallow, which helps stop the sneezing. Or, you can open the dog’s mouth and gently press on the tongue until they swallow. You can also try massaging your dog’s throat to stop the spasm. If the problem is chronic, a veterinarian will have to diagnose the underlying cause and provide appropriate treatment. Featured Image: iStock/fotografixx"}]