[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Does Pet Insurance Cover Pre-Existing Conditions?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog-getting-vet-checkup.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog-getting-vet-checkup.jpg"}, "author": {"@type": "Person", "name": "Amber Souza, LVT", "url": "https://www.petmd.com/author/amber-souza"}, "keywords": "Dog, Pet insurance, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/does-pet-insurance-cover-pre-existing-conditions"}, "datePublished": "May 20, 2022", "dateModified": "September 8, 2023", "description": "Find out what pet insurance companies consider to be pre-existing conditions and whether these are covered.", "articleBody": "Pet insurance has become more popular as veterinary medical expenses continue to rise. If you’re looking into getting pet insurance for your dog or your cat, one important question is whether their health issues are considered to be “pre-existing conditions” and whether any policy will cover them.  What Is a Pre-Existing Condition? A pre-existing condition is defined as any medical condition that your pet has shown signs of or been diagnosed with before the insurance policy’s effective date. Here are a few examples: Your Pit Bull was diagnosed with allergies during the waiting period (a set amount of time after you get a policy until it kicks in). As a result, any treatments, such as medications or prescription foods, will not be covered by your pet’s policy. Before you signed up for pet insurance, you took your Siamese cat to the vet, who said that they were showing signs of inflammatory bowel disease (IBD). Even though your cat has not yet had testing to confirm a diagnosis, because your kitty had symptoms consistent with IBD, any future diagnostic testing or treatment for this condition will not be covered by their policy. Your German Shepherd is more prone to hip dysplasia due to their breed. If your pup does not show any signs of hip dysplasia before the policy’s effective date, any treatment or diagnostic testing for hip dysplasia is likely to be covered by the policy. However, some policies have specific rules for hereditary conditions like hip dysplasia, such as your pet must be under a certain age when they enroll in the policy, or that it won’t be covered if symptoms of hip dysplasia emerge within the first year of coverage. Check the FAQs or the policy for these exclusions. Do Any Pet Insurance Policies Cover Pre-Existing Conditions? In general, pre-existing conditions are not covered by most pet insurance plans, but there are exceptions. It all goes back to what the insurance company defines as pre-existing. Here are some of the most common types of illnesses and conditions, when they are considered to be pre-existing, and how that affects whether they’re covered or not. In general, pre-existing conditions are not covered by most pet insurance plans, but there are exceptions. It all goes back to what the insurance company defines as pre-existing.Hereditary and Congenital Conditions Many companies cover congenital and hereditary conditions as long as your pet hasn’t shown any signs or been diagnosed with one before coverage starts. Some companies even have separate “hereditary and congenital coverage” policies. Hereditary (genetic) conditions are common, especially in purebred animals, and are inherited from a pet’s parents. Some examples include: Hip dysplasia Elbow dysplasia Cherry eye (entropion) Patellar luxation Intervertebral disc disease (IVDD) Allergies Some types of cancer Thyroid disease Diabetes A congenital condition is one that your pet is born with, although they might not show any signs right away. Examples include: Hernia Congenital heart disease Some liver diseases, such as portosystemic shunts and copper-associated hepatopathy Nervous system issues Brachycephalic airway syndrome Curable Pre-Existing Conditions Curable conditions are defined as any medical condition/illness that your pet has been treated for and cured of. Most insurance companies require 180 symptom-free days to consider a condition cured, while some require a whole year. Some examples of curable conditions are:   Ear infections Urinary tract infections Upper respiratory infection Vomiting/diarrhea not related to a chronic illness Incurable Pre-Existing Conditions These are conditions that cannot be cured; instead, they must be managed. Most pet insurance plans will not cover incurable pre-existing conditions that were diagnosed before the policy’s effective date. Some examples of incurable conditions are: Arthritis Some types of cancer Allergies Diabetes Hip dysplasia Many types of heart disease Torn cruciate ligament Epilepsy Disc disease Urinary blockages, crystals, or idiopathic cystitis Bilateral Conditions A bilateral condition is a health condition that can happen to both sides of a pet. An example is hip dysplasia, which can occur in either the left or right hip, or often both. Most insurance policies will not cover a bilateral health condition if the issue was diagnosed before the coverage date, just like any average pre-existing condition. For example, if your pet was diagnosed with hip dysplasia on their left side before enrollment, and years later developed hip dysplasia on their right side, your policy will not cover either. Some other types of bilateral conditions are: Torn cruciate ligaments Glaucoma Uveitis Patellar luxation Cataracts Insurance companies exclude bilateral conditions because there is a good chance that a condition that occurs on one side of your pet’s body will develop on the other side. For example, a dog with left hip dysplasia will tend to shift their weight to their right side to avoid discomfort. As a result, they are at higher risk of developing hip dysplasia on their right side as well. The underlying genetics that predispose pets to many bilateral conditions also, obviously, affects both sides of the body. Hip dysplasia is also incurable, so it can be excluded for that reason if your pet had shown any signs before coverage. However, some bilateral conditions may be considered curable and will be covered. For example, let’s say your dog was diagnosed with an ear infection in the right ear before enrollment but develops an ear infection in the left ear after the policy kicks in. The insurance company will likely cover the left ear infection as long as your dog had been symptom-free for 180 days (or maybe longer) after the first ear infection. Be sure to read the fine print and ask your insurance company about bilateral conditions.  Can Symptoms Be Considered Pre-Existing Conditions? Yes! Even in the absence of a diagnosis, symptoms can also be considered pre-existing conditions if they are documented before a pet is covered. But it also matters if it’s a symptom of something curable or incurable. For example, if your pet excessively licks their feet but has not been formally diagnosed with allergies, any claims related to this will likely not be covered. This is because excessive paw licking is considered a common sign of skin allergies, which fall under the category of incurable pre-existing conditions. On the other hand, if your pet has symptoms of head shaking and ear scratching, which are known signs of ear infections, your policy is likely to cover treatment, as ear infections are deemed curable. Do Pet Insurance Companies Ask for Medical Records? Yes! Pet insurance companies do require medical records in order to enroll any pet in a policy. These companies employ teams of veterinary specialists that are trained to review your pet’s medical records to determine if your pet has any pre-existing medical conditions. Careful review of these records will ensure that your pet receives appropriate coverage and that you are reimbursed for your medical expenses as soon as possible. If your pet has never been to a vet, or has not been recently, the insurance company will usually require you to take your pet to a local veterinarian for an exam and provide records from the visit before enrolling your pet in a policy. Should I Get Pet Insurance for a Pet That Has Pre-Existing Conditions? Absolutely! Do not let your pet’s pre-existing condition discourage you from pursuing pet insurance. Even if the pre-existing condition isn’t covered, your pet insurance policy will still cover other things, like accidents or new illnesses. The policy should cover any future unrelated conditions that are diagnosed, depending on the type of policy you buy. Even if the pre-existing condition isn’t covered, your pet insurance policy will still cover other things, like accidents or new illnesses.In short, regardless of your pet’s medical history, pet insurance can be a good investment, particularly as pets age and are more likely to develop serious illnesses such as heart disease, kidney disease, or even cancer. Having that financial support can drastically improve your pet’s treatment options. So do your research, ask questions, and don’t be afraid to shop around for a policy that will best protect your pet from unforeseen medical costs. Featured Image: iStock.com/SeventyFour"}]