[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/sql9sj2jtq", "@type": "VideoObject", "duration": "PT2M19S", "name": "5346787323001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/4f948bc2eb80ba7095f73f5f416978bbe49a9aba.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/sql9sj2jtq", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/cfe6142f8d904cc725f14a470552f2d2e7f51144.m3u8", "transcript": "A good Samaritan had found a dog in their neighborhood in a trash bag. It's not every day that you find a dog in a trash bag. Dogs art trash they are living, breathing beings who deserve to be cared for and love. She was a dog and that was brought in through our Vinci service here.\n\nAnd when they first met her. She was not able to walk. She was paralyzed in her hind limbs. Couldn't move her back winds at all.\n\nAnd also couldn't feel them. And we know from her status and from studies of dogs once they've lost that ability to feel doing a large surgery is not actually going to restore their ability to move or to walk or to feel most of the time. I can't imagine anybody harming an innocent dog by give the best care. My dogs.\n\nI them like my kids and I can't imagine somebody actually doing that act of putting her in a bag and putting her out in cold. In January at the end of this month she will be getting her card, which will allow her to get around a lot better a lot faster. This is her card. She loved.\n\nActually, I was surprised. I didn't know how she was going to take to it and some dogs. I mean, you can imagine, it's kind of a strange apparatus for them to go into. But she didn't mind at all.\n\nAnd she immediately started to take off down the hallway. We definitely are looking forward to getting her into this. But we also wanted to let her rest a little bit and heal up a little first little rest to start with. And then she'll be able to have some more fun.\n\nAnd that's why she has changed my life by just adding so much joy to every single day. I can't wait to get I can see her in the morning, she brings happiness to every single person that she comes in contact with all she wants to do is love and be loved and be held.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/general-health/paralyzed-dachshund-found-trash-bag-finds-loving-new-home?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Paralyzed Dachshund Found in Trash Bag Finds Loving New Home", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/frances-family.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/frances-family.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/paralyzed-dachshund-found-trash-bag-finds-loving-new-home"}, "datePublished": "March 3, 2017", "dateModified": "September 7, 2022", "description": "Frances the Dachshund was found in a trash bag on the freezing cold streets of Philadelphia. The paralyzed dog received care from veterinarians at the University of Pennsylvania and is now in a loving home. Watch her incredible story.", "articleBody": "By Deidre Grieves No dog should have to endure what happened to Frances. The longhaired Dachshund was found in the Lawncrest neighborhood of Philadelphia—put out on the streets in the freezing cold like garbage. “A Good Samaritan found a dog in their neighborhood in a trash bag,” says Gillian Kocher, a spokesperson for the Pennsylvania SPCA (PSPCA). “It’s not every day that you find a dog in a trash bag. Dogs aren’t trash. They are living, breathing beings that deserve to be cared for and loved.” That Good Samaritan brought Frances to an animal shelter in the city and she was eventually transferred to the care of the PSPCA. Shelter workers brought Frances to the University of Pennsylvania’s Ryan Veterinary Hospital where doctors quickly realized that Frances was paralyzed in her hind limbs and couldn’t walk. She also couldn’t feel anything in her back legs. “We know from her status—and from studies of dogs—that once they have lost that ability to feel, doing a large surgery isn’t actually going to restore their ability to move or to walk or to feel most of the time,” says Dr. Jonathan Wood, who specializes in neurology at the hospital. Wood and his team assessed that Frances’ injury was an old one, and decided that the dog would be better off without surgery. After staying in the hospital to recover, the PSPCA started working to find Frances a caring, loving home. That’s where Christine Gacano and her family come in. Gancano immediately fell in love with Frances and welcomed the dog into her home with open arms. “I give the best to my dogs—I treat them like my kids,” says Gancano with tears in her eyes. “I can’t imagine somebody actually doing that act of putting her in a bag and putting her out in the cold in January.” Frances is fitting in nicely with the Gancano clan, which also includes two other Dachshunds. To help Frances get around, the veterinary team at PennVet made Frances a custom set of wheels so that she can walk, run, and play with her other furry family members. “I didn’t know how she was going to take to it, but she didn’t mind at all,” says Dr. Alex Tun. “She immediately started to take off down the hallway.” Frances’ disability presents no concern for Gancano and her family, who are thrilled to have Frances as part of their lives. “Every single day I can’t wait to get up and see her in the morning,” says Gancano. “She brings happiness to every single person she comes in contact with. All she wants to do is love and be loved.” Frances’ case is still under investigation in Pennsylvania."}]