[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Common Shoulder Injuries in Dogs: How To Identify, Treat, and Manage Them", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-11/GettyImages-1310040393.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-11/GettyImages-1310040393.jpg"}, "author": {"@type": "Person", "name": "Rhiannon Koehler, DVM", "url": "https://www.petmd.com/author/dr-rhiannon-koehler"}, "keywords": "Dog, Condition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/common-shoulder-injuries-dogs"}, "datePublished": "November 2, 2023", "dateModified": "November 3, 2023", "description": "Learn about the most common shoulder injuries in dogs, including symptoms, causes, and when to call your vet.", "articleBody": "Most dogs will go through life without experiencing a significant shoulder injury. However, if your dog is limping or showing pain in a front leg, an injury to the shoulder is important to rule out. Dogs carry most of their body weight on their front end, so injuries to their shoulder can be quite painful, especially when the dog puts weight on the affected limb. What Is a Shoulder Injury in a Dog? When we think about shoulder injuries in dogs, we’re usually talking about the shoulder joint. This joint is at the top of each front leg where the humerus (upper arm bone) connects to the scapula (shoulder blade). This is a ball-and-socket joint, which means the humerus has a ball-like structure at the top that fits into a socket on the shoulder blade. A shoulder injury is any alteration to this joint that causes the dog pain. This means either the bone itself or the soft tissues (muscles, tendons, ligaments) can be affected. Sprains and strains can happen to our canine family members, just like us. Common Shoulder Injuries in Dogs Below are five common shoulder injuries in dogs. We’ll provide a brief overview of these injuries and then discuss diagnosis and treatment. Supraspinatus Tendinopathy in Dogs One of the muscles of the shoulder is the supraspinatus muscle. This muscle is located on the half of the shoulder blade closest to the neck, while its tendon runs along the shoulder joint. Supraspinatus tendinopathy is most common in large-breed working and active dogs. Breeds with a higher incidence include: Labrador Retriever Rottweiler Border Collie Golden Retriever German Shepherd Australian Shepherd The most common cause is overuse from repetitive activity. These activities usually include landing with the forelimbs outstretched, quick turns, and jumping while turning. The repetitive activity causes strain on the injury. Over time, this can lead to scar tissue buildup in the tendon (supraspinatus bulge). Symptoms usually include: Limping on one side (occasionally both sides)Lameness (impaired mobility or limping) after exerciseShortened stride lengthOften, the symptoms won’t improve with rest and anti-inflammatory medicationsMuscles of the shoulder blade may appear small and shrunken (atrophied)Pain when the tendon is palpated (examined by touch)Infraspinatus Myopathy in Dogs The shoulder includes a muscle called the infraspinatus muscle, which rests on half of the shoulder blade on the side closer to the back half of the pup. With chronic infraspinatus myopathy, there is contracture (shortening and hardening) of the infraspinatus muscle, referred to as infraspinatus contracture. Infraspinatus myopathy occurs due to trauma in the area. This trauma can result from blunt trauma (such as being hit by a car) or repeated small traumas (such as running for a long time). The muscle is covered by a fibrous layer called fascia. When swelling occurs within the space restricted by the fascia, it affects blood flow to the area. In many cases, the trauma has not completely caused a rupture of the muscle, leading to fibrosis (the formation of excess fibrous tissue) and subsequent hardening of the muscle. Symptoms include: Painful, non-weight-bearing lameness (after the initial injury) Swollen shoulder (after the initial injury) Initial pain and lameness usually resolve over several weeks, but then contracture may appear later After contraction occurs, you may notice weight-bearing lameness with a flip-like action of the paw when placing the foot After contraction occurs, the shoulder may appear to be rotated outward, and the elbow is held against the dog’s chest with the lower limb held away from the body Atrophy of the shoulder muscles over time Biceps Tendinopathy (BT) in Dogs The biceps brachii muscle is located on the upper arm, with the tendon of this muscle coursing upward through the shoulder joint. This muscle is important for flexing the elbow, extending the shoulder, and stabilizing the shoulder when weight is placed on the limb. As with other shoulder injuries, BT usually occurs in large-breed working dogs due to repeated strain. Breeds commonly affected include Labrador Retrievers and Rottweilers. Symptoms include: Difficulty making sharp turnsReluctance to jumpShortened strideWeight- bearing lameness, which worsens after activityPain when pressing on the affected tendonPain when the biceps muscle is manually stretchedOsteochondritis Dissecans (OCD) in Dogs OCD is a developmental condition, which means it occurs in dogs still growing. As dogs mature, some of the cartilage on the joint surface turns into bone, a process called ossification. When specific areas of the joint surface don’t mature normally into bone, these areas can form islands of cartilage. This is called osteochondrosis. In some osteochondrosis cases, a flap of cartilage can lift off the joint surface. This is called osteochondritis dissecans. Dogs are most often affected between 4 to 8 months of age. Symptoms include: Limping on a front leg (sometimes both)Pain when the leg is moved through its range of motionAtrophy of muscles on the affected legMedial Shoulder Instability (MSI) in Dogs Medial shoulder instability refers to instability on the inner part of the shoulder joint (toward the dog’s midline). This instability can result from a single traumatic event, but the most common situation is chronic repetitive use. Small tears develop in the shoulder tissues, causing the joint to become unstable. In its most severe form, the shoulder joint gets dislocated. Dislocation (luxation) usually occurs due to trauma, such as being hit by a car. Symptoms include: A change in how the dog performs a specific movement, such as sharp turnsWeight-bearing lamenessUsually only affects one sideWorsens after exerciseHow Veterinarians Diagnose and Treat Shoulder Injuries in Dogs If your dog is limping in either front leg and your veterinarian suspects a shoulder injury, they’ll want to observe your dog walk and test their range of motion to confirm if the shoulder joint is affected. Shoulder X-rays are the most likely diagnostic test that your veterinarian will perform. This allows the veterinarian to rule out bone injuries. In some cases, X-rays can also detect changes to tendons, which may help determine the cause of the dog’s pain. For example, some dogs with supraspinatus tendinopathy will have mineralization (formation of mineral deposits) of the tendon, which may be visible on X-rays. If the veterinarian doesn’t detect any evidence of a bone injury (such as a fracture or OCD, or arthritis), they will suspect a soft tissue injury. It’s difficult for a private-practice veterinarian to determine the exact cause of soft tissue pain in a shoulder. They are likely to treat with pain and anti-inflammatory medications like carprofen. If your pet is still experiencing limping and lameness at a follow-up visit, you may be referred to a specialist for advanced diagnostics. Advanced diagnostics for a shoulder injury could include shoulder arthroscopy (surgically placing a camera into the shoulder joint), an ultrasound, or an MRI. In some cases, the veterinarian may collect joint fluid to rule out infection. Some conditions, such as a fracture or OCD, may have surgical treatments. However, some soft tissue injuries may be treated conservatively, with pain and anti-inflammatory medications as well as cage rest. Cases that do not respond to conservative treatment may require long-term management. Many shoulder injuries will show improvement with rehabilitation techniques like ultrasound therapy, shockwave therapy, range-of-motion exercises and stretches, heat, and massage. Be sure to follow your veterinarian’s recommendations for managing your dog’s shoulder injury. When To Call Your Veterinarian About Your Dog’s Shoulder Injury Shoulder injuries in dogs are typically not a medical emergency. If you notice your pet is limping but they’re otherwise acting normal, you can simply call your veterinarian for an appointment. However, if your dog is known to have experienced a traumatic injury, such as being hit by a car, seek immediate medical attention. With traumatic injuries, the full extent of the injury isn’t always apparent right away, so it’s important to have a veterinary evaluation. Featured Image: xavierarnau/E+ via Getty Images"}]