[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "10 Things You Probably Shouldn&#039;t Do at the Vet&#039;s Office", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1345373138.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1345373138.jpg"}, "author": {"@type": "Person", "name": "Lauren Mick, LVT", "url": "https://www.petmd.com/author/lauren-mick"}, "keywords": "Dog, Cat, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/10-things-you-should-not-do-at-vet-office"}, "datePublished": "December 15, 2022", "dateModified": "January 26, 2023", "description": "Are you that one pet parent that causes the vet staff extra stress? Find out how you can help make your pet’s visit go as smoothly as possible for everyone.", "articleBody": "Some pets enjoy vet visits, but as you are probably well aware, many do not. They can’t comprehend that the procedures and medications they get at the vet clinic are for their own health and well-being. But there are ways you can help make the experience at the vet’s office easier for your pets as well as for you and the veterinary staff. Here are some pointers for what NOT to do. Assume good behavior in your pets We all like to think our own pets are the best four-legged creatures to walk the Earth. Unfortunately, it is very common and normal for pets to show a completely different side at the veterinary clinic, especially if they’ve never been to that clinic before or they remember a previous negative visit. Cats can have difficulty with a change in environment, even more so if they are strictly indoors. It helps to take things slow. You may also want to search for a “Fear-Free Certified” clinic. Let dogs sniff around if they are on a leash. Use many positive reinforcement cues, such as treats (if they can have them), verbal praise, and pets. If your pet has not been to the vet’s office before, let the staff know it’s their first visit. Assuming a pet will be friendly (even if they have been in the past) can put the staff in danger and cause a negative experience for your pet. Assume pricing Part of veterinary care is the cost. Just like the bills for people, medical expenses can be high. You will most likely not visit two clinics that have the same pricing, as this is dependent on many factors, such as location, quality, and demand. Do not assume that because your friend had a dog spayed for $120 that it will be the same for your own pet. Larger pets need more medication; smaller pets need less. Different medications cost the clinics different amounts, and some are very hard to come by. If you are in a small town at a local vet, and your friend went to a large vet chain in a big city, the rates will be different. Keep in mind that you are paying for the best care possible for your beloved pets. Pet insurance can help you be prepared for unexpected expenses and be a life saver, literally! Wellness plans can help you prep for all the expected expenses of keeping your pet healthy. Assume the diagnosis When you bring your pet in with an illness, come with an open mind. Many symptoms can show up with tons of different illnesses. For example, vomiting in cats can be hairballs, allergies, thyroid disease, irritable bowel disorder, anxiety, or many other diagnoses. On top of this, pets tend to hide symptoms well into their illness. Let your veterinary staff do the necessary physical exam and diagnostics to figure out what’s going on with your pet instead of assuming what the diagnosis is. Google your way to cancer This is a big one: Do not google yourself into a panic prior to a sick visit. The internet can be a great resource for pet information, but it can be misleading if the source is not reliable. It can lead you to expecting the worst outcome possible for your pet. This can cause a lot of unnecessary anxiety for you, and since pets can sense our anxieties, it can make your pet stressed out, too. This can make the vet visit more stressful for everyone. Not use a leash Please do not think that your oh-so-lovable Golden Retriever does not need a leash for their vet visit. You never know what your dog may react to in the parking lot or waiting room. There may be a very anxious large dog that can cause you or your pet harm if they are approached by a pet that is off leash. Off-leash pets can stress out sick pets or pets that are naturally anxious and already on the verge. Some animals, such as rabbits and cats, can very easily be frightened by a large dog coming up to their carrier. We want to do what’s best for every pet and pet parent, so make sure your pet is on a leash and not approaching other pets. Not use a carrier Keeping smaller or more anxious pets in a carrier is just as important. Many pets feel safer when they are in an enclosed space. This protects them from other animals as well. Without a carrier, a cat, bird, small reptile, or pocket pet can run away or seriously harm themselves. Carriers also make it easier for veterinary staff to access the pet. Here are a few great options for carriers: Small pet carrier/rodent: Frisco Top-Loading Small Pet Carrier Reptile carrier: IRIS Reptile Habitat Carrier Bird carrier: Yaheetech Iron Travel Bird Cage Carrier Cat/small dog carrier: *Pro tip: Look for a cat or small dog carrier with front and top access, such as the one below. This makes for easier entry and exit, and pets are less likely to get trapped in the carrier during emergency medical situations. Frisco Two-Door Top-Load Dog and Cat Kennel Keeping carriers in plain sight while at home and bringing them out commonly helps pets not associate them with just going to the vet, which can cause anxiety. Allow your pet to make a positive association with their carrier. Use a retractable leash or super long leash This one you may not be aware of, but it’s important to know. Retracting leashes are dangerous. They can wrap around your pet, other pets, or people. This can lead to wounds and trip hazards. Instead, use a fixed-length leash. Long fixed leashes are great for “sniffaris” with your dog outdoors, but in a waiting room, they can be dangerous as well. Choose a leash that’s short enough that it allows you to keep your dog within a few feet. You may choose to pair this with a quality harness. It helps even more if the harness has a handle, or even if the leash has a handle. Here are some options that are perfect for vet visits: Leashes: OneTigris Training Nylon Bungee Dog Leash Chai’s Choice Premium Outdoor Adventure Padded 3M Reflective Leash Frisco Solid Nylon Dog Leash Leads (great for dogs that tend to slip out of their collars, and for when you need some extra handling support):  Guardian Gear Kennel Dog Lead Harnesses: *Pro tip: When it comes to harnesses, the best way to ensure your dog does not pull is positive reinforcement training. Although certain harnesses will prevent a lot of the pulling (easy-walk), a strong-willed dog will still pull if they are motivated enough!   Mighty Paw Padded Sports Reflective No-Pull Dog Harness Kurgo Tru-Fit Enhanced Strength Crash-Tested Car Dog Harness PetSafe Easy Walk Dog Harness Medicate your pet before discussing with the vet health team or forget to mention current medications Many people have anxiety medications for their pets or antibiotics/steroids lying around the house that they were prescribed in the past but they did not finish. You may want to ease your pet’s anxiety before a vet visit or planned procedure/test, but unless you’ve discussed premedicating with your veterinary care team, do not give your pet unprescribed medication. This can cause all sorts of issues. First, it makes it harder for vets to see clinical signs and be able to reach the right diagnosis if they can’t see your pet when they are not sedated or medicated. You can also cause unwanted or dangerous side effects. Non-steroidal anti-inflammatory medications (such as Rimadyl, Metacam, Deramaxx, or Etogesic) and corticosteroids (such as prednisone, triamcinolone, or dexamethasone) are two of the most frequently prescribed classes of medications in veterinary medicine. But when two or more are given at the same time, even within a few days of one another, gastrointestinal problems are likely. Another example is combining certain drugs that may cause “serotonin syndrome.” Several types of drugs commonly prescribed to pets increase serotonin levels within the brain, and when they are used together, their combined effect may result in a dangerous and possibly fatal reaction. Drugs that can play a role in serotonin syndrome in pets include Anipryl (selegiline or L-deprenyl), Mitaban and Preventic (amitraz), Clomicalm (clomipramine), Reconcile and Prozac (fluoxetine), and amitriptyline. These medications should not be given together. Transition or “wash-out” periods that last several weeks may be necessary when switching from one to another. Make sure you have past medical records and a list of current medications your pets are on when you come to the vet. You can even find templates online that can help you prepare for commonly asked veterinary visit questions. Example template by Dr. Judy Morgan  Judge veterinarians or veterinary staff members by their cover In a veterinary clinic or hospital, you are bound to see staff from many different backgrounds. But one thing they all most likely have in common is that they’re there to help keep your pet healthy and make them feel comfortable at the clinic. Do your best not to judge any of these dedicated professionals by their appearance. For example, don’t assume that if a veterinarian looks young, they must not have any experience or know what’s best for your pet. Think we are adding unnecessary tests to charge more One of the most common misconceptions pet parents have is that veterinary professionals charge high prices and make bucketloads of money from their field of work. The truth is that veterinary professionals are not in this field for money. In many cases, they could be making much less than you expected. In addition, the American Veterinary Medical Association estimates that recent graduates have an average debt of $147,258 from veterinary school. Veterinary professionals also sacrifice their mental and physical well-being at times for the love of their field. Sadly, the rates of suicide and depression are high for veterinary professionals compared to the general US population. The reasons for this are many—burnout, high-stress jobs, big workloads, long hours, and even though they may hide it, compassion fatigue in having to give bad news to pet parents about their beloved pets. They’ve dedicated themselves to making pets’ lives better by doing the best they can for them in times of need, whether that’s placing an IV catheter, performing orthopedic surgery, or simply giving your pet one-on-one time and love so they know they are in good hands. Featured Image: iStock.com/aldomurillo"}]