[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Does Pet Insurance Cover?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Health", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/vet-petting-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/vet-petting-dog.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Cat, Dog, Pet insurance", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/what-does-pet-insurance-cover"}, "datePublished": "May 11, 2022", "dateModified": "October 8, 2023", "description": "Find out what health issues and preventive measures are covered by the different types of pet insurance plans.", "articleBody": "Figuring out pet insurance can be overwhelming, especially when it comes to what it covers—and what it doesn’t. The “best” pet insurance coverage depends on your individual situation. The most basic questions you’ll have to answer as you look for a plan are: What your pet needs Whether the policies you’re considering provide that coverage While your vet can be a great resource to help you understand pet insurance and which plan is right for you, here are some basics on what pet insurance covers.  What&#039;s Usually Covered by Pet Insurance? The exact pet insurance coverage depends on what type of plan you have. Pet insurance plans are not like human plans, where everything from your yearly physical to a sprain or rash falls under one plan. In general, most pet insurance companies offer three main plans that vary in what they will cover: Accident-only pet insurance plans Accident and illness plans Wellness/preventive pet insurance plans Accident-Only Pet Insurance Coverage As the name implies, an accident-only pet insurance plan covers costs associated with accidents, including some emergency veterinary expenses. Often, there is the misconception that “everything emergency” is covered by an accident-only plan. However, it’s always a good idea to read the fine print on accident-only plans—because your idea of an accident and the insurance company’s idea of an accident might be very different. For example, if you knock over the garbage can and your dog quickly scarfs down a chicken bone that results in emergency medical expenses, this might not be considered an accident. However, if someone leaves the front door open and your dog runs outside and gets hit by a car, that would likely be covered as an accident. Accident-only pet insurance coverage tends to be less expensive, which makes sense, considering these plans are the most restrictive. When pricing your plan, also make sure you understand the deductible, caps, and reimbursement percentages as well. These will affect your out-of-pocket expenses if you need emergency coverage. Accident and Illness Pet Insurance Coverage Accident and illness pet insurance tends to be the most popular type of plan among pet parents, because these often cover any nasty surprises you weren’t expecting. These generally cover both accidents (such as falling off the deck), and health conditions, from infections to chronic health conditions like diabetes, joint disease, and even cancers. The typical accident and illness pet insurance covers diagnostic and treatment expenses related to those types of vet visits (“sick pet” visits). Accident and illness pet insurance tends to be the most popular type of plan among pet parents, because these often cover any nasty surprises you weren’t expecting.Accident and illness plans are more expensive than accident-only plans, but they have a wider range of coverage. Many policies will include deductibles, caps, and varying reimbursement percentages, which will further influence the cost of your pet insurance plan and out-of-pocket costs. Wellness Plans Pet wellness plans typically provide coverage for wellness and preventive care. They are often sold as add-ons to traditional accident-and-illness pet insurance plans, or they can be purchased as standalone policies. Wellness plans usually cover standard things such as routine vaccinations, annual checkups, senior checkups, heartworm testing, and parasite prevention medications for heartworms, fleas, and ticks. One advantage of getting a wellness plan is spreading the expenses across a full year instead of paying them all at once when your pet needs routine care once or twice a year. Wellness plans can also encourage you to schedule all your pet’s preventive care. After all, no one wants to leave benefits on the table! As always, read the fine print of the plan. For example, many wellness plans don’t cover dental care. Or, they might cover dental cleanings but not tooth extraction, but the extraction might be covered under an accident and illness policy.  What Does Pet Insurance Not Cover? As with any plan, it’s always a good idea to read the fine print and ask questions. Search the company’s website for a list of conditions that are not covered. Some plans will have exemptions for congenital conditions (ones present at birth) and/or hereditary conditions based on your dog’s breed. For example, certain respiratory conditions among English Bulldogs may not be covered because they’re so common.  Problems that develop during the “waiting period” (the date from when you sign up until coverage kicks in) will also not be covered. Generally, if your pet is considered to have a “pre-existing condition” (such as a heart murmur or arthritis diagnosed before you signed up), expenses related to this health condition will not be covered.  Specific types of therapy, such as massage therapy, behavioral therapy, and non-mainstream treatments may or may not be covered.  How Much of the Vet Bill Will Pet Insurance Cover? The amount you get reimbursed depends on the type of plan, your deductible, the reimbursement percentage, and the annual or per-condition cap. Similar to human insurance, a deductible is a set amount that you pay the vet before coverage kicks in. There are some different kinds: An annual deductible resets each year. Your dog may get hives and also be diagnosed with an ear infection on separate visits, and all approved costs will go toward the yearly deductible. Once the deductible is met, your coverage kicks in. A per-incident deductible is one where you have to pay a certain amount for each type of incident. In this scenario, let’s say your dog is diagnosed with diabetes. You will be responsible for hitting the deductible before coverage kicks in. While these expenses can add up, the advantage is that, assuming you keep the policy year after year, you’ve already satisfied the deductible for diabetes-related expenses in the first year. Also pay attention to the reimbursement percentage. This is the amount of coverage a plan provides after the deductible is met. For example, if the reimbursement percentage is 90%, you will be responsible for 10% of all expenses even after you’ve met the deductible. In this scenario, if you have a vet bill for $1,000, you will still owe $100, or 10%, of the total bill. Many policies also have an annual reimbursement cap, meaning they will only pay so much in any given year. If your pet has an expensive year, you will be responsible for all costs above the total reimbursement cap. Other insurance companies use a per-condition deductible. For example, the policy may only pay up to $3,000 to treat your pet’s diabetes, but if they also get a skin tumor that needs to be removed, that will be covered. When Will Pet Insurance Start Covering Incidents? In most cases, pet insurance doesn’t kick in immediately. Most insurance companies have a waiting period between the time you buy the policy and the time the coverage actually starts. This is to make sure your pet doesn’t have an immediate and expensive health need that caused you to run out and buy insurance. There may be one waiting period before illnesses are covered (such as 14–30 days), and a different waiting period (such as 48 hours) for accidents to be covered. Pet insurance can be a great investment in your pet’s health, but to get the most from your insurance, make sure to weigh all the factors, including your pet’s life stage and health status, and all plan options. And remember, you need to purchase a policy before your pet is sick or injured! Your vet will always be a good resource for questions on pet insurance. A little bit of research up front can save a lot of extra expenses and misunderstandings later on. iStock.com/SeventyFour"}]