[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Causes Urinary Incontinence in Dogs and How Do You Treat It?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/old-senior-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/old-senior-dog.jpg"}, "author": {"@type": "Person", "name": "Amanda Simonson, DVM", "url": "https://www.petmd.com/author/dr-amanda-simonson"}, "keywords": "Dog, Urinary health, General Care, Symptom Checker, Urinary Incontinence", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/incontinence-senior-dogs-what-do-and-how-help"}, "datePublished": "July 31, 2020", "dateModified": "September 12, 2023", "description": "Dr. Amanda Simonson explains what causes urinary incontinence in dogs and how it can be treated.", "articleBody": "Managing incontinence in a dog can be frustrating. You keep finding and having to clean up dog pee in the house, and you may even start to feel angry or upset. But here’s the good news: Understanding the causes and seeking treatment can lead to the best outcome for your pet. Here’s the information you need on what causes dog incontinence and what you can do about it. What Is Incontinence in a Dog? Incontinence is the involuntary leakage of urine. So if your dog is incontinent, it means that they are not even aware of the fact that they are urinating. This incontinence occurs often in places where pets are resting (like in their bed or on the couch), and it tends to be a normal or large amount of urine. What Causes Urinary Incontinence in Dogs? There are many causes of incontinence in dogs. The first thing to note when you find urine in inappropriate places is where the pee is located and how much urine there is. It is important to watch your dog when they are urinating to gather clues as to the nature of the problem. Several medical conditions can result in inappropriate urination or urinary incontinence in a dog: Urinary tract infection Uroliths (urinary bladder stones) Excessive drinking of water (which can be caused by diabetes mellitus, hyperadrenocorticism or Cushing’s disease, diabetes insipidus, and kidney failure) Spinal cord disease or damage (inflammation, trauma, pain, vertebral abnormality, paralysis, cancer) Ectopic ureters and other anatomic abnormalities (a physical defect in the tubes that carry urine from the kidney to the bladder; most commonly found in young dogs) Weak bladder sphincter (reduced sensitivity of receptors in the sphincter) How Can You Tell Dog Incontinence From Inappropriate Elimination? Other conditions can look like incontinence in dogs but may be caused by a different issue. Most of the following instances of inappropriate elimination are voluntary urinations in which the pet is aware, but loses control.    Submissive or excitement urination: This is a voluntary urination that has a behavioral component. Submissive urination often involves a small amount of urine and only happens when your dog is near a person or excited about an event.   Lack of proper house-training: Some dogs have not been consistently and positively trained to eliminate in appropriate spots. This can look like a normal amount of urine, and it tends to happen near a door or somewhere away from where your dog eats, sleeps, and plays. Cognitive changes: Older pets can experience cognitive changes that alter their ability to recognize appropriate places to urinate. You will find a normal amount of urine in any place throughout the house. Pain: Pain can lead to inappropriate elimination as well, as some pets find it difficult to posture or physically move to the correct location. Sometimes this can look like your dog is dripping urine as they try to make their way outside. How Do You Treat Dog Incontinence? If you find urine around the house, or you suspect urinary incontinence, you need to take your dog to the vet to discuss the details of your observations. The doctor will perform a physical examination to note changes in your pet’s body, as well as some diagnostic tests. This usually starts with urinary testing (a urinalysis and urine culture) and blood work. These tests can decode many medical causes of the changes in urination. Other tests may be required depending on the results of these tests. Once your vet understands more clearly what the medical condition is, they can address it specifically: Urinary tract infection: Antibiotics are used to clear a urinary tract infection. Bladder stones: Diet and medication can help with some bladder stones. Pain management can be started if indicated. Many urinary bladder stones require surgical intervention. Diabetes and Cushing’s disease: Urine issues caused by diabetes and Cushing’s disease can improve when you address the primary condition. Ectopic ureters: Surgery is commonly indicated if ectopic ureters are found. Weak bladder: Dogs are started on medication or they may require surgery. Urinary Incontinence Caused by a Weak Bladder Let’s talk more specifically about the details involving weak bladder sphincter incontinence. The medical term is urethral sphincter mechanism incompetence (USMI). This condition is the most common cause of urinary incontinence in spayed female dogs. Often, they are mature or middle aged when the incontinence starts. According to a research article by Forsee, Davis, Mouat, et. al in the Journal of the American Veterinary Medical Association, dogs weighing 15 kilograms (33 pounds) or more are seven times more likely to develop urinary incontinence.1 The Veterinary Information Network notes that several breeds have urinary incontinence more commonly. These include the Bearded Collie, Boxer, Collie, Dalmatian, Doberman Pinscher, English Springer Spaniel, German Shepherd Dog, Irish Setter, Old English Sheepdog, Rottweiler, and Weimaraner.2 Multiple factors are thought to play a role in USMI, including abnormal bladder positioning, estrogen deficiency or decline, obesity, genetics, or changes to vaginal support structures. Studies show mixed results about the timing of spaying in relation to this condition. Treatment for Weak Bladders in Dogs We initially try medication therapy for dogs experiencing USMI. Phenylpropanolamine (PPA) is a drug we commonly trial; it is well-tolerated by many pets and has been widely used in veterinary medicine. This medication can have some side effects (high blood pressure or elevated heart rate), so we monitor these pets closely after starting medication. Estrogens can increase the number or sensitivity of the receptors in the urethra. Sometimes we can use testosterone in males. Often, these medications do not need to be given as frequently as other medications. However, these drugs can also have side effects on the bone marrow, so we monitor blood work once starting one of these medications.    Surgical therapy can be considered if dogs do not respond to medical therapy. Surgery can include a procedure called colposuspension, or injection of bulking agents such as collagen into the urethra, or stem cell therapy. Many dogs respond well to therapy. These pets can have a good quality of life and enjoy many normal activities with their families. Typically, once starting medication, a dog will remain on a lifelong dose. Sometimes a dose change or addition of a second medication is required. Dog diapers can be effective tools to help to manage cleanliness, but you will need to carefully monitor for urine scalding or skin infection. This can happen if urine is sitting against your dog’s skin for too long. This moist environment can be uncomfortable for your pet or allow for an infection to develop. References: Forsee KM, Davis GJ, Mouat EE, et. Al. Evaluation of the prevalence of urinary incontinence in spayed female dogs: 566 cases (2003-2008). J Am Vet Med Assoc. 242(7):959-62. 2013.Rothrock K (revised), Shell L (original author). Veterinary Information Network, VINcyclopedia of Diseases: Canine: Incontinence, Urinary.Featured Image: iStock.com/Capuski"}]