[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bladder Stones in Dogs: Can You Prevent Them?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-bladder-stones-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-bladder-stones-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Urinary health, General Care, Preventative care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/bladder-stones-dogs-can-you-prevent-them"}, "datePublished": "October 26, 2017", "dateModified": "September 7, 2022", "description": "Preventing bladder stones in dogs before they develop (and cause pain and discomfort) is ideal, but prevention and treatment can be a challenge. Still, there are things you can do to reduce the risk of occurrences of bladder stones in dogs.", "articleBody": "By Paula Fitzsimmons If your dog has accidentally made puddles on your floor, had trouble peeing, or you’ve noticed blood in her urine, your veterinarian may have diagnosed her with bladder stones. Preventing stones before they develop (and cause pain and discomfort) is ideal, but prevention is not always straightforward. Nor is it guaranteed to work. There are several different types of stones, which form for different reasons and require various forms of treatment and strategies for prevention. For example, “despite preventative measures, approximately 50 percent of dogs will have recurrence of calcium oxalate stones within two years,” says Dr. Alex Gallagher, a clinical assistant professor at the College of Veterinary Medicine, University of Florida in Gainesville. Difficulties in preventing bladder stones arise partly because some factors are out of your control. Your dog’s breed, for example, may genetically put her at a higher risk for bladder stones. And because vets don’t have a solid understanding of why some stones develop, prevention and treatment can be a challenge. “Calcium oxalate stones are difficult to prevent, as the cause of these stones is poorly understood in most cases. A majority of dogs that have recurrence likely have an underlying genetic predisposition that, at this time, we are unable to identify or treat,” he says. Still, there are things you can do to reduce the risk of occurrences. “The most important considerations would be to keep your dog at a good lean body weight, offer plenty of fresh water, and feed a high protein diet,” says Dr. Meghan Glazer, a veterinarian at WVRC Emergency &amp; Specialty Pet Care in Waukesha, Wisconsin. How Your Dog’s Breed Affects Risk of Bladder Stones Bladder stones develop in a dog’s urinary tract when minerals are concentrated in the urine, then crystallize. The most common stones dogs get are those made of struvite or calcium oxalate, says Glazer, who specializes in emergency medicine. (Vets also say stones made of ammonium urate are relatively common.) The type of stone (or combination of stones) that develops is determined, in part, by breed, says Dr. Zenithson Ng, a clinical assistant professor at the University of Tennessee, College of Veterinary Medicine.   Some of the smaller breeds are genetically predisposed to calcium oxalate stones, he says. These include Miniature Schnauzers, Bichon Frise, Lhaso Apsos, Yorkshire Terriers, and Shih Tzus. These same breeds, as well as Miniature Poodles, Pekingese, and Dachshunds, are at higher risk for developing struvite stones. A liver shunt—a congenital condition that increases ammonia levels in the blood and urine—puts certain breeds at increased risk for developing urate stones, Gallagher says. “Liver shunts are common in certain breeds, including Yorkshire Terriers, Maltese, Pugs, and Miniature Schnauzers.”   He says urate stones can also be caused by an inherited defect in uric acid metabolism, seen most often in English Bulldogs and Dalmatians.  Age as a Risk Factor for Bladder Stones in Dogs Although bladder stones can occur at any point in a dog’s life, age can factor in, says Ng, who is board-certified in canine/feline practice. For example, “Struvites are more often found in young adult dogs and are the most common stone diagnosed in puppies.” Urates, he says, are more often diagnosed in dogs 4 to 5 years old, and calcium oxalate stones are most frequently diagnosed in middle-aged and older dogs, 7 to 9 years old. Older dogs also have an increased risk of developing diseases that predispose them to stone formation, says Gallagher, who is board-certified in veterinary internal medicine. “This includes diseases that increase risk of infections that can result in struvite stones and increasing levels of calcium in the blood or urine that can increase the risk of calcium oxalate stone formation.” Diseases That Can Lead to Bladder Stones Certain conditions can predispose a dog to bladder stones, Glazer says. “For example, if a patient has diabetes, they are inherently at a higher risk for urinary tract infections, and subsequently struvite bladder stones.” Dr. Cathy Meeks, a veterinarian with BluePearl Veterinary Partners in Tampa, Florida, adds that when a dog has diabetes, “the urine will have sugar in it, making it a good environment for bacteria to grow.” But struvite stones are almost always due to infection. Certain types of bacteria produce an enzyme called urease, Gallagher says, and urease increases the concentration of the minerals needed to form struvite stones. “Common bacteria that do this include Staphylococcus, Proteus mirabilis, some Klebsiella species, and some Corynebacterium species. Prevention of these stones involves treating the underlying infection and monitoring for recurrence of infection and stones.”  Hydration Is Key to Stone Prevention The best tip for management and prevention of any kind of crystal and stone is to focus on keeping your canine companion hydrated, Ng says. “The role of adequate water intake cannot be stressed enough.” Water reduces the ability of a bladder stone to develop, Glazer adds. “Increasing water intake promotes dilution of urinary crystals (of various origins), allowing them to dissolve or be flushed from the system prior to organizing into actual stones.” Ng says your dog should always have access to fresh water. “Ensure that they are well hydrated and that they are given the opportunity to urinate frequently throughout the day.” The general rule is for dogs to drink about an ounce of water per pound of body weight each day. Keep her water bowl clean and filled with fresh water and make sure she can easily reach it. You can also promote good hydration if you feed her canned food, which contains about 70 to 80 percent water. The Role of Diet in Preventing and Managing Bladder Stones What you feed your dog also plays a pivotal role in the prevention and management of bladder stones, but will depend on the type of stone your dog develops. “Prescription urinary diets are formulated for the specific type of stone that a dog has formed. These specific diets influence factors such as the body’s electrolyte and mineral composition and urine pH, which can reduce risk of further production or in some cases, possibly dissolve the stones which are present,” Ng says. Calcium oxalate stones require a pH that is more basic to prevent recurrence, whereas a struvite stone requires a more acidic pH, says Meeks, who is board-certified in veterinary internal medicine. “Also some stones (like struvites) are able to be dissolved without surgery in some cases. These stones usually form secondary to a urinary tract infection and can be treated with antibiotics and a special diet that causes the urine to be more acidic.” There is a connection between diets higher in carbs (and lower in protein) and the development of oxalate bladder stones, Glazer says. “There is also a link between obesity and the development of these stones. Thus, feeding a high-protein diet and keeping your dog at a lean body weight can be helpful in prevention.”  Calcium oxalate stones cannot be dissolved by diet (surgery or other procedures are required to remove these stones from the bladder) but dietary management is essential to preventing recurrence, Glazer says. “It namely focuses on managing specific electrolytes and the pH of the urine.” The opposite is true for struvite stones. Diet does not typically play a key role in their formation, but they can be dissolved with a prescription diet (by adjusting the pH of the urine) and treating the infection, she adds. “This dissolution occurs typically over the course of a few weeks to months. Close monitoring is warranted during the process, as some patients can develop urinary obstructions if the stones suddenly block off the urethra.” If the available prescription diets are not appropriate for your dog, your veterinarian can prescribe medications that will result in urinary acidification. The Importance of Regular Monitoring Early identification of bladder stones is important. “In dogs that have had bladder stones, particularly calcium oxalate, regularly monitoring to find recurrence early can be helpful, as less invasive methods [than surgery] might be available to remove stones when they are small,” Gallagher says. In order to monitor effectively, you should know which symptoms to look for. “It is recommended to have a veterinarian evaluate your pet if you note any blood in the urine, straining to urinate, change in frequency of urinations, etc.,” Glazer says. “The most concerning symptoms would be straining to urinate or inability to urinate, indicating that immediate veterinary attention is warranted.” Letting your dog out frequently to pee is good practice, but you also need to watch her when she urinates. “Oftentimes, if dogs are not walked and only let out to go to the bathroom, initial or subtle signs of urinary stones (or any type of urinary abnormality) may not be noticed and not addressed until the dog demonstrates severe signs,” Ng says. Taking your dog to the vet for an annual checkup is also a key component of prevention, Ng says. “If there are any concerns, your veterinarian may make recommendations for you.” Your dog may not be able to completely avoid getting bladder stones, especially if she is predisposed by breed or age. But you can take steps to reduce these occurrences—and spare her needless suffering."}]