[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Thunderstorm, Thunder and Lightning Safety for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-06/thunderstorm-and-lightning.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-06/thunderstorm-and-lightning.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, General Care, Anxiety, Zoo Anxious Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/thunderstorm-and-lightning-safety-pets"}, "datePublished": "June 27, 2022", "dateModified": "August 30, 2023", "description": "Find out what you can do to prepare for thunderstorms with pets, from easing their anxiety to keeping them safe from lightning.", "articleBody": "Even before you hear the first rumble, you can tell just by looking at your dog that a thunderstorm is brewing. Many dogs become very frightened with even the smallest storm. An upset pet may cause damage to your home or even run outside, where they can become lost or get struck by lightning. And what about the times when you’re walking your dog and get caught in a sudden thunderstorm? Here’s what you need to know about keeping your pets safe during thunderstorm season. How to Prepare for Thunderstorms With Pets Spring and summer are thunderstorm season across much of the United States, so no matter what the weather forecast says, it’s a good idea to stay prepared for big storms. Here are some tips to help your pet safely weather the storm. Bring your pets inside Your pets will be safer inside, even if they don’t like being cooped up. This includes cats that are normally outdoors during the day. Cats will sometimes try to hide under a vehicle for safety, but try to bring them indoors before a storm hits. In the event that lightning hits the car, your cat could be injured or killed by the electrical surge. This is true even for pets that have outdoor shelter, like a dog or cat house. These are generally not considered to be safe in the event of a storm. Also, if your pet becomes anxious because of the storm, they may roam around looking for safer territory and become lost. All things considered, having your pet safely confined indoors is the best plan—they can go back out when the storm has passed. Remove metal collars/leashes/harnesses Metal can transmit electricity, which could worsen the effect of a lightning strike. This is why you should remove any collars and harnesses from your pet that contain metal. Also, if your pet becomes nervous during the storm and tries to hide behind furniture or squeeze into a tight corner, the metal on these wearables can injure your pet, damage your furnishings, or trap or restrain your pet. As a rule, it’s safest for your pet to spend the storm without any collar or gear, other than calming devices such as a ThunderShirt. Make sure your pet is microchipped and your contact info is up to date All pets should wear some form of identification, just to be safe. A microchip is a safe, metal-free way to protect your pet. It’s a chip that’s about the size of a grain of rice that your veterinarian injects in much the same fashion as a vaccine. Any vet’s office or shelter has a small machine to scan microchips. When your pet is found and scanned, the microchip provides information you’ve saved in your microchip account, such as health concerns, necessary medications, and your contact information. Unfortunately, many animals run away during storms—shelters often report a spike in missing pet reports in the days after a severe storm. Up to 80% of these animals are never reunited with their pet parents, so making sure your pet is indoors and equipped with microchip identification greatly increases the chances you will find them again. Try calming products There are many products that can be used to help calm and relax your pet during a storm. It may take some experimentation to figure out which ones work for your pet. Some work great for some animals and not at all for others. Ask your vet for their recommendation to help identify what’s best for your pet. Cats may respond to pheromone diffusers and sprays such as Feliway, and many dogs respond to anxiety vests such as the ThunderShirt or another brand. Try a number of products until you find a product or combination of products that works for your pet. Create a safe space for your pets Creating a safe space for your pet is a great strategy to comfort them during a storm. Many dogs like crates covered by blankets, which resembles a safe, cozy den. Give your dog something they enjoy, like a KONG treat toy or another chew toy. For cats, give them a cat tree or other spots where they can hide. If possible, avoid getting stressed out yourself—your pets can feel that you’re stressed and interpret this to mean that danger is nearby. You may think it’s calming to hold your pet and to keep saying, “It’s okay.” But since this is not something you do on a daily basis, they may interpret it the opposite way you intend: there is danger. If you are relaxed, your pet is also likely to stay calm. After all, if you have made the situation as safe as possible, what is there to stress over? How to Keep Pets Safe During Lightning and Thunderstorms Thunderstorms are an inevitable feature of summer, but there are steps you can take before or even during a storm to keep your pet safe. What if you&#039;re caught outside while walking your dog? Try to find a solid, enclosed structure like a house, vehicle, or shed where you can wait out the storm. If you are unable to get inside, stay away from trees or tall structures and don’t climb on top of anything so you don’t attract lightning. If you find yourself in a field, crouch as low as possible until the storm passes. Do not lie flat on the ground. Avoid anything that might conduct electricity, such as metal fence posts or the undercarriage of a vehicle. If you are inside when the storm starts, where in your house should you go? During a bad storm, look for an interior room without exterior windows and doors. Not only could these be blown in by strong winds, but many also contain metal. Do not run water and don’t allow your pet to hide in the bathtub, as plumbing can also conduct electricity. Concrete floors may also allow a lightning strike to transmit, so keep your pet off any concrete floors. An interior bedroom is likely the safest location to weather the storm. How soon should you let pets out again after the last thunder? It’s usually safe to go back outside again once you have heard no thunder and seen no lightning for at least 30 minutes. Keep in mind that if you can hear thunder—even distantly—you could still be in danger.  Lightning can strike as far away as 10 miles from storm clouds! When in doubt, wait it out. Thunderstorms can be scary for both people and pets. However, it’s important to remember that the chance of getting struck by lightning is extremely small, and there are many steps you can take to minimize the risks. Bringing your pets indoors and keeping everyone as calm as possible goes a long way toward weathering the storm. Plan ahead, speak to your veterinarian, and have any supplies you might need on hand. Then sit back and watch nature’s beauty at work, knowing you have taken all the appropriate steps to keep your family safe. Featured Image: iStock.com/milehightraveler"}]