[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/cat/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is Toilet Water Safe for Pets to Drink?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-in-bathroom.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-in-bathroom.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Cat, Dog, Safety, Bacteria, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/cat/general-health/toilet-water-safe-pets-drink"}, "datePublished": "January 6, 2017", "dateModified": "August 19, 2022", "description": "When it comes to strange pet behaviors, drinking out of the toilet is one of the oddest. Learn more about why pets drink from toilets, why it is dangerous, and what you can do to stop it.", "articleBody": "Reviewed and udpated on May 18, 2020 by Jennifer Coates, DVM When it comes to strange pet behaviors, drinking out of the toilet may very well be at the top of the list. Oddly enough, some of the reasons for a pet drinking out of the toilet are rather sensible—at least on the surface. Dr. Jennifer Coates puts it this way, “When was the last time you dumped and scrubbed your pet’s water bowl? If you can’t remember, the water in the toilet may be more appetizing than what’s available in the water bowl!” Why Are Pets Attracted to Toilet Water? The fact that your toilet is running (complete with sounds of flowing water) may very well speak to the primal nature of your pet to seek out running water in the wild. According to Dr. Coates, running water tends to be a healthier choice than stagnant water in a natural setting. “Perhaps some of our pets have an instinctive pull towards running water and that’s why they’re attracted to water that ‘moves’ in our homes,” she says.  Ask anyone who has a cat that hangs out on the kitchen counter. Turning on the faucet can be an irresistible temptation for the cat to saunter over and have a sip. Similarly, many dogs love to drink water running from the hose when you’re washing your car or watering the lawn. Even knowing this, pet owners still scratch their heads when, after they go to the trouble of providing fresh water—perhaps even water of a trendy and imported nature—their fur kids still line up for a crack at the toilet when they’re feeling parched. Coates has another hypothesis. “It could be that some pets prefer the relative solitude of the bathroom. If their water bowl is in the middle of a chaotic home, they might not feel comfortable settling down to drink at that location,” she says. So, are the dangers of drinking out of the toilet real, or are we worrying ourselves over something that is harmless for our pets? Is Toilet Water Dirty? “I think [the dangers] are real,” says Dr. Patrick Mahaney, a holistic vet who practices in Los Angeles, California. “I’m not a fan of letting your pet drink out of the toilet.” Dr. Mahaney says, “if you were to swab your average toilet there would be an issue. If you don’t clean your toilet very often, you are going to put your dog or cat at risk for coming down with an infection, such as E. coli, because our feces can contain that—as well as other bacteria.” The risk of infection increases greatly when we ourselves are sick. According to Dr. Mahaney, humans can pass diseases like Giardia to their animals, and the consumption of toilet water can put your pet on the road to illness. And intestinal bacteria and parasites aren’t the only risks. Humans who are undergoing medical treatments such as chemotherapy can also shed toxic chemical substances in their urine and stool. While the chances of such exposures may be low for pets, there remains a potential for it to happen. Toxic Toilet Cleaning Products Another danger associated with consuming toilet water come from the chemicals that we use to clean our toilets—with chlorine bleach products being one of the main offenders. Toilet cleaners can contain sodium hypochlorite, hypochlorite salts, sodium peroxide, sodium perborate, and other chemicals that can be lethal when directly consumed. Restricting your pet’s access to the bathroom for a few hours (and a few flushes) after you’ve cleaned is a good rule of thumb. And never use the types of cleaners that are added to the toilet reservoir. They continuously release chemicals into the water with every fill of the bowl. Of course, it is also a good rule to be vigilant for symptoms of any sort of poisoning. Poorly diluted toilet bowl cleaners can cause chemical burns in the mouth and throat while going down, as well as other serious complications once fully ingested. Symptoms of bleach ingestion in pets can include vomiting, drooling, redness in and around the mouth, abdominal pain, and a sore throat. “Any toxin is not good for a pet to ingest,” says Dr. Katie Grzyb of One Love Animal Hospital in Brooklyn, New York. Dr. Coates agrees but adds, “when used properly in a toilet bowl, bleach is usually so diluted that healthy animals would be expected to show only mild gastrointestinal upset after ingestion.” How to Stop Your Pet Drinking from the Toilet “I think the best way to curb drinking from the toilet is to keep the lid down and the door closed. Also, offering several bowls of clean, cool, fresh water around the house can help to deter toilet-water drinking,” says Dr. Grzyb. Dr. Mahaney also advises owners to keep the lid closed, but realizes that is not possible for everyone. “If you can’t [keep the toilet closed] because you have children, for example, then just try to keep the toilet as clean as possible,” he says. For pet owners who want to offer all of the excitement of drinking from the toilet without the risk, a pet water fountain can provide that experience. Dr. Coates recommends them, “particularly for cats who may not drink enough water from bowls to stay well hydrated.”  Of course, you’ll need to keep your pet’s fountain filled with fresh water, as well as thoroughly cleaning the interior once a week and periodically changing the filters. Dr. Coates cautions, “if you don’t clean and maintain your pet’s water fountain, the water in it just may be dirtier than what’s available in your toilet.” By: David F. Kramer Featured Image: iStock.com/marcoventuriniautieri"}]