[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Is a Fecal Transplant for Dogs and Cats?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-fecal-transplant.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-fecal-transplant.jpg"}, "author": {"@type": "Person", "name": "Hanie Elfenbein, DVM", "url": "https://www.petmd.com/author/dr-hanie-elfenbein"}, "keywords": "Dog, General Care, Cat, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/what-fecal-transplant-dogs-and-cats"}, "datePublished": "January 26, 2018", "dateModified": "September 7, 2022", "description": "Given the success of fecal transplants in humans, veterinarians and veterinary researchers wondered whether the procedure could also help dogs and cats with chronic intestinal disease and diarrhea. Learn how fecal transplant therapy works and whether it makes sense for your pet.", "articleBody": "By Hanie Elfenbein, DVM In the past few years, doctors and researchers have recognized the important role of gut bacteria in digestion. These bacteria inhabit the digestive system of all animals and are necessary for proper digestion of food and absorption of nutrients. Gut “microbiota” refers to the community of these bacteria, as well as other microscopic organisms that work together to keep your digestion healthy. The composition of the microbiota depends on many factors, including genetics, environment, and diet. Intestinal infections, such as those that cause diarrhea, and subsequent antibiotic medications alter the gut microbiota. Sometimes this leads to long-term dysbiosis, or an imbalance in the composition of the microbiota, leading to digestive difficulty and chronic diarrhea. What Is a Fecal Transplant? Fecal microbiota transplantation (FMT), among other terms used, is a procedure where fecal material from a healthy individual is given to an individual with intestinal illness in order to restore a healthy balance to the gut microbiota and resolve the illness. In humans, FMT is most frequently used to resolve gastrointestinal infections with C. dificle, a harmful bacterium that flourishes in immunocompromised, hospitalized, and other very ill individuals. The healthy bacteria found in the fecal transplant material replaces the harmful bacteria inside of the recipient’s intestines and helps restore a beneficial community. Researchers are studying whether FMT can also help people with chronic intestinal disease such as Crohn’s disease and ulcerative colitis. So far, the therapy seems promising. Given the success of FMT in humans, veterinarians and veterinary researchers wondered whether the procedure could also help dogs and cats with chronic intestinal disease and diarrhea. An occasional bout of diarrhea is likely nothing to worry about and can be easily treated. But some pets rarely have normal stool or have diarrhea for weeks at a time. These dogs may need daily therapy or major changes in their diet before they can have normal feces. Veterinarians classify diarrhea by what type of therapy resolves it: antibiotic-responsive, fiber-responsive, diet-responsive, and non-responsive. It is thought that dogs with diarrhea that is refractory to treatment have an imbalance of their gut microbiota, or a dysbiosis. FMT is aimed at treating that dysbiosis by replenishing beneficial types of bacteria. This is why selection and screening of the donor animal is so important—their microbiota needs to be healthy and well-balanced. How Does Fecal Transplant Therapy Work? Recently, a small study involved FMT for dogs with chronic diarrhea who were unresponsive to conventional therapies including diet changes, antibiotics, and probiotics. In the study, a fecal sample was collected from a very carefully screened donor dog. Prior to making the “donation,” the donor dog was tested for infectious diseases including parasites and harmful bacteria. Within hours of collecting the fecal sample, it was prepared for transplantation by blending it into a thin slurry that could be pushed through a small tube. The recipient dog was sedated, a thin tube inserted into his rectum, and the donor material was dosed in small amounts throughout the entire length of the intestine. This procedure was repeated several times over a course of months. The dogs responded well. However, there is no standardization to the therapy and it is still considered experimental by most veterinarians. Differences in screening protocols have led to different levels of success. The results of rigorous FMT studies in dogs are still pending and many veterinarians prefer to wait until the efficacy and safety have been well documented before offering FMT. Though the procedure itself poses little harm to the recipient, so long as the donor animal is properly screened, the administration process requires sedation and therefore assumes all the risks of anesthesia. Overall this risk is low, but it is something to consider before putting a pet through an as-yet unverified procedure. Nevertheless, some clinics are beginning to offer fecal transplant therapy for both dogs and cats. Unfortunately for cats, even less is known about whether FMT is an effective therapy for feline chronic diarrhea. Humans and dogs share an omnivorous physiology but cats are obligate carnivores and therefore have a digestive system with different requirements for health. In veterinary literature, there is a single report of FMT in a cat. This gives hope to families of cats with chronic diarrhea but is just a beginning. Is My Pet a Candidate for a Fecal Transplant? There is a grossness factor when talking about transferring feces from one animal to another, but for those animals who are chronically ill, the potential benefits outweigh the disgust. Plus, as most discussions of FMT in dogs remind us, many dogs willingly (enthusiastically?) eat feces. There is no evidence that dogs are treating themselves by eating feces. In fact, a recent study found no link between dogs who eat feces and those with chronic intestinal illnesses. The very acidic environment inside the stomach kills most bacteria, so the oral route is not recommended as a therapy. It is possible to pass a tube from the nose or mouth through the stomach and into the intestines as an alternative to entering through the rectum. Both of these procedures should be done with the guidance of a small camera at the end of the tube so that the veterinarian can see what she is doing. Most dogs and cats with chronic diarrhea have an underlying disease that can be treated with more conventional methods. It can be very frustrating to go through the trial-and-error process to find the right solution for your individual pet’s needs. The sum of all the diagnostic tests that your veterinarian needs in order to find the treatment can get expensive and is usually done one piece at a time. Don’t get frustrated and quit. Your veterinarian wants your pet to feel better as much as you do. The best thing you can do is keep records of treatments and responses. And if nothing else works, it may be worth asking your veterinarian whether she, or a colleague at a specialty clinic, performs FMT.   "}]