[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is Vaping Dangerous for Pets?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/vaping-dangers.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/vaping-dangers.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/vaping-dangerous-pets"}, "datePublished": "January 16, 2018", "dateModified": "September 7, 2022", "description": "Learn more about signs of nicotine poisoning in pets and the dangers associated with vaping and electronic cigarettes.", "articleBody": "by Lynne Miller As more smokers indulge in vaping, the ASPCA Animal Poison Control Center and Pet Poison Helpline report a growing number of cases of pets being sickened by e-cigarettes and their components. Poisoning from e-cigarettes is a relatively new threat to animals. Electronic nicotine delivery systems were introduced in the U.S. about ten years ago, according to the Consumer Advocates for Smoke Free Alternatives Association, and many adults use e-cigarettes in an attempt to quit smoking.   However, e-cigarettes and e-pipes usually contain liquid nicotine, which is poisonous to pets, says Dr. Tina Wismer, medical director of the ASPCA Animal Poison Control Center. In recent years, the ASPCA’s poison control center has seen a decrease in the number of reports of pets getting sick from ingesting tobacco cigarettes while incidents involving e-cigarettes have been on the rise, Wismer says. And while Wismer is not aware of any animal deaths, “we’ve had animals that have had to undergo treatment at a veterinarian’s office and probably would have died if treatment had not been provided,” she says. Learn more about signs of nicotine poisoning in pets and the dangers associated with vaping, below. Symptoms of Liquid Nicotine Poisoning Compared to the nicotine in conventional cigarettes, the amount of nicotine in the liquid can vary from small amounts to much more than a cigarette, Wismer says.  Dogs and cats can become seriously ill very quickly after ingesting even small quantities of liquid nicotine, which is absorbed in the body more rapidly and completely and sometimes in greater amounts compared to cigarettes, she says. An animal that has ingested nicotine will most likely vomit and, depending on how much nicotine the animal has ingested, she may appear agitated, drool, have diarrhea or a high heart rate, Wismer says. Pets that have consumed larger quantities of nicotine may seem depressed, have a low heart rate and low blood pressure, and these symptoms often precede death, she adds. The dog’s size makes a difference, too. “The smaller the dog, the less nicotine it can take.” In most cases, nicotine poisoning is not fatal. If they receive prompt veterinary care, pets usually recover, says Dr. Charlotte Flint, senior consulting veterinarian with the Pet Poison Helpline—an organization that reported 86 cases of pets being exposed to e-cigarette liquid in 2017, up from 80 cases in 2016. “It would be rare for a pet to have lasting effects after nicotine poisoning,” she says. “This is a type of poisoning where symptoms occur rapidly, usually within an hour, and resolve quickly, in most cases within 24 hours.” Treatment for Liquid Nicotine Poisoning If you discover your pet  has chewed on an e-cigarette or cartridge or gotten into your nicotine, you should take her to the veterinarian right away. If the pet has not vomited already, the doctor may try to induce vomiting or give the animal activated charcoal to bind the nicotine, Flint says. Animals that are throwing up or drooling may be given anti-nausea medications. Sometimes, intravenous fluids are administered to speed up the removal of nicotine from the animal’s body and help treat hydration and blood pressure problems. A dog or cat experiencing seizures as a result of the nicotine poisoning would be given anti-convulsant medications, Flint says. If problems with the heart rate or blood pressure develop, the pet would receive heart medication. Pets often stay at the hospital where staff would monitor their hearts and breathing and watch for neurological symptoms, Flint says. Additional Dangers of Vaping Around Pets Dogs can also get sick from chewing on and ingesting pieces of the e-cigarette batteries, Wismer says.“Batteries can cause burns because of the alkaline,” she says. While some people use smoking devices to inhale marijuana, it’s not clear whether exposure to secondhand marijuana vapor from an e-cigarette would hurt pets. “We don’t really know how much from the kit is absorbed by the person doing the inhaling,” says Dr. Patrick Mahaney, a veterinarian based in Los Angeles. “Whatever is exhaled could have a toxic effect on pets.” The concern is related to the tetrahydrocannabinol—which is the primary active ingredient in marijuana and is toxic to pets, he says. Animals that have been exposed to THC may exhibit unusual behavior such as euphoria, vocalization and static ataxia, where the animal stands on all four legs and rocks back and forth, says Mahaney. Other side effects of THC include hypersensitivity to noise, dribbling urine and enlarged pupils. What effect secondhand exposure to e-cigarette vapors has on animals is hazy at best, but health authorities are starting to raise concerns. In 2017, the World Health Organization said passive exposure to e-cigarette vapor could lead to adverse health effects in humans. The organization noted that secondhand aerosols from e-cigarettes are an air contamination source for hazardous particulate matter. Therefore, Flint advises pet owners to err on the side of caution. “We know the risk of secondhand exposure is lower with vaping compared to traditional smoking but it doesn’t appear to be risk free,” says Flint, who recommends pet parents avoid vaping near their animals. Vaping Safety Around Pets Ideally, vaping should be done outside, away from your pet, says Mahaney. To be on the safe side, he also recommends marijuana users not exhale in the presence of their pets. Be especially careful if you have feathery friends in your home, Flint says. “Birds have exquisitely sensitive respiratory tracts and are more likely to absorb chemicals through their respiratory tract,” she says. Birds also could be vulnerable to respiratory problems if they groom or preen the vaping residue off their feathers, she says. When buying nicotine, Mahaney recommends pre-filled cartridges. “You’re more likely to spill it if you fill it yourself,” he says. At this time, ingestion of vaping products is the biggest known hazard to animals. Since pets, especially dogs, tend to explore their environment with their noses and mouths, it’s important to keep vaping products stored in a safe place, out of your pet’s reach, at all times."}]