[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Are Anxiety Blankets Safe for Pets?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/anxiety-blankets-for-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/anxiety-blankets-for-pets.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Anxiety, General Care, Mental health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/are-anxiety-blankets-safe-pets"}, "datePublished": "April 12, 2018", "dateModified": "October 13, 2022", "description": "You might be tempted to find a quick fix to your pet&#039;s anxiety problem, like using a weighted blanket marketed to treat anxiety in people. But are they safe for pets?", "articleBody": "When you live with a dog who pants and paces all the time, or a cat who lets out an ear-splitting yowl just as you are about to fall asleep, you might be tempted to find a quick fix to your pet’s anxiety problem, like using a weighted blanket marketed to treat anxiety in people. But are they safe for pets? What Are Anxiety Blankets? Weighted blankets have been found to be useful in people with anxiety disorders. The heavier weight of the blanket may mimic the effect of being swaddled, which some people find soothing. The underlying theory behind the weighted blanket phenomenon is called sensory integration. The deep and consistent pressure of the weighted blanket may help lower the body’s physiologic level of arousal and stress. When your body feels calmer, your brain follows suit. Some studies reported that people do feel less anxious when they used the weighted blanket. One study on children with autism found that, while the blankets did not help the children fall asleep faster, the children reported that they liked the weighted blanket. Parents reported that they noticed that the blankets had a positive effect on their children. In that particular study, it indicates that while there may not be a great physiological response to the weighted blanket, there was a positive psychological effect. Are Anxiety Blankets Appropriate for Pets? Some people do like the sensation of being swaddled or “tucked in” with a weighted blanket, while others may find it restrictive. Similarly, some pets may prefer to sleep under blankets or seek out beds that have a light cover. Keep in mind, however, that a weighted blanket designed for people may be too heavy to be used in our pets. Even a child’s weighted blanket may be too heavy depending upon the size of your pet. The smallest child’s weighted blanket may be between two and four pounds, while an adult weighted blanket can weigh between 10 and 20 pounds. Even though the weight is evenly distributed throughout the blanket, it may be very restrictive for smaller pets and it may be difficult for a pet to move around or get comfortable under a weighted blanket. If your dog or cat is only ten pounds, having another two to four pounds placed on top of them may cause them discomfort and may force your pet into a position in which it may have a difficult time getting up and turning around. In addition, an anxiety blanket designed for humans may place too much weight on a pet’s chest, which may make it difficult for them to breathe. Think about wearing a tight corset and how difficult it would be for you to take a deep breath—this is how a pet may feel underneath a weighted blanket.   The safety risks for anxiety blankets are especially high for pets who already have difficulty breathing due to asthma, or a flatter-faced animal like a Bulldog or a Persian cat. In addition, if your pet has a skin condition, the constant pressure of a weighted blanket on their skin may be very irritating to them. Weighted blankets can also be problematic for pets who have a habit of chewing on their blankets. The blankets are usually filled with heavy plastic beads, so if your dog tears up the blanket, you may find little beads scattered everywhere. If they then ingest the material, it may cause stomach upset, such as vomiting and/or diarrhea. In a worst-case scenario, your pet may eat enough of the material to cause an intestinal blockage that needs surgery to relieve the obstruction. Pet-Safe Anxiety Blankets Currently, there are no weighted blankets designed specifically for use on pets, however, there are several vests and wraps marketed to reduce anxiety in dogs and cats. The theory behind why these vest and wraps work is the same as in humans. The vests or wraps are meant to be snug fitting, which provides light pressure on the pet’s body. There have been several studies performed on dogs suffering from separation anxiety or noise or thunderstorm phobia that have found that some dogs experience lowered heart rates and overall calmer behavior during those scary events when wearing the vest or wrap. Skin contact from the vest or wrap may also release oxytocin which can lower heart rate, blood pressure and help with social bonding. Anxiety wraps or vests designed specifically for dogs and cats usually are a better-fitting choice than a blanket designed for humans. These products are less constricting and allow free movement. Some dogs and cats may tolerate a vest or wrap well while other pets may need to wear it for short periods of time to have them slowly acclimate to the different sensation on their body. While these pet-specific products may not completely eliminate the pet’s anxiety, it can be helpful for some pets with certain anxiety disorders and is well worth a try."}]