[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Gum Colors and What They Mean", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/dog-gum-hero.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/dog-gum-hero.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Oral health, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/dog-gum-colors-and-what-they-mean"}, "datePublished": "October 18, 2022", "dateModified": "December 1, 2022", "description": "Can your dog’s gum color tell you if there’s something wrong with their health? What color should they be? Find out what to check for and when to call the vet.", "articleBody": "We tend to overlook our dog’s gum color unless they open their mouths to bark or yawn, but the gums can be an important sign of underlying diseases in our furry friends. It is important to assess your dog’s gums periodically to know what normal, healthy gums look like. Then you can more easily notice changes to their gum color. Sometimes an abnormal gum color in dogs can be important yet subtle indicator of an illness that may be life-threatening if left undiagnosed and untreated. What Color Are Healthy Gums in Dogs? Normal dog gums should be a powder-pink color, similar to the color of cooked shrimp. Normal, healthy dog gums are a light pink color. (Photo Credit: Sandra Mitchell, DVM)Normal, healthy dog gums are a light pink color. (Photo Credit: Sandra Mitchell, DVM) Healthy gums on a puppy (Image Credit: iStockPhoto.com/YellowSarah)Healthy gums on a puppy (Image Credit: iStockPhoto.com/YellowSarah) Some dog breeds are prone to pigmented or spotted gums, and this is normal. These breeds include: Chow Chows Shar-Peis Dalmatians Golden Retrievers Labrador Retrievers Doberman Pinschers German Shepherds Australian Shepherds Akitas  Mastiffs Newfoundlands Irish Setters Airedales  Some American Pit Bulls and Staffordshires  Certain mixed-breed dogs Most dogs with pigmented gums have pink speckles, which still allows for color assessment. Pigmented gums still have some pink. (Photo Credit: iStockPhoto.com/Szinhana Galytska)Pigmented gums still have some pink. (Photo Credit: iStockPhoto.com/Szinhana Galytska) How to Examine Your Dog’s Gum Color Follow these steps to examine your dog’s gum color: Use your fingers to gently lift their upper lip or pull down on their lower lip. Note the color. If your dog will allow, feel their gums just above or below a tooth. The gum should be moist to the touch. Gently press on the pink portion of the gums. The gums should turn white. When you stop pressing, the color should turn from white back to pink in less than 2 seconds (this is called capillary refill time, or CRT). If you notice that your dog’s gums are discolored or tacky, the CRT is greater than 2 seconds, or there are any new growths, contact your veterinarian to discuss these findings and possibly schedule a veterinary appointment for physical examination. Gum Colors in Dogs and What They Mean Some gum colors in dogs can cause concern for health conditions, while others are normal and of no consequence. Identifying changes in your dog’s gums helps with speedier diagnosis and treatment. Pale pink to white gums can be from anemia, shock, poor circulation, or heart disease. Anemia has many causes that can eventually lead to pale pink or white gums. The most common include internal bleeding, immune-mediated disease, clotting disorders, rat poison ingestion, kidney failure, severe internal or external parasitic infections, and bleeding abdominal tumors. Pale gums may indicate an underlying medical condition. (Photo Credit: Dr. Sandra Mitchell)Pale gums may indicate an underlying medical condition. (Photo Credit: Dr. Sandra Mitchell) Inflamed, slightly red gums can be secondary to gingivitis or other oral infections. Puppies will often get slightly reddened gums where the tooth meets the gumline when they are teething. Their teeth may even bleed while chewing, or they may lose teeth, and this is a normal process. In older dogs, certain viruses and kidney disease can cause oral ulceration, which appears as slightly reddened (sometimes bleeding) gums. Cherry red gums are usually a sign of toxin ingestion, but this is also seen with heatstroke and severe hypertension (high blood pressure). Yellow gums (also called icteric or jaundiced gums) can be a sign of immune-mediated anemia or liver issues, and this can also be a normal side effect of blood transfusions. Gray, blue, or purple-tinged gums often signal poor circulation or decreased oxygenation. These are most commonly noted with heart disease, severe hypothermia, severe hypotension (low blood pressure), or respiratory diseases. Brown or black spots on the gums can be normal in certain dog breeds (see the list above). If these are new spots that are not normal for your pet, or if they are associated with growths on the gums, they can be signs of cancerous or viral issues. Signs of Unhealthy Dog Gums Gum color is not the only important thing to monitor when it comes to your dog’s gum health and overall oral health. Be sure to regularly check your dog’s mouth for: Bleeding gums Ulceration Broken teeth Growths Early detection of oral masses or dental disease can often help your pet live a longer, happier, healthier life. If you have any concerns, contact your veterinarian to schedule a thorough physical examination. Featured Image: iStockPhoto.com/DenGuy"}]