[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Introducing PetMD’s Symptom Checker", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1457846321.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1457846321.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Cat, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/-introducing-petmd-symptom-checker"}, "datePublished": "September 22, 2023", "dateModified": "September 28, 2023", "description": "PetMD&#039;s Symptom Checker was created and reviewed by our veterinary team to provide pet parents with information and next steps related to their pet&#039;s most common symptoms.", "articleBody": "We understand how stressful it can be when your dog or cat is acting unusually—especially if they seem to be sick or unwell. Wouldn’t it be helpful to have a tool designed to figure out what we should do next for our pet? PetMD’s Symptom Checker was designed in conjunction with veterinarians to provide an easy-to-use online tool to help answer the most common questions related to your pet’s symptoms and provide next steps. Why did we create the PetMD Symptom Checker tool?  PetMD’s symptom checker is an innovative online experience that can help you understand what might be causing your pet’s symptoms and when you should call your vet.  Our team of veterinarians identified over 50 of the most common symptoms and combinations of symptoms that pets experience. To use the tool, simply answer a series of questions related to your pet’s symptoms—the tool will guide you to a summary page that includes information about possible causes, when you should call your vet, and helpful resources to help pay for veterinary care or chat directly with a Chewy online vet.   What does PetMD&#039;s Symptom Checker do better than other symptoms tools?  All of the information on PetMD was written and peer-reviewed by our team of veterinarians—including the Symptom Checker. Our vets created each symptom journey to ensure accuracy and provide education for pet parents that is unlike any other pet symptom tool on the market.    Our tool offers in-depth medical questions to help provide the pet parent with the best possible guidance. Additionally, we offer pet parents educational materials such as article links related to their pet’s symptoms, and potential health condition, to help educate them further. What common symptoms does PetMD&#039;s Symptom Checker cover?  Since our team of vets provides telehealth vet care to pet parents every day through Chewy’s Connect with a Vet tool, we were able to capture the most common symptoms pet parents report to us, including: vomiting, diarrhea, not eating, itching, eye problems, shaking head, and acting oddly. Pet parents can explore each of these problems by entering the symptom they are concerned about and answering the associated question flows.    What other pet health tools and services does PetMD have?  Since 2008, PetMD has been a leading veterinary library of articles related to all things involving pet health, including health conditions, nutrition, behavior, and training. And as part of the Chewy family, PetMD provides access to additional pet health resources, including Connect with a Vet and CarePlus Insurance.   If your pet is experiencing any signs that are giving you pause, check out the PetMD Symptom Checker and learn what to do next. Featured Image: iStock.com/SeventyFour"}]