[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Balcony Safety and Pets: How to Avoid High-Rise Risks", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/balcony-safety-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/balcony-safety-pets.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/balcony-safety-and-pets-how-avoid-high-rise-risks"}, "datePublished": "April 23, 2018", "dateModified": "September 7, 2022", "description": "Balconies can be dangerous places for cats and dogs; they run the risk of falling, getting burned by a hot grill or ingesting toxic house plants.", "articleBody": "By Paula Fitzsimmons If your balcony is your go-to spot to enjoy fresh air and sunshine, it’s only fitting to want to let your cat or dog enjoy it with you. But is it a good idea? Balconies can be dangerous places for cats and dogs; they run the risk of falling, getting burned by a hot grill or ingesting toxic house plants. However, this doesn’t mean that the balcony is off-limits to your best friend. By taking a few precautions and practicing due diligence, you can keep her safe while enjoying some time together outdoors. Can Cats and Dogs Fall from Balconies? Both cats and dogs are at risk of falling from balconies, although it’s more common with cats, says Dr. Sonja Olson, a senior clinician in emergency medicine for BluePearl Veterinary Partners. Cats and dogs can squeeze through balcony railings, but cats are more prone to jumping onto and over them, Olson adds. Although cats have an innate reflex to right themselves and land on their feet, they aren’t immune from harming themselves, says Dr. Lori Bierbrier, medical director of community medicine at the ASPCA. In fact, she adds that balcony injuries are so common in cats that a term has been created for it: high rise syndrome. In one report of 119 cats who had fallen from high rises during a four-year period, about 97 percent survived, but many sustained serious injuries, including 46 percent who presented with fractured limbs. In addition, a balcony doesn’t have to be very tall for it to do damage. “Folks may not think that two stories is that high, but yes it is,” says Olson. Even a one-story fall can sometimes cause injuries, she says, “especially with dogs, who are not as graceful and ‘springy’ as cats.” Balcony Risks and Dangers for Pets Falling is the primary balcony hazard for pets, says Bierbrier, and can cause injuries including broken bones, skin abrasions and damage to internal organs. It can also be the cause of soft-tissue sprains and facial injuries like trauma to the nose and teeth, split palates and broken jaws, says Olson. Even if your pet isn’t injured in a fall, she may run away and get lost (another good reason to get her microchipped), Olson adds. “Your pet’s ability to escape from the balcony is [what makes a balcony] dangerous,” she says. “Once out of that space, you no longer have control over what they can come into contact with or what they could ingest, for example.” Falling isn’t the only potential danger. Burns from heated grills, exposure to toxic plants, bees, wasps and other insects, and getting a head or limb caught in a railing are also risks to be wary of, says Bierbrier. Can My Cat or Dog Go on the Balcony? Provided you’re willing to take steps to prevent mishaps and watch her closely, your cat or dog can enjoy time on the balcony. Before you head outside, take a good look at your balcony setup. The safest balconies are those with screened-in enclosures (like catios), says Olson. These enclosures won’t be effective, however, if she can escape from it, so inspect it carefully for tears or gaps. “Pets are ingenious escape artists,&quot; she adds. If you do opt for a screened-in enclosure, Olson recommends making sure your companion has an approved cat or dog door so they can get back inside the home. “Also, make sure they have food, water and shelter from the sun.” Look carefully at any other items that may be potentially hazardous to animals, such as grills. Additionally, “Consider the ornamental plants that may be placed on the balcony and make sure they are not toxic plants,” Olson says. You’ll also want to move furniture away from balcony edges to prevent animals from using it as a way to jump over the railing, Bierbrier says.   Finally, consider keeping your pet in a harness or on leash when they’re on your balcony, says Olson. “So if they suddenly pursue that bird flying by or the squirrel in the tree nearby, they do not fall off the balcony railing or go through the balcony slats.” Regardless of any precautions you take, experts stress the importance of supervising your companion while on the balcony. It takes just one moment of not being vigilant for an animal to harm herself. “Money spent on harnesses, leashes, or other supplies that make a balcony more secure can save a pet’s life, and save pet owners hundreds or thousands of dollars,” says Bierbrier."}]