[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Clean a Dog&#039;s Ears", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog.cleaning.ears_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog.cleaning.ears_.jpg"}, "author": {"@type": "Person", "name": "Joel DeJaynes, DVM", "url": "https://www.petmd.com/author/dr-joel-dejaynes"}, "keywords": "Dog, Grooming, General Care, Ear health, Symptom Checker, Ear Cleaning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-clean-dogs-ears"}, "datePublished": "December 21, 2021", "dateModified": "September 12, 2023", "description": "Dr. Joel DeJaynes gives step-by-step instructions on how to safely clean your dog’s ears.", "articleBody": "Cleaning your dog’s ears is part of their overall health and well-being routine. It may also be required to prevent or treat health issues. However, cleaning your dog’s ears can be challenging, especially if you’ve never cleaned a dog’s ears and are not sure what to expect.   Dogs produce wax in their ears just like humans and usually need periodic cleaning to maintain normal health. Your dog’s ears may also need cleaning if they develop an ear infection. Since proper ear care is an essential part of caring for your beloved pet, it is important that the ear cleaning is performed correctly to prevent injury or damage to your dog’s ears.  Are You Supposed to Clean Your Dog’s Ears?  Your veterinarian can help you determine if—and how often—you should clean your dog’s ears. Some of the factors that determine how often you clean your dog’s ears include:  Does your dog produce a lot of ear wax?   Do you have your dog groomed regularly?   Does your dog like to swim, which can cause water getting into their ears?   Does your dog have an underlying allergy?   Some dogs do not produce much ear wax or have lifestyles that require frequent ear cleaning. However, dogs that swim and get water into their ears, or those that get water into their ears during a bath, will benefit from having their ears cleaned. Dogs with allergies and who suffer from repeat ear infections will also benefit from routine ear cleaning to prevent or reduce the frequency of ear infections.   A good rule of thumb is to check your dog’s ears for wax once a month. Bath time provides a great opportunity to inspect your dog’s ears. You can also peek at their ears when you are brushing them or providing other routine care like trimming nails.   A groomer may also perform a routine ear check when your dog is groomed. If you notice a buildup of wax in your dog’s ear, it’s time to clean them. Since dogs are all unique and can develop wax in their ears based on breed, health, and other factors, there is not a standard timeframe to follow for routine ear cleaning. Your veterinarian can help you determine a schedule that makes sense for your dog.   When a dog’s ears are red, seem painful, or have a bad odor, they might have an ear infection. If you spot these symptoms, do not attempt to clean your dog’s ears. Instead, contact your vet as soon as possible. Some ear infections can be minor, while others can be severe, and your veterinarian will guide you on the best course of treatment and follow-up care.  There are some instances where a veterinarian will recommend against routine ear cleanings. Dogs that have damage to their eardrum or severe inflammation of the ear canal may suffer further damage from ear cleaning.   If you are uncertain whether routine ear cleanings are recommended for your dog, ask your veterinarian to examine your dog’s ears to determine if there is any reason to avoid ear cleanings. If home ear cleaning isn’t recommended, your vet may also provide ear cleaning services. This may be a good option for dogs with an infection, other health issues, or if you are simply uncomfortable cleaning your dog’s ears.   What Can I Use to Clean My Dog’s Ears?  It’s important to only use a cleaner that’s approved specifically for dogs or cats. Avoid using ordinary household items like water, alcohol, hydrogen peroxide, vinegar, essential oils, etc. These materials will not efficiently clean the ear canal and may lead to your dog developing ear infections or even damage to the ear canal. Approved ear cleaners can be purchased from your veterinarian, online, or from major pet retail stores.   Clean cotton balls, or cotton wipes are recommended for ear cleanings. Cotton swabs should never be used because they can push wax down into the ear canal, making it harder to dislodge the build-up. In certain situations, cotton swabs could also potentially cause damage to the eardrum.  ￼Dog Ear Cleaning: A Step-By-Step Guide:  Get ready. Make sure you have all your supplies within arm’s reach: an approved cleaner, cotton balls or wipes.  Have support. If your dog is not used to ear cleanings, you may need another person to help hold them while you clean their ears. Restraining your dog can be done by gently placing an arm around their neck to prevent it from pulling away. Use the other hand to gently stabilize the head or the back half of their body if they are trying to pull away. Remember not to squeeze too tightly.  Expect a mess. Until you know how much your dog will fight or wiggle, clean your dog’s ears outside or in a place that’s easy to clean, if possible. A towel may be helpful to keep the rest of their body clean.  Be gentle. Carefully hold the exterior floppy or erect portion of the dog’s ear that is made up of hair, skin, cartilage, and blood vessels (called the pinnae) to allow for exposure to the ear canal.  Use a cleaner. Fill the ear canal with an ￼approved ear cleaner, making sure it fills both the horizontal and vertical ear canal. Gently massage the base of your dog’s ear while slowly moving your hand upward so the entire ear canal is massaged.  Shake it out. Allow your dog to shake their head. Even though it’s messy, shaking lets your dog expel most of the cleaner and wax on their own, making your job easier.  Wipe up. Use a clean cotton ball to wipe out as much of the ear canal as you can see. Do not shove the cotton ball into the ear to avoid injury or the cotton ball getting stuck. Repeat the wiping process using clean cotton balls until the cotton ball is clean and there is no more visible discharge in the ear canal.  Featured image: iStock.com/M_a_y_a"}]