[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Do Dogs See When They Watch TV?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-watching-tv.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-watching-tv.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, General Care, Eye health, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/can-dogs-see-tv"}, "datePublished": "October 27, 2021", "dateModified": "August 30, 2023", "description": "Dr. Sandra Mitchell explains what what your dog sees when they look at a TV.", "articleBody": "Have you ever sat down to watch TV, only to have a little furry head pop up and completely block your vision? Is your dog actually watching TV when they sit in front of the screen and stare at it or bark? What exactly is it that attracts your dog to the TV? Can dogs really see TV the way we do? Are they interested in TV shows made for dogs? Let’s find out. Can Dogs See TV? Dogs absolutely can see TV, and many seem to enjoy it. There are a number of features about television shows that dogs find attractive. Some of these are visual, such as motion, while others relate to the sounds coming from the TV. Dog eyes are very different from human eyes, so they see things on TV differently. Their vision isn’t as sharp, being closer to 20/75 than 20/20, which may explain why they prefer to sit closer to the TV than we do—it helps keep the images sharp. They also have different color perception because they have only two types of color-processing cells in their retinas (we have three). They can only see blues, greens, and yellows, so a dog running on grass with a blue sky behind them, playing with a yellow frisbee, may be very interesting, while a dog sitting next to a red and white picnic table with a red toy would be very dull. Dogs also have more rods in their eyes than people. Rods are the cells that increase night vision. This means that dogs see very well in the dark and are very sensitive to motion. Dogs will also perceive the image itself differently, especially on older TVs. Humans don’t notice any flickering of images if the screen refresh rate is faster than 55 hertz. However, dogs have better motion perception—they will see flickers up to 75 hertz. So, if we are watching an average TV show at 60 hertz, it will look smooth to us, but the image will appear to flicker for dogs. Fortunately, newer TVs are refreshed at a higher rate, and laptops and desktops have higher refresh rates, so not only do we enjoy a better picture, but so do our pups! Do Dogs Know That TV Isn&#039;t Real? It is hard to know what dogs are “thinking” when they watch TV, and some seem to take it much more seriously than others. That being said, it does appear that dogs recognize other animals on TV, will respond to the barking of dogs, and readily distinguish photos of dogs from cartoon dogs. But dogs also heavily rely on other senses, such as smell—which clearly isn’t possible on a televised image. Based on the disconnect with dogs’ most important sense (smell), it’s likely that dogs do recognize that the image on the screen isn’t real, but instead a representation of an animal or figure. That being said, dogs do often respond to the sounds made by animals on TV, and this clearly communicates information to them, even across species lines. So it might be wise to avoid shows involving distressed animals when your dog is sharing screen time. Why Do Some Dogs Watch TV and Others Don&#039;t? Just like people, dogs will get varying enjoyment out of the TV. Different breeds (and different individual dogs) have differing sight capacity, so some dogs may be able to see what is happening on TV better than others. If a dog can easily see and recognize a dog chasing something across a screen, they may be more engaged than a dog that relies more heavily on sense of smell or hearing. And some dogs may be more easily “fooled” by the images on the screen, while others are a little more perceptive in knowing that what they see is not real. What Kind of TV Shows Do Dogs Like? In general, dogs will prefer shows that feature animals in motion, and they’d rather see a real animal than a cartoon. If you’d like to test whether your dog is interested in TV, pick a show with very active animals—especially those your dog is attracted to in real life (such as squirrels, birds, cats, or other dogs). If the colors featured on the screen are shades of blues, yellows, and greens, your dog will be able to see them better. Then watch your dog’s reaction to figure out if they like what they see. Are their eyes following the action? Is their tail happily wagging, or do they seem distressed and growling? Do they seem worried by what they see? Keep testing shows until you find one that makes your dog happy—and then hope that you don’t have to fight them over the remote control! Should You Leave the TV on for Your Dog? Dogs watching TV has become a “thing” to the point that there are now channels devoted to dogs and marketing messages that dog TV will calm and relax your dog. Is this true? The jury is out. More than likely, dogs prefer to watch TV with their owners for companionship. When they’re alone, they’re more likely to just curl up to sleep or do their own thing. However, if your dog seems to like watching TV, you aren’t likely doing any harm by leaving it on when you go out or as long as TV time doesn’t interfere with playtime, outdoor time, or social time together. Just hearing the sounds of TV (or even a radio) might be stimulating enough to make the time pass more quickly until you come home. Keep it at a low volume and make sure your dog can move away from the TV if they choose to (for example, if they are crate training or confined to a room with the TV on). Featured Image: iStock.com/tiffanynorman"}]