[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Your Pet Health Questions Answered by Dr. Ben Carter", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/ben-carter-petmd.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/ben-carter-petmd.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/your-pet-health-questions-answered-dr-ben-carter"}, "datePublished": "March 26, 2019", "dateModified": "September 7, 2022", "description": "Dr. Ben Carter gives his insight on pet health questions frequently asked by pet parents to help keep their pets happy and well.", "articleBody": "We spoke with Dr. Ben Carter from Animal House Veterinary Center to get his professional insight on some important pet health questions. If you are a pet parent, you can use these recommendations and helpful info on dogs and cats to keep your pets in good health for years to come.  What are the recommendations for keeping your pet’s heart healthy? Dr. Carter recommends maintaining your pet’s healthy heart through exercise and proper nutrition. “Some things we can do at home to make sure our pets have a healthy heart include taking them for a walk for 15-20 minutes every single day and making sure that they eat a well-balanced diet,” he says. According to Dr. Carter, a well-balanced diet is one that is approved by AAFCO and has the proper amount of carbohydrates, fats and proteins, as well as amino acids. There are essential amino acids that must be supplied in your pet’s food, which can be found in protein. These amino acids help maintain the health of your pet’s muscles, bones, blood, organs, immune system, and hair and nails. Fats and carbohydrates are important sources of energy for your pet and can help support their development, so it is essential that your pet’s food contains the right balance of both. The proper combination of nutrients for your pet depends on their life stage, so it is recommended to buy dog food and cat food that’s balanced for the age of your pet. What is the best flea and tick prevention and how often should I use it?  The best flea and tick prevention for both indoor and outdoor pets, according to Dr. Carter, is in the form of a prescription oral medication that can be taken every 30 days. Dr. Carter says that oral flea and tick treatments are “very safe and very effective in flea and tick control.” Dr. Carter advises pet parents to give their pets oral prescription flea and tick treatment every month for year-round protection. Oral flea and tick treatments include flavored tablets and soft chews and are conveniently administered by mouth. This medication should be taken immediately after or in conjunction with your pet’s normal meal.  You can find these types of prescription flea and tick solutions in the Chewy Pharmacy.  Can CBD oil help with pain and illness? “So, CBD oils are something that is new to the veterinary market,” says Dr. Carter. “We don’t have the actual studies that say they are efficacious for dogs or cats. We are still in the realm of actually doing our studies to see how effective they are.” Dr. Carter advises interested pet parents to stay tuned for more information on the topic, as more studies may be done on CBD oil for pets in the coming years. Should you brush your cat or dog’s teeth? How often?  Brushing your pet’s teeth is extremely important for their health. “We definitely recommend you do it at least once or twice a day, but we know that it’s hard to do,” says Dr. Carter. “So, anytime that you can is super beneficial.” It is also recommended that you take your pet for a professional dental cleaning once a year to maintain a healthy, clean mouth. How can you conquer separation anxiety in dogs?  Separation anxiety in dogs occurs when an owner leaves the pet for the day or to go on a trip, and the pet responds with destructive or otherwise inappropriate behavior. “Separation anxiety is something that’s really hard to deal with in veterinary medicine. Right now, what we recommend is a combination of behavior modification and either supplements or prescription pet medications, as directed by your veterinarian,” says Dr. Carter. Changing your dog’s behavior can take time and consistency, so it is recommended that pet parents consult with a behaviorist or experienced trainer if your pet struggles with separation anxiety. How often should I bring my pet to the vet? “Every pet needs to visit their veterinarian at least once a year,” says Dr. Carter. These annual exams allow you to track your pet’s growth and development, and they allow your veterinarian to identify any potential health issues so you can start any necessary treatments early.  “For pets who are chronically ill or have any other conditions, I recommend to come in at least every six months or whatever was recommended by your veterinarian,” he says. Even if your pet seems fine, it is essential that your veterinarian monitors the issue to ensure your pet is as healthy as they can be. What should I expect during a routine vet visit? “During a pet’s annual examination, we do a nose-to-tail physical exam,” says Dr. Carter. Your veterinarian will look for hair loss, lumps, rashes, discoloration or unusual spots, as well as for fleas, ticks and mites. They’ll check your pet’s ears and eyes for discharge, swelling, redness or itching, as well as their dental health status by examining your pet’s teeth and smelling their breath. In addition to a physical exam, “We make sure they’re up to date on all their vaccines and that they also have enough preventative care items to get them through until their next veterinary visit,” says Dr. Carter. A stool sample may also be required, which checks your pet for intestinal parasites."}]