[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Which Over-the-Counter Human Medications Are Safe for Dogs?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/medicine-cabinet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/medicine-cabinet.jpg"}, "author": {"@type": "Person", "name": "Riley Shugg, MS, DVM", "url": "https://www.petmd.com/author/dr-riley-shugg"}, "keywords": "Dog, Over the counter medication, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/which-over-counter-human-medications-are-safe-dogs"}, "datePublished": "April 5, 2022", "dateModified": "September 7, 2022", "description": "Can you give human medications to dogs? Dr. Riley Shugg explains whether you can use any over-the-counter human medication for dogs.", "articleBody": "If you have any concerns about dosing and ingestion of human medications in pets, or if your pet is having adverse side effects (e.g., vomiting, diarrhea, behavioral changes), please contact your veterinarian or an emergency veterinarian, or call Pet Poison Hotline at (855) 764-7661. Although we treat and love our dogs like children, dogs are not small people. The same medications that safely work in children or adults are not necessarily safe in dogs. While it’s true that vets may prescribe human medications for dogs, there are important differences in drug tolerances, side effects, dose ranges, and applications. For example, veterinary medicines are dosed based on your dog’s weight, while human medications are often dosed based on age. Even if you think it’s safe to give your dog a human medication, you should always ask your vet first. This might seem inconvenient, but giving your dog an over-the-counter (OTC) medication can cause more harm than good or even make your dog’s existing health condition worse. Your dog may also have a specific condition or reason that means it’s not okay to give them a medication that might be okay for another dog. Are There Any Safe Over-the-Counter Human Medications for Dogs?   Yes, there are some OTC human medications that veterinarians recommend for certain conditions, but it’s never a good idea to assume it’s okay to use any medication in your dog without a vet’s advice. This is true even for common medications without dose restrictions, like artificial tears, which have minimal side effects for dogs. Generally, artificial tears can help lubricate a dog’s eye if they have dry eye or help remove dust particles or other foreign bodies from their eye. However, artificial tears aren’t useful for all eye conditions, and some foreign material may need to be flushed out by a veterinarian, who would then evaluate your dog’s eye to ensure that a scratch or ulcer hasn’t formed. Can You Use Over-the-Counter Pain Meds for Dogs? Out of all the OTC medications, pain medications are among the most commonly reached for by pet parents—and some of the most dangerous. Acetaminophen (Tylenol / Excedrin) Acetaminophen (sold under the brand names Tylenol and Excedrin) is one of the most common pain-control medications on the market. In dogs, too much acetaminophen can lead to liver damage and affect the ability of red blood cells to carry oxygen. This condition is known as methemoglobinemia. OTC acetaminophen for humans is also sometimes combined with allergy medications or other medications that may not be safe for your dog. NSAIDS (Advil / Motrin / Aspirin / Ibuprofen) While non-steroidal anti-inflammatory drugs (NSAIDs) are commonly used in veterinary medicine, medications like ibuprofen, Advil, aspirin, and Motrin can cause stomach ulcers that result in bloody stool and vomit. They can also cause liver and kidney failure, as well as seizures and other potential side effects. Even if your dog doesn’t suffer from side effects after being given an NSAID, giving your dog a human-approved NSAID before talking to your vet may prohibit your vet from prescribing more effective pain-control medications. There’s also an increased risk of overdose and potentially fatal side effects for your dog. What Do Vets Prescribe for Dogs for Pain? Common pain medications prescribed by vets include canine-approved NSAIDS, gabapentin, and opioids such as tramadol. NSAIDS Approved for Dogs Current FDA-approved NSAIDs for dogs include: Carprofen (Rimadyl, Vetprofen) Deracoxib (Deramaxx) Firocoxib (Previcox) Grapiprant (Galliprant) Meloxicam These NSAIDs are often prescribed to dogs suffering from chronic pain associated with osteoarthritis or to help control pain after surgery. Although these products are approved for use in dogs, they are not completely without risk. Even when appropriately dosed, NSAIDs can cause injury in dogs with pre-existing liver and kidney disease. To reduce the dose of a prescribed NSAID in dogs suffering from arthritis, vets will often recommend using a joint supplement along with the NSAID. Some of the most common and effective joint supplements ingredients include glucosamine, chondroitin, and MSM. These are available in a wide range of formulations and strengths. Talk to your vet before giving your dog a joint supplement, even if it’s made for dogs. Gabapentin Another common pain medication prescribed in veterinary medicine is gabapentin. Gabapentin is an anticonvulsant medication that has been shown to relieve neuropathic pain in animals, with minimal side effects. Gabapentin is commonly prescribed for back injuries, along with an anti-inflammatory as well as a muscle relaxer such as methocarbamol. Gabapentin may also be prescribed for a wide range of pain-inducing illnesses in dogs with kidney or liver issues who can’t take NSAIDs. Opioids It might be surprising to find out that opioids are used in veterinary medicine to treat a wide variety of pain. While most opioids are limited to use in animal hospitals, tramadol and buprenorphine may be prescribed for use at home. Tramadol is a synthetic opioid that is often used in dogs that are already receiving gabapentin or NSAIDs. Buprenorphine is a popular choice for dogs diagnosed with pancreatitis or visceral pain, although it’s not as widely used in dogs as in cats. Can Dogs Take OTC Human Medicine for Allergies?   Antihistamines are some of the most commonly prescribed OTC allergy medications for dogs. As always, it’s a good idea to talk to your vet before giving any allergy medications to your dog. Do not give diphenhydramine (Benadryl) to dogs that are pregnant or have low blood pressure or glaucoma without talking to your vet.   While Benadryl is otherwise generally safe and well-tolerated in dogs, it can cause drowsiness. Some Benadryl products may also contain Tylenol, so you should always read the ingredient list. Do not give cetirizine (Zyrtec) and loratadine (Claritin) to dogs with liver and kidney disease without talking to your vet. Cetirizine (Zyrtec) and loratadine (Claritin) are otherwise generally well-tolerated in dogs experiencing itching, allergies, and allergic reactions to insect bites, but they can cause vomiting, hypersalivation (drooling), and sedation in some dogs. Can You Use Over-the-Counter Topical Antibiotics for Dogs? Neosporin, a common OTC antibiotic ointment, can be used to treat minor scrapes and cuts, but take care to prevent your dog from licking the ointment off. This can delay healing and increase the chance of a secondary infection. You can also try an antiseptic spray such as Vetricyn, which your dog may tolerate better than a thick ointment like Neosporin. While Neosporin is fine in a pinch, wounds that show signs of infections (e.g., redness, swelling) need oral antibiotics. Is Any OTC Human Medicine Safe for Dog Vomiting? There are no safe OTC anti-nausea or anti-vomiting (anti-emetics) medications for dogs. Giving your dog these medications can mask symptoms in dogs that have swallowed a foreign body, have an obstruction, or are experiencing a serious illness. The dog’s condition may seem to improve over the short-term, only to turn worse later as the condition or disease overcomes the medication.   While giving your dog Pepto Bismol isn’t toxic, this can also be dangerous if your dog breathes it into their lungs while vomiting. Pepto Bismol can also make it harder for your vet to get an accurate x-ray if one is needed. This may make it harder to diagnose a dog that has swallowed foreign material.   For all of these reasons, anti-nausea medications should only be given or prescribed by a veterinarian. If your vet prescribes it, an anti-emetic such as the veterinary product Cerenia or the human medication ondansetron can provide relief.  Can I Give My Dog Cough Medicine?   Chronic coughing in dogs is never normal and always needs to be checked out by your vet. Common causes of coughing in dogs include: Heartworm disease Kennel cough Congestive heart failure Tracheal collapse Chronic bronchitis Cancer Over-the-counter human cough medications should never be given to dogs. Many of these products contain xylitol, an artificial sweetener that is highly toxic to dogs. Cough suppressants may also include other medications like acetaminophen that can be dangerous for dogs. Can You Give Dogs an Antacid? They should only be used with the recommendation of your veterinarian. Antacids such as famotidine (Pepcid) and omeprazole (Prilosec) are commonly recommended by veterinarians for GI ulceration and for preventing GI ulceration while on steroids. Studies are being conducted to evaluate the long-term side effects of these medications. Can You Give Your Dog Human Medicine for Constipation? MiraLAX (unflavored) can be used in cases of short- or long-term constipation. Proper dosage is important to ensure the medication doesn’t cause GI upset and excessive diarrhea, so consult with your vet before giving your dog MiraLAX. Featured Image: iStock.com/Tom Merton"}]