[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Travel With Your Dog: The Ultimate Guide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1254081911.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1254081911.jpg"}, "author": {"@type": "Person", "name": "Janelle Leeson", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Travel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-to-travel-with-dog-ultimate-guide"}, "datePublished": "September 14, 2023", "dateModified": "October 6, 2023", "description": "Traveling with your dog can be an exciting adventure–but can also pose some stress. We share everything you need to know about traveling with a dog, including what to pack, and what to know before you jet off together.", "articleBody": "Though there are great pet sitters and boarding facilities available, nothing beats a road trip with your pup. These fur-filled getaways—especially the first one—take preparation. So, how can you get ready for your trip? Here&#039;s what you need to know to keep your fur baby safe and comfortable on the road. Speak With Your Veterinarian  Dr. Jana Bryant, DVM, a veterinarian at CityVet in Las Colinas, Texas, has two large Labradors. Her kids beg her to take the pups on every trip, big or small. According to Bryant, loop your vet into your plans before hitting the road with your dog. Get Essential Vaccinations “Ask your vet if your pet needs any additional vaccinations,” Bryant says. For example, if you’re traveling to the Northeast United States (where deer tick populations are highest), make sure that your dog is prepared with a Lyme vaccine and tick preventative. For trips to the southern parts of the United States, dogs should receive leptospirosis vaccinations. Get a Health Certificate Dog health certificates state that your vet has examined your fur baby and they don’t appear to have any potentially contagious diseases. Health certificates are typically good for 30 days, though some airlines require a health certificate dated within 10 days of travel. Update Your Medical Records and Microchip ID Ask for an electronic copy and/or a printed copy of your pup’s most recent medical records. This is also a good time to ensure your dog&#039;s microchip information is accurate, too. Get Ahead of Motion Sickness About half of pet parents and their dogs travel by car, and some of those pups experience motion sickness. Signs of motion sickness include excessive drooling, licking of the paws, whining, or yawning. If this sounds like your dog, Bryant suggests asking your vet if an anti-motion sickness medication could help. “Many puppies will grow out of motion sickness. However, we want to prevent them from feeling nauseous in the car, as it can lead to a negative association with car rides as they grow older,” she says. Does Your Dog Need Calming Aids or Sedatives? If your dog is easily excitable, anxious, or reactive, consider whether a trip is the best choice for them. If your pup must travel, it’s very important to consult with your vet before purchasing any calming supplements or aids. “There are many over-the-counter supplements that aren&#039;t tested for safety or purity,&quot; Bryant says. Your vet may prescribe medications to help your dog sleep through car or train rides. However, your vet may not recommend giving your pup a sedative if they have any underlying health conditions before flying, such as liver or heart disease. Alternatively, sedatives may not be allowed by the airline, as sedatives can increase the risk of issues in a pup’s ears during pressure changes, as well as lung and heart problems. Do Your Research  Plan Your Route Leigh Siegfried, a dog behaviorist, and founder of Opportunity Barks, maps out her route before taking a trip with her pup. She makes sure to plan a few potty stops for her dog. While rest stops are convenient, they are often along major highways and lack green space. She recommends adding a park to your route. “Let your dog stretch, do some scent work, and really get a good amount of exercise,” Siegfried says. Locate Emergency Veterinary Offices Make sure to have the name and number of a few urgent care vet clinics along your route and near your destination. If you’re visiting friends or family, they may know of a trustworthy emergency vet. If they can refer a vet, give the office a call and ask them about their walk-in policy and what documentation you should have on hand. Bryant also recommends packing a first aid kit with a minimum of these essentials: Absorbent gauze pads like the following: Bandages designed for pups similar to the following: Medicated antibacterial cleaner such as the following: And don&#039;t forget a muzzle in case your pup needs it for any medical treatment: Understand the Rules of Your Airline or Train Agency  In 1990, Gayle Martz helped change airline policies to allow some pets in passenger cabins. If a dog’s carrier can’t find under the seat, pet parents can purchase a seat for their furry companions. “Destinations, airlines, and rail lines all have their own rules and regulations,” Martz says. “That&#039;s why I do my research before traveling with my pup.” For example, dogs traveling with American Airlines must be at least 8 weeks old and cannot be on tranquilizers or sedatives. Additionally, brachycephalic breeds are not permitted to travel in cargo. Dogs can’t be exposed to air temperatures above 85 degrees Fahrenheit or below 45 degrees Fahrenheit for more than four hours. If the weather is too hot or too cold at your departing airport or destination, your dog won&#039;t be allowed to fly, even when meeting the above requirements. Here are a few other factors to take into consideration: Make a reservation for your dog. Airlines and train agencies typically have a limited number of spaces for pets in the passenger cabin. Your dog must be up to date on their vaccinations. Flying internationally with a pet may require additional vaccines and/or documentation. Your pup may need their health certificate approved by the USDA’s Animal and Plant fit Health Inspection Service (APHIS). Your dog must be in a carrier for the duration of the flight or train ride. However, you may need to take your pet out of the carrier while passing through security so that their bag can be scanned. “Airport security will tell you how to proceed,” she says. “It’s important to be discreet, compliant, and respectful with your pet.” There may be pet fees. The amount varies by airline or train agency. Contact the company you’re traveling with to see how much you can expect to pay."}]