[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Anesthesia Risks for Pets You Should Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Surgery, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/general-health/5-anesthesia-risks-pets-you-should-know"}, "datePublished": "June 21, 2016", "dateModified": "September 7, 2022", "description": "Anesthesia is a critical and necessary part of your pet’s surgical process, however, there are some risks involved that pet owners should take into consideration to help ensure the success of their pet’s surgery. Find out more about these risks, and questions to ask your veterinarian before your pet goes into surgery, here.", "articleBody": "By Katherine Tolford   When your pet needs surgery it can be an overwhelming experience. Many owners are understandably focused more on the outcome than what goes on during their pet’s procedure. Anesthesia is a critical and necessary part of your pet’s surgical process, however, there are some risks involved that pet owners should take into consideration to help ensure the success of their pet’s surgery. Find out more about these risks, and questions to ask your veterinarian before your pet goes into surgery, here. According to Dr. Lynne Kushner, a private practice veterinary anesthesiologist and professor, the degree of sedation or anesthesia your pet will require depends on the procedure or stimulus they need.   “A vet simply can’t do a proper job if the animal is able to move or if they could possibly chew on a tube. The only way an animal will tolerate a breathing tube is if they’re unconscious,” she said. “The more painful the procedure, the deeper the anesthesia [required]. Sedation produces a milder effect than anesthesia [and is] used for less invasive procedures such as ultrasounds, bandage changes and minor wound repair.”   Your pet may be given local anesthesia, which affects a restricted area of the body, for things like removal of a small skin mass. General anesthesia is used for more painful procedures, such as spaying or neutering, mass removals, fractures, emergency surgeries, laceration repairs or abdominal masses. In this state, your pet is unconsciousness and unable to respond to stimuli. Kushner also recommends general anesthesia for dental issues to protect your pet’s airway and help with breathing as tartar is removed from the teeth.  Puppies and kittens older than three months can be sedated or anesthetized, but they may not respond to drugs as well because their organs aren’t yet functioning at full capacity. Their smaller size and lower amount of body fat also makes them more susceptible to hypotension, making it important to keep them warm during surgery, Kushner said.   Conversely, an older pets’ organs may not be fully functioning, and anesthesia can further alter that function. Specifically, if an older animal has low blood pressure, their blood flow may not be optimal and could result in the loss of organ function, especially the liver and the kidneys, Kushner said.   Dr. Amber Hopkins, a veterinary anesthesiologist at San Diego’s Veterinary Specialty Hospital, said elderly pets often suffer from a variety of ailments such as diabetes, cardiovascular disease and arthritis that can result in complications.   “The risk with older pets is more related to any underlying medical illnesses they may have. We have to be especially careful with how older pets are positioned during surgery to help protect their joints especially if they suffer from arthritis,” Hopkins said.   As with all animals, senior pets should be prepared for anesthesia by having baseline blood work done before surgery so your veterinarian can identify any underlying problems and prepare for them. If your pet has gained or lost a few pounds, your vet may need to adjust the recommended drug dosage and tailor it to your pet’s individual body weight, which can be a delicate balance. Smaller animals will require less medication because there’s less muscle and fat for the drugs to redistribute through, Hopkins said.   “The drugs may hang around longer if there’s no fat for it to go to [creating a more profound effect on the heart]. Thinner patients also tend to get colder. Their blood pressure decreases under anesthesia and their metabolic rate is less. It’s important to keep them warm during the procedure,” Kushner said.   An animal that’s overweight can be difficult to position during surgery and may have compromised breathing issues. “There’s so much fat and tissue along the chest wall, which makes it difficult for the lungs to expand and get enough oxygen. They won’t breath well on their own. Anesthesia reduces respiration levels so we have to breathe for them with a breathing tube” Kushner said. With reputations for being both finicky and difficult at the vet, cats can sometimes be riskier to anesthetize than dogs. “Cats tend to be more temperamental to handle. They’re generally harder to restrain,” Kushner said.   Their smaller size can also impede the proper use of monitoring equipment. For instance, inserting a catheter in a cat’s artery to monitor blood pressure can be harder to do because their vascular system is smaller. Cats also have a tendency to experience laryngeal spasms in the larynx when a breathing tube is inserted, making it important for an experienced person to perform the intubation. Multiple attempts to properly insert the tube could lead to trauma of the airway.   “Cats have smaller surface body areas so they get colder faster than dogs. The difficulty with dogs is they’re generally bigger so we have to restrain them more. Moving, positioning and ventilating them can be challenging,” Hopkins said. Due to the shape of their faces and shorter noses, brachycephalic breeds, like Pekingese, Boston Terriers and Pugs as well as Himalayan and Persian cats, can be more difficult to sedate or anesthetize.   “They’re at a higher risk during anesthesia because they have smaller nasal passages. So they tend to have airway issues. They may also have long soft palates which can make breathing post anesthesia more difficult,” Hopkins said.   Dogs with a history of tracheal collapse, like Poodles, Yorkshire Terriers and Pomeranians, are also at a higher risk. In cases of tracheal collapse, owners need to be aware that their pet will likely cough more frequently over the next week after intubation. Cough suppressants and, in some cases, antibiotics and steroids are administered to lessen chance for infection and inflammation following intubation. Tracheal collapse is a chronic progressive condition in affected animals. Patients with diagnosed or suspect tracheal collapse are left intubated as long as possible to help allow inflammation to dissipate and to allow an open airway while recovering.      Overall, anesthesia risks for pets are low. In a multi-institutional British study, healthy dogs were found to be at .05% risk for death during anesthesia. The mortality rates for healthy cats were at 0.1%, while sick cats and dogs have a mortality rate of 1.3%   According to Kushner, anesthesia should be reconsidered if the risks of giving your pet anesthesia outweighs the benefit your pet will get from the procedure, and if your pet has heart, airway, tracheal or pulmonary disease or needs any type of longer procedure or surgery, she recommends seeking out a specialty practice with an anesthesiologist on staff.   “If your pet has heart failure, the first thing is to get it under control before anesthesia. The heart isn’t pumping adequately, so you have to treat that first and then you can do the procedure,” she said.   Other preexisting medical conditions that can make anesthesia more risky include liver or kidney disease, unregulated diabetes, myopathy (especially in cats, in which cardiomyopathy is a common heart disease) and dehydration, Kushner said. It’s important to discuss your pet’s age, medical history and severity of any preexisting diseases or conditions with your vet before any procedure.   “It’s important to get a full health profile and a baseline of blood work done before surgery. It doesn’t necessarily affect the outcome of anesthesia, but it gives an idea of any underlying problems,” Kushner said. Unlike in human medicine, where patients are referred to specialists, it’s not always the norm for a private practice to have an anesthesiologist on staff as most veterinarians are expected to have a broad range of knowledge.   “Many vets have certified technicians on staff who handle the aesthesia,” Kushner said. “It’s important to have the proper knowledgeable and trained personnel monitoring the animal’s vital signs including heart rate, respiration, oxygenation and heart rhythm every five to ten minutes. If we see a decrease in these levels, we can recognize it right away and do something about it.”   Regardless of who anesthetizes your pet, both Kushner and Hopkins encourage owners to ask the following questions prior to their pet’s surgery:   Will an anesthesiologist, a doctor, a credentialed nurse, or a certified technician be monitoring my pet during anesthesia?Does this person know how to monitor the machines?Will you monitor blood pressure, respiration and oxygenation?Is there going to be someone monitoring my pet the whole time? Or will he or she be floating around the hospital during the procedure?Will someone also be touching my pet to monitor how he physically feels and if his pulse feels normal?Do you vary drug protocols based on a patient’s individual needs?How do you manage pain?What’s the recovery period like post surgery? Who will be watching my pet?"}]