[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Many Hours Does a Dog Sleep in a Day?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/man-spending-a-lazy-afternoon-with-his-dog-a-french-bulldog-picture-id1160996835.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/man-spending-a-lazy-afternoon-with-his-dog-a-french-bulldog-picture-id1160996835.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, General Care, Wellness", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-many-hours-does-dog-sleep-day"}, "datePublished": "October 4, 2021", "dateModified": "September 27, 2023", "description": "Is your dog sleeping the normal amount? Dr. Sandra Mitchell talks about how many hours dogs usually sleep each day, and what to do if your dog sleeps all the time or gets restless at night.", "articleBody": "The life of a dog seems like such a leisurely experience. Get out of bed, go outside to relieve yourself, come in, have a snack, and go back to bed. Then wake up, go outside again, have dinner, and then go back to bed for another nap. While this may seem like a lot of time spent sleeping, it’s actually quite normal. Here’s everything you need to know about your dog’s sleep patterns, from how much sleep they need to whether you should worry if your dog sleeps all day or can’t sleep at night. How Long Do Dogs Sleep Each Day? On average, most dogs spend about 50% of their day sleeping—about 12 hours in a 24-hour period. Puppies, large-breed dogs, and older dogs may sleep more, while small-breed dogs and working dogs may sleep less. In addition to the 50% of their day spent sleeping, dogs will then spend another 30% of their awake hours doing what I call “loafing.” Just like with humans, loafing is when a dog is awake but really not doing much of anything—just hanging out. Typically, loafing time is spent lying down, watching the world go by, and generally enjoying being lazy. So, that comes out to a whopping 80% of the doggy day being spent not doing much of anything at all. Why Do Dogs Sleep So Much? Dogs sleep a lot more than people do. They sleep when their bodies say they need sleep—unlike people who have busy schedules and don’t always listen to the signals from their bodies. Sleep is very important for dogs. “All day long, electrical activity is happening in our brain, and random, disorganized data gets stored in various places,” says Dr. Nicholas Dodman, professor emeritus at Tufts University. “We organize that in our sleep, and dogs do, too. It’s very therapeutic, and if you deny dogs that, they’ll kind of lose it.” Dr. Joan C. Hendricks, VMD, PhD, Dip ACVIM, adds that sleep helps a dog’s brain development, memory, and learning capacity, as well as their immune system. “Sleep-deprived animals and people are more prone to infections,” she says. Many experts also assume that lack of sleep may contribute to your dog being in a bad mood. And it makes sense that large-breed dogs, puppies, and senior dogs need even more sleep. Larger dogs simply need to work harder to move their bodies about, and it takes time to recover from that effort. Young dogs race around, exploring everything and burning up all kinds of energy. Then, they crash and sleep hard until their body has recovered and is ready for another bout of play. Older dogs also need more sleep to help their bodies recover from daily activities. What If My Dog Sleeps All Day? Most important to veterinarians is when pet parents notice changes in a dog’s sleep patterns. If your dog usually sleeps for 2-3 hours in the morning and then is up for the rest of the day, but then you suddenly notice they are sleeping for 5-6 hours in the morning and into the afternoon, it’s time to call the vet. Conditions such as diabetes and kidney disease could be the reason for the change in your dog’s normal sleep patterns. Some of the big reasons older dogs might sleep more than usual are hypothyroidism (an underactive thyroid), heart disease, and arthritis. Another thing we tend to clue in on is a dog’s response to being awakened. Most dogs will wake up fairly quickly, and if there is enough motivation (such as a dangling leash or a snack), they will stretch, get up from the nap, and be ready to go. Veterinarians worry if dogs are very hard to wake up, or if they can’t be motivated to do the things that they normally enjoy. If you notice that your dog is sleeping more than normal, or they are hard to wake up, keep a sleep log and make an appointment with your vet. Your vet can look over the sleep log and do tests to help find underlying conditions that may be causing your dog to sleep more or be more reluctant to get up. What If My Dog Is Restless at Night and Won’t Sleep? Age is another factor when it comes to sleep disruptions—with older dogs sometimes having more trouble falling asleep than puppies or younger adult dogs. Dr. Hendricks says that like many older people, some senior dogs (especially those diagnosed with canine cognitive dysfunction, a condition similar to Alzheimer’s disease) go through sundowning. This means they may get confused and restless as night falls. They tend to pace a lot and may have trouble falling asleep. This can be controlled with medication in many cases. Some animals will respond to having night lights placed near their favorite sleeping spots, as well as leaving a TV or radio on for them at a low volume. An even more common problem is older dogs who must go out more frequently to urinate.  Although this can have a medical basis, it can also simply represent a change in your dog’s patterns and be completely normal for them. Check with your vet if your dog is suddenly needing to go out at night. Make accommodations for your dog to be able to go out more frequently at night, whether it’s laying out a pee pad, letting them out during the night, or using a dog door. In most cases, there are identifiable reasons for dogs that are restless at night. Contacting your veterinarian to help identify that reason—and if possible, eliminate the trigger—is the best long-term solution. Are There Sleep Aids for Dogs? Unfortunately, there is no “one-size-fits-all” sleep aid for dogs. The most common solution to sleep-related problems in dogs is diagnosing and remedying the underlying problem. For dogs that are overly anxious, pheromone products, such as plug-in diffusers or sprays, may help calm and settle them. For other dogs, a light dose of Benadryl can take the edge off and help them to sleep—but this is something that should be done under the advisement of your veterinarian.  Making the area conducive to sleep helps as well. Some dogs benefit from a night light, and many dogs like to have the radio or TV on. Many dogs actually sleep best in the comfortable confines of their kennel (keep the door open to create a sleeping spot).  It may take a little hit or trial and error to find out what works best for your dog, but with some detective work and the help of your veterinarian, most dogs will snooze happily through the night (and most of the day!)   Featured Image: iStock.com/gollykim"}]