[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Bark in Their Sleep?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Health", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/tired-english-bulldog-lying-down-oni-the-floor-by-the-sofa-picture-id843465888.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/tired-english-bulldog-lying-down-oni-the-floor-by-the-sofa-picture-id843465888.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/why-do-dogs-bark-their-sleep"}, "datePublished": "April 29, 2022", "dateModified": "September 7, 2022", "description": "Ever wonder why your dog barks in their sleep? Veterinarian Sandra Mitchell explains what could be behind this behavior.", "articleBody": "Have you ever been relaxing with a good book or show, only to be startled by your sleeping dog suddenly barking, howling, twitching, and/or “running” in their sleep? If so, you’re not alone—these are common canine behaviors. Why Is My Dog Barking in Their Sleep? The most common reason dogs bark in their sleep is simple: they’re dreaming! Dogs go through very similar stages of sleep as people. When they first settle down to sleep, they will be relaxed and aware for about 10 minutes before entering a light sleep. During this period, their body temperature lowers, their heart rate drops, and their eyes may even be only partially closed. Eventually, they enter a period called non-REM sleep, which is when the body repairs cells and builds muscles and bone. As they sleep, just like people, dogs shift between non-REM sleep and REM “rapid eye movement” sleep. Dreaming usually occurs during REM. This period is also associated with sleepwalking and motion, including dogs “running” and barking in their sleep. Your dog may be dreaming about catching a ball in the park, playing with the dog next door, or even taunting the cat. While some dogs are active sleepers, there are differences between individuals and even breeds. Small dog breeds alternate between non-REM and REM sleep more frequently than larger breeds, so they tend to have more dreams and may bark more. According to Stanley Coren, a professor emeritus of psychology at the University of British Columbia and the author of Do Dogs Dream? Nearly Everything Your Dog Wants You to Know, large breed dogs follow human cycles, going into REM sleep roughly every 90 minutes, whereas small breeds might go into REM as often as every 10 minutes. For the most part, dogs barking and moving in their sleep is completely normal. However, if this is a new behavior, or it seems to be happening more, mention it to your vet to rule out any underlying issues. What If Your Dog Barks Only in Their Sleep? Most dogs who are vocal while awake may also be vocal at night—but some dogs only bark when they are sleeping. We don’t understand why this happens—it could be related to their particular dreams. Perhaps in their dreams, your dog is bold and fearless and barks a lot. Whatever the reason, this is also normal behavior and shouldn’t raise any red flags. What Should You Do If Your Dog Barks in Their Sleep? It is recommended to do nothing at all if your dog is barking in their sleep. Just like with people, it can be very confusing and disorienting for your dog to be awakened in the middle of a dream. Even if the dream seems to be a nightmare, it’s probably best to let your dog just work through it in their own way. If your dog’s barking is keeping members of the family awake, the best solution may be to find an area for your dog to sleep that is further away from your bedrooms, or wear earplugs. Do not give your dog any type of sleep medication. Human sleep medication can be dangerous for your dog. Even with dog-safe sedatives or supplements, your dog will still have dreams, and sedatives tend to have side effects. What If Your Dog Cries, Whimpers, or Howls in Their Sleep? Crying, whining, and howling while sleeping could all indicate that your dog is having a nightmare, or a dream where those behaviors are considered normal—like dreaming about joining a howling coyote pack. If your dog is not showing these behaviors when awake, there is likely nothing to worry about. However, if your dog is acting strangely when awake, or these sounds are new, it could be a sign of discomfort and should be discussed with your veterinarian. Although dogs barking and making other noises in their sleep can be startling and alarming, in most cases, they are quite normal. And it can be fun to watch and try to interpret exactly what your dog might be thinking about and doing in their dreams! Featured image: iStock.com/marcoventuriniautieri"}]