[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/5ev37m13ys", "@type": "VideoObject", "duration": "PT53S", "name": "5592059875001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/f643165f6eb620f4918ef8b5148c3c0fb2626d29.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/5ev37m13ys", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/50589d1b29bcb9912135848f0218462c5b0e9ea1.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/general-health/dog-saliva-9-fast-facts-you-should-know?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Saliva: 9 Facts You Should Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-saliva.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-saliva.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/dog-saliva-9-fast-facts-you-should-know"}, "datePublished": "June 1, 2016", "dateModified": "September 7, 2022", "description": "Dog saliva is a way of life for pet parents who get covered in drool and slobbery kisses. But did you know these five facts about dog saliva? Read on to find out more.", "articleBody": "  There are a lot of myths surrounding dog saliva, especially whether it’s antibacterial or whether a dog’s mouth is cleaner than people’s mouths in general. Here are nine facts about dog saliva that may make you think twice about dog kisses. You can be allergic to dog saliva. While many people believe that pet fur is the culprit of allergic reactions to dogs, many of these allergies actually stem from proteins found in dog saliva. According to one study, dog saliva contains at least 12 different allergy-causing protein bands. When dogs lick their fur, the saliva dries, and these proteins become airborne.1 The researchers who conducted the study concluded that dog saliva has greater potential as an allergen source than dog dander. The study revealed that a specific protein profile (IgE) differs between dogs, making some dogs saliva more allergic for specific humans who are hypersensitive to this protein. Dog saliva is antibacterial, but it probably won’t heal wounds. Dogs often lick their wounds in order to clean them. There may be healing properties in a dog’s saliva, and this may be another reason that they lick their wounds. Certain proteins in dog saliva called histatins can defend against infection, and research has shown that there are other beneficial chemicals in a dog’s saliva that can help protect cuts from infection. There is evidence that suggests that wounds licked by dogs heal twice as fast as wounds that were not licked. In one 2018 study, researchers discovered that canine saliva contains various proteins, antimicrobial enzymes, and peptides that make holes in bacterial cell membranes.2   Unfortunately, not all wounds will heal when licked. Moisture and inflammation from licking, and in some cases, the bacteria that lives in the saliva, can slow healing or even make the infection worse. This is why veterinary visits are recommended for even superficial wounds. Often, your veterinarian will recommend a collar or a bandage to keep your dog from licking their wounds and causing more trauma to the already inflamed area. Dog saliva (dog kisses) may transfer bacteria to humans. Just because dog saliva has antibacterial properties does not mean that dog “kisses” are clean and humans should let their guard down. Dr. Edward R. Eisner, the first veterinarian to become a board-certified specialist in Veterinary Dentistry in Colorado, notes that it’s possible for bacteria to be transferred from pets to humans. One study found that a species of tooth and gum bacteria and be transmitted between dogs and people.3 Although obtaining a bacterial infection from your dog is unlikely, it is still possible. In a case report from 2016, a 70-year-old woman had a severe infection of bacterium called Capnocytophaga canimorsus, which was most likely from her Italian Greyhound’s saliva. Luckily, she survived and fully recovered after intensive-care therapy and antibiotics.4 Elderly and immunocompromised people are more prone to zoonotic infections (infections transmitted between humans and animals) due to immune system dysfunction. A dog’s saliva is not cleaner than ours. We do not know very much about all of the bacteria that dogs carry in their saliva, but we do know that the oral microbiome (bacterial environment) differs greatly between dogs and humans.  One study found that only 16.4% of identified microbes are shared between humans and dogs.5 Researchers discovered that dogs have a type of bacteria called Porphyromonas gulae, which is known to cause periodontal disease. Humans have a different strain of this bacteria, Porphyromonas gingivalis. Both of these bacteria cause our mouths to be considered “dirty” and can cause dental issues for both humans and dogs. Harvard researchers have discovered over 615 different types of bacteria in human mouths, while over 600 different types have been found in dog mouths. Thus, dog saliva is definitely not cleaner than human saliva. You can get hookworms and other parasites from dog saliva. Certain intestinal parasites can be carried in dog saliva, and though it’s rare, they can be transmitted to humans. Dogs are known to lick their hind ends after defecation and greet each other with a nose-to-rump greeting. This means that microscopic bacteria and parasites carried in fecal material can be present in dogs’ mouths and nasal cavities.  Most intestinal parasites are transmitted through a fecal-to-oral route and more easily if you have a wound in your mouth. These parasites include Giardia, hookworms, and roundworms.  Luckily, our immune systems and the enzymes in our mouths often kill off these infections before they become problematic.  Those people who are immunocompromised, including young children and the geriatric community, are at a higher risk of showing clinical signs from zoonotic parasitic infections that come from dogs. Dog saliva helps prevent canine cavities. The saliva found in the mouths of dogs is better suited to prevent cavities, in comparison to human saliva. “[Human saliva] has a PH of 6.5 to 7,” says Dr. Colin Harvey, emeritus professor of surgery and dentistry at the School of Veterinary Medicine at the University of Pennsylvania. “The saliva of dogs and carnivores in general is slightly alkaline, around 7.5 to 8. The significance of that difference is that dogs do not get dental cavities nearly as frequently as humans. The slightly alkaline nature of dog saliva buffers the acids that are produced by some bacteria that are the cause of the enamel of the tooth being eroded away.” Dr. Eisner notes that despite the cavity-preventing nature of dog saliva, periodontal disease will still occur without active prevention. “Saliva coats our teeth,” says Dr. Eisner. “If it’s not brushed off by toothbrushing, it becomes plaque, which further traps the bacteria.” As the condition progresses, the bacteria can cause bone destruction in the tooth-supporting structures of the mouth. Regular toothbrushing and annual dental care are important for dogs. A puppy should have their first exam at 8 weeks of age. Dogs that have periodontal disease may need to visit their vet more frequently to monitor the progress of the condition. Saliva helps dogs with digestion, but not in the way you think. A 2018 study revealed that a dog’s mouth does not have amylase, an enzyme associated with digestion that is abundantly found in human saliva. This suggests that dogs may have a different mechanism for digestion than humans.6 In fact, unlike people, dogs don’t have to chew their food to mix in the saliva and start the digestive process. A dog’s stomach and intestines can do all the necessary work. In dogs, the only function of dog saliva is to move food down the esophagus. Some dog breeds drool more than others. Some dogs drool more than others simply because of their mouth, lip, or face shape. In dogs with looser skin around their mouth, short muzzles, and large jowls, saliva tends to pool more and/or their mouths are not able to contain the saliva produced. These dog breeds include: Great Dane Newfoundland St. Bernard Bullmastiff Basset Hound Great Pyrenees Boxer Excessive saliva in dogs can be a sign of tons of issues. A dog may suddenly drool excessively (hypersalivation) because smell food or they are excited or stressed. For example, if you are eating a steak in front of your dog, or if your dog gets stressed when they see you packing for a trip, you may notice more drool than normal.  But hypersalivation can also be a sign of medical issues. Some causes of abnormal drooling include: NauseaForeign objects stuck in the mouth/throat Dental problems Injuries to the mouth Generalized pain Masses, tumors, or growths in the mouth Dental issues such as broken/painful teeth or infections Caustic agents such as certain plants, foods, and cleaning products Gastrointestinal disturbances Overheating/heatstroke Motion sickness Anxiety If you are concerned that your dog is drooling a lot, or if the hypersalivation is paired with any of the following clinical signs, seek veterinary attention as soon as possible to rule out any medical issues or emergencies: Decreased appetite Pain when eating Dropping food during eating Chewing only on one side of the mouth or holding head at an odd angle when eating Changes in behavior, such as aggression or hiding behavior Pawing at the face or rubbing the face on carpets Swelling of the face Blood in the saliva Difficulty swallowing Vomiting or diarrhea A bad odor coming from the mouth   References Polovic N, Wadén K, Binnmyr J, et al. Dog saliva – an important source of dog allergens. Allergy. 2013;68(5):585-592. doi:10.1111/all.12130Torres SMF, Furrow E, Souza CP, et al. Salivary proteomics of healthy dogs: An in depth catalog. PLoS ONE. 2018;13(1). doi:10.1371/journal.pone.0191307Yamasaki Y, Nomura R, Nakano K, et al. Distribution of periodontopathic bacterial species in dogs and their owners. Archives of Oral Biology. 2012;57(9):1183-1188. doi:10.1016/j.archoralbio.2012.02.015Wilson JP, Kafetz K, Fink D. Lick of death: Capnocytophaga canimorsus is an important cause of sepsis in the elderly. BMJ Case Reports. 2016;2016:bcr2016215450. doi:10.1136/bcr-2016-215450Dewhirst FE, Klein EA, Thompson EC, et al. The Canine Oral Microbiome. Ravel J, ed. PLoS ONE. 2012;7(4):e36067. doi:10.1371/journal.pone.0036067Sanguansermsri P, Jenkinson HF, Thanasak J, et al. Comparative proteomic study of dog and human saliva. PLoS ONE. 2018;13(12). doi:10.1371/journal.pone.0208317  Featured image: iStock.com/"}]