[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Your Dog&#039;s Ears Smell and How to Clean Them", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-laying-on-bed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-laying-on-bed.jpg"}, "author": {"@type": "Person", "name": "Leigh Burkett, DVM", "url": "https://www.petmd.com/author/dr-leigh-burkett"}, "keywords": "Dog, Ear health, Grooming", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/why-do-my-dogs-ears-smell-bad"}, "datePublished": "June 30, 2020", "dateModified": "September 7, 2022", "description": "Do your dog’s ears smell? Dr. Leigh Burkett explains what makes dogs’ ears stink and how to clean and soothe them.", "articleBody": "Have you noticed that your dog’s ears smell? This can actually be a sign of a problem in your dog’s ears, from ear wax buildup to ear infections. Here’s what you need to know about smelly ears in dogs, from what causes the smell to tips for cleaning and preventing ear issues. Jump to a specific section here: What Causes a Dog’s Ears to Smell? Should You Clean Your Dog’s Ears? How to Clean Your Dog’s Ears How to Prevent Smelly Ears in Dogs What Causes a Dog’s Ears to Smell? There are a few different things that can cause your dog’s ears to stink. Here are some of the most common causes of smelly dog ears. Ear Wax Buildup Ear wax buildup can occur if the normal self-cleaning mechanism of your dog’s ear is disturbed. Your dog may not seem bothered by this at all. The ear wax will be a yellow color. This type of wax buildup can cause a change in odor in your dog’s ears, but it will be a mild odor. The problem can usually be solved by cleaning your dog’s ears with a veterinarian-approved routine ear cleaner. Yeast Infections Ear yeast infections are quite common and can cause a more pronounced odor in your dog’s ears. Yeast infections occur when there is an overproduction of Candida in your dog’s body. In many cases, a yeast infection causes what is described as a sweet or musty smell. There can also be redness and discharge from the ear that’s generally brown in color. Yeast infections should be seen by your veterinarian within several days. Your veterinarian may perform a cytology (taking a swab of the discharge and staining it, to look at it under the microscope) to diagnose this problem. Prescription treatment may include antifungal drops or an ear cleaner, and in difficult-to- treat cases, an oral antifungal medication. You may clean your dog’s ears at home with a vet-approved ear cleaner, but do not clean them for 24 hours prior to your appointment, as this can make a diagnosis more difficult. Bacterial Ear Infections A bacterial ear infection usually causes the most severe symptoms. Do not try to clean your dog’s ears at home before seeing your veterinarian. With certain types of bacteria, you may smell the ear from across the room. In these cases, there will be redness, swelling, and/or pain that is sometimes quite significant, and the discharge will be pus and/or a blood-tinged fluid. A cytology should be performed by your vet to confirm the presence of bacteria. Bacterial ear infections are treated with antibiotic eardrops and sometimes oral antibiotics. In resistant cases that do not respond to routine treatment, a culture may be performed to find out the exact type of bacteria and the proper antibiotic treatment. If the infection is severe enough to cause significant swelling in the ear, oral steroids may be needed to reduce pain and swelling. These cases should be seen by your vet as soon as possible. Mixed Ear Infections Mixed ear infections (where bacteria and yeast are present) are common. The symptoms can vary, depending on the types and numbers of organisms present, and they may appear similar to yeast and/or bacterial infection. Signs of a severe middle ear infection include: Your dog appears to be off-balance. Your dog seems uncoordinated. Your dog turns in circles. This is a serious infection that should be seen by a veterinarian immediately. It should be noted that a dog that has recurrent ear infections often has an underlying condition that should be addressed. Should You Clean Your Dog’s Ears? Dogs have an ear-cleaning mechanism that will naturally keep their ears clean. This means that ear cleaning at home should only be performed under these circumstances: Your dog has visibly dirty ears. Your dog went swimming or had a bath (using a veterinarian-approved cleaner with a drying agent). Your veterinarian directed you to do so while treating an ear infection. Your dog’s ears should be cleaned with a solution specifically developed for this purpose. Do not use home recipes for ear cleaning that contain hydrogen peroxide, vinegar, or alcohol, as they may irritate the ears or worsen an existing problem. Steps for Cleaning Your Dog’s Ears If you need to clean your dog’s ears, here are the steps: Hold the bottle of vet-approved ear cleaner above your dog’s ear and gently squeeze the solution into the ear. Fill the ear so that it is almost full of solution. Gently massage the base of the ear to distribute the cleaning solution and loosen any debris. Allow your dog to shake their head. This will help bring the debris toward the outside so that it is easier to clean away. (You may want to have a towel nearby to prevent any debris from getting on you.) Use a cotton ball to gently wipe away any wax and debris. Cotton-tipped swabs should not be used to clean your dog’s ears. They might have the unintended effect of pushing debris further into the ear canal. How to Prevent Ear Odors in Dogs To keep your dog’s ears healthy, you should check them at least once weekly. This allows you to find any problems early and act before they develop into a serious issue. Some signs to look for include: Odor Discharge Blood Swelling If your dog is having ear problems, you may also notice changes in their behavior, like: Scratching at the ears Shaking the head excessively Tilting the head Turning in circles Acting off-balance If you have more than one dog, another dog may pay more attention to the ears of their housemate if there is a problem. If your dog has recurrent ear infections, you should consult with your veterinarian about a treatment and cleaning regimen, and discuss potential underlying causes. Featured Image: iStock.com/Eva Blanco Read more: 6 Common Ear Problems in Dogs"}]