[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "4 Most Common Sleep Disorders in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1445084668.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1445084668.jpg"}, "author": {"@type": "Person", "name": "Rhiannon Koehler, DVM", "url": "https://www.petmd.com/author/dr-rhiannon-koehler"}, "keywords": "Dog, General Care, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/most-common-sleep-disorders-dogs"}, "datePublished": "October 4, 2023", "dateModified": "October 4, 2023", "description": "Sleep disorders in dogs are rare, but deserve a chat with your vet. Learn about the four most common sleep disorders in dogs, including symptoms, treatment options, and more.", "articleBody": "You often hear people talk about their experiences with insomnia, but did you know that sleep disorders can affect our dogs too? Sleep is important for your pet’s well-being, and sleep disorders in dogs can be hard on your entire household. Here, we’ll explain the four most common sleep disorders in dogs. What Are the Most Common Sleep Disorders in Dogs? Sleep disorders are uncommon in dogs overall. Disorders known to affect dogs include insomnia, sleep apnea, narcolepsy, and REM sleep behavior disorder. If you notice the signs of any sleep disorders, you should reach out to your veterinarian for diagnostics and a treatment plan. The best thing you can do to help get a diagnosis is record a video of the behavior. Outside of potentially seeing a narcoleptic episode, your veterinarian is unlikely to see any evidence of the sleep disorder in the clinic. Insomnia in Dogs Insomnia in dogs usually has an underlying behavioral or medical cause. Common causes of insomnia in dogs include canine cognitive dysfunction (dementia), anxiety or stress, pain, and excessive itchiness. Dogs with insomnia will often pace, whine, bark, or act confused at night. They may try to wake their human family members. Often, these pets act much more tired during the daytime. Insomnia in dogs is more common in older pets. However, some younger dogs with conditions such as generalized anxiety or itchy flea allergies may also have insomnia. Sleep Apnea in Dogs With sleep apnea in dogs, the pet momentarily stops breathing while they’re sleeping, sometimes many times throughout the night. Sleep apnea occurs because the airway squeezes smaller or becomes blocked, preventing air from reaching the lungs. Sleep apnea is most common in flat-faced (brachycephalic) dogs, such as Pugs, English Bulldogs, and French Bulldogs. These dogs often have changes to their airways that make them more likely to become smaller or be blocked. For example, they often have very narrow nostrils (stenotic nares) and a longer soft palate (part of the roof of the mouth) that can hang into the opening of their windpipe. Dogs with severe obesity may also be prone to sleep apnea because internal fat tissue is putting  too much pressure on their airways. A common sign of sleep apnea is loud snoring throughout the night. Dogs with sleep apnea may also act tired throughout the day. If your dog jolts awake and then falls back asleep, this is also a sign of sleep apnea. If you are concerned about sleep apnea, follow up with a veterinarian. If your dog’s breathing isn’t restarting immediately or you’re noticing their gums are a muddy or bluish color, this is a medical emergency and you need to contact your veterinarian or an emergency veterinarian. Narcolepsy in Dogs Narcolepsy in dogs can be quite frightening for a pet parent the first couple of times they’re faced with a narcoleptic episode. Signs of narcolepsy in dogs include fragmented (broken up) sleep, excessive daytime sleepiness, and sudden physical falls (cataplexy) during play or when excited. With narcolepsy, the pet is often active and excited one moment and then suddenly appears to pass out for just a few seconds or up to a few minutes. Narcolepsy is inherited in some dogs, showing up between four weeks and six months of age. Breeds sometimes affected by inherited narcolepsy are the Doberman Pinscher, Labrador Retriever, and Dachshund. Inherited forms of narcolepsy happen because of a change in a specific gene called the hypocretin receptor 2 gene. Hypocretin is a chemical made by a part of the brain called the hypothalamus. This chemical plays an important role in controlling sleep and awake periods in dogs. Dogs with inherited narcolepsy have normal levels of hypocretin but abnormal receptors, so they don’t respond normally to hypocretin. This results in narcoleptic episodes, especially during times of excitement. Dogs that get narcolepsy later in life are usually between seven months and seven years of age. Dogs with acquired narcolepsy don’t make enough hypocretin. The underlying cause for decreased hypocretin production isn’t currently known. This condition is known to affect at least 17 dog breeds, including Airedale Terriers, Alaskan Malamutes, and Saint Bernards. Narcolepsy isn’t progressive or life-threatening, but it does require lifelong management. REM Sleep Behavior Disorder Rapid eye movement (REM) sleep behavior disorder in dogs occurs when the dog has violent motion and odd behaviors while they’re asleep. During REM sleep, the eyes dart around and the brain is active. REM sleep is the stage of sleep when dreams occur. During normal REM sleep, the muscles become temporarily paralyzed. In dogs with REM sleep behavior disorder, muscle paralysis doesn’t occur. Signs of REM sleep disorder in dogs include violent limb movements, howling, barking, growling, chewing, or even biting while asleep. These signs can be seen while sleeping at night or even during naps. REM sleep behavior disorder in dogs often starts in younger dogs, with over half of dogs showing signs when they’re one year old or younger. There is no known sex or breed predisposition. Most dogs require lifelong management and don’t fully recover from this disorder. However, if REM sleep behavior disorder occurs with another condition like tetanus, treatment of the other condition may result in recovery from the sleep disorder as well. Treatment for Sleep Disorders in Dogs Once your pet has a diagnosis, treatment will be based on which sleep disorder is affecting your pet. Management of insomnia in dogs may include: Medications—Dogs with insomnia may take medications to help with sleep and lower anxiety. Examples include trazodone, clorazepate, alprazolam, flurazepam, and clonazepam.Supplements—Examples include valerian, kava, and melatonin. Speak with your veterinarian before starting any supplements.Management of underlying conditions—For example, if your dog’s ability to sleep is disrupted by a painful condition like arthritis, your veterinarian may prescribe pain medications like grapiprant (Galliprant®) and recommend use of an orthopedic dog bed at night. If they have cognitive dysfunction, treatment could include prescription diets; medications such as selegiline or antianxiety medications; and supplements like Senilife®.Changes to daytime routine—Your veterinarian may recommend giving your dog activities for their body and mind during the day to help your pet burn off extra energy, relieve anxiety, and create nighttime tiredness.Management of sleep apnea in dogs may include: Surgery—For dogs with flat faces, some surgical procedures such as widening the nostrils or removing the extra tissue from their soft palate may help prevent episodes of sleep apnea.Weight loss—Work with your veterinarian to make sure your pet with sleep apnea is at a healthy weight. If your dog is obese, your veterinarian can help develop a safe weight-loss plan.Management of narcolepsy in dogs may include: Medications—Antidepressant medications may be recommended to lower excitement, possibly reducing falling episodes. Examples include imipramine, clomipramine, fluoxetine, or venlafaxine. Stimulant medications may help with daytime sleepiness.Changing food and water bowls—Be sure to avoid glass feeding bowls to prevent injury if the pet falls on the bowl. Bowls should also be put up at least shoulder height to prevent accidental drowning or suffocation if the pet tumbles into the bowls. Elevated food bowls are ideal.Avoiding heights—If your dog has narcolepsy, avoid walking them where they might have a dangerous fall if they collapse. For example, dogs with narcolepsy should not be taken on mountain hikes.Management of REM sleep behavior disorder in dogs may include: Medications—Potassium bromide, which is also used to prevent seizures, is recommended for dogs with REM sleep behavior disorders. Dogs who have REM sleep behavior disorder in addition to other behavior conditions like obsessive-compulsive and generalized anxiety disorders may show improvement with tricyclic antidepressants like amitriptyline.Are Sleep Disorders More Common in Older Dogs? Not all sleep disorders are more common in older dogs. Dogs with canine cognitive dysfunction syndrome, a form of dog dementia that’s common in old age, often have insomnia. Older dogs are also more prone to chronically painful conditions like arthritis. For these reasons, you may see insomnia more often in older dogs. However, sleep apnea, narcolepsy, and REM sleep behavior disorder are all most likely to first appear in younger dogs Featured Image: Getty/Petra Richli"}]