[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/rdx59obucp", "@type": "VideoObject", "duration": "PT1M19S", "name": "5324794623001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/ad1e8bccfe9d63411a30ba32355bf9eaa4c620f0.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/rdx59obucp", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/950741f055290e4307a84fd0d3c9e4c5c3c8991a.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/general-health/how-clean-dog-poop?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Clean Up Dog Poop", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/how-to-clean-up-poop_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/how-to-clean-up-poop_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-clean-dog-poop"}, "datePublished": "October 11, 2016", "dateModified": "September 7, 2022", "description": "By Cheryl Lock Dog poop might not be the most glamorous of topics, but believe it not, there’s actually quite a lot that pet parents should be aware of when it comes to this, let’s say messy, topic. “There are a list of diseases that can be transmitted from dogs to humans via the fecal/oral route,” says Dr. Oscar Chavez, DVM. “For this reason, some care should be taken in the handling, or picking up, of dog feces.”", "articleBody": "By Cheryl Lock Dog poop might not be the most glamorous of topics, but believe it not, there’s actually quite a lot that pet parents should be aware of when it comes to this, let’s say messy, topic. “There are a list of diseases that can be transmitted from dogs to humans via the fecal/oral route,” says Dr. Oscar Chavez, DVM. “For this reason, some care should be taken in the handling, or picking up, of dog feces.” Diseases aside, as a pet owner you’re probably also interested in learning how to get those pesky accident marks out of your carpet or other fabrics, as well. Fear not—we’ve got the full poop scoop right here. Why Dog Poop Can Be Dangerous As Dr. Chavez mentioned, there are some inherent dangers when it comes to handling dog poop, so it’s important to always be vigilant and careful when doing so. “Diseases that are transmitted from animals to humans are called zoonotic diseases,” he said. “Zoonotic diseases that we can get from contaminated dog feces include Salmonella, Campylobacter, Giardia, roundworms and potentially hookworms.” Complicating matters is the fact that sometimes our pets can be carrying these diseases — like Salmonella — without actually becoming ill themselves, so it’s important to treat every one of your dog’s bowel movements as carefully as possible. How to Properly Clean Dog Poop How you go about cleaning up your dog’s poop will depend on where the accident actually occurs. In general though, the following are some expert-approved ways to scoop the poop that will keep you safe and help ensure that all fecal matter is properly disposed of. If dog poop happens outdoors: An outdoor cleanup is the best-case scenario for all involved, but that still means you should be careful removing the feces. If it’s possible, Dr. Chavez suggests trying to have your dog poop on sand or grass, since this is the easiest to clean and the threat of transmitted disease is lessened. “If on sand or grass, use a thick plastic bag to cover the feces and entrap it, then turn the bag inside out immediately, trapping the feces in the bag,” he said. “Tie the open end of the bag together and discard into a wastebasket as soon as possible. Some bags even have additional features that provide protection like double layers on the end in contact with the feces, and draw strings.” Whatever bag you use, be certain it’s new, and doesn’t have any holes or punctures. Of course sand or grass isn’t always readily available for pooping purposes, so if your pup ends up on another type of surface (gravel or asphalt, for example), and it’s an area frequented by people (especially children), remove the poop in the same manner as above and consider washing down the surface with water and diluted bleach, if possible, to kill any bacteria or protozoa, and then scrubbing the area with a metal brush. If it’s in an obscure area, however — like the middle of a busy street — remove the dog poop, but it’s probably not necessary to scrub with bleach, as the bacteria will eventually die on its own without the potential hazard of being touched by people.  If dog poop happens indoors: Cleaning dog poop on your new carpet or your grandmother’s old reclining chair comes with its own set of issues, but all is not lost. If it’s diarrhea you’re dealing with, Bill Masters, owner of Diamond Carpet Care, suggests scraping up as much of the feces as you can, and then allowing it to dry out overnight. “The next day, scrape up again,” he says Then use a solution of 2-3 drops of Dawn dish soap, 3 oz. of white vinegar and 16 oz. water. Pour the solution directly onto the stain and allow it to sit for three minutes before laying a folded towel on top and blotting as needed.” You might need to repeat the solution another time to ensure that the spot is lifted, and then use a dry towel to blog the area dry. Solid poop will of course be easier to remove than diarrhea, but it still might require some extra elbow grease on your part. For solid messes, Mike Sheridan, senior technician with Randy’s Carpet Care, suggests using a solution of white vinegar and water mixed 50/50, after you clean the area, to neutralize the PH so the stain doesn’t brown as it dries. (Another bonus to vinegar? It kills germs!) Finally, when the mess is clean, put a spray nozzle on your brown hydrogen peroxide bottle and give the area a good misting, but don’t saturate it (which could leave a stain). “Peroxide is great for organic stain removal, and it also helps prevent browning,” Sheridan added.  If dog poop lingers on your pet: If you find that your dog’s poop has had some lasting effects on his person, the best thing to do is give him a bath with warm water and dog shampoo. “If you don’t have dog shampoo, a mild human shampoo like Johnson &amp; Johnson Baby Shampoo will work,” says Dr. Chavez. “Most bacteria area killed by soap and warm water.” Of course wearing gloves — like dishwashing gloves, for example — while doing so is never a bad additional precaution. At the end of the day, if your dog is healthy, the threat of your dog’s poop harming yourself or others is greatly minimized. “Healthy, clean dogs make healthy, formed stools, which are safer and easier to clean up,” says Dr. Chavez. “The best way to reduce any risk of cleaning up your dog’s poop is to feed him a high quality diet that isn’t contaminated in the first place, to keep your dog in good health and monitor his fecal consistency.” Learn about “the 4 Cs” of dog poop: How Should My Dog’s Poop Look? See Also:"}]