[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dangerous Winter Holiday Plants for Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Care", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/pup-with-a-fir-tree.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/pup-with-a-fir-tree.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Holidays, Poisoning, General health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/dangerous-winter-holiday-plants-for-pets"}, "datePublished": "February 9, 2011", "dateModified": "October 9, 2023", "description": "While holiday plants can bring festive cheer, they can also be toxic to your pets. Find out which holiday plants you should avoid having in your home.", "articleBody": "During the holidays, plants play a prominent role in festive decorations. However, there are some types of decorative plants that are toxic to dogs and cats. In some cases, ingesting these plants causes only mild indigestion and discomfort. In other cases, toxicity can lead to more severe health problems, and can even be fatal. If you are planning to bring holiday foliage into your home this season, you must understand which plants are safe, which should be kept out of your pet’s reach, and which should be avoided entirely. If your dog or cat does manage to ingest any part of these holiday plants, call your veterinarian or the Pet Poison Helpline at 855-764-7661 immediately. Poinsettia Plants Many believe that the poinsettia plant is deadly for pets and children, but this is unlikely. The poinsettia plant’s brightly colored leaves contain a sap that is irritating to the tissues of the mouth and esophagus. If the leaves are ingested, they will often cause nausea and vomiting. It would take a large amount of the plant’s material to cause poisoning. Most animals and children won’t eat such a large amount due to the irritating taste and texture of the sap. However, if the plant has been treated with a pesticide, your pet could be at risk of becoming ill from ingesting the pesticide. The size of your pet and the amount of ingested plant material will be the determining factors for the severity of the poisoning. Young animals, such as puppies and kittens, are at the highest risk. Remember—the smaller the animal, the more toxic something might be. Toxicity is calculated by body weight and the amount ingested, making smaller pets at higher risk of it. Additionally, toxicity depends on blood flow distribution to the body. Smaller animals will have toxins distributed faster than larger animals. Severe reactions to the plant or to the pesticide it has been treated with include seizures, coma, and in some cases, death. It’s best to keep poinsettias out of reach of your pets. Holly and Mistletoe Holly and mistletoe are also popular holiday plants. These plants, along with their berries, have a greater toxicity level than the poinsettia. Symptoms of illness form ingesting these plants include intestinal upset, such as vomiting and diarrhea, excessive drooling, and abdominal pain. Mistletoe contains multiple substances that are toxic to both dogs and cats, including toxalbumin and pharatoxin viscumin (lectins, phoratoxins). It’s well-known for causing severe intestinal upset as well as a sudden and severe drop in blood pressure, breathing problems, and hallucinations (showing up as unusual behavior). If a large enough amount of these plants is ingested, seizures and death may follow. The leaves and berries of holly and mistletoe plants—even the dried plants—should be kept out of your home. Lilies and Daffodils The lily and daffodil are popular gift items at this time of year but can be toxic to pets. In cats, Lilium and Hemerocallis genera lilies are the most dangerous. Eating even a small amount of the plant will have a severe impact on a cat&#039;s system, causing severe symptoms such as gastrointestinal issues, arrhythmia, and convulsions. Daffodils are also toxic to both dogs and cats. The bulbs are the most toxic; however, even a few bites of the flower can cause kidney failure and even death in cats. Any lilies and daffodils you buy or receive as gifts might be better used for decorating your desk at work to keep your pet safe (unless there are pets in the office). Amaryllis (Belladonna) The beauty of the flowering Amaryllis is only matched by its toxicity. The Amaryllis contains lycorine and other noxious substances, which cause salivation, gastrointestinal abnormalities (vomiting, diarrhea, decreased appetite, and abdominal pain), lethargy and tremors in both cats and dogs. The bulb of the plant is reputed to be even more dangerous than the flowers and stalk. The Amaryllis also goes by other names, including Belladonna, Saint Joseph Lily, Cape Belladonna, and Naked Lady. Amaryllis, by any name, should be kept out of the house. Christmas Cactus Fortunately, the Christmas Cactus (or its relative, the Easter Cactus) plant is not toxic to dogs in either its parts or flowers. The same applies for cats. However, fibrous plant material can cause irritation to the stomach and intestine, leading to vomiting or diarrhea. Curious cats and dogs, especially kittens and puppies, may be injured by the spines, so these plants should still be kept out of pets’ reach. The Christmas Tree There are other dangers to consider with the Christmas tree that go beyond lights and ornaments. The oils produced by fir trees can be irritating to a pet&#039;s mouth and stomach, causing excessive vomiting or drooling. The tree needles, meanwhile, may cause gastrointestinal irritation, obstruction, and punctures. Additionally, the water used to nourish Christmas trees can be noxious. Bacteria, molds, and fertilizers can cause your pet to become extremely sick with only a few laps of water. Keep the water covered and blocked off to prevent pets from accessing it. Curious cats may climb the tree and/or knock the tree over, injuring themselves and damaging heirloom ornaments. Keep your Christmas tree blocked off and out of reach of your cats. Playing It Safe If you do choose to bring any of these plants into your home, be very careful about where you are placing them. Lilies and daffodils shouldn’t be in a home with cats, as these can result in death more commonly than other plants. Cats especially need to be considered, since they can jump to high shelves. If your cat is a known plant chewer, you will probably be better off choosing artificial plants over the real things. The holiday season brings potential dangers for our pets, but with a little effort, you can keep them safe. Call your veterinarian or the Pet Poison Helpline at 855-764-7661 immediately if you suspect your pet has ingested any part of a holiday plant. Featured Image: GettyImages/LightFieldStudios"}]