[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "9 Pet Health Myths You Should Stop Believing", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_RESIZED.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_RESIZED.jpeg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Cat, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/9-pet-health-myths-you-should-stop-believing"}, "datePublished": "April 23, 2023", "dateModified": "April 24, 2023", "description": "What’s a myth and what’s real? Dr. Sandra Mitchell exposes the truth behind nine pet health myths we all thought were true.", "articleBody": "There are so many commonly accepted myths that sometimes it’s hard to know what’s true and what’s not. You may even have “evidence” that these things are true or come across a blog that backs them up. That’s why we’ve put together some of the most common pet health myths you should not believe and explain the truth beyond the myth. Myth 1: I don’t see any fleas on my pet, so they don’t have fleas. This is a myth! Believe it or not, 95% of the fleas in your house at any given time do not live on your pet. The vast majority of fleas in an environment aren’t adult fleas, which is what you are likely to see when you’re looking for them on your pet. However, these problematic little creatures spend most of their time in the house as “babies”—eggs, larvae, and pupae. These stages of the life cycle are ones you will never see. Just one adult female flea can lay up to 2,000 eggs in her short lifetime, so finding a single flea can be a problem. To make matters worse, many adult fleas are removed when your pet is cleaning, making it even less likely that you will see them. So even if you aren’t seeing fleas, they may very well be there. Check in the fur for flea dirt, which looks like tiny dark specks, as well as for excessive scratching and sores created from your pet scratching after fleas bite. The only way to ensure that your pet does not have fleas is to keep them on a prescription flea prevention year-round. Myth 2: Cat health problems aren’t as expensive as dog health problems. Both dogs and cats get chronic health problems that require testing and medications to treat. Many people have the misconception that treating a sick cat will be less costly than treating a sick dog. While it’s true that many cats are smaller than most dogs, and therefore medications (which are often dosed based on body weight) may be less expensive, it costs just as much for basic health care. For example, an X-ray on a cat or a dog (or a human) will cost the same. This is also true for basic blood work. It is also equally expensive to place an IV catheter on a cat as it is a dog (although a big dog might need more fluids, which would cost more). Up to 35% of pet owners admit that they underestimated the cost of their pets, so you are not alone if you thought your kitty would be a less expensive option than a dog. The fact is that, over the long haul, cat care is likely to be only slightly less expensive than dog care, if at all. Myth 3: Pets destroy things and pee on things out of spite. Myth busted! Animals do not experience emotions such as “spite,” nor do they, generally, feel “guilty” when we yell at them—although they may look it. Most of the time, animals destroy things because they’re bored and were looking to entertain themselves when no one else was around. These pets often need more exercise and/or mental stimulation and training. An animal that is urinating in the home is generally delivering a very specific message—that there is either a health problem or something unsuitable about the litter box/bathroom setup. Pets that are peeing in the house or peeing outside the litter box likely need a veterinary visit. Myth 4: Feeding table scraps is OK. Who doesn’t like to share a little bite from the table when approached with those adorable, begging eyes? It won’t do any harm, right? Wrong! The digestive tract of pets isn’t designed to process the high-fat/high-carb diet of their human family. Therefore, it isn’t uncommon for pets to suffer serious digestive problems after eating people food. Pancreatitis is the most worrisome, as it can be fatal. Longer-term concerns are weight gain and/or malnutrition. If you really want to share with your pet, stick with vegetables that aren’t treated with butter or seasonings. Myth 5: Shorthaired pets shed less. False! All of that fur needs to be turned over just as frequently in shorthaired pets as in longhaired pets. You might not notice it as much, of course, because it is shorter. A bonus myth is that shorthaired pets are less allergenic. Not true, either! Most people’s allergies are to proteins in the animal’s saliva, not their coat. Myth 6: A warm nose means your pet is sick. False again! A warm nose simply means your pet has a warm nose. Nose temperature is a reflection of the surrounding environment (such as room temperature and humidity) more than a measurement of health. If your pet has a warm nose and otherwise seems to be acting completely normal, there likely is nothing to worry about. Myth 7: It is OK for pets to lick their wounds. This myth is wrong on several fronts. When pets lick their wounds, they deposit all of the bacteria living in their mouth directly into the sore, setting the stage for infection. Plus, the rough barbs on the tongue inflame and irritate the tissue around the wound, making the sore more painful. And, of course, because it hurts, the animal licks more—and a vicious cycle ensues. Some pets will take a tiny cut and make it several inches longer in just a few hours. As unhappy as it can be for all parties involved, pets with a wound should wear an E-collar to ensure that they cannot lick or bite the sore before it is totally healed. Myth 8: Dogs eat grass to make themselves vomit. This is only partially true. Most dogs that eat grass do not vomit afterward. In fact, many behaviorists think that grass eating is a normal behavior that dogs just enjoy! Sometimes pets do eat grass and then vomit. So, did the animal eat the grass to soothe an upset stomach, or did the grass make them sick? It’s a chicken-and-egg question. Grass can be treated with fertilizers and pest control that can make a dog sick. What we do know is that less than 25% of dogs vomit after eating grass, and only 10% show signs of illness before eating grass. So, chances are, in most cases, the two behaviors are unrelated. Dogs eat grass just to eat grass, get roughage, and be dogs. Myth 9: Your pet only needs to go to the vet when they are sick. An important myth busted! The best way to prevent serious illness in your pet is to have regular veterinary visits so that problems can be noticed, identified, and corrected early. Not all problems can be prevented, but seeing your veterinarian at least once a year (twice a year if your pet is over the age of 7), whether your pet is due for vaccines or not, will likely prevent a larger problem down the road. Featured image: Adobe/chendongshan"}]