[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Exercises You Can Do With Your Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/woman-running-dog_169538315_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/woman-running-dog_169538315_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/6-exercises-you-can-do-your-dog"}, "datePublished": "May 8, 2015", "dateModified": "September 7, 2022", "description": "Man’s best friend may also be man’s best workout buddy. Dog walkers exercise about a half hour a week more than people without pets, the research shows. Here are six exercises you can do with your pup that will help him shed the pounds—and cause you to break more than a sweat, too.", "articleBody": "By Andrew Daniels Man’s best friend may also be man’s best workout buddy. According to research from Michigan State University, the majority of dog owners who regularly walk their dogs meet the national standards for regular, moderate, or vigorous exercise. Dog walkers also exercise about a half hour a week more than people without pets, the research shows. More studies tout the benefits of getting fit with Fido: University of Missouri research found that overweight dog walkers who took their furry friends for a 20-minute strolls five days a week lost an average of 14 pounds in a year. Australian research also shows that if you frequently take your pooch for walks, you’re less likely to make excuses to not work out. Who needs a gym when you’ve got your own cuddly canine just waiting to be your personal trainer? Here are six exercises you can do with your pup that will help him shed the pounds — and cause you to break more than a sweat, too.  Exercises from Tricia Montgomery, Founder and CEO of K9 Fit Club, a national network of clubs dedicated to the health, fitness, and wellness of dogs.  Image: Khakimullin Aleksandr / Shutterstock 1. Warmup  Place your dog’s leash in your left hand with no more than a 2-foot lead, and power walk back and forth for 1 to 2 minutes. Move to a light jog or sprint, back and forth for 2 minutes.Stand in place and perform arm circles to warm up your shoulders, while your dog stands next to you.“Remember to work at your own pace,” suggests Montgomery. “If this is your first time, your dog doesn’t know what to expect. Remember to praise them for their good actions.” Image: Ross Stevenson / Shutterstock 2. Waggin&#039; Wall Sit  The wall sit is a great leg exercise that conditions your glutes, hamstrings, and quads, Montgomery says. Stand with your back to a wall and your feet shoulder-width apart.Push your hips, lower back, and shoulders into the wall. Slowly walk your feet out as your upper body sinks to the floor.Bend your knees until your legs form a 90-degree angle, but make sure to keep your hips and lower back flat against the wall. Hold this position for up to 1 minute. “Your dog’s paws may be placed on your knees for added resistance, or sitting in front of you,” says Montgomery. Image: William Warby / Flickr   3. Leapin&#039; Labrador  Bring your dog to your left side and stand with your feet hip-width apart.Slightly bend your knees, and make sure your chest is directly over your toes. Move sideways while shifting your weight to the left as you raise your right foot off the ground.Hop sideways to the right, landing on your right foot, with your left leg following. Repeat three times to the right side, and with each hop, encourage your dog to follow.Now lead with the left, letting your right leg follow in a sideways hopping motion. Repeat three times, and praise your dog in between.Image: otsphoto/Shutterstock 4. Rover&#039;s Reverse Lunge  “Compared to a basic lunge, reverse lunges place less stress on your knees while still conditioning your entire leg,” Montgomery says. Face your dog and ask him to sit.Take one large step backward and lower your hips until your front thigh is parallel to the floor, and your front knee is directly over your front ankle. Use your front leg to push your body backward.Now lunge with the opposite side. “This should be a slow and controlled movement, so your dog should be able to sit, then come, or shake on your command between each reverse lunge,” says Montgomery. Image: Thinkstock 5. Butts with Your Mutts  Lie on your back with your knees bent and feet flat on the floor. You can also rest your feet on a bosu ball or another short surface if available.Ask your dog to lie down alongside you, or sit on top of the bosu ball at your feet.Let your hips and lower back sink into the floor as you take a deep breath.As you exhale, engage your abdominal muscles and lift your hips up off the floor, pressing your heels into the floor for added stability. Inhale again as you lower your hips back to starting position.Image: iko / Shutterstock  6. Sheltie Step Up (Requires a step platform)  Ask your dog to stand on your left side.Stand with your feet parallel, about hip-width apart while holding the leash in your hands. Slowly step to place your right foot on the platform. Keep your torso upright, and align your knee over your second toe. Have your dog come with you.Push off with your trailing (left) leg to raise your body onto the platform, placing that foot alongside. Have your dog follow, with front paws on the platform.With the leash firmly guided by your left hand, slowly load the weight of your body into your leading (right) foot.Step backwards to place the trailing (left) foot on the floor in its trailing position. Guide your dog and allow your body to lean slightly forward during the step-down movement.Load your weight into your trailing (left) foot, and step off the platform with your leading (right) foot, returning to your starting position.Repeat for the opposite side.To progress, step up onto one leg only, and remain standing on a single leg before stepping back down. “This is a bonding exercise with your dog, while working on obedience,” Montgomery says. “It also provides benefits to you, including strengthening your inner thighs and toning your legs. Remember to praise your dog along the way.”   Image: Thinkstock     You Might Also Like   6 Signs Your Dog Isn&#039;t Getting Enough Exercise Is My Pet Fat? Top 10 Hiking Dog Breeds "}]