[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "22 Holiday Items That Can Harm Your Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/holiday-pet-hazards.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/holiday-pet-hazards.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cat, Holidays, Christmas, Safety, Winter", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/holiday-items-that-can-harm-pets"}, "datePublished": "September 29, 2023", "dateModified": "September 29, 2023", "description": "While the holidays are a time of cheer and celebration, they also pose some serious hazards to your pets. Check out these holiday safety tips to know what items are not pet-safe.", "articleBody": "The holidays bring plenty of joy and celebrations, but the merrymaking could put your pet in harm’s way. Many of the decorations, foods, and festivities we associate with the holidays could cause big problems for your pet, putting them at risk for everything from indigestion to death. Here&#039;s a list of potential holiday pet hazards, plus tips for keeping your pets safe this season. 1. Fatty Foods People often use the holidays as an opportunity to indulge in rich, fattening foods. But you’re not doing your pets any favors by sharing your favorite holiday treats with them, says Dr. Rachel Barrack, DVM, of New York City’s Animal Acupuncture. In dogs, “these rich foods can result in pancreatitis, a painful inflammation of the pancreas that causes vomiting and diarrhea,” she says, and both dogs and cats can develop an upset stomach when they eat anything out of the ordinary. 2. Chocolate Who doesn’t snack on sweet treats during the holidays? However, our pets should not be able to get their paws on any chocolate. Dogs have a sweet tooth and amazing noses, says Dr. Tina Wismer, Medical Director of the ASPCA Animal Poison Control Center. If that combination leads them to a plate of brownies or a box of dark chocolates, they can develop vomiting, diarrhea, muscle tremors, seizures, and heart failure. Chocolate is toxic to cats as well as dogs and causes many of the same symptoms. So, it’s important to keep your chocolate treats safely stored away from your pets. 3. Grapes and Raisins Whether they’re part of a fruit plate or dried raisins in a fruitcake, grapes and raisins should never be accessible to pets. Dr. Barrack explains that grapes and raisins are toxic for dogs and can lead to acute kidney failure. While cats are less inclined to eat grapes, they can still be harmful for them as well. 4. Sugar-Free Candies and Pastries Another potentially dangerous treat is sugar-free pastries and candies, says Dr. Wismer. These often contain the sugar substitute xylitol. In dogs, this can cause low blood sugar levels and liver failure. 5. Onions and Garlic On the savory side, onions and garlic can affect red blood cells and cause anemia when consumed in excessive amounts, says Dr. Wismer.  Keep all forms—raw, cooked, chopped, or powdered—out of your pet’s reach, and call your vet right away if you suspect that your pet has ingested onions or garlic. Cats are especially susceptible to onion and garlic toxicity. 6. Meat Bones Dogs might enjoy having a nice big bone to chew on, but cooked meat bones can splinter and cause a blockage or lacerations in the gastrointestinal tract, says Dr. Barrack. Raw bones have less of a chance of splintering, but they can transmit disease-causing pathogens. Chewing on anything hard can also cause broken teeth. Instead of giving them to your pup, throw those leftover turkey or chicken bones in the trash and stick to pet-safe treats. Dogs might enjoy having a nice big bone to chew on, but cooked meat bones can splinter and cause a blockage or lacerations in the gastrointestinal tract.7. Alcohol Pets should never be given alcohol, says Dr. Barrack, because it depresses the nervous system. Dogs and cats can get drunk just like people, says Dr. Wismer, and alcohol poisoning can lead to dangerously low blood pressure, body temperature, and blood sugar levels, plus tremors, seizures, comas, and death. Mixed drinks can be especially problematic. They’re stronger than beer and wine, and many holiday drinks are made with a dairy base (such as White Russians and eggnog), which is attractive to dogs and cats. 8. Poinsettias Most holiday plants, such as poinsettias, can cause mild oral irritation and gastrointestinal distress, says Dr. Barrack. Symptoms of irritation from poinsettias include: Drooling Licking lips Vomiting Diarrhea Though it’s best to keep this holiday plant away from cats and dogs, medical treatment is rarely necessary for pets that ingest poinsettias. 9. Lilies Other plants are far more dangerous. Even tiny amounts of certain types of lilies can cause kidney failure in cats, says Dr. Barrack. Lilies can also cause problems for your dog, too. Lily exposure in dogs can lead to vomiting, diarrhea, and other symptoms. The lilies that are especially dangerous to cats include: Tiger lilies Day lilies Asiatic lilies Easter lilies Japanese Show lilies Even tiny amounts of certain types of lilies can cause kidney failure in cats.10. Holly If ingested, holly plants can cause vomiting and diarrhea in cats and dogs, says Dr. Barrack. Injuries from their spiny leaves can also cause excessive drooling, lip smacking, and headshaking. 11. Mistletoe You might want to hang up traditional mistletoe, but this popular Christmas decoration should be kept away from pets. If ingested, the plant can cause stomach problems. Large amounts may lead to hypotension, seizures, and even death, says Dr. Barrack. 12. Candles Whether you’re lighting a menorah, adding ambiance to your dinner setting, or placing candles in the window, be sure to keep pets far away from open flames. “Hanukkah is the festival of lights, but make sure your pet cannot come into contact with a lit menorah,” says Dr. Barrack. Dr. Wismer agrees: “We don’t want anyone knocking the table over or setting their tails on fire.” Don’t assume that a curious cat would never jump up on a mantle or table and accidentally catch their tail in the flame. 13. Christmas Trees While the Christmas tree is an essential part of holiday decor for many families, your pets see it more as a new toy to explore. You will need to take some precautionary measures to keep your Christmas tree safe from pets—and vice versa. Cats are especially curious about Christmas trees. Whether your tree is real or fake, make sure it’s properly secured and has some sort of barrier to deter cats from going for a climb, says Dr. Barrack. In addition to ruining your decorating work, cats could injure themselves in the tree. If your tree is real, don’t let cats or dogs drink from the water reservoir—especially if you use a fertilizer. Drinking this stagnant water can cause vomiting and diarrhea. 14. Ornaments and Snow Globes Aside from the tree itself, the ornaments can also pose a hazard. Glass ornaments can break, cutting pets’ paws or faces, says Dr. Barrack. If ingested, they can also cause gastrointestinal blockages and lacerations. Snow globes and bubble-shaped holiday lights may also contain poisonous chemicals such as ethylene glycol, she says, which can cause kidney failure in pets. 15. Tinsel, String, and Ribbons “Tinsel is one of the most dangerous items that we can put on the tree,” says Dr. Wismer. It’s made from plastic or metal, which can cut through a curious cat’s digestive tract, so it’s best to skip this shiny tree-topper. Strings of popcorn or cranberries, as well as ribbons on presents, can cause similar problems for pets. 16. Electrical Cords Electrical cords can present a hazard for pets as well. And during the holiday season, there always tends to be more around the house for the decorations and lights. “If chewed, live electrical cords can cause oral burns, seizures, and even death,” says Dr. Barrack. Make sure to keep holiday lighting unplugged and out of reach when pets are unsupervised. 17. Houseguests “We always talk about grandma&#039;s purse being one of the most dangerous things in the house for pets,” says Dr. Wismer. It can contain items like medications, sugar-free gum, and over-the-counter pain meds, all of which can be bad news for pets. Ask guests not to leave bags or purses on the floor. If they’re staying the night, keep the guest room door closed so pets don’t get into their suitcases. Having lots of people in the home can also be stressful for dogs and cats, Dr. Barrack says, so give your pet a safe and quiet place to relax. Changes made to the home, like moving a litter box out of a guest room or changing your dog walking routine, can cause a lot of stress for pets. There’s also the danger that indoor pets can get loose if the front or back door is left open. Make sure your pets have collars and microchips, Dr. Wismer says. 18. Heaters and Warming Devices Space heaters, heated blankets, and other warming devices could cause trouble if your pet knocks them over, tangles the cords, or moves them from their original position. You should also never use kerosene heaters indoors, warns Dr. Wismer. These could pose a carbon monoxide risk, potentially poisoning you and your pets. 19. Fireplaces Another heating hazard is the fireplace, including fire logs. “For some reason, dogs love to chew on these,” Dr. Wismer says. They’re not poisonous, but they could cause an obstruction in the dog’s digestive tract. Also be sure to clean the ashes out of the fireplace. They’re very alkaline, Dr. Wismer says, and could cause burns if ingested. 20. Cleaning Supplies Whether you’re getting the house ready for holiday guests or cleaning up after them, keep pets far away from cleaning supplies that contain chemicals such as ammonia, bleach, and chlorine.  “Even all-natural products can cause stomach irritation,” says Dr. Barrack. Some of the essential oils used in “natural” cleaning products are quite toxic, especially to cats. “Keep your pets in a separate area until all recently cleaned surfaces are dry,” she says. 21. Rock Salt While there have been many innovations in making rock salt safer for pets, the reality is that not all municipalities have made the switch. Protect your pets’ paws with dog boots, or wash their feet thoroughly after each winter walk. Rock salts and other ice-melting chemicals can cause stomach upset or, potentially, electrolyte problems when they’re swallowed, says Dr. Wismer. When trapped in your pet’s paws, they can also cause abrasions and ulcerations that lead to pain and infection. 22. Antifreeze There have also been moves to make antifreeze less appealing to pets by adding a bittering agent that discourages them from lapping it up. But it’s not a foolproof solution. Safer pet-friendly types of antifreeze are available, but who knows what type of antifreeze is dripping out of your neighbor’s car! Always clean up antifreeze spills thoroughly and call your vet if you suspect that your pet has ingested even a drop. Antifreeze can cause kidney failure and death. By Helen Anne Travis Featured Image: Getty/VYCHEGZHANINA"}]