[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Keep Small Dogs Healthy, From Puppy to Senior Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/woman-hanging-out-with-yorkie.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/woman-hanging-out-with-yorkie.jpg"}, "author": {"@type": "Person", "name": "Heather Hoffmann, DVM", "url": "https://www.petmd.com/author/dr-heather-hoffmann"}, "keywords": "Dog, Breed, General Care, Preventative health, Zoo Small Dog Pack, Zoo Yorkipoo Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-keep-small-dogs-healthy-puppy-senior-dog"}, "datePublished": "September 1, 2020", "dateModified": "September 8, 2023", "description": "Dr. Heather Hoffmann explains how to take care of small dog breeds and keep them healthy through every life stage.", "articleBody": "Small dogs have become increasingly popular due to their compact size. However, we need to consider that, due to their smaller size, they have specific nutritional needs and a genetic predisposition to certain health problems. If cared for properly, small dog breeds can have a long life span. Here are some general guidelines on how to keep small dogs healthy, from puppyhood to their senior stage of life. Jump to Section: List of Small Dog Breeds and Weight RangeHealth Issues in Small Dog BreedsLife Span of Small Dog BreedsPuppy: 0-12 MonthsAdult: 12 Months – 8 YearsSenior: 8-16 YearsWhat’s the Small Dog Weight Range? Small dogs are usually considered to be 20 pounds or less, give or take a few pounds. These are 10 of the most common small dog breeds, and of course, small mixed-breed dogs are included in this category as well. French Bulldog Beagle Miniature Poodle Yorkshire Terrier Dachshund Pembroke Welsh Corgi Cavalier King Charles Spaniel Miniature Schnauzer Shih Tzu Pomeranian What Health Issues Do Small Dogs Have? Small dogs can be predisposed to certain health conditions due to their breed and genetic influences. Some of the most common health issues we see in small dog breeds are: Tracheal collapse Patellar luxation Mitral valve disease Intervertebral disc disease (IVDD) Issues with temperature regulation Tracheal Collapse Collapsing trachea is a common condition in middle-aged to senior Yorkshire Terriers, Pomeranians and Shih Tzus. It occurs when the rings of cartilage that make up the trachea (or windpipe) lose some of their rigidity, causing the tracheal rings to flatten when the dog breathes in. This phenomenon can make it difficult for air to get into the lungs, and it often sounds like a “goose honk” cough. Tracheal collapse is not preventable and is usually treated with managing your dog’s weight, using harnesses instead of collars, and giving medication for coughing as needed. Contact your veterinarian if you hear the honking cough and have one of those breeds. Patellar Luxation Patellar luxation is a condition where the kneecap gets moved out of its normal position due to an anatomical variation in the affected knee. This condition is very common in small dogs and has been reported to affect 7% of small-breed puppies. Some of the most commonly affected breeds are Miniature Poodles, Chihuahuas, Pomeranians, and Yorkshire Terriers. If your dog is having trouble putting weight on their back leg, is walking with a locked knee, or is kicking out a back leg while running, have them examined by your veterinarian. Patellar luxation can usually be managed with joint supplements and medications, but in serious cases, it may require surgery. Mitral Valve Disease One of the most common health conditions in small dog breeds is one that affects the heart. Mitral valve disease occurs when the mitral valve (one of the valves between the main chambers of the heart) deteriorates over time. This allows blood to flow backwards through the heart chambers instead forward and into the body. Sometimes this phenomenon will cause a “murmur,” or the sound you hear when you listen to a heart with a degenerative valve. Many dogs with mitral valve disease may not even show symptoms, but this condition can predispose them to congestive heart failure. Thankfully, not every dog that has mitral valve disease will develop congestive heart failure, but regular veterinary monitoring is important with any dog that has a heart condition. There is currently nothing that can prevent this heart condition, as it is thought to be genetic. IVDD Intervertebral disc disease (IVDD) can also be referred to as a slipped, herniated, ruptured, or bulging disc. This disease is very common in Dachshunds but can also be seen in Beagles, Shih Tzus and Pekingese breeds. IVDD occurs when the gel-like center of the intervertebral disc ruptures through the fibrous outer layer and pushes on the spinal cord, causing severe pain or even limited mobility or paralysis. Depending on the severity of the injury, IVDD can be treated with medical management or may require emergency surgery. The likelihood of disc injury can be reduced by avoiding activities such as jumping on/off furniture and explosive movements (jumping in the air during fetch or racing up steps). In addition, keeping your furry friend at a healthy weight can help prevent back problems as they age. Poor Temperature Regulation Small dog breeds have poor temperature regulation compared to larger breed dogs. This means that they may seem to get colder easier or overheat faster. Fortunately there are simple ways to prevent any major issues. If your dog shakes in cold weather or air conditioning, you may want to invest in a doggy sweater or jacket to prevent heat loss. Dogs that are at risk for overheating in hot temperatures will benefit from staying indoors or in a cool, shaded area with access to plenty of water. Consult with your veterinarian if temperature regulation becomes a constant issue that is difficult to manage. How Long Do Small Dog Breeds Live? On average, small-breed dogs live to about 11-13 years of age. Of course, there will be some dogs that live much longer, and unfortunately, those that will pass away sooner than that. Veterinary record analysis has revealed that small mixed-breed dogs had an average life span of 11 years. How to Keep Small Dogs Healthy at Each Life Stage One of the benefits of having a small dog is that they have a longer life expectancy, and therefore, we get to have them as our companions for a significant amount of our lives.  To keep your small dog as healthy as possible, you’ll need to keep specific health considerations in mind during each of their life stages. Here are some health tips for the puppy, adult, and senior stages of a small dog’s life. Small-Breed Puppy: 0-12 months A small-breed puppy has different needs than a medium-sized or large-breed puppy. Here’s how to set your small-breed puppy up for success. Nutritional Needs Small dog breeds grow at an exponential rate and reach adult size more quickly than larger dogs. It is important to feed a diet approved for puppy life stages because these foods are specifically formulated to ensure proper nutrition for growth. The brands of food that veterinarians recommend the most are Royal Canin, Hill’s Science Diet, and Purina Pro Plan because their diets are formulated by veterinary nutritionists and are specifically designed to meet certain nutritional needs. Small dogs are unique in the fact that they can get low blood sugar, or become hypoglycemic, if they do not get proper nutrition throughout the day. For this reason, you should feed a small dog three meals a day until they are around 12-14 weeks of age before switching to twice-daily feeding. Most dog food brands will give specific feeding recommendations based on the current age and weight of the puppy to ensure proper growth. Here are some options for small-breed puppy diets: Royal Canin Small Puppy dry dog food Royal Canin Puppy Healthy Development small breed food trays Hill’s Science Diet Small Paws Puppy dry dog food Hill’s Science Diet Small Paws Puppy canned dog food Purina Pro Plan Focus Puppy Small Breed dry dog food Purina Pro Plan Focus Puppy canned dog food Supplements If your puppy is receiving an appropriate diet, they will not require any additional supplements at this time. Medical Needs It’s important to ensure that your small dog is healthy before or as soon as you welcome them into your home. It’s normal for puppies to have internal parasites, or “worms,” as they can get passed from the mother. However, if your puppy has a noticeably large belly or diarrhea, or you can see visible worms in their stool/vomit, take them to see a veterinarian as soon as possible. Similarly, if your puppy is coughing or sneezing or has discharge coming from their eyes or nose, please seek veterinary care. Veterinary Care Establishing a relationship with a local veterinarian is a great first step in owning a healthy small dog. Depending on when your puppy was last vaccinated, schedule an appointment for an exam before they are due for their shots so your puppy can get used to a new environment without negative associations. In addition to vaccinations, your vet will likely check a stool sample for internal parasites to determine if additional deworming medication is necessary. If you have any questions about your small dog’s health, the first visit is a great time to ask because the doctor will be performing an exam from nose to tail to ensure that there are no concerns. Vaccines Dogs need to be vaccinated every two to four weeks until they are 16 weeks of age, which is when their immune system is fully developed. The major required vaccines are rabies, distemper, and parvovirus. However, depending on your dog’s lifestyle, vaccinations against Bordetella, canine influenza, leptospirosis and Lyme disease may be recommended. Please discuss the proper vaccines and vaccination schedule for your puppy with your veterinarian. Dental Care Dental disease is a very common problem in all dogs, but small dog breeds are especially prone to gum disease at a young age. The best way to prevent this is to commit to an at-home dental routine and schedule anesthetic dental cleanings based on your veterinarian’s recommendation. For some dogs, this can be as often as every six months, but others may only need cleanings every couple of years.  Starting a dental hygiene routine early is key to maintaining dental health in your small-breed dog. Although daily teeth brushing would be ideal, it may not be feasible. Water additives and dental chews are the easiest and most effective ways to prevent plaque buildup and secondary gum disease. Here are a few water additives and dental chews that are highly recommended and safe for puppies: Virbac C.E.T. VeggieDent tartar-control chews Virbac C.E.T. Enzymatic oral hygiene chews TEEF! Drinkable Dental Health water additive Spay/Neuter Part of being a responsible pet owner is reducing the amount of unwanted animals that are brought into this world by spaying or neutering your pet. Small dogs tend to reach sexual maturity sooner than large-breed dogs, so it is generally recommended to have them spayed or neutered before 6 months of age. For females, spaying before the first heat cycle dramatically reduces the risk of mammary cancer and a uterine infection called pyometra. For males, neutering eliminates the risk of testicular cancer and reduces roaming/male-dominance behaviors.  In addition, small dogs are more likely to have trouble giving birth due to anatomical challenges. Please consult your veterinarian for more information if you are planning on breeding your small dog. Parasite Prevention Parasite prevention is one of the most important and simplest ways to keep your small dog healthy. There are two main components to effective parasite prevention: Flea and tick prevention (external parasites) Heartworm and intestinal parasites (internal parasites) Fleas and ticks can carry a variety of diseases, while heartworms and intestinal parasites can cause significant internal organ damage, so it’s important to use a product that covers the parasites most prevalent in your area. It is recommended to start flea, tick, and heartworm prevention as early as 8 weeks of age and continue for the life span of your pet. Your veterinarian can recommend the best product for your puppy’s lifestyle. Mental and Physical Stimulation Physical exercise and playtime are important for any puppy, but it’s just as important to provide mental stimulation to maintain a healthy body and mind. For small-breed puppies, this can include walks or outside play combined with interactive toys and training sessions. Here are some options for interactive toys for puppies: KONG Puppy dog toy KONG Puppy Teething Stick dog toy Starmark Everlasting Treat Bento Ball dog chew toy Adult Small-Breed Dogs: 12 months – 8 years As your small dog matures into adulthood, keeping up with their health care is just as important, if not more important, than when they were a puppy. All of the most common health conditions we see in small dog breeds (tracheal collapse, patellar luxation, mitral valve disease, intervertebral disc disease, and trouble with temperature regulation) have the potential to start showing symptoms during the adult life stage. It’s important to try to prevent the diseases that are preventable and to discuss any concerning changes you may see with your veterinarian. Nutritional Needs Although it may seem too soon, once your small dog reaches 12 months of age, it is time to transition to an adult food. If your dog has done well with his current brand of puppy food, you can stay within that brand and pick a food labeled for the adult life stage. If you are not happy with your current brand of food, now would be a good time to try something different, since switching formulas will be necessary anyway. Remember to transition from puppy to adult food slowly, adding a little of the adult food to the puppy food over a week. Veterinarians most often recommend Royal Canin, Hill’s Science Diet, and Purina Pro Plan because their diets are formulated by veterinary nutritionists and are specifically designed to meet nutritional needs. Some diets are tailored for specific small dog breeds, dogs with sensitive skin/stomachs, and dogs with weight-management issues. Discuss the best diet for your small dog with your veterinarian. Here are some options for small-breed adult dog diets: Royal Canin Size Health Nutrition Small Indoor adult dry dog food Royal Canin Weight Care small adult dry dog food Hill’s Science Diet Sensitive Stomach &amp; Skin small and mini adult dry dog food Hill’s Science Diet Small Paws adult canned dog food Purina Pro Plan Savor adult shredded blend dry dog food Supplements The adult life stage is a great time to start joint supplementation. Although many pet parents will wait until their dog has joint problems to start supplementation, these problems can actually be prevented with the proper products. The following products are veterinary-approved joint supplements that are safe for small dogs. Discuss with your vet whether your small dog would benefit from these supplements: Nutramax Dasuquin MSM soft chews VetriScience GlycoFlex Stage III joint support Medical Needs Keeping up with your adult small dog’s health is extremely important, because this is the prime time for preventing future issues. Veterinary Care Continuing yearly veterinary visits is crucial for keeping your small-breed dog as healthy as possible. Because dogs age much more quickly than humans, not seeing a vet for over a year would be the equivalent of a human not seeing a doctor for almost 10 years! Even if they are not due for vaccinations yearly, your dog should be examined, have their stool checked, and get a heartworm test once a year to stay current with prevention. If financially feasible, yearly full blood work is also a great way to obtain a baseline for your pet’s “normal” so that your veterinarian has something to compare it to if your dog gets sick or develops a condition. Vaccines At this point in your dog’s life, you should have discussed which vaccines are necessary for their lifestyle with your veterinarian. Depending on which types of vaccines are available, your dog will likely need vaccinations every year to every three years. Dental Health Your adult small dog’s teeth should be examined by your veterinarian at their yearly checkup to determine when they will need to be scheduled for their first anesthetic dental cleaning. If you stick to a regular dental routine that includes daily tooth brushing, your dog may not need yearly cleanings. However, each dog/breed will vary in their individual dental needs, so it is important to formulate a specific plan with your veterinarian that best fits their lifestyle. Continuing an oral hygiene routine at home is key to maintaining dental health in your small-breed dog. If your small dog has done well with one of following water additives or dental chews, you can continue to use these products throughout their adult and senior life stages: Virbac C.E.T. VeggieDent tartar-control chews Virbac C.E.T. Enzymatic oral hygiene chews TEEF! Drinkable Dental Health water additive Spay/Neuter If your dog has not been spayed or neutered by this age, it is not too late! Although performing these procedures earlier in life greatly reduces the risk of certain conditions, it is still recommended to fix your pet as soon as possible. Your dog can also still be spayed or neutered after they are bred, to prevent unwanted pregnancies. Contact your veterinarian if you have questions about spaying or neutering or are thinking of breeding your small dog. Parasite Prevention Parasite prevention should be continued for your small dog’s entire life. Depending on the product that your veterinarian has helped you choose, that may mean giving a pill/applying a topical solution once a month, or getting an additional injection every 6 to 12 months (ProHeart 6 and ProHeart 12 heartworm injections). If you are using a combination heartworm and flea/tick product, your dog will need to be tested yearly for heartworms to refill the prescription. This is performed to ensure that the medication is working properly and there have been no lapses in coverage that would result in your dog contracting heartworm disease. If you move to a different location over the course of your dog’s adult life, make sure that your current preventative product covers the most prevalent parasites in the new area. Mental and Physical Stimulation Mental and physical exercise routines should continue from puppy to adulthood to establish a healthy routine for your dog. As they get older, you can incorporate agility training, swimming, or hiking if they are large enough and enjoy those activities. Even if you have a very petite dog, you can use the following interactive toys as a means of both physical and mental exercise: Frisco Hide and Seek plush Chewy box toy Starmark Everlasting Treat Bento Ball chew toy Trixie Mini Mover Level 3 strategy toy Senior Small-Breed Dogs: 8 – 16 years It may be difficult to consider your fur baby to be a “senior” dog, but all pets will eventually get to this stage in their life. You may notice their muzzle getting gray, that they show less interest in playing, that they are sleeping more, and that there is a general “slowing down process.” Although this process is expected, you don’t want to become complacent with health care at this stage in their life. If you notice signs of pain (limping, trouble getting up from lying down, a stiff gait, etc.) please bring this up to your veterinarian. These symptoms could be signs of arthritis, which can and should be diagnosed and treated to prevent unnecessary pain. Ramps are specifically designed for senior dogs that have trouble getting into cars or getting up from lying down, and orthopedic beds can help your small dog sleep as peacefully as possible in their later days. In addition, yearly blood work should be performed to avoid missing any underlying diseases that are more common in older dogs (kidney disease, diabetes, Cushing’s disease, etc.). It is also important to remember that older dogs may need more frequent potty breaks since the won’t be able to hold it as long as they once could. Nutritional Needs Once your small dog reaches around 8 years of age, it is time to switch to a diet formulated for senior dogs. Senior diets are formulated to help keep dogs at a lean weight as they get older, and they often contain important antioxidants and nutrients that are vital to maintaining health in senior pets. Remember to transition from adult to senior food slowly, adding a little of the senior food to the adult food over a week. Veterinarians commonly recommend Royal Canin, Science Diet, and Purina Pro Plan because their diets are formulated by veterinary nutritionists and are specifically designed to meet nutritional needs. You can even find diets that are tailored for senior pets with neurological issues, such as canine cognitive dysfunction or “doggy dementia.” Discuss the best diet for your senior dog with your veterinarian. Here are some options for small-breed senior diets: Royal Canin Size Health Nutrition Small Aging 12+ dry dog food Royal Canin Size Health Nutrition Small Aging 12+ wet dog food Hill’s Science Diet Small Paws Adult 11+ dry dog food Hill’s Science Diet Small Paws Adult 7+ wet dog food Purina Pro Plan Bright Mind Adult 7+ Small Breed Formula dry dog food Supplements Joint supplementation is especially important in senior pets. If you did not start your dog on one of the recommended products during their adult years, it is not too late to start now! These supplements may even be a part of suggested medical therapy if your senior dog has been diagnosed with arthritis. The following products are veterinary-approved joint supplements that are safe for small dogs. Discuss using these with your veterinarian: Nutramax Dasuquin MSM soft chews VetriScience GlycoFlex Stage III joint support Medical Needs  For senior small dogs, trips to the vet will become more frequent, and you may see significant changes in their health. Veterinary Care Going to the vet yearly, or even twice a year, for checkups is crucial for keeping your small-breed dog as healthy as possible during their senior years. Senior dogs should have full blood work done yearly or even more frequently because blood values can change dramatically in a matter of months, and we don’t want to miss any underlying diseases as your dog gets older. It is still important to have your small dog’s feces and heartworm status checked yearly because parasites do not have an age preference. Vaccines Your vet may tell you that some vaccines are optional at this stage of life, depending on your dog’s medical conditions or lifestyle changes. Dental Care Your senior small dog’s teeth should be examined by your veterinarian at their yearly checkup to determine if they will need any additional anesthetic dental cleanings. If you’ve kept up with your pet’s dental routine throughout their life, your dog may not need yearly cleanings. However, each dog/breed will vary in their individual dental needs, so it is important to formulate a specific plan with your veterinarian that best fits their lifestyle. Continuing an oral hygiene routine at home is key to maintaining dental health in your small-breed dog. If your small dog has done well with the one of the water additives or dental chews previously recommended for adult dogs, you can continue to use these products. Parasite Prevention Your senior small-breed dog will still need protection from parasites like fleas, ticks, and heartworms. If your usual treatment doesn’t seem to be working, ask your vet to switch your dog to a different type or brand. You have several options, including pills, topical solutions, and injections (ProHeart 6 and ProHeart 12 for heartworms). Your dog will still need to be tested yearly for heartworms to fill prescriptions for flea/tick/heartworm combo products. Testing ensures that the medication is working properly, that it was administered properly (your dog actually ate the pill, or the topical solution was dispensed), and there have been no lapses in coverage that would result in your dog contracting heartworm disease. Mental and Physical Stimulation Physical exercise may become more difficult for your senior dog as they age, but even short walks can promote a healthy lifestyle. If your dog has limited mobility, you can continue to use hide-and-seek plush toys, rubber chew toys that hold treats, and treat puzzle toys as a means of both physical and mental exercise. End of Life Care End of life care is never an easy subject, but there are many resources and tools that you can use to help make it a little easier and to answer the dreaded question, “Is it time?” If you are having trouble caring for your senior pet, or deciding whether your pet still has a good quality of life, contact your veterinarian to talk it through. Resources for assessing your dog’s quality of life: Quality of Life Scale Lap of Love Quality of Life Scoring Tools Lap of Love “How Will I Know It Is Time?” Featured Image: iStock.com/Goodboy Picture Company"}]