[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/1xuh3nn9hn", "@type": "VideoObject", "duration": "PT1M59S", "name": "5327091836001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/a2248b93a57dddb2103d20fc8d08f31365c19820.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/1xuh3nn9hn", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/a7abecb161dbc15e8b04339ade60b60bb576cfa2.m3u8", "transcript": "Although it is far from appealing. Still eating or copper aphasia is a relatively common behavior seen in puppies. However, it should be addressed appropriately and quickly to prevent it from becoming a recurring habit as your dog ages at birth. It is natural for a mother to eat her puppy stool both to keep her litters den clean and to protect her puppies from predators.\n\nThat may be drawn to the scent of the puppy stool though she will stop this behavior on her own. Once the puppies are weaned her puppies may pick up on it and continue the behavior as they mature. This combined with a natural puppy curiosity to explore things with their mouths is often how Cooper aphasia begins in dogs. Additionally stool eating can be a sign of other underlying issues, including poor digestion boredom stress, or even hunger.\n\nSome puppies will also eat stool as an attention seeking behavior if their owner has a strong reaction to it either to hide the evidence or to get some extra attention. Ensure that your puppy is consistently fed a high quality food that is formulated for puppies and includes the protein, vitamins, and minerals that he needs for normal growth. Speak with your veterinarian about your puppy's diet, especially if you believe your puppy has any digestive issues. Signs of this might include watery stool or stool with large pieces when they just have food and be diligent cleaning up after your puppy eliminates and never give him a chance to play with eat or inspect his stool after he goes to the bathroom distract your puppy from his stool by rewarding him with verbal encouragement or a treat for a job well done.\n\nAs soon as he goes and if necessary, take your puppy inside before cleaning up his stool. It's also important to keep your puppy on a leash whenever you walk in to prevent him from smelling and eating the stool of other animals. Some parasites and illnesses can be transmitted through stool. So it's important to keep your puppy as far away from it as possible.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/general-health/why-do-puppies-eat-poop?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Puppies Eat Poop?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/border-collie-puppy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/border-collie-puppy.jpg"}, "author": {"@type": "Person", "name": "Jamie Lovejoy, DVM", "url": "https://www.petmd.com/author/dr-jamie-lovejoy"}, "keywords": "Dog, Puppy, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/why-do-puppies-eat-poop"}, "datePublished": "March 16, 2023", "dateModified": "March 16, 2023", "description": "Ever see your puppy eat poop and wonder what is going on? While this is a normal puppy behavior, it&#039;s one that can be corrected with positive reinforcement. Learn more about why puppies eat poop and how to stop it.", "articleBody": "Watching your puppy eat poop is the one thing that makes you reconsider how much you want those puppy kisses. Unfortunately, eating stool (a behavior called coprophagy or coprophagia) is actually a very normal behavior in puppies, though it isn’t a behavior we want to encourage. Understanding why your puppy eats stool and learning how to address this behavior appropriately will help prevent it from becoming a lifelong habit. So … why do puppies eat poop? Why Is My Puppy Eating Poop? If your puppy consistently ingests stool, talk with your veterinarian. There are many possible reasons for a puppy to eat poop, and knowing if the cause is medical, behavioral, or a combination of both can help you eradicate the behavior successfully. Puppies Eat Poop To Mimic Their Mothers  Before puppies are weaned, it’s very common for the mother dog to eat the stool her young produce. This is a primitive, evolutionary behavior that developed to keep the den clean and protect the puppies from disease, parasites, and predators. The smell from large amounts of stool accumulating in a den would certainly draw unwanted attention! Young puppies learn how to be a dog from their mother by mimicking her behaviors, so it’s not uncommon for them to also try eating their own—or their litter mates’—stool. This behavior can sometimes be thwarted by picking up any stool the puppies produce before they have the chance to snack on it. Puppies Eat Poop Because of Poor Digestion  Another theory behind coprophagia is that some puppies develop the habit after not digesting their food well. If food is digested poorly, this might cause portions of the stool to have the same smell and taste as their puppy food. This similarity may inspire some puppies to eat the stool. Causes of poor digestion can be diet formulation, parasites, or abnormalities in the digestive tract. Inadequate weight gain or gastrointestinal signs such as vomiting or occasional diarrhea may warrant further investigation into your puppy’s intestinal health and diet. Boredom and Stress Can Cause Puppies To Eat Poop Puppies with inconsistent socialization and activity can develop many bad habits in an effort to entertain themselves or feel more in control of their environment. Though chewing on crates and furniture is more common, some puppies might eat their poop. Consistent, frequent playtime and interaction is important to help prevent this unwanted behavior. If your schedule requires your puppy to be alone for extended periods of time, talk to your veterinarian about age-safe dog toys that will keep them entertained and stress-free. Puppies Eat Poop Because They’re Not Getting Enough Food Though rare, coprophagia can develop simply because your puppy isn’t getting enough nutrition. Growing puppies require many more calories than adult dogs and should be fed a diet specifically designed for their needs. Young puppies should be fed three or four times a day on a consistent schedule. If you have questions about how much or how often you should feed your puppy, talk to your veterinarian. Intestinal parasites can also leech nutrients from your puppy, leading to clinical signs that are similar to when they aren’t getting enough food. Your veterinarian can look for evidence of intestinal parasites through fecal testing. Puppies Eat Poop To Get Your Attention Getting upset and yelling at your puppy is a very common reaction when you see them doing something as gross as eating poop. Unfortunately, most puppies can’t distinguish negative interactions from positive interactions, so pet parents might be unintentionally reinforcing this behavior. Some puppies will quickly learn that they get attention from their humans if they eat poop—and they’ll start to do so just to get a reaction. Puppies Eat Poop To Avoid Punishment On the other hand, puppies who recognize yelling and punishment as something to avoid may eat poop to hide the fact that they have defecated where they aren’t supposed to while being house-trained. Therefore, punishment tactics should never be used with puppies to help with house-training or stool-eating. Instead, put effort into praising good behaviors (like when your puppy poops outside). When a puppy poops on the floor, ignore them and just clean it up well. When they potty outside, praise them. Your puppy will learn that they get attention for pooping outside, not for pooping inside and eating it. How To Stop a Puppy From Eating Poop If your puppy has already developed a poop-snacking habit and they have no physical abnormalities or illness, the following tips may help stop the yucky behavior. Always Feed Your Puppy High-Quality Food Make sure you’re feeding your fur baby a diet formulated for a growing puppy. Diet won’t be the same for every puppy: Large-breed puppies and toy puppies have different nutritional needs. Consult with your veterinarian to make sure the amount and frequency is appropriate for your puppy’s age and size, and that your puppy seems to be growing at an appropriate rate. Watch for signs of digestive issues: Vomiting, diarrhea, and passing undigested food may be signs that your puppy is not digesting their food appropriately. Make Sure Your Puppy Gets Enough Exercise and Attention Exercise and play are essential for a happy puppy, and providing consistent opportunities to engage their mind and their muscles will make them less likely to develop undesirable habits. When you have to leave your puppy alone, consider age-appropriate and non-destructible chew toys or puzzle toys to entertain them. Always Clean Up After Your Puppy If your puppy doesn’t have access to poop, it’s unlikely that they’ll keep eating it. Cleaning up stool promptly can help them avoid temptation. After your puppy poops, distract them from their stool by calling them to you. A puppy who successfully comes when called and ignores their stool should be rewarded, either verbally or with training treats. Bring your puppy inside, if possible, before removing the stool to avoid drawing attention back to the location. Keep Your Puppy on a Leash For puppies that cannot be easily distracted from their stool, leashes can be an effective tool to keep them walking away after they have defecated. It can also keep them away from the stool of other dogs (or other animals). While verbal commands and recall are always preferred, a gentle tug on the leash can help distract them from the stool initially. Don’t forget: Training treats and praise can still be used with leashed puppies when they respond appropriately to your commands. Why Do Adult Dogs Eat Poop? Adult dogs that eat poop might not have outgrown their puppyhood desire, and it’s still poorly understood why some dogs develop the habit later in life. But, like in puppies, it may be a reaction to anxiety or boredom. As with all adult-onset behavior changes, it’s important to rule out illness with your veterinarian. If no medical cause for the coprophagy is found, use the same techniques described above for your adult dog. Featured Image: iStock/Mark Myerson"}]