[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chiggers on Dogs: What You Need to Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Parasites", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/chiggers-on-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/chiggers-on-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Insect bites, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/chiggers-dogs-what-you-need-know"}, "datePublished": "July 12, 2016", "dateModified": "September 7, 2022", "description": "If you’ve ever taken a walk with your dog in the woods or through a field, only to have your best friend scratching up a storm for the next several days, you might have experienced a chigger attack. Find out what chiggers are, and how to treat them, here.", "articleBody": "By Samantha Drake If you’ve ever taken a walk with your dog in the woods or through a field, only to have your best friend scratching up a storm for the next several days, you might have experienced a chigger attack. These tiny, red pests are so small that you might not even notice them on your dog but, once they become a source of itchy discomfort, they’re difficult to ignore. Find out what chiggers are, and how to treat them, below. What Are Chiggers? The scientific name for chiggers is Trombiculamites, but they’re also known as red bugs, harvest mites, itch mites and scrub mites. The tiny pests are commonly found in the woods and areas with tall grasses, particularly in the southeastern part of the United States. Chiggers in their larval stage feed on a variety of animals, birds and reptiles. Their bites cause intense itching, which can be miserable for dogs that venture into a chigger’s natural habitat. To make matters worse, the American Association of Veterinary Parasitologists (AAVP) notes that emerging chigger larvae tend to congregate in one area, which means an unsuspecting host is likely to be exposed to a whole swarm of chiggers at one time. “They’re so tiny you can just barely see them,” said Dr. Susan E. Little, chair of Veterinary Pathobiology at Oklahoma State University’s Center for Veterinary Health Sciences. And for pet parents that lead an active lifestyle with their pets, a single infestation of chiggers can be enough to keep you indoors, Little said. Probably the biggest misconception about chiggers is that they burrow into the skin and feed on blood. However, chiggers actually feed on skin cells and don’t penetrate the skin, Little said. When the larval chigger attaches to its host, its salivary secretions harden to form a tube, known as a stylostome, which the chigger uses to suck up liquefied skin tissue from the host, according to the AAVP. Feeding can last several days. When the chigger finishes, it detaches and proceeds to the next stage of its lifecycle, the prenymphal stage. Meanwhile, the feeding tube stays attached to the host and is what causes the lingering itchiness. Chigger bites are most common during the summer and fall months and the main symptoms are severe itching. Scratching the bites can lead to a secondary infection, but chiggers do not carry disease, according to the AAVP. Treating Chigger Bites A dog’s body is fairly well protected from chigger bites because of its fur, Little said, but chiggers can attach to a dog’s head, particularly the skin in and around a dog’s ears and eyes. “The sooner you get them off the better,” Little said. To remove chiggers from these sensitive areas, Little recommends wiping the area with a soft cloth or vet-recommended skin wipe. A warm bath can also help. In cases of severe infestation, a vet may prescribe prednisone to ease skin inflammation from scratching, Little said. Additionally, systemic pet treatments containing acaricides (any medication used for killing ticks and mites, like Frontline, Revolution and Seresto) kill chiggers as well as ticks and can help repel the pests. Fortunately, chiggers don’t jump from dogs to people, said Dr. Christine L. Cain, assistant professor and section chief at the University of Pennsylvania School of Veterinary Medicine’s Dermatology &amp; Allergy Section. And, although the itching can persist for up to a week, the chiggers themselves are not difficult to remove. “The issue is fairly transient,” Cain said. “Chiggers are not going to live on the dog long-term.” Dog owners may be tempted to try alternative treatments to help ease their pet’s itchy discomfort. But home remedies such as Epsom salts, oatmeal and green tea in the bath water may or may not be effective. Cain advises checking with your dog’s veterinarian before trying any alternative treatment. Image: Marek Velechovsky via Shutterstock"}]