[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Should You Enroll Your Pet in a Clinical Trial?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS_ClinicalTrials_779196712.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS_ClinicalTrials_779196712.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/should-you-enroll-your-pet-clinical-trial"}, "datePublished": "May 18, 2018", "dateModified": "September 7, 2022", "description": "Clinical trials are an essential part of veterinary research. They enhance the veterinary care options available for pets, but are they right for your pet?", "articleBody": "By Paula Fitzsimmons Clinical trials provide veterinary researchers with the data they need to develop drugs, procedures and other treatments for our companion animals. Participants may receive access to cutting-edge veterinary care at little or no cost, while contributing to work that can also benefit other animals. Many of these veterinary research studies are non-invasive, and researchers typically enroll animals already afflicted with the disease being studied. What does a clinical trial entail, and what are the drawbacks and risks? Read on for a deep dive into veterinary clinical trials to determine if they’re right for your furred family member.  What Are Clinical Trials? Most clinical trials are run at veterinary teaching hospitals where veterinarians and researchers investigate promising treatments or try to improve upon established ones, says Dr. Felix Duerr, an assistant professor of Orthopedics and Small Animal Sports Medicine/Rehabilitation at Colorado State University Veterinary Teaching Hospital in Fort Collins. “We want to find out if a treatment is successful and safe.” The animals are usually client-owned, and most already have the disease being studied. “For some clinical trials, healthy animals are also needed in order to provide a comparison to animals with a particular disease,” says Dr. Eleanor Hawkins, a professor of Internal Medicine at North Carolina State University College of Veterinary Medicine in Raleigh. Clinical trials run the gamut of veterinary disciplines, from cardiology and neurology to dermatology and nutrition. One of Dr. Duerr’s studies seeks to determine if injecting stem cells into dogs with osteoarthritis is more effective than hyaluronic acid.  “The study will answer whether it’s worthwhile for a pet parent to spend more than 10 times as much on stem cells rather than hyaluronic acid, an off-the-shelf product,” says Dr. Duerr. Researchers run randomized and blinded studies to keep the results unbiased and error-free. “Clinical trials may have a control (comparison) group that is receiving a placebo. The investigator is usually blinded (unaware) of which animal is getting the experimental treatment and which is getting the placebo,” says Dr. Hawkins. What Are the Benefits of Enrolling Your Pet in a Clinical Trial? Animals enrolled in clinical trials have access to promising veterinary care treatments and interventions not yet available in the mainstream, and at low or no cost to pet parents. “For example, a drug or surgical method may not be available outside of the clinical trial, or the cost may be prohibitive. In some clinical trials, more extensive diagnostic testing may be provided without charge, as part of the study,” says Dr. Hawkins, who is board-certified in internal medicine. Clinical trials can potentially have a positive impact on the health of millions of animals. Some pet parents feel so strongly about contributing that they enroll their healthy pets. “As a healthy animal, the benefit will primarily be to further medical knowledge. Some clients are interested in contributing to the advancement of medicine in general, while others are interested in contributing to knowledge about a specific breed-related problem or disease that has a personal interest to them. In some trials, healthy animals may get benefits such as diagnostic screening without charge,” says Dr. Hawkins. What Are the Drawbacks of Clinical Trials? In exchange for access to cutting-edge veterinary care treatments at little or no personal expense, pet parents are obliged to make a time commitment, says Dr. Hawkins. “Often, though not always, there are specific requirements for clients to return to the hospital on a set schedule and/or to complete questionnaires about their pet throughout the study. Often for a study to provide meaningful results, a strict schedule must be followed.” Dr. Duerr’s stem-cell study, for example, spans over a year and requires nine to 12 visits and three procedures requiring sedation. With any veterinary care procedure, there are safety risks, which Dr. Hawkins says depend on the specific study. “Concerns include adverse effects from a drug or intervention, failure of the drug or intervention to have a beneficial effect, and delay of conventional treatment or intervention.” Dr. Duerr says problems occur infrequently, but that there are still risks. In his study, “You have to sedate the animal to safely do a joint injection, and anytime you sedate an animal, there’s a little bit of a risk. We are introducing a needle into the joint, so there is a tiny risk of complication from that, such as a joint infection.” There are measures in place to minimize risks, however, says Dr. Hawkins. “The first is that the principle investigator in a clinical trial carried out in a veterinary teaching hospital is usually a veterinarian who cares deeply about their patients. Importantly, every clinical trial must undergo an independent rigorous review by the Institutional Animal Care and Use Committee (IACUC). The Committee is comprised of faculty, non-faculty professionals and community representatives.”   Experts recommend taking time to thoroughly read the consent form to avoid miscommunication. “Every study involving client-owned animals will also have an informed consent form that has been approved by the IACUC.  It is critical that anyone entering their pet in a clinical trial read the consent form carefully,” says Dr. Hawkins. Are Clinical Trials Stressful for Pets? Dr. Duerr says that there are misconceptions about what clinical trials entail. In Dr. Duerr’s study, the team uses sensors to determine the amount of pressure the dogs put on each leg and paw. “For example, if there is a dog that has left-sided elbow arthritis, he would put less weight on that leg, which would result in less pressure,” he says. “One of the things we show is how happy the dogs are to be part of this. They know that when we measure how much pressure they’re putting on their paws, they get treats.” Whether a specific trial is suitable for an animal depends on the trial requirements as well as his health and personality, says Dr. Hawkins. This applies to older dogs, too. “It might be very appropriate for an older dog to be enrolled in a clinical trial—for instance, a trial testing a drug to control pain for arthritis, or a diet to improve cognitive function. The decision whether to enter a clinical trial should be made in the same way you would make any other medical decision for your pet, with consideration for things such as benefits, risks, expenses, convenience and lifestyle of you, your family and the pet,” explains Dr. Hawkins. Animals admitted to Dr. Duerr’s trials must fare well around strangers. “Dogs not happy around other people are not great for enrollment.” What the Process Entails A clinical trial usually starts with an online survey. “We ask questions like, has your dog been diagnosed with arthritis? Are there any other health issues? and what medications is he on?” says Dr. Duerr. His team reviews the forms and narrows the list down to potential candidates for a study. The chosen dogs in the stem cell study receive an exam that includes blood work and radiographs to confirm the presence of arthritis and to ensure that there are no other health issues. Pet parents whose dogs pass these preliminary stages are invited to join the study, and given details about the program and a consent form to sign. Once the terms are agreed upon, Dr. Duerr’s team starts acquiring data on the dogs. This study includes measuring the amount of pressure dogs place on their paws and asking owners about their dog’s daily activities and functional limitations at home. Within a four-week period, they administer the first treatment. “For this study, two joint injections over a two-week time period and then we measure how much better the dog gets.” Clinical trials are vital to veterinary research and the development of new veterinary care treatments and drugs that can improve the lives of our beloved animals. Enrolling your pet is a personal decision that depends on his temperament as well as your own level of comfort. As a pet parent, you need to weigh the pros and cons, says Dr. Duerr. “What are the potential side effects versus the potential benefits?” Image via Shutterstock"}]