[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "4 Hairless Dog Breeds", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/hairless-dog-breeds.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/hairless-dog-breeds.jpg"}, "author": {"@type": "Person", "name": "Emily Sanders", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, General health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/hairless-dog-breeds"}, "datePublished": "October 26, 2023", "dateModified": "October 26, 2023", "description": "Hairless dogs are in the minority, but there are a few breeds of hairless dog you can choose from. Learn more about hairless breeds of dog and how to care for them here.", "articleBody": "While most dogs are fluffy, sometimes our four-legged friends are a little more … naked. Hairless dog breeds might be the minority, but there is a lot to love about them. For one, many hairless dogs might be a good fit for certain people who are allergic to dogs (though no pup is completely hypoallergenic). Here’s what to know about bringing home a hairless dog.  Caring for Hairless Dog Breeds Because their bare skin makes them more exposed to the elements, hairless dogs need a different care routine than their furrier counterparts. 1. Sunburns Just like humans, sun can damage a dog’s skin. It can give your dog a sunburn and even lead to more serious issues, like skin cancer. If you have a hairless dog, protect their skin with dog-friendly sunscreen or by blocking the sun’s rays with clothing. 2. Hypothermia Heat isn’t the only issue for hairless dogs: These pups get cold easily when the temperatures drop. Keep your pup warm by bundling them in doggy sweaters and coats whenever they’re outside in chilly temperatures and giving them blankets when they’re inside.  3. Skin Conditions Hairless dog breeds need a bath every week with lukewarm water and a mild shampoo to keep their skin clean. Bath time is also a good chance to inspect them for dry spots, redness, or flaky areas on their skin. Along with baths, many hairless dogs need their skin moisturized regularly with a dog-friendly lotion or cream. Some can also be prone to acne, and care will be needed to prevent that as well. Medicated wipes can be used to help with any skin infections, acne included. Hairless Dogs To Bring Home Here are four hairless dog breeds that can be a good fit for your home. 1. Xoloitzcuintli (Mexican Hairless) Photo credit: Adobe/MasarikHeight: 10–14 inches (toy); 14­–18 inches (miniature); 18–23 inches (standard) Weight: 10–15 pounds (toy); 15–30 pounds (miniature); 30–55 pounds (standard) Lifespan: 13–18 years The Xoloitzcuintli (pronounced “show-low-eats-QUEENT-lee”) is one of the world’s oldest dog breeds, dating back over 3,000 years, according to the breed club. Also called Xolos (“show-lows”) or Mexican Hairless dogs, the breed lived alongside Mayan, Colima, and Aztec peoples, and is the official dog of Mexico. Xolos come in three sizes—toy, miniature, and standard—and two coat varieties: hairless and coated (with short, sleek fur). Xolos have a temperament typical of working dogs: They can be wary of strangers but are deeply devoted to their family. Early socialization and training is vital for these hairless dogs so they learn new people aren’t scary or suspicious. 2. American Hairless Terrier Photo credit: Adobe/Sabriel SmutHeight: 12–16 inches Weight: 12–28 pounds Lifespan: 14­–16 years The American Hairless Terrier is the only hairless breed native to the U.S. Unlike the ancient Xolo, American Hairless Terriers’ history only dates back to the ’70s, when a hairless puppy was born into a litter of Rat Terriers, according to the American Hairless Terrier Club of America (AHTCA). Unlike other hairless dog breeds that may sprout fur on their heads or ankles, this bald dog is completely hairless (though the breed club says some may have eyebrows and whiskers). As descendants of Rat Terriers, AHTs are intelligent, high-energy, playful, and have a strong prey drive. Along with keeping their skin clean, protected, and healthy, regular exercise and mental stimulation is a must for this breed. If your AHT becomes bored, expect your backyard to be excavated. 3. Chinese Crested Photo credit: Adobe/Kseniya AbramovaHeight: 11–13 inches Weight: 8–12 pounds Lifespan: 13–18 years The Chinese Crested is a hairless toy breed that comes in two equally dramatic-looking types: Hairless Chinese Cresteds have naked bodies with tufts of white, silky hair on their head, paws, and tail tip. Powderpuff Chinese Cresteds have a full coat of long, silky fur. This ancient breed is so old that the origins aren’t clear; it’s unlikely that they’re even from China, as a genetic study found the breed shares the same mutation as the Mexican Hairless, and may have developed south of the U.S. Chinese Cresteds are often described as catlike; some pet parents say their Chinese Cresteds like to perch on the back of the couch, much like a feline. They are highly affectionate, loyal, and crave attention from their pet parents. Though this breed is mostly hairless, pet parents should brush what hair their dog does have to prevent tangles and mats. 4. Peruvian Inca Orchid Photo credit: janpla01/Royalty-free via Getty ImagesHeight: 10–16 inches (small); 16–20 inches (medium); 20–26 inches (large) Weight: 8.5–17.5 pounds (small); 17.5–26.5 pounds (medium); 26.5–55 pounds (large) Lifespan: 12–14 years Peruvian Inca Orchids are a rare breed of hairless dog that also comes in a coated variety, although it’s less common. Hairless Peruvian Inca Orchids aren’t completely naked dogs, though: They have a small tuft of fur on top of their head. Like the Xolo, this breed is an ancient dog and comes in three sizes: small, medium, and large. But don’t expect to see a Peruvian Inca Orchid at the dog park—this breed is much rarer than other hairless dogs. They’re the national dog of Peru and native to the country. Affectionate, intelligent, and athletic, Peruvian Inca Orchids may be wary of new people at first and might chase smaller animals due to their prey drive. As with all dogs, socialization and positive reinforcement training are important with Peruvian hairless dogs. Featured Image: tsik/iStock / Getty Images Plus via Getty Images"}]