[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Protecting Pets During Domestic Violence Situations", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1381413154.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1381413154.jpg"}, "author": {"@type": "Person", "name": "Janelle Leeson", "url": "https://www.petmd.com"}, "keywords": "Dog, Cat, General health, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/protecting-pets-during-domestic-violence"}, "datePublished": "August 10, 2023", "dateModified": "October 6, 2023", "description": "Learn how communities and organizations are providing safe havens for domestic abuse survivors and their pets.", "articleBody": "It was difficult for Laura* to leave her abusive environment. She knew that breaking the cycle meant leaving her family. She was most worried about leaving her siblings and her dog. That part of Laura’s story isn’t unique. Many domestic violence survivors delay leaving because they’re concerned about another loved one’s safety. In fact, nearly half of domestic violence survivors say they delayed leaving a dangerous situation because they were concerned for their pets’ safety, says Claire Coughlin, manager of Safe Havens for Pets. Abusers often use this fear as a way to control and manipulate their victims; 71% of survivors entering domestic violence shelters report that their abusers threatened, harmed, or killed a family pet. As many as 25% of survivors feel that they have no option but to return to their abuser out of concern for their pet&#039;s safety. The safety of the victim and their pet is interconnected, in more ways than one. That’s why communities are stepping up and providing resources that victims and survivors need. If you are in a domestic violence situation, please contact the National Domestic Violence Hotline at 1-800-799-7233 or visit their website. Recognizing the Cycle of Domestic Violence The pattern of abuse is just that—a pattern, Laura says. That means there’s an opportunity to recognize and remove yourself from the cycle. Typically, the cycle of domestic abuse has four phases: Love-bombing Tension building Abusive incident Quiet period “When you’re being love-bombed, the person aims to sweep you off of your feet and get you to fall in love with them very quickly,” Laura explains. Then the abuser becomes increasingly controlling or demanding. In many cases, abusers use pets to control their victims. They may threaten to harm the pet if the victim does not comply with their demands. Pets are often subject to the same or similar abuse that their human experiences. They may be physically abused, or food, water, or shelter may be withheld. Abusers often use the pet to manipulate the victim’s emotions. “Long past the time when a victim has stopped caring what happens to her own self because her self-esteem is so shattered, she will still do almost anything to protect a beloved pet,” Laura shares.  “Abusers are aware of that.” Preparing to Leave with Your Pet Not all paths to safety look the same. But if you’re planning to leave with your pet, create a plan to safety ahead of time. Establish ownership of your pet A paper trail is essential if there is ever any doubt about who owns your pet. Establish yourself as your pet’s owner with: Pet adoption papers Veterinarian records Grooming records Pet insurance policies Microchip registration Have your pet’s essentials ready Food Medicine, including preventative flea, tick, and heartworm medications Ownership documents Health documents, including vaccination records Leash ID and rabies tag Carrier or crate Toys Bedding If you have physically left, Coughlin says to take safety precautions. “Stay away from public parks and dog parks,” she says. “Consider the safest routes and times to walk them.” If you must leave without your pet, leave behind essential care items like food and water. Resources for Victims and Their Pets Coughlin says approximately 17% of domestic violence shelters in the United States allow companion animals—and that’s a percentage that’s growing each year. You can find a list of pet-friendly domestic violence shelters here. Safe Havens Safe Havens are sheltering services that assist individuals experiencing domestic violence by placing their companion animals out of harm’s way. There are approximately 1,200 safe havens in all 50 states and Washington, D.C. Find the Safe Haven nearest you.  Safe Havens may be shelters that house survivors and pets together, or they may house the pets on-site but in a separate area. Networks of foster care homes also provide temporary housing for pets while their owners are seeking safety. Vet offices, grooming facilities, boarding facilities, and doggy daycares are examples of establishments that may identify as Safe Havens. Even if an establishment isn’t listed as a “Safe Haven,” contact them, Coughlin says. They may have space for your pet. She adds that Safe Havens outside of your area may have a transportation service or funding for rideshares. The safety of the victim and their pet is interconnected, in more ways than one. That’s why communities are stepping up and providing resources that victims and survivors need.Financial Assistance Low-cost or free veterinary care Your pet can receive essential care such as spaying and neutering, vaccinations, and wellness exams at a low-cost or free veterinary clinic. Your veterinarian may be able to direct you to additional financial assistance programs that are available in your area. To find a low-cost clinic near you, visit PetHelp Finder. Food and supply pantries These community-based programs provide free or low-cost food and supplies for pets. Use PetHelp Finder to locate a pantry nearest you. State assistance Many states offer financial assistance programs and support. For help with housing, transportation, paying bills, and more, visit FindHelp. Here is a list of some of the national organizations with websites that can provide financial assistance to pet parents in need: RedRover Brown Dog Foundation Shakespeare Animal Fund The Magic Bullet Fund The Pet Fund The Mosby Foundation The Riedel and Cody Fund Cats in Crisis (U.K.) Frankie’s Friends Paws 4 A Cure Feeding Pets of the Homeless Top Dog Foundation Rose’s Fund for Animals The Binky Foundation Restraining Orders Thirty-nine states, the District of Colombia, and Puerto Rico have laws to ensure that victims of domestic violence can include their pets in restraining orders, or pet protection orders (PPO). Even in states without such specific laws, it is generally possible to add pets to orders as property. Support Hotlines There are several support hotlines available to victims of domestic violence and their pets. These hotlines can provide information and resources, as well as emotional support. Some of the most helpful hotlines include: The National Domestic Violence Hotline: 1-800-799-SAFE (7233) The Rape, Abuse &amp; Incest National Network (RAINN): 1-800-656-HOPE (4673) The National Sexual Assault Hotline: 1-800-656-HOPE (4673) Turning Point Hotline 586-463-6990 The Office on Violence Against Women (OVW) and the National Coalition Against Domestic Violence (NCADV) also have websites with helpful information and resources. How to Support Domestic Violence Victims and Survivors There are various ways you can support survivors in your local community. It&#039;s important to stay up to date on current legislation in your city and state. and to become involved in the various organizations that offer support to domestic violence survivors.  Encourage Your Representatives to Support Policies That Support Victims and Survivors The Violence Against Women Act (VAWA) is a critical piece of national legislation that provides support to victims of domestic violence, sexual assault, dating violence, and stalking. VAWA has expired in the past; it’s important to contact your legislators and urge them to support reauthorizing VAWA in 2027, Laura says. “There’s funding out there, but we need people to support it and we need it to be renewed,” adds Coughlin. You can stay up to date with policies that support domestic violence survivors here. Other policies you may want to support include the Pet and Women Safety (PAWS) Act, Family Violence Prevention and Services (FVPSA) Act, and Preventing Animal Cruelty and Torture (PACT) Act. Become a Safe Haven for Pets Many domestic violence survivors are unable to leave their abusers because they fear for the safety of their pets. By becoming a safe haven for pets, you can help survivors escape abuse and start a new life with their beloved animals. Safe Havens for pets take many forms, such as in-home fostering or space at a local veterinary office. Donate or Volunteer Organizations that provide essential services to victims of domestic violence, such as safe housing, counseling, and legal assistance may need a helping hand. Speak Out Against Domestic Violence We need to have the uncomfortable conversations, Coughlin says. When you speak out against domestic violence, you help to raise awareness about the issue and send a message to victims that they are not alone. *Laura Frombach is a domestic violence survivor. She has had an accomplished career in technology, working for IBM, HP, Dell, Coca-Cola Enterprises, FedEx, and Lenovo, and she worked on Pershing nuclear missiles for the U.S. Army. She is co-author of Street Smart Safety for Women: Your Guide to Defensive Living. You can watch her TEDx talk on domestic violence here.  Featured Image: iStock.com/Pavlo Sukharchuk"}]