[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Wellness Exams: How to Prepare", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/dog-and-cat-vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/dog-and-cat-vet.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog Care Hub, Cat Care Hub, Cat, Dog, Preventative health, Wellness exam", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/pet-wellness-exams-how-prepare"}, "datePublished": "August 22, 2022", "dateModified": "September 8, 2023", "description": "Taking your pet for a wellness exam is important for spotting health issues early. Find out why they’re so important and how to prepare for your pet’s next wellness exam.", "articleBody": "You know the saying: An ounce of prevention is worth a pound of cure. Even though it’s become a cliché, it’s true. Regular wellness checkups help catch problems early, when treatment is most likely to be successful. They also keep pets happy and healthy and can save a lot of money in vet bills in the long run. How Often Should Cats and Dogs Go to the Vet? The recommended frequency for wellness checkups depends on a pet’s age. Puppies and Kittens Puppies and kittens grow and develop incredibly fast! They generally need to see a veterinarian for wellness care every 3 to 4 weeks, starting when they are 6 to 8 weeks old and ending when they are between 16 and 20 weeks old. Then their next wellness exam is usually scheduled about one year after their last puppy or kitten visit. Adult Dogs and Cats Most adult pets in the prime of their lives do just fine with annual wellness exams. Senior Dogs and Cats Because pets age more rapidly than we do, it’s a good idea to start bringing your pet to see the veterinarian every 6 months once they hit their senior years. This transition occurs around 7 years of age for medium-sized dogs, a year or two earlier for large and giant breeds, and a bit later for cats and small dogs. What to Expect at a Pet Wellness Checkup There’s a lot to cover during a pet wellness checkup. At every visit, the veterinarian, technician, and other clinic staff will: Measure your pet’s weight, temperature, pulse rate, and respiration rate. By doing this at least once a year, your veterinarian can get a feel for what’s normal for your pet and see what’s changing. Ask questions about your pet’s diet, lifestyle, behavior, and health history. This is the time to bring up any concerns you might have. Perform a full physical exam. The veterinarian will examine your pet from head to toe, looking for early signs of health problems. This will include an oral exam, listening to the heart and lungs with a stethoscope, examining the eyes with an ophthalmoscope, looking in the ears with an otoscope, body condition scoring (a way to monitor weight), feeling lymph nodes and organs within the abdomen, performing a rectal exam, checking reflexes, watching how your pet moves, assessing them for pain, and much more. Next, the veterinarian will review your pet’s records to determine what diagnostic testing is needed, based on your pet’s age, lifestyle, and overall health: Fecal exam – Most adult dogs and cats should have a fecal examination at least once a year to check for intestinal parasites. Young animals are especially susceptible to worms, and they benefit from fecal examinations at every puppy or kitten visit. Heartworm test — Dogs and cats over 7 months of age should be tested for heartworms before starting prevention. The American Heartworm Society recommends annual testing for dogs even when they are on heartworm prevention so that any breakthrough infections can be caught early. FeLV / FIV test – It is important to know whether a cat is infected with feline leukemia virus (FeLV) or feline immunodeficiency virus (FIV). According to the American Association of Feline Practitioners, the timing and frequency of testing should be based on a cat’s age, history, health, and lifestyle. Bloodwork and urinalysis – When pets reach their senior years, it makes sense to run a panel of laboratory tests to screen for diseases that become more common in old age. Veterinarians commonly recommend a complete blood cell count, a blood chemistry panel, a urinalysis, and thyroid testing (for cats) at least once a year for their older patients. Finally, the veterinarian will talk to you about what type of preventive care your pet needs: Vaccines – At every wellness visit, the veterinarian will assess a pet’s need for new vaccinations and vaccine boosters (some can be given every 3 years). It may also be possible to check a pet’s vaccine titer to determine if boosting is necessary. Core vaccines are immunizations that virtually all pets should receive. Core vaccines for dogs: rabies, distemper, adenovirus, parvovirus Core vaccines for cats: feline viral rhinotracheitis, calicivirus, panleukopenia, rabies The decision to give non-core vaccines like Bordetella, canine parainfluenza, canine influenza, Lyme, and leptospirosis (dogs) or feline leukemia virus (cats) is based on a pet’s age, health, and lifestyle. Parasite prevention – Dogs and cats are at varying degrees of risk for fleas, ticks, heartworms, intestinal worms, and other parasites based on their age, where they live, and their way of life. Your veterinarian can put together an appropriate parasite prevention plan based on all these factors. Many products now treat multiple types of parasites with a single dose, given monthly or less frequently. Pet ID – Combining visible forms of pet ID, like a collar tag along with a microchip, greatly increases the odds of being reunited with a lost pet. Once a pet has a microchip, you must keep your contact information current with the chip’s company. Inserting a microchip under the skin is a quick, relatively inexpensive procedure that your vet can do at any appointment. Spay/neuter – Most pets who are not going to be a part of a breeding program should be spayed or neutered. Your veterinarian can discuss the benefits, risks, and appropriate timing of spaying and neutering. Dental care – Good dental care is essential to pet well-being. Your veterinarian can tell you if your dog or cat needs a professional dental cleaning and recommend appropriate dental home care. Grooming – Regular brushing, bathing, nail trims, haircuts, and ear cleanings may be needed to keep your pet looking and feeling their best. Your veterinarian can help you determine what grooming your pet needs. Daily life, behavior, diet, and exercise – Your veterinarian will give advice about behavior, diet, exercise, environmental enrichment, litter box management, diseases that can be passed between pets and people, and disaster preparedness. How Much Does a Vet Checkup Cost? Below are some typical costs associated with routine wellness care for dogs and cats: Office visit/physical examination: $40 - 90 Panel of screening bloodwork: $50 - 200 Urinalysis: $20 - 60 Fecal examination: $25 - 50 Core vaccines (each): $20 - 45 Microchip placement: $20 - 75 Heartworm test: $20 - 50 FeLV/FIV test: $20 - 40 Nail trim: $10 - 20 Veterinary offices should be able to provide you with a detailed estimate for your pet’s expected wellness care. Don’t be embarrassed to ask for an estimate before you schedule an appointment. The cost of pet checkups can vary quite a bit, based on several factors, including the age of your pet, where you live, and the type of clinic. Your Pet’s Health and Age For example, a wellness visit for a healthy 2-year-old Shih Tzu who doesn’t need any vaccine boosters is going to be relatively cheap. On the other hand, a wellness checkup for a 15-year-old Siamese cat who routinely goes outdoors could include multiple vaccine boosters and a lot of lab work, and those costs  add up. Location Location also plays a big part in determining the cost of veterinary care. The 2019 Nationwide/Purdue Veterinary Price Index shows that the highest average weighted price for veterinary services ($406 in San Francisco) was 1.5 times higher than the lowest average weighted price ($265) for rural areas far from large cities. Type of Clinic Finally, the type of clinic you go to affects what you will pay. Some not-for-profit organizations provide basic care, like rabies vaccines, at cost. Vaccine clinics also tend to be inexpensive, but you may not be able to access all the care your pet needs. Getting pet wellness care through a full-service veterinary hospital may not be the cheapest option, but it does provide one-stop-shopping and lets you build a relationship with the doctors and technicians you’ll be relying on if your pet is injured or becomes sick. How to Prepare for Your Pet’s Wellness Exam Being prepared will make your pet’s wellness exam go more smoothly, be less stressful, and even save you money. Here are some steps to take to prepare: If your pet has received veterinary care elsewhere, bring their health records with you or have them forwarded to your current clinic. This will help prevent unnecessary duplication of diagnostic tests or preventive care. Take pictures or make a list of all the medications, supplements, and foods (including treats) you give your pet. If possible, bring a fresh stool sample from your pet with you, but don’t worry if that’s not possible. Your veterinarian will probably be able to collect a sample from your pet if necessary. Write down any questions you have about your pet’s wellness care. Your veterinarian will be happy to talk anything over, but you have to ask! Featured Image: iStock.com/PeopleImages"}]