[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Reasons To Thank Your Vet—and How to Do It", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/thank-your-vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/thank-your-vet.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/7-reasons-thank-your-vet—and-how-do-it"}, "datePublished": "November 23, 2016", "dateModified": "September 7, 2022", "description": "Veterinarians work tirelessly to make sure your four-legged friends are happy and healthy. But many vets also suffer from stress and depression, and suicide rates among veterinarians is high. So, here are reasons you should regularly show thanks to your vet, and a couple tips for how to do it.", "articleBody": "By Teresa Traverse As a pet owner, you rely on your vet to take care of your pet. But many vets are struggling to take care of themselves. The suicide rate among veterinarians is high: More than one in six veterinarians might have contemplated suicide since graduation, according to a study released by the Centers for Disease Control and Prevention. The study also showed that vets are more likely to suffer from psychiatric disorders like depression than the general population. It’s a problem that the veterinary community is sadly aware of. “We have all lost at least one colleague to suicide,” says Heather Loenser, DVM, the veterinary advisor of professional and public affairs for the American Animal Hospital Association (AAHA). But if this is news to you, that’s not really much of a surprise to Ron Del Moro, Ph.D., a licensed clinical counselor at University of Florida&#039;s Veterinary Hospitals. “Everyone’s aware of it, but no one really talks about,” says Del Moro. Well, we’re here to talk about it. Here are some of the issues that veterinarians routinely face and ways you can show appreciation to your vet all year round. 1. Many Vets are Perfectionists “I don’t know any non-perfectionist veterinarians. I’m sure they’re out there. I just don’t know them,” says Loenser. Veterinary medicine is competitive. With only 30 schools of veterinary medicine in the United States, getting admitted is tough. And those intelligent, competitive traits that get vets into school stick with them after graduation.  “You have these really highly intelligent people, driven people who are perfectionists who want to solve problems and heal everybody. It’s a tough job,” says Del Moro. “So many times our minds are the biggest problems that get in the way.” Facing the reality that financial and other concerns often prevent them from saving pets who could be saved is terribly difficult for many veterinarians. 2. Vets are Human, Too As pet owners, it can be tough not to see your vet as some sort of superhero. After all, he or she cures diseases and heals your pets when they’re sick. But it’s important to remember that vets are people too. And like any human, vets make mistakes and have setbacks.   “Failure’s not necessarily something we were trained to be comfortable with,” says Loenser. “When things go wrong in a case—there’s an outcome that we weren’t anticipating or we were hoping didn’t happen, but it does. That’s really hard on us all the way down to the core of our beings.” 3. They Handle Euthanasia Procedures Having to end a pet’s life can be a heartbreaking task—but veterinarians do it on a regular basis. And some handle the task better than others, Loenser says. “Some people look at that as a viable alternative to having an animal suffer with a chronic disease. In that case, you’re truly alleviating suffering,” she says. “Other veterinarians don’t look at it that way. They take it very personally when an animal has to be put to sleep.” 4. They Deal With Small Business Stress Many vets run their own businesses and have to deal with all the stresses that go along with that, including managing staff, paying a lease, and dealing with taxes. “Veterinary schools are getting better at teaching basic business administration in schools. And then there are veterinarians that get MBAs,” says Loenser. “But that’s not still not the norm, and there’s still room for veterinary schools to better teach us how to run our businesses.” 5. Vets Interact With Unreasonable Clients Both Loenser and Del Moro confirmed that one of the most stressful parts of any vet’s life is interacting with unreasonable pet owners. “You’ve got these doctors who are doing the best they can with the information they have and sometimes you can’t satisfy the clients enough, ever,” says Del Moro. He acknowledges that the bonds pet owners have with their animals are strong, which can make interactions between vets and their clients emotionally charged. “First and foremost, try to empathize with the doctor’s situation and how difficult it is. Whatever news you’re getting,” says Del Moro. “People forget that [vets] have feelings too. They too are impacted. They too got into this profession because they love animals. And no one wants to see the animal suffer.” 6. Vets Have High Student Loan Debt Many vets have high student loan debts. The average veterinarian graduates from school owing $153,191 in student loans, according to a study conducted by the American Veterinary Medical Association (AVMA). It can take vets a long time to dig themselves out of this debt. 7. Vets are Paid Relatively Low Salaries In addition to a mountain of veterinary school debt, vets often have to deal with relatively low starting salaries. The average starting salary for a small animal veterinary practitioner is roughly $70,000 according to the AVMA https://www.avma.org/KB/Resources/Statistics/Pages/Market-research-statistics-First-year-employment.aspx. While that might not sound like a bad starting salary, it can be tough to pay off debt and achieve other goals like buying a home at that level. “Even though veterinarians don’t go into this for the money, for my peers it’s frustrating when we see other professionals who have gone to school for a similar length that have a lot more stuff and freedom,” says Loenser. Ways You Can Help Veterinarians do a lot for you and your pet, so it’s important to show your vet how much you value his or her work. Here are a few easy—but impactful—ways you can show your vet you care. Give Thanks Don’t think you have to go all out to show appreciation. Saying “thanks” will do. “Thanking face to face is always lovely,” says Loenser. “Some people might think we don’t need that, but that’s nice to hear.” Cards, food, and flowers also make nice gifts. Donate to a Charity in Your Vet’s Name Many veterinary hospitals support charities or have memorial funds for animals and staff members who have passed, Loenser tell us. Research those organization and consider donating money to them in your vet’s name. Many vet schools also have funds set up to help animals in need. A client of Loenser’s did this once. “They gave a donation to my vet school in my name for taking care of their animal. That was huge to me,” says Loenser. Be Straightforward About Finances “We really try to give accurate estimates. Feel free to go over them with us,” says Loenser. “When it comes to the point when you’re checking out of the hospital [make sure] you’re not surprised and then angry.” Veterinarians are willing to talk about the pros and cons of treatment options at different price points, but they don’t know what your constraints are unless you bring them up. Pay Your Bills on Time Many veterinary practices are small business and can struggle to pay their expenses (including the salaries of all those wonderful technicians who have helped your pet) if you don’t pay on time. If you’re on a payment plan, making on-time payments can go a long way in fostering goodwill with your veterinarian. Post a Positive Review on Social Media   If you think your vet is giving stellar service, say so on Yelp, Google, or Facebook. “Posting a great review really means the world to us,” says Loenser. “We love to see positive reviews.” And pointing other pet owners towards a great vet is a win-win for everyone. Be Open To Suggestions Loenser explains that really motivated pet owners will usually research a condition prior to coming in for a visit. But what you’ve read is not always the best solution and can lead to problems if pet parents aren’t open minded and responsive to a veterinarian’s advice. She says she enjoys talking to pet owners who have done their research as it can save her time. But if you’ve been treating a condition with a treatment you found on the Internet and aren’t having success with it, be prepared to listen to what your vet has to say. Follow Recommendations When a vet gives you a treatment plan, follow it. “We feel heard. We’re saying this because we care about your animals. We believe in what we’re recommending,” says Loenser. If you don’t feel comfortable following the plan or can’t afford it, let your vet know so he or she can recommend a different treatment plan that meets your needs. Arrive on Time “It doesn’t take much for us to get behind if people start coming in late,” says Loenser. Even if you get there on time, keep in mind that other patients might not have been as punctual. Realize that the vet may have just seen a pet that required more of his or her time. Critically ill pets take precedence over animals with broken toenails or other minor conditions. Respecting your veterinarian’s time and schedule and being understanding if he or she gets pulled away to deal with an emergency will go a long way in demonstrating your gratitude."}]