[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Things People Don’t Realize About Being a Veterinarian", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Care", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/A%20golden%20retriever%20and%20their%20vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/A%20golden%20retriever%20and%20their%20vet.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/things-people-dont-realize-about-being-a-vet"}, "datePublished": "April 17, 2019", "dateModified": "October 7, 2023", "description": "Many children dream of becoming a veterinarian. However, the steps to becoming a veterinarian and the actual job involve much more than just caring for animals.", "articleBody": "If you’re reading this, you probably love animals. You may have even wanted to be a veterinarian when you were little. For many people, spending each day helping and healing animals is a dream come true. But being a veterinarian goes beyond having an endless love for animals. From completing undergraduate and graduate veterinary training to building courage and emotional strength, there’s much more to becoming a veterinarian than meets the eye. Here’s what you should know if you’re considering a career in animal healthcare. 1. School and Training Are Extensive Becoming a veterinarian means getting a lengthy education, inside and outside of classrooms. “I always found every way I could to spend my time helping animals,” says Dr. Liz Bales of Red Lion Veterinary Hospital in Newark, Delaware. Dr. Bales’ decision to become a veterinarian required a lot of work before she even got into veterinary school. She researched different universities’ pre-vet requirements, then excelled in an intensive undergraduate program of biology, calculus, chemistry, organic chemistry and more. She had to pass all the typical standardized testing to get into the right university program. By finding the right program, Dr. Bales could pursue her veterinary career at the University of Pennsylvania School of Veterinary Medicine. “Additionally, I volunteered outside of college with a veterinarian during all of my free time, including holidays and the summer,” Dr. Bales explains. Dr. Emily Nielsen of Stahl Exotic Animal Veterinary Services in Fairfax, Virginia, advises young clients who want to become vets to spend time at a veterinary clinic or an animal shelter and find a mentor. This will help prospective students to prepare for many years of education and training. 2. There Are Veterinary Specialties “What people don’t know about vets is that we specialize in everything and anything, whether it’s dental issues or an eye problem or cancer,” says Dr. Alexander Klein of Alison Animal Hospital in Brooklyn, New York. People bring in pets with a variety of symptoms and rely on veterinarians to be able to identify what the underlying causes are. “That’s what makes it so hard, because we see everything, and we try to know about and do it all for our clients,” says Dr. Klein. For extremely difficult or rarer cases, the option to refer the pet to a specialist is available. But if you want to become one of these doctors, you’ll have to remain in school for even longer than a “regular” vet. Common veterinary specialties include surgery, dermatology, cardiology, neurology, dentistry, and more.  To become a specialist, after vet school, the veterinarian needs to attend a one-year internship followed by a three-year residency and then pass an intense certifying examination.  3. Vets Also Grieve the Loss of a Pet One of the toughest parts of being a vet is saying goodbye to a beloved pet. “Veterinarians devote their lives to providing care for and saving the lives of animals. There is no easy way to cope with the sad aspects of the job,” says Dr. Bales. She offers her clients an open letter to empathize with them and tell them how painful it is for her when she loses a patient. Dr. Klein says that while the difficult aspects of the job never go away, having an enduring connection to the community and his clients gives him strength. “Because the clients all come in pairs—two-legged and four—it’s twice as fulfilling to work with them.” 4. There’s Compassion Fatigue Compassion fatigue (the physical, emotional, and psychological strain from helping others) plays a large role in being a veterinarian. When they’re not working in a veterinary clinic, veterinarians take time to recharge. “Work-life balance is very important in this [line of] work because there is often so much compassion fatigue,” says Dr. Nielsen. To help maintain a balance for herself, Dr. Nielsen spends her downtime doing things that make her happy, like training for marathons and planning her return to competitive horseback riding. 5. You Need to Learn to Improvise Compared to human medicine, there’s not as much research when it comes to veterinary care. This is especially true for exotic animals. When veterinarians like Dr. Nielsen—whose patients include snakes, rabbits, hamsters, reptiles, and birds—encounter a unique problem, they must find unique solutions. Dr. Nielsen, who considers guinea pigs to be one of her favorite pets to treat, explains, “Sometimes you must get creative in helping exotics, and you’re not always sure it will work. It’s this kind of challenge, and the successful treatment outcomes, that are what makes the job so worthwhile—no day will ever be boring.” 6. Communication Is Key “Aside from learning about animals and focusing on their needs, veterinarians need to be good at communicating,” says Dr. Nielsen. “So much of what veterinarians do involves communicating with clients and other vets. You need to be prepared to do that well.” Dr. Nielsen reminds her clients that it’s a team effort in getting a pet feeling better. “If your rabbit needs medication every three hours, you’ll need to do your part of the treatment plan we’ve created for him,” she says. “It’s heartening to work with animals, but pet parents understanding that they are a crucial part of the equation is what helps it succeed.” 7. It’s Never a Straight Career Path “I always envisioned myself as an equine veterinarian, driving from farm to farm, caring for horses,” says Dr. Bales. However, when she got out of veterinary school, she discovered that it wasn’t going to be the best fit. “The great thing about veterinary school is that it prepares you for a variety of careers,” Dr. Bales explains. 8. Veterinary Care Is a Business Although veterinary work is highly personal, it’s still a business. Veterinarians who own their own practices must worry about utility bills, printer paper and staff salaries, just like any other company. Just like any business, a vet’s office can experience ups and downs. They must adjust to the changing market to make sure that they can provide pets with the best care possible without going bankrupt in the process. Dr. Klein explains that your neighborhood veterinarian faces the same small-business challenges as an independent bookstore or local yarn shop, with competition on all fronts. “A local vet should be an ideal small-business owner, with services and products the community needs.” Dr. Brad Levora of Little Seneca Animal Hospital in Germantown, Maryland, points out that after the economic crash of 2007 and 2008, he saw a drastic drop in the number of people bringing their pets into the vet. “Often, we would not see an animal unless it was in extreme pain or deteriorating health. In those instances, the help needed was highly specialized and thus expensive or, in some cases, there was little we could do except try to keep the animal comfortable.” Dr. Levora recommends that pet parents who experience financial bumps should speak openly to their veterinarians, exploring all options to support their pet’s health and well-being. “Your vet wants what’s right for the pets and will do his or her best to work with you,” he says. Featured Image: iStock.com/A boy and the sea"}]