[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/cat/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How To Introduce a Cat to a Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/introduce-cat-to-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/introduce-cat-to-dog.jpg"}, "author": {"@type": "Person", "name": "Rebecca Bermingham, CVT", "url": "https://www.petmd.com/author/rebecca-bermingham"}, "keywords": "Cat, Dog, Adult, General Care, Zoo Cat Training Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/cat/general-health/how-to-introduce-cat-to-dog"}, "datePublished": "May 3, 2023", "dateModified": "October 4, 2023", "description": "Wondering how to introduce a cat to a dog? Introducing dogs and cats can take several weeks, and it&#039;s important to progress at a speed your pets are comfortable with. Here&#039;s how to safely make introductions.", "articleBody": "When it comes to introducing a new cat to your dog, a slow and careful introduction process sets everyone up for success. It’s essential to progress at the speed that both pets are comfortable with and to continually monitor them for any signs of fear, anxiety, or stress. The goal is for both pets to have nothing but positive interactions with each other. Introducing Cats and Dogs Successfully 1. Keep Them Separate When bringing home a new cat, the first step is to establish a safe place, or sanctuary, just for them. This space allows them to become acclimated to their new home before being introduced to the resident pooch. If possible, choose a room the dog doesn’t spend much time in (such as a spare bathroom or guest bedroom), as it’s best to not disrupt the resident pet’s routines as much as possible. Fully quarantine any new pet for a minimum of three to four days, and have a health assessment done by your veterinarian before the introduction process begins. 2. Rotate Pets Through the House The best way to begin the acclimation process is to allow one pet to freely roam the house while the other pet is confined, and then rotate. For instance, let the cat explore the house while the dog is in the backyard. Then keep the cat in a bedroom while the dog has free rein in the rest of the house. It can also be helpful to allow the two pets to sniff each other from under the door, or even to rotate their bedding. The goal is for them to have plenty of opportunities to acclimate to each other’s smells and noises before ever seeing each other. 3. Let Them See Each Other Once both pets are relaxed and comfortable hearing and smelling each other, they’re ready to begin seeing one another. Use a barrier, such as a tall pet gate, to keep both pets safe. For excitable pets, it may be helpful to partially obstruct their view (using furniture or a towel) for the first few sessions. To create positive associations, pair these sessions with meals, treats, positive reinforcement training, or engaging play. One simple way to do this is by feeding both pets their meals a bit away from the divider, and then gradually decreasing the distance as both pets seem calm and confident. Just stay alert for signs of resource guarding in your dog or cat. If you’re seeing signs of resource guarding, pause the introduction process until you can seek guidance from your veterinarian or a qualified trainer. While these sessions should be brief at first, time spent near each other can gradually increase as both pets become more comfortable.   4. Make Leashed Introductions Once both pets are comfortable being around each other on either side of a divider, they’re ready for their first true introduction. Controlled introductions should start in common areas of the home with the dog on a loose leash. As the pet parent, it’s important to be aware of both your dog’s body language and your cat’s body language during these interactions so you can quickly identify any warning signs. The dog should have a loose body and tail position and easily reorient toward you when called. The cat should have forward-facing ears, a neutral tail position, and a soft gaze with narrow pupils. They should be allowed to come and go, investigating the dog as they are comfortable.  If you see your dog moving slowly, stiffening, or becoming fixated on the cat, it’s time to create more distance or take a break. Similarly, if the cat crouches, freezes, swishes or flicks their tail, pins their ears back, or if their pupils begin to dilate, they are showing signs of stress and need a break from the interaction.  If your dog is barking or lunging at the cat, or if the cat is hissing or growling or their fur begins to stand up, it’s best to separate the pets and return to the previous successful step once they’ve had a chance to relax. After numerous positive leashed introductions, allow the cat and dog to coexist with the dog dragging the leash. This gives the pets more freedom to interact while maintaining an added safety measure in case they need to be separated promptly. 5. Decrease Supervision When you are confident that the pets are getting along well, slowly allow them to be together with less supervision. To start: Try leaving the room briefly while still being within earshot. As they continue to do well, you can be absent for longer periods of time. It’s important to give the cat elevated surfaces where they can easily seek refuge from the dog, such as cat trees and cat shelves. This will decrease stress and give the cat a safe escape in case of a problematic interaction. It’s recommended to keep pets separated when you are out of the home, even when they are doing well together. It’s not uncommon for the introduction process to take a couple weeks to a few months, depending on the individual pets. Progress is not always linear, and it’s OK to take a step backward at any point if you start to see signs of stress. The safety and well-being of both pets is always the biggest priority, so avoid putting this process on a timeline. It’s also important to recognize that not every dog-cat pairing is a good fit. If you feel one or both pets are having a difficult time adjusting or if you are feeling overwhelmed, bringing in a qualified positive reinforcement-based trainer may be the best option. Featured Image: iStock/Olezzo Illustrations by Lili Chin"}]