[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Weight Reducing Diets For Dogs (and Cats)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4150489744_ec5d4710bb.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4150489744_ec5d4710bb.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, Nutrition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/evr_dg_weight_reducing_diets"}, "datePublished": "March 7, 2011", "dateModified": "August 16, 2022", "description": "By T. J. Dunn, Jr., DVMSeptember 15, 2009 Where Have We Gone Wrong? Twenty years ago commercial diets appeared on the canine and feline banquet table that were designed to promote weight loss. Great, I thought. And since so many pets were overweight, I jumped into the pool of promoters dispensing pet weight loss diets from my animal hospital.", "articleBody": "By T. J. Dunn, Jr., DVMSeptember 15, 2009 Where Have We Gone Wrong? Twenty years ago commercial diets appeared on the canine and feline banquet table that were designed to promote weight loss. Great, I thought. And since so many pets were overweight, I jumped into the pool of promoters dispensing pet weight loss diets from my animal hospital. Pretty soon just about every pet food company produced and promoted their various brands of weight reducing diets in flavors, textures, colors and compositions that were sure to keep our pets&#039; tummies full and appetites satisfied … and yet would result in a slimmer and healthier dog. The problem is that these reduced calorie or weight loss diets seldom worked. Today, twenty-five years after the weight reducing diets first appeared, it is estimated that over 35 percent of domestic dogs and cats are not only overweight but actually obese! I began asking myself what happened. I had examined thousands of dog and cat patients that were consuming various brands of &quot;lite&quot; or &quot;reducing&quot; or &quot;senior&quot; diets that target the overweight or less active pet. Essentially all of those reducing diets had added quantities of fiber and reduced percentages of fat and protein compared to maintenance diets, so, in theory, they should have worked. In total honesty, though, I assert that I have seen less than ten patients actually lose weight on these weight-reducing diets. With equal honesty, I assert that many actually gained weight! I believed in these diets at first, and I sold lots of them; but eventually I became discouraged with the results I was seeing and so were pet owners. In trying to figure out why these diets failed miserably in otherwise healthy dogs and cats not afflicted with thyroid or other metabolic dysfunctions, I have come to a few conclusions. Keep in mind that I started out a believer. I had no preconceived biases against the concept of feeding weight reducing pet foods to dogs and cats. But I have lost faith. I was consistently examining patients that were not being given treats and were fed according to the label recommendations and yet were either not losing weight or were actually gaining! I set off on a personal search for the answer to this paradox. After all, I was recommending and selling these weight-reducing diets so I had a personal interest in seeing that whatever I sold or prescribed worked. (I am reluctant to suggest to the pet owner to feed less than what is suggested on the package label because when one feeds less than indicated for a specific body weight, the minimum daily allowances of vitamins, minerals and essential amino acids and fats may not be met, and the dog will suffer from nutritional deficiencies. I’ve seen it happen.) Even though no pet food producer guarantees their product will work as advertised, I felt I needed to stand behind whatever I sold or recommended. What I discovered was fairly simple and intuitive, and clearly made sense. It explained to me why so many patients failed to lose weight with the weight reducing diets. Why They Failed It is my opinion that a fundamental concept required in a successful attempt to achieve weight loss was being overlooked in favor of key word marketing strategies. We humans have been conditioned to think that fat intake promotes fat storage in the body and consequent gain in body weight. This is true and it makes sense. So the pet food manufacturers created diets with decreased fat content partly because fat is calorie dense. (Removing a gram of fat from a pet food recipe and substituting something else such as protein or carbohydrate reduces twice as many calories from the recipe as would be reduced if carbos or protein were removed. 1 gram of fat contributes about 9 calories, 1 gram of carbohydrate and 1 gram of protein contribute about 4 calories each.) Manufacturers splashed the evocative key words &quot;reduced fat&quot; or &quot;reduced calories&quot; prominently on pet food labels and capitalized on current human buying trends and perceptions.   Almost all pet weight loss diets have a reduced protein and fat content per unit weight; therefore, something else needs to take up the space in the ingredient recipe. So the pet food manufacturers added fiber to bulk up the diet so the dog would &quot;feel full&quot; on a lower caloric density diet. (There are surely some human psychological factors at work here, too, because every pet owner wants the pet to have the satisfaction of a “full tummy”.) The dog&#039;s suggested meal portion would be satisfyingly large in quantity but would be less &quot;calorie dense.&quot; Not a good idea, as it turns out, for a meat-eating animal such as a dog or cat. Case, Carey and Hirakawa in their book Canine and Feline Nutrition, published by Mosby and Sons, 1995, state &quot;Diets that contain increased levels of indigestible fiber and reduced levels of protein are not recommended for weight loss or for long-term weight maintenance of sedentary dogs and cats. If a diet is simultaneously high in indigestible fiber and low in fat and/or other nutrients, it is possible that long term feeding may result in nutrient deficiencies in some animals&quot;. Those last two sentences explained why I was seeing so many patients eating reducing diets that were developing dry, itchy, flaky skin and had coats that were coarse and greasy and lacked luster. Remember that an ounce of fat has twice the calories of an ounce of protein or carbohydrate. Many weight-reducing diets for pets contain increased amounts of carbohydrate from corn, barley, wheat and rice in place of the calorie dense fats. And since dogs and cats convert protein to energy much more efficiently than humans, many weight loss diets have reduced protein levels -- and the protein ingredients are replaced with even more carbohydrate. An added bonus for the manufacturer is that carbohydrate ingredient sources are generally less expensive than sources of fat and protein. So, intuitively, it seems to make sense that pet weight loss diets should have less fat and protein and more carbohydrate. And over the last twenty-five years that is precisely how weight loss diets for dogs and cats have been constructed. The conclusion that came to me is this: Most weight loss diets for pets are carbohydrate based, and that&#039;s precisely why they&#039;re not working. What You Should Know About Carbohydrates Biology rules! I believe carbohydrate is the dominant nutrient driving the success or failure of a weight loss diet formulation for dogs and cats. Here&#039;s why: Ingested carbohydrate stimulates insulin secretion from the pancreas every time the dog or cat consumes substances such as corn, wheat, barley, sugar, sucrose, rice, potatoes, fruits, vegetables or pasta. But insulin, just like other chemicals in the body, does exactly what it is supposed to do. And one of those tasks is to promote the conversion and deposition of extra dietary carbohydrates (those not needed immediately for the day&#039;s energy consuming activities) into reservoirs of glycogen in the muscles and liver. Once those reservoirs are full, extra glycogen is directed by insulin chemistry to be modified a bit and deposited into the major energy reservoir called adipose tissue -- or fat. To simplify, continuous exposure to excess carbohydrate for the day&#039;s activity and metabolic needs results in conversion of the excess carbohydrate into fat. The same statement is not so true regarding excess protein ingestion. What You Should Know About Protein An interesting and important fact of protein metabolism is that if the dog or cat consumes more protein on a daily basis than needed for metabolic processes, energy needs, and tissue building and repair, the extra protein is excreted by the kidneys and not stored as fat. Unlike extra carbohydrate calories that are stored as fat, protein surplus is essentially eliminated from the animal&#039;s body. What You Should Know About Fat Decreasing the fat content of weight-reducing diets to achieve a less calorie dense product may not be wise. It has been my unbiased observation that a large percentage of dogs and cats consuming these diets end up with dry, flaky and itchy skin, coarse and greasy coats, and even cracked nails and pads. They start overweight and stay overweight! Add some high quality fats and protein to theses diets and the undesirable conditions disappear within three weeks. Not very scientific, I admit, but neither is increasing the carbohydrate content of a diet in place of high quality protein and fat in an effort to reduce a dog or cat&#039;s fat reservoir! The Solution Weight management in pets involves more than dietary considerations. Domestic pets don&#039;t have to chase down their meals these days so they inherently experience less exercise and acquire more food with less energy output than their wild predecessors. Human and animal behavior modification is an absolute necessity if a dog owner is to successfully reduce the dog’s body weight to an optimum level. David Kronfeld, DVM, PhD., until he passed away was a specialist in veterinary nutrition at Virginia Tech, University in Blacksburg, VA. He pioneered scientific studies in animal nutrition. He has said, &quot;In my experience, the only worthwhile weight loss programs are life-style oriented -- more exercise and less food, that is, a lower intake of a diet of the highest quality.&quot; Twenty-five years ago I was a proponent of cereal based, low fat, reducing-diets for body weight management in dogs and cats. When I observed that in a substantial majority of cases these diets simply did not do what they were intended to do, and in some cases actually resulted in the opposite of what was expected, I rethought what made sense from a natural and biological standpoint. I now recommend to dog and cat owners whose pets are overweight but healthy (no thyroid or other metabolic disorders) that they feed controlled portions of a diet composed of high quality protein sources, moderate percentages of high quality fat, and low carbohydrate. Add exercise to the recipe and the weight reducing results are excellent and predictable. Image: Derek Gavey / via Flickr"}]