[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Medical Causes Behind Weight Gain", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-overweight-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-overweight-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/evr_multi_medical_causes_behind_weight_gain"}, "datePublished": "December 17, 2010", "dateModified": "August 16, 2022", "description": "Your pet is overweight, and being the conscientious pet owner, you have made the necessary changes to your pet’s diet and activity levels, but your pet is still overweight. In fact, not only is he still overweight, he seems to be gaining more weight. If diet and exercise are not solving the problem, what else is there? There are other valid reasons for weight gain besides eating habits and lack of activity. Here are seven of the most likely offenders.", "articleBody": "Your pet is overweight, and being the conscientious pet owner, you have made the necessary changes to your pet’s diet and activity levels, but your pet is still overweight. In fact, not only is he still overweight, he seems to be gaining more weight. If diet and exercise are not solving the problem, what else is there? There are other valid reasons for weight gain besides eating habits and lack of activity. Here are seven of the most likely offenders. Pregnancy This is the most obvious cause of weight gain and potbellied appearances. Although it may seem obvious, some pet owners are completely unaware that their cat or dog is pregnant until there is a litter of little ones staring them in the face. If a female dog or cat is not spayed, she can become pregnant, and it does not take long for it to happen. A few unattended minutes in the backyard can lead to an unintended pregnancy. So don&#039;t go putting your dog on a strict diet or exercise regimen just because she&#039;s gaining weight for no obvious reason. She may just be “expecting.” Fluid Retention A common side-effect of heart disease is a condition called ascites, the medical term used for excess fluid in the abdomen. The outward symptom is of an enlarged belly that is not coincident with overeating or lack of exercise. Other conditions can also cause the body to react in this way, including tumors or diseases of the internal organs. In very young animals, abnormal amounts of fluid in the abdomen may be the result of abnormal blood flow in the heart due to a congenital defect. Another cause of ascites may be linked to a portosystemic shunt, also referred to as a liver shunt, where the circulatory system bypasses (shunts) the liver. In cats, feline infectious peritonitis (FIP) is one of the main causes of abdominal fluid retention. Prescription Drugs There are some prescription medications that can also lead to weight gain, especially if they are taken over a long period. If your pet is on any kind of medication and is also having a weight problem that you cannot control through simple food management and moderate exercise, you will need to consult with your veterinarian to see if the medication is related to the weight, and if a different medication or lower dose can prevent further weight gain. Parasites Internal parasites, especially the type that lodge in the abdominal walls and intestines (though not limited to those types), will often cause fluid to build up around the area of infestation, causing a potbellied appearance. This is often seen in young animals whose immune systems are not yet strong enough to resist the effects of parasitic infestation, and is more severe when there is a heavy load of internal parasites. In the course of a standard examination, your veterinarian will take blood, fluid, and stool samples, one or more of which will show the presence of parasites in the body. Once the specific type of parasite is determined, your veterinarian will be able to prescribe the appropriate parasiticide.   Hypothyroidism The thyroid glands are responsible for the production of thyroid hormones, the chief instigator for how quickly the body uses energy. That is, the speed at which energy is metabolized. Energy is taken into the body in the form of food, and under normal health conditions, the body burns this energy during the course of normal activity. However, under production of thyroid hormones can result in a sluggish metabolism, and too much energy being retained in the body, resulting in a burden of weight. The name for this condition is hypothyroidism, where the prefix hypo- means “under.” It can be confounding to observe that even while your pet is eating very little, she is continuing to gain weight. This is because even the small amount of food energy she is taking in is being stored rather than released through the metabolic process. Some of the other symptoms seen with this disorder are fatigue, coarse hair coat, slow heart rate, and itchy, dry skin. Your veterinarian can conduct some straightforward blood tests to determine if your pet has an underlying case of hypothyroidism. If the diagnosis is positive for hypothyroidism, your doctor can prescribe medication to treat it Cushing’s Disease (Hyperadrenocorticism) Often seen in older animals, particularly older dogs, Cushing’s disease is a disorder that arises from long-term overproduction of glucocorticoid hormones, which are an important aspect of protein, carbohydrate, and metabolic regulation. This hormone is related to the adrenal glands (found near the kidneys) and pituitary glands, developing when something in one of these glands is abnormal. With pituitary Cushing’s, the condition is most often caused by a tumor in the gland that is causing the gland to produce excess ACTH. This is the most common form of Cushing’s. With adrenal Cushing’s, the condition is caused by excess production of cortisol, a steroid hormone. Cushing ’s disease is commonly symptomized by muscle weakness and wasting, extreme thirst, increased appetite, urinary tract infections, rapid weight gain, and hair loss. One of the most apparent outward symptoms is a potbelly, which is due to the wasting of muscles in the abdomen and the shifting of fat into the abdominal area. If you suspect that your pet has Cushing&#039;s disease, you will need to take your pet to a veterinarian for a full blood, urine, and chemistry profile. Bloat Some dogs, either because of their background, current living conditions, health or personal characteristic, will eat their dog food rapidly. This behavior is referred to as “wolfing down” food by some pet owners, and is often remarked upon as appearing as though the dog is swallowing its food without tasting or chewing it – or “gulping” it down. This is, in fact, pretty much what is happening. As the dog “wolfs down” its food, it is also swallowing large amounts of air. What follows is a stomach full of unchewed food and excess air, resulting in a condition called gastric dilatation and volvulus syndrome (GDV), more commonly referred to as bloat. Besides the obvious distended belly, dogs suffering from bloat will often have symptoms of troubled breathing, rapid heartbeat, pain in the abdomen (on touch), drooling and collapse. This is a life-threatening condition requiring immediate medical attention. Bloat is most often seen in large, deep-chested breeds of dogs, such as Great Danes, German Shepherds, and Standard Poodles."}]