[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What’s the Best Dog Food for Weight Gain?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Boston-terrier-jumping-up-and-begging-for-food.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Boston-terrier-jumping-up-and-begging-for-food.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Nutrition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/whats-best-dog-food-weight-gain"}, "datePublished": "December 10, 2019", "dateModified": "August 16, 2022", "description": "Are you worried that your dog is underweight? Here’s what veterinarians look for in a healthy dog food for weight gain.", "articleBody": "Overweight pets seem to get all the press these days, but what about dogs on the other side of the spectrum? Some dogs have trouble keeping their weight up at a healthy level or have recently lost weight (due to illness, for example) and need to gain it back. When a dog is healthy, getting them to gain weight can be as simple as feeding them a little bit more of their current diet. This is usually the case for dogs that aren’t finicky and only need to gain a relatively small amount of weight. At other times, however, helping a dog gain weight can become more complicated. Here’s what your veterinarian will be looking for in a dog food for weight gain and some tips on how you can help your dog gain weight safely. What Type of Dog Food Is Used for Weight Gain? A good dog food for weight gain will have several traits that make it not only appealing for dogs, but also healthy and nutritious. Here’s a breakdown of what helps a food qualify as good for weight gain. Palatability Dogs will be willing to eat more of a food that tastes good. Wet foods tend to be more palatable than dry, as are diets that are higher in fat and protein. Homemade diets are generally the most palatable option, but if you’re going to cook for your dog, make sure you’re working with a veterinary nutritionist who can ensure that the diet is nutritionally complete and balanced. Digestibility The digestibility of a food is a measure of how much can actually be utilized by the dog in comparison to the amount that is eliminated because it’s not absorbed. If a food is highly digestible, a dog does not have to eat as much to reap the nutritional benefits.    Unfortunately, there is no way to directly assess a food’s digestibility by reading its label. However, fiber, by definition, is indigestible, so all other things being equal, you’ll want to avoid high-fiber foods. A quick way to get a feel for a food’s digestibility is to look at the feces a dog produces when eating that diet. Dogs eating highly digestible foods produce firm, low-volume, well-formed stools, while those eating diets with low digestibility will produce more and looser feces. Calorically Dense Dog foods that are calorically dense pack a whole lot of energy (calories) into a small amount of food. This means that your dog doesn’t have to eat much to take in a lot of calories. Thankfully, information about a food’s caloric density is provided on the label, usually in the form of kcal/cup, kcal/can or kcal/kg (note: a kcal is the same as a calorie when you’re talking nutrition). Fat provides more calories per gram than either protein or carbohydrates, so high-fat foods are usually more calorically dense than low-fat foods. Higher levels of protein are often desirable to support the dog’s lean body mass. Examples of Good Dog Foods for Weight Gain Here are some types of dog food that meet the criteria of tasting good, being highly digestible, containing a lot of fat and protein, and being nutritionally complete and balanced. Therapeutic Diets In extreme cases, your veterinarian might prescribe a critical care or recovery food like Hill&#039;s Prescription Diet a/d Urgent Care canned dog and cat food, Purina Pro Plan Veterinary Diets CN Critical Nutrition Formula canned dog and cat food or Royal Canin Veterinary Diet Recovery RS canned dog and cat food. These foods are made to help dogs keep their energy up while recovering from illness, surgery or injury. They are highly palatable in order to encourage a dog to eat no matter how unwell they are feeling. Puppy or All Life Stages Foods Puppy food and all life stages food—that also meet the Association for American Feed Control Officials (AAFCO) standards set for puppies—are usually higher in protein and fat than most adult dog foods. Look for high-quality, AAFCO-compliant options like Wellness Complete Health Just for Puppy canned dog food, Merrick grain-free lamb and sweet potato recipe dry dog food and Adirondack 30% high-fat puppy and performance recipe dry dog food. Avoid foods designed for large-breed puppies since they are lower in fat than a general puppy food. Performance Diets Dogs who are extremely active often need to eat performance diets that are high in protein and fat to maintain their body condition. These diets are designed for healthy dogs that are just in need of some weight gain or a more calorically dense food to support their active lifestyle. Eukanuba Premium Performance 30/20 adult dry dog food and Purina Pro Plan Sport All Life Stages performance 30/20 formula dry dog food both contain a minimum of 30% protein and 20% fat, while Dr. Tim&#039;s Highly Athletic Momentum formula dry dog food provides 35% protein and 25% fat. Tips for Helping a Dog Gain Weight Talk to your veterinarian if you have any concerns regarding your dog’s health or to simply confirm that your dog needs to gain weight. They can provide you with recommendations specific to your dog’s unique situation and help create a weight gain program to ensure your dog stays healthy and safe. Here are three tips for success: Transition to your dog’s new food gradually. Because many dog foods for weight gain are high in fat, a rapid switch could lead pancreatitis—a potentially fatal condition that is sometimes associated with fatty meals. While wet foods tend to be more palatable than dry, dry foods are almost always more calorically dense than wet. Therefore, you’ll need to determine the pros and cons of each option, or you can try mixing a small amount of highly palatable wet food in with calorically dense dry food to get the best of both worlds. Feed multiple small meals throughout the day rather than one or two larger portions. Dogs will typically eat more under these conditions. You can also leave dry food out all day, although this may make it harder to monitor your dog’s appetite. By: Jennifer Coates, DVM Featured Image: iStock.com/Amy Newton-McConnel"}]