[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Do You Know Your Pet is Obese?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS-Obese-Dog-427471531.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS-Obese-Dog-427471531.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/evr_multi_pet_obesity"}, "datePublished": "December 17, 2010", "dateModified": "August 16, 2022", "description": "It has been called a societal epidemic, as though extreme fluctuations in weight can somehow be “caught.” But how else do we explain why so many Americans are now medically diagnosed as obese, and how do we explain why our pets appear to be suffering a similar ill at ever increasing numbers?", "articleBody": "It has been called a societal epidemic, as though extreme fluctuations in weight can somehow be “caught.” But how else do we explain why so many Americans are now medically diagnosed as obese, and how do we explain why our pets appear to be suffering a similar ill at ever increasing numbers? As the Association for Pet Obesity Prevention (APOP) noted in their 2011 National Pet Obesity Awareness Day Study, domesticated animals are, like humans, becoming obese at an alarming rate. What is the Normal Weight? The numbers are staggering to consider. The APOP study found over 41 million overweight dogs and 47 million overweight cats in the U.S.. The researchers note that pet owners – the same people feeding these overweight animals – are starting to see their overweight pets as “normal.” However, 82 percent of pet owners that took part in the study did realize that pet obesity is a health concern and that something needed to be done to resolve it. How Do You Determine if Your Pet is Overweight? Veterinarians use a system of measurement called body condition scoring to determine your dog or cat’s level of fitness. The points range from one to five, where one means the animal is very thin – almost to the point of emaciation – and five is indicative of obesity. Your veterinarian will determine your pet’s body condition by measuring the fat found on specific landmarks on the body. For example, the ribs should be easily felt, with each rib bone easily distinguished from the others, and should have just a light layer of fat over them. The rear area, above the base of the tail, should have a light, smooth pad of fat. Other areas that are checked include the spinal column, hip bones and shoulder blades. If these bones cannot be distinguished from the fat, your pet is carrying too much fat. If the bones are sticking out and are too easily distinguished, your pet is not carrying enough fat. Looking down at your standing pet from a top view, you should be able to see the shape of the waist distinctly. Looking at your standing pet from the side, you should be able to see or feel a light tuck, or curving upward, in the stomach, just beneath the ribcage. What Should You Do if Your Pet is Overweight? First, your veterinarian will need to determine your pet’s ideal weight. This will be based on several considerations, like age, breed and general, overall health. Once that has been determined, your veterinarian will be able to help you to construct a meal plan that is perfectly suited to your pet’s ideal physical shape for its breed and age, as well as the best nutritional balance for maintaining its health. You will also need create a simple exercise plan for your pet, again based on breed capability, age and general health, in order to build healthy muscle and to use the fat that has already been stored in the body. Because each animal has its own individual health needs, it is highly advisable to seek the professional advice of a veterinarian, rather than basing any diet or physical exercise plans on research alone. Also, if at any point your pet begins to behave in a different way, or appears to be ill, you will need to consult with your veterinarian immediately. Change is gradual, including the benefits you will be seeing in response to your pet’s diet and exercise modifications. Over time, as you take your pet for progress checks at the veterinarian’s office, you will see the improvements that have come about as a result of the commitment you have made to improving your pet’s health. Image source: Ezzolo/Shutterstock.com"}]