[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/dd85380h5a", "@type": "VideoObject", "duration": "PT49S", "name": "holiday-food-scraps-dangerous-for-pets", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/193bcbf06b51614224b3778b1c165f3c2a706a47.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/dd85380h5a", "uploadDate": "2019-12-12", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/d02c10d116904f04bb0839339905d7b424eb07e0.m3u8", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/holiday-food-scraps-that-are-dangerous-for-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Holiday Food Scraps That Are Dangerous for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Care", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/Screenshot%202023-10-09%20at%2010.50.32%20AM.png", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/Screenshot%202023-10-09%20at%2010.50.32%20AM.png"}, "author": {"@type": "Person", "name": "Laci Schaible, DVM, MSL, CVJ", "url": "https://www.petmd.com/author/dr-laci-schaible"}, "keywords": "Dog, Holidays, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/holiday-food-scraps-that-are-dangerous-for-dogs"}, "datePublished": "August 27, 2019", "dateModified": "October 9, 2023", "description": "We all want to share the holiday spirit with our pets, but should we be sharing our holiday meals? Find out which holiday foods are toxic for dogs.", "articleBody": "As the holidays approach and our plates overflow with home-cooked meals, it’s important to remember that many holiday foods are bad for dogs and can even be toxic. From savory mashed potatoes and gravy to sweets and treats, learn which foods to avoid sharing with your pup—whether it’s letting them lick the plate or setting aside a bowl full of scraps. Holiday Foods That Are Bad for Dogs  1. Mashed Potatoes and Gravy Packed with dairy and butter, this dish should never be given to your pup. Mashed potatoes contain large amounts of fat, which are likely to cause gastrointestinal (GI) upset, such as diarrhea or even pancreatitis. Gravy is equally harmful and very high in sodium and fat. As a pup-friendly alternative, consider these tasty treats: 2. Meat Fat, Bones, and Skin Turkey meat and fat may smell delicious to your pup, but they can cause serious complications in your dog’s GI system. Dogs should not be offered meat with bones, excess fat, skin or juices, as can put your furry companion at a high risk for conditions such as gastrointestinal blockage. They can also lead to more complex diseases like pancreatitis. Ingestion of sharp bone fragments can also cause injuries in the mouth, stomach, and intestinal tract. It may even cause a perforation or tear in these organs, which can be fatal. When a perforation or tear occurs, intestinal contents spill into the abdomen causing sepsis. Instead, offer your dog some pup-friendly choices: 3. Casseroles and Spreads Holiday casseroles are laden with heavy creams, butter, oils and salt as well as garlic and onion—both of which are toxic to dogs. Even if a dish is based around a vegetable that is safe for dogs, such as green beans or sweet potatoes, it’s still toxic for your pup. Dogs should also not be given dairy products. Avoid the heavy appetizers, such as cheese balls and fatty dips and spreads. Most dogs do not tolerate dairy well, and the holidays are not an ideal time to test the limits of their GI tract. Here are a few alternatives for your four-legged companion: 4. Stuffing Stuffing is a fatty, sodium-packed food that contains onions and garlic, which are both toxic to dogs. Do not give your pup stuffing. Instead, offer these safe choices to your fur baby: 5. Holiday Breads Holiday fruitcake poses as a bread but is more of a dessert. It’s deadly to dogs, as it’s loaded with raisins. Even just a few dropped raisins can cause kidney failure and is fatal to dogs. 6. Desserts While humans may love apple pie, pumpkin pie and chocolate pie, these rich and sweet desserts can be very dangerous for dogs. Dogs will go to great lengths to get at these treats. Don&#039;t leave the candy bowl or kitchen counter unsupervised and within a paw&#039;s reach—even for a moment. While not all desserts are toxic to dogs like chocolate is, desserts are never a safe option. Artificial sweeteners found in desserts, such as xylitol, can be deadly in small quantities. Save the after-dinner sweets for the humans. For dessert, give your dog a safe treat, such as: How to Avoid an Emergency Vet Trip While it may be tempting to feed your dog human holiday food scraps, it often causes more harm and illness than providing them with a yummy treat. Stick with flavorful dog food and dog treats instead of table scraps! Featured Image: GettyImages/Pekic"}]