[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Heartworm Prevention Is More Important Than You Think", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Parasites", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/closeup-of-terrier-dog-lying-on-grass-in-garden-picture-id979001016.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/closeup-of-terrier-dog-lying-on-grass-in-garden-picture-id979001016.jpg"}, "author": {"@type": "Person", "name": "Jennifer Kvamme, DVM", "url": "https://www.petmd.com/author/dr-jennifer-kvamme"}, "keywords": "Dog, Parasites, Heartworm, Preventative health, Prescription medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/parasites/evr_dg_how_dog_heartworm_treatment_preventive_medications_work"}, "datePublished": "March 2, 2012", "dateModified": "August 25, 2022", "description": "Find out everything you need to know about treating heartworms in dogs and why dog heartworm prevention is so important to stay on top of.", "articleBody": "Image via iStock.com/HRAUN By Jennifer Kvamme, DVM Keeping your dog free of heartworms is an important job. You should have your dog tested annually for the disease and keep her on prescription heartworm medication for dogs. Have you ever wondered why your dog needs to be tested if they’ve been taking heartworm preventatives? Is it really that bad if you give it a few days late? Just how do these preventive medications thwart heartworm disease in your dog? Here are some facts. Heartworm Preventatives Don’t Actually Stop the Initial Infection You may be surprised to learn that heartworm preventatives do not stop the actual infection from occurring. That’s right—the prevention part actually refers to clearing up larval infections that have already happened so that the heartworms cannot grow into adults. If an infected mosquito happens to bite your dog, your pup may still be infected with the larvae. But heartworm medications work to kill off the larval heartworms that made it into your dog’s body during the past month to prevent further infection. The heartworms in the dog will die at certain stages of development, before they can become adult heartworms and cause disease. However, heartworm preventatives will not kill adult heartworms that are already present. Breaking the Heartworm Life Cycle The heartworm life cycle is complex. The dog is infected by early stage larvae that are transmitted by a mosquito carrying infected blood. This larvae goes through multiple stages of development within body tissue before migrating to the heart and lungs as an adult heartworm. These adults produce microfilariae, the earliest life stage that circulates within the dog’s blood. Prevention kills only early stage larvae and microfilariae. This is why it is important to give your dog heartworm prevention every month. It kills the larvae before they develop into a stage that is immune to the medication in heartworm prevention. Most heartworm medications require monthly administration, while others work longer (up to six months with an injectible product called moxidectin or Proheart®). There are many choices of heartworm prevention available, from topical products to chewable oral medications; many come in both dog and cat versions. Monthly heartworm preventative medications do not stay in your dog’s bloodstream for 30 days. The active ingredients work to kill any larvae that have been in the system for the past 30 days, clearing the body each month. The medication is only needed once a month because it takes longer than a month for the larvae to develop to a stage where they reach the body tissues. Why You Need a Prescription for Heartworm Medication So, why do you need a prescription from your veterinarian to be able to purchase heartworm preventatives online? And why won’t your veterinarian give you the heartworm medications without first testing your dog for heartworm infection? The reason for this is that your veterinarian wants to make sure your dog doesn’t have an active infection of heartworms before giving a heartworm medication. Dogs with heartworms can have a severe, possibly life-threatening reaction to the dying, circulating microfilariae (adult heartworm offspring) if given these heartworm medications. These microfilariae are only present in pets with adult heartworm infections. Additionally, there are several other reasons your veterinarian requires a yearly test for heartworms before giving you a prescription for the heartworm medication. You may have missed a dose, or your dog may have spit the heartworm medication out or vomited it up, leaving your dog unprotected for a period that you were unaware of. If for any reason the dog became infected with heartworms, treatment to rid the body of the infection must be started as early as possible to prevent permanent heart and lung damage. If you don’t test for the disease and your dog is infected, the heartworm disease will gradually progress and cause serious, life-threatening illness. This can happen even if you continue to give heartworm medication because those medications kill only early stage larvae. More mature larvae will continue to develop into adults, and adults will continue to produce microfilariae. It’s better to know as soon as possible so treatment can be started before the damage is too severe. Heartworm tests can be run in the veterinarian’s office and require only a small blood sample from your dog. Heartworm Preventatives Should Be Given Year-Round Veterinarians strongly recommend that dogs be given heartworm prevention all year round. In some parts of the country, where mosquitoes are less active in the winter months, you may be in the habit of only treating your dogs for heartworms half the year. Due to unpredictable seasonal temperature changes, the American Heartworm Society recommends year-round prevention for animals in every state. Also, with dogs traveling with their owners more, the prevalence of heartworm across the United States is increasing. This is a good practice to help you stay in the habit of always protecting your dog from heartworms, no matter what the season. Some heartworm preventatives contain medications that also remove other parasites, such as fleas, mites, ticks, roundworms, hookworms and whipworms. Depending on which heartworm medication you choose for your dog and cat, they may also be protected year-round from these parasites. Ask your veterinarian for help in choosing the best possible heartworm preventative medication for your pet. In regions where heartworm infections are common, repelling mosquitos adds a second layer of protection that can be very valuable. Permethrin-based products such as Seresto 8 month flea and tick prevention collars and Vectra® repel mosquitos as well as fleas and ticks. Heartworm prevention is an important part of your pet’s health care. Don’t risk their health by skipping doses."}]