[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Heartworm Prevention Mistakes You Might Be Making", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/heartworm-prevention1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/heartworm-prevention1.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Heartworm, Preventative health, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/parasites/6-heartworm-prevention-mistakes-you-might-be-making"}, "datePublished": "June 6, 2016", "dateModified": "September 7, 2022", "description": "Even if you give your dog heartworm medication, you may be making some mistakes that could expose your pets to heartworm infection.", "articleBody": "By Caitlin Ultimo   Heartworm: Any pet parent has heard of it and hopefully you have taken some measures to help protect your dog or cat against the disease. The mosquito-borne sickness is one of the most easily prevented diseases in veterinary medicine and is both difficult and expensive to treat. Still, simply giving your dog heartworm medication may not be enough – a good deal of its effectiveness stems from how and when you administer any preventatives.   Today, the American Heartworm Society reports that, of veterinarians who say incidents of heartworm are on the rise, 61 percent cite poor compliance as a reason. So, even though heartworm may be relatively easy and inexpensive to prevent (compared to how difficult and costly it is to treat), why are so many pets still afflicted by the disease? Here, find out the most common heartworm-prevention mistakes pet parents make so that you can be sure that your pet is properly protected. You might want to obtain heartworm medication online (or maybe you have leftover doses from the year prior at home), but before giving your pet any heartworm medication you should consult your veterinarian first. They will be able to perform a blood test for heartworm on a yearly basis so that you can be sure that your dog or cat is heartworm-free before starting any medication. If a pet parent gives heartworm preventives to a dog or cat that has heartworms can cause the worms to die rapidly and become lodged in the vessels around the heart and lungs. The dying of the heartworms can also lead to severe anaphylactic reaction, which needs immediate intervention by a veterinarian and can be fatal. Even though you may think that there may be more mosquitos in the warmer months compared to fall or winter seasons, owners that only give their pets heartworm prevention medication for the summer are potentially leaving their pets vulnerable to infection at the beginning and end of the season.   “Recently, mosquitoes have been active for more months out of the year than in the past due an increase in average annual temperature,” said Caitlyn Roswell, DVM and staff doctor at Animal Medical Center in New York. “Most prevention works by eliminating an infection contracted the month prior, so pets that are not protected through the fall are especially at risk.”   Most heartworm prevention also contains protection against common intestinal parasites, which can also be contracted during any season. Heartworm medication dosing is based on your pet’s weight, which can fluctuate, especially in growing pets, said Stephanie Liff, DVM and owner of Pure Paws Veterinary Care of Clinton Hill Brooklyn, NY. Pets that are near the limit of the range indicated on the packaging should be carefully monitored as prevention is always best when an animal is receiving an appropriate dose of treatment.   “It is important to see your vet annually so that you can keep track of any weight changes to confirm your pet’s dose remains correct,” Liff said.  “There are both topical and oral options for treatment available for heartworm prevention, so if a pet doesn&#039;t tolerate one product, it doesn&#039;t mean that an owner should forego prevention entirely,” Roswell said.   Both oral and topical products are meant to be given monthly and are dosed by size, Liff said. Additionally, there is an injectable product that can be given by a veterinarian every six months (the dose is also based on size). While there are some combination products available in the market, it’s important to know that most general flea and tick treatments do not guard pets against heartworms. You may think that if your pet is an indoor cat or a dog that spends most of his time inside that he is safe from encountering mosquitos that carry heartworm disease. Unfortunately, that is not the case.   “Mosquitoes can survive indoors and live for months,” Roswell said. “Owners should be aware that indoor pets are still at risk and need to be protected as well.” One of the most common mistakes that a pet parent can make is forgetting to administer their pet’s monthly heartworm dose. Although many products have efficacy for four weeks and will kill exposure to heartworm via mosquito transmission for up to two weeks old, the maximum efficacy is achieved when the product is given monthly (or every six months if your pet is on an injectable product) and when given it is entirety.   “Giving monthly heartworm prevention is the easiest way to avoid mistakes,” Liff said. “If monthly dosing is too difficult to remember, ask your vet about other options or sign up for reminder programs provided by the manufacturer of the heartworm preventative.” Giving doses late, missing doses or not knowing that a dose needs to be given every month can leave pets at risk for contracting heartworms. “Remember, there is no region of the country that is heartworm free – it has been diagnosed in all 50 states,” Roswell added.   Some signs that can signal that your pet has been infected by a mosquito carrying heartworm include difficulty breathing, coughing, tiredness, reduced appetite, weight loss, vomiting, gagging and lung, liver, kidney, or heart failure – which can lead to death. Most pets with heartworm do not show any symptoms until the disease becomes severe, which can take weeks or even months to develop. Contact your veterinarian if you notice any of these symptoms, and especially if your pet is not currently on heartworm medication or if he or she hasn’t been tested for heartworm yet within the past year."}]