[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/g3elo2pobz", "@type": "VideoObject", "duration": "PT2M29S", "name": "5327099854001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/25d36f4f23ac900e6e7053c6a204f550c1ecfc48.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/g3elo2pobz", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/a889733cdc13025be500bedf8e209c4e1b9cc95e.m3u8", "transcript": "Eight legged pests that affect your pet. You may be aware of the problems that insects, such as fleas and mosquitoes pose for pets but there are a whole host of arachnids that can cause serious harm for dogs and cats familiarizing yourself with common eight legged critters and learning how to treat bites and stings can help protect your pet from illness and even death ticks ticks our eight legged parasites that feed on the blood of our pets and can transmit serious illnesses such as Lyme disease and Rocky Mountain spotted fever with a hard backed shield and a dark body. Ticks are most active in warmer months and climates.\n\nThey live in tall grass where they attach to passing animals and crawl upwards ticks often burrow near the head. And neck feet and ears mites mites are another arachnid that can cause two types of mange and pets demo hectic mange and psychotic mange. While these conditions aren't life threatening they can cause serious skin infections if left untreated ear mites can also create complications in the inner ears of dogs and cats spiders. The majority of spiders in North America are not poisonous but their bites can still cause our pets swelling and pain.\n\nThe bites of black widow and brown recluse spiders however are toxic to animals. These bites can cause intense pain paralysis and even death, particularly in the case of a black widow bite scorpions similar to spiders most scorpions found in North America are relatively non-toxic though their venom can cause intense localized pain in pets more dangerous scorpions like the central Roy's oak silicate also known as the baha California bark scorpion inject venom into pets with a neurotoxin that can affect an animal's nervous system how to treat and prevent pest bites. If you're concerned that a spider or scorpion has bitten your pet.\n\nContact your veterinarian immediately for serious spider and scorpion bites antivenom and pain medication may be recommended as treatment ticks should be removed with tweezers by grasping the head and pulling straight up if possible let your veterinarian know the type of arachnid you believe has bitten your pet the best way to protect your pet is to ask your veterinarian about appropriate flea and tick medication if you plan to spend time outdoors with your pet particularly in grassy or wooded areas. Keep your pet on a leash and watch for any eight legged pests that may be underfoot.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/parasites/ticks-on-dogs-cats-and-other-8-legged-pests?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8-Legged Pests That Affect Your Pet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Insect bites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/parasites/ticks-on-dogs-cats-and-other-8-legged-pests"}, "datePublished": "December 9, 2015", "dateModified": "August 25, 2022", "description": "Fleas and ticks on dogs can cause serious problems. But there are other eight-legged pests that pose health dangers to dogs and cats. Learn more about these disease-transmitting parasites.", "articleBody": "Pet parents may be aware of the problems that insects like fleas and mosquitos can cause for pets. But did you know there are a whole host of arachnids that can also pose serious harm for dogs and cats? Familiarizing yourself with common eight-legged critters, and learning how to treat bites and stings, will help protect your pet from serious illness—and even death. Ticks Ticks are eight-legged parasites that feed on the blood of our pets and can transmit serious illnesses such as Lyme disease and Rocky Mountain Spotted Fever. With a hard-backed shield and a dark body, ticks are most active in warmer months and climates. They live in tall grass where they attach to passing animals and crawl upwards. Ticks often burrow near the head, neck, feet and ears. Mites Another arachnid that is a common pest for dogs and cats are mites. Mites can cause two types of mange in pets: demodectic mange and sarcoptic mange. Neither of these conditions is life threatening but can cause serious skin infections if left untreated. Ear mites can also create complications in the inner ears of dogs and cats. Spiders The majority of spiders in North America are not poisonous, but their bites can still cause our pets swelling and pain. The bites of black widow and brown recluse spiders, however, are toxic to animals. These bites can cause intense pain, paralysis and even death, particularly in the case of a black widow bite.  Scorpions Similar to spiders, most scorpions found in North America are relatively nontoxic, though their venom can cause intense, localized pain in pets. More dangerous scorpions, like the Centruroides [sentro-roi-dees] exilicauda [ek-sil-uh-KAU-duh]—also known as the Baja California bark scorpion—inject venom into pets with a neurotoxin that can affect an animal’s nervous system.  How to Treat and Prevent Pest Bites If you’re concerned that a spider or scorpion has bitten your pet, contact your veterinarian immediately. For serious spider and scorpion bites, antivenin and pain medication may be recommended as treatment. Ticks should be removed with tweezers by grasping the head and pulling straight up. If possible, let your veterinarian know the type of arachnid you believe has bitten your pet. The best way to protect your pet is to ask your veterinarian about appropriate flea and tick medication. If you plan to spend time outdoors with your pet, particularly in grassy or wooded areas, keep your pet on a leash and keep an eye out for any eight-legged pests that may be underfoot. "}]