[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Types of Heartworm Preventive Treatment Products", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Parasites", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-heartworms-stethoscope2.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-heartworms-stethoscope2.jpg"}, "author": {"@type": "Person", "name": "Jennifer Kvamme, DVM", "url": "https://www.petmd.com/author/dr-jennifer-kvamme"}, "keywords": "Dog, Parasites, Heartworm, Preventative health, Prescription medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/parasites/evr_dg_types_of_heartworm_preventive_products"}, "datePublished": "March 6, 2012", "dateModified": "August 25, 2022", "description": "Regular application of heartworm medication to dogs and cats is key in warding off heartworm disease. But which of the several heartworm preventives offered should you choose from? Here is some info to help you decide.", "articleBody": "By Jennifer Kvamme, DVM When it’s time to purchase heartworm preventive medication for your dog or cat, you have several options to choose from. In order to purchase any of these heartworm medications, however, you must first have your dog or cat tested for heartworms. If the test comes back negative, your veterinarian will then suggest a heartworm medication that will work best for your dog or cat’s particular needs. It’s very important to prevent this deadly disease, as prevention is much safer, easier, and cheaper than treatment. These heartworm medications are all very effective at prevention, as long as they are given in the proper dose on a regular schedule.  The American Heartworm Society recommends that animals living in all parts of the U.S. be given heartworm preventive medications on a year-round basis. Here we will discuss some of the common options available on the market today. Oral Monthly Heartworm Medications The heartworm preventives you are probably most familiar with are the once monthly tablets or chewables. These products typically contain either ivermectin or milbemycin as the active ingredient. In the past, a heartworm medication was available containing diethylcarbamazine, but it had to be given daily to be effective. This drug has been since removed from the market, as newer products that are more effective have since emerged. Many of the various oral heartworm medications available today have more than one function. Some will not only kill heartworm larvae, but will also eliminate internal parasites such as roundworms, hookworms, and/or whipworms. There is an oral product available that includes ingredients that also work to eliminate fleas by stopping them from producing live eggs. The good thing about these types of heartworm medications is that they only need to be given once a month for prevention. You need to watch your dog or cat to be sure he/she chews the entire piece or tablet and doesn’t spit any of it out. Otherwise, the heartworm medication loses its effectiveness. Dogs or cats that have an allergy to beef products may not be able to take a flavored, chewable product. Your vet can provide a possible alternative if this is the case for you. Topical (Spot-on) Heartworm Medications There are a few topical heartworm preventive medications available for both dogs and cats. These heartworm medications are applied monthly to the back of the dog or cat’s neck, or between the shoulder blades on the skin. Not only do these preventives protect against heartworms, they also kill fleas. Those heartworm preventives made with selamectin can work to eliminate ear mites, mange mites, and ticks (in dogs only), and will even kill some internal parasites (in cats). Moxidectin is another active ingredient in topical heartworm preventives available for both dogs and cats. This ingredient (along with imidacloprid) works on heartworm larvae and fleas, as well as hookworms, whipworms, and roundworms in dogs — and ear mites, roundworms, and hookworms in cats. Some dogs and cats may not like having the spot-on applied to their skin and will rub themselves against furniture, carpet, etc., after application, in their attempts to remove it. These heartworm preventives are toxic if ingested, so you may need to watch or isolate your dog or cat to be sure he/she doesn’t come into contact with children or other animals for a time after application (to prevent product from getting on hands, or from animals grooming each other). Injectable Heartworm Medication  Moxidectin can also be used for dogs as an injectable heartworm medication for up to six months with one injection. This heartworm preventive not only kills heartworm larvae, it also eliminates hookworms in dogs. It is not available for use with cats. The product has gone through some safety concerns and was voluntarily taken off the market in 2004 after reports of side effects. In 2008, the product was returned to the veterinary market with restrictions on its use. Veterinarians must administer this heartworm medication to their patients, and this is only after intensive training in its proper use. Your veterinarian is also required to record the lot number of the product used for your dog and must report any adverse effects that may come up.  No matter which medication you prefer to give your dog or cat, make sure you read labels closely and follow all instructions for use. Tell your veterinarian if your dog or cat shows signs of illness after administration, and be sure to have your dog or cat tested yearly for heartworms.                                                                     Image: WilleeCole / via Shutterstock"}]