[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Often Do Pets Cause Trip-and-Fall Injuries?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/basenji-dog-with-its-mixed-breed-white-friend-sitting-near-stove-and-picture-id1093894294%20%281%29.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/basenji-dog-with-its-mixed-breed-white-friend-sitting-near-stove-and-picture-id1093894294%20%281%29.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/how-often-do-pets-cause-trip-and-fall-injuries"}, "datePublished": "May 21, 2019", "dateModified": "September 7, 2022", "description": "Fall injuries caused by pets may be more common than you think. Find out how they happen and how you can prevent them.", "articleBody": "Pets bring joy to people’s lives and positively impact your health and well-being. But they can also unintentionally cause trip-and-fall injuries, even resulting in visits to the emergency room.  Pet-related fall injuries occur more often than you might think, so being aware of the hazards and taking steps to prevent trips and falls can help you avoid emergency situations. How Common Are Fall Injuries Caused by Pets? A 2010 study by the Centers for Disease Control and Prevention’s (CDC) National Center for Injury Prevention and Control revealed that pet-related fall injuries happen with relative frequency. An estimated 86,629 fall injuries associated with cats and dogs occurred in the United States each year from 2001 to 2006. Of these, seven and a half times as many injuries were caused by dogs in comparison to cats. The most common injuries reported were fractures, bruises and abrasions, most of these occurring in the extremities. According to the 2010 CDC study, while injury rates were the highest for people over 75 years old, pets were fall hazards for people of all ages. Jenn Fiendish, a veterinary behavior technician who runs Happy Power Behavior and Training in Portland, Oregon, says it’s not uncommon for pet parents to sustain an injury from falling or tripping over a dog. “This is often due to behaviors such as lunging at other animals, jumping onto or trying to get past an owner, and forceful pulling on the leash,” she says. Fall Injuries Within Your Home Fall injuries can happen anywhere, even at home. You might be at the stove cooking, for example, and your pup may be right behind you, waiting for food to drop, says Melissa Winkle, an occupational therapist and president or Dogwood Therapy Services in Albuquerque, New Mexico, who works with people with disabilities. “And [they] stay so close that when you turn around, you trip.” Or you might come home to an excited dog who has been left alone all day, arms full of groceries, and if your dog jumps up excitedly and runs around your legs, you can easily trip. Winkle further cautions pet parents about the hazards of a jumping dog. “Typically we see people get new pups or smaller adult dogs, and families allow the puppy to jump ... Then the pup grows up knowing that this behavior will be rewarded,” says Winkle. In this case, the bigger issue is a lack of proper training that can cause a fall injury. How Fall Injuries Can Happen Outdoors Retractable leashes are another common cause for fall injuries, according to Winkle. “People give their dogs 8 feet of leash, and the dog sees something or hears something and gets a running start, giving them mechanical advantage, and pulls the person over,” says Winkle. Dogs can also change directions abruptly or get caught up in their leash while using a retractable dog leash. “I have seen both dogs and people get serious injuries from these kinds of leashes,” says Winkle. Winkle suggests using a fixed-length 4-6 foot dog leash and being aware of your environment so you can predict if your dog will take off. Dog parks are prime spots for both dog and human fall injuries, says Winkle. “People get to talking on the phone or to other pet parents and forget to watch their dogs,” says Winkle. Dogs tend to pay more attention to each other while playing, so it’s not unusual for them to run full-tilt into an unsuspecting bystander. “Supervision is the key,” she adds. Obedience Training to Prevent Fall Injuries The CDC report says that obedience training is an important factor in reducing falls. Walking your dog on a loose leash and teaching her to stay to one side of you (aka heeling) are two training skills that can reduce the risk of tripping over a dog, explains Fiendish. “For animals with more severe behavioral issues like leash reactivity or fear aggression, one must work with a qualified behaviorist or trainer so that the root problem is addressed along with behavior modification and training,” she adds. The same training can also apply to cats and smaller dogs, she says. (Although most injuries are caused by dogs, tripping over a cat is also a real risk.) “In addition to training, the use of a collar bell is also helpful, as it gives an owner the ability to hear the pet and thus alerts them to their presence.” Winkle says that providing environmental controls, such as the Carlson Pet Products extra wide walk-thru dog gate, can be a convenient way to keep both human and pup safe. “This particular product allows people to get through easily with a very shallow step-over, and it is tall enough to keep even larger breeds out of high-traffic and low-attention areas.” Many of these trip-and-fall injuries can be prevented if both human and dog have an understanding of the rules, says Winkle. “It really boils down to training together, having a relationship, watching the dog and managing the environment all the time,” she says. Assessing your lifestyle and physical status is also essential, says Fiendish. “Big, exuberant dogs as well as small, ‘hard-to-keep-track-of’ animals are often not a great choice for those with mobility issues.” Fall injuries caused by tripping over a cat or dog happen more often than people may think—and it impacts people of all ages. Being aware, reducing risk factors and investing in obedience training can go a long way towards preventing accidents. By: Paula Fitzsimmons Featured Image: iStock.com/Yurikr"}]