[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Disaster Preparedness: Tips for Finding Pet-Friendly Evacuation Shelters", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Ginger-cat-in-carrier.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Ginger-cat-in-carrier.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/pet-disaster-preparedness-tips-finding-pet-friendly-evacuation-shelters"}, "datePublished": "May 22, 2019", "dateModified": "September 7, 2022", "description": "Make sure you have your emergency plans in place with these pet disaster preparedness tips.", "articleBody": "Reviewed for accuracy on May 22, 2019, by Dr. Katie Grzyb, DVM In the case of a major disaster, would you know where to go with your pet? Pet disaster preparedness is about more than just having an evacuation kit ready. You should also know where you and your furry companion will be seeking shelter together, because you should never leave your pet behind when evacuating for an emergency. The time to prepare for a disaster is before it happens, according to Elizabeth Richer Campo, senior vice president of Pasadena Humane Society &amp; SPCA. “Get to know what the potential risks are where you live.” “As a Californian, I have made plans based on having to evacuate in a disaster (fire and earthquake) or managing at home if roads are inaccessible (a potential scenario in an earthquake),” Richer Campo says. Here’s a list of must-do’s so you can stay at a safe, pet-friendly accommodation during an emergency. Locate Pet-Friendly Shelters First, you’ll need to determine where your evacuation zone is, then you can research pet-friendly shelters in that area. The local health departments (county or state) or the local emergency management office should be your first stop when organizing a pet evacuation plan. These are usually the groups that coordinate emergency responses, so they may likely have information on pet-friendly shelters or kennels in your evacuation area, says Dr. George Ghneim, DVM, PhD, from Wake Veterinary Hospital &amp; Urgent Care. When researching possible places to seek shelter in your evacuation area, call around to different kennels to find out if they have pet-friendly housing available and what kind of papers need to come with your pet, advises Richer Campo. Richer Campo suggests asking questions like, “Do they need proof of vaccinations? Do they take all sizes/breeds of dogs?” She also says that if you have exotic pets, it is even more important to plan ahead because they are more difficult to house. Check with the veterinarians in your chosen location to see if they can house your exotic pets. Advocate for Pet-Friendly Shelters in Your Evacuation Zone “Although most emergency shelters do not allow pets, some make exceptions for therapy and assistance animals,” says Dr. Ghneim. “Some states require that evacuation centers have a location where small domestic animals can be housed on the same site,” Richer Campo says. If your state or municipality doesn&#039;t have this requirement, Richer Campo says, lobby for it and talk with your city council and state representatives about evacuations for pets.” Reaching out to the Red Cross is also a good idea, says Richer Campo. The Red Cross will work with partners in your community who can open a pet shelter nearby. Look for Pet-Friendly Hotels Within Driving Distance Contact hotels, motels and even bed-and-breakfasts in your evacuation area to see if they accept pets. Although it’s hard to predict the best locations, as that really depends on the type and intensity of the disaster, Dr. says that making a list of nearby hotels is a good start. You should also create a list of veterinary hospitals and kennels in that area. When talking to hotels, find out if they have restrictions regarding the breed, size or number of pets. Even hotels that don’t accept pets might make an exception in case of a disaster, so ask about that, too. Pick an “Emergency Evacuation Town” Even better than just a nearby hotel or pet kennel is a town outside of your evacuation zone that you can reach within an hour or two. This town could serve as home base until the emergency situation dissipates. “Picking a town that you are familiar with is a great idea,” says Dr. Ghneim.  Dr. Ghneim recommends choosing a location that is both outside of the designated evacuation and easy to relocate to quickly. He says, “The distance will depend on the type of disaster—a flood zone or burn zone may be rather small, but a category 4 hurricane may cover hundreds of miles.” Picking an “emergency town” is especially helpful for disasters that have some kind of warning or regular pattern, says Richer Campo. “Look at what areas are historically safer and start looking for housing options in those areas,” she says. “Have that list as part of your disaster kit, so when a disaster is predicted, you can start making reservations.” Ask Family and Friends for Help It doesn’t hurt to ask relatives or friends if they could serve as an emergency shelter in the case of a disaster. Even if they can’t host you for a long period of time, maybe they could take you in for one night before you continue on to your destination. You should talk with them in advance to create a plan instead of just springing it on them during an actual emergency. “Communication and planning are important when handling where you will go in an emergency, whether it’s short-term or long-term,” says Dr. Jim Carlson, DVM of Riverside Animal Clinic. “If you are thinking of staying with family and friends, you should discuss their level of comfort with your animals.” Keep Paperwork Handy and Ready to Go If you need to evacuate with your pets, any place that takes your pet in (from a hotel to a pet-friendly shelter) will ask for at least the basic paperwork before you can check in. “It’s likely that a kennel, extended-stay hotel or airline will ask for proof of vaccination and possibly a negative intestinal parasite screen,” says Dr. Carlson.   Your vaccine records should include proof that your pet has been inoculated with all of their core vaccines, like rabies, distemper/parvovirus and Bordetella (kennel cough), Dr. Ghneim says.    You should be sure to have multiple forms of your pet’s vaccination and health paperwork. You can keep physical copies in a go-to binder and digital copies in your email and on your phone, says Dr. Carlson. “In addition to vaccination and health papers, don’t forget pet identification information: microchip number, photos and a collar with your name and contact information on it.”   By: Diana Bocco Featured Image: iStock.com/Lightspruch"}]