[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Much of a Dog’s Personality Comes From Their Owner?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Chocolate%20Lab%20Dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Chocolate%20Lab%20Dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/how-much-dogs-personality-comes-their-owner"}, "datePublished": "May 13, 2019", "dateModified": "September 7, 2022", "description": "How much of a dog’s personality comes from genetics vs. how they’re raised? Does your personality rub off on your pets?", "articleBody": "Reviewed for accuracy on May 13, 2019 by Dr. Wailani Sung, MS, PhD, DVM, DACVB You may know dogs and people whose personalities are mirror images of each other: a low-key pet parent with an equally mellow pup or an outgoing pet parent with a dog who greets everyone with wet kisses. This might not actually be just a coincidence, as scientists say that dog personality is strongly linked to human personality. But, just how similar is a dog’s personality to their caretaker? Is the human-animal bond so strong that a dog can adopt personality traits from their owner, and vice versa? Personality Similarities Between Dogs and Their People In a study published in Applied Animal Behaviour Science, researchers asked pet parents to rate themselves on five major personality dimensions (as well as on corresponding personality traits of dogs). “The Big Five,” as they’re referred to in the psychology community, are: Neuroticism (a tendency towards feelings like anxiety and fear) Extraversion Conscientiousness Agreeableness Openness (level of creativity, curiosity and being open to new ideas) Pet parents overwhelmingly responded that they share all five personality dimensions with their dogs. To be certain the results weren’t mere projection by pet parents, independent peers also assessed the dog and human duos. The independent peers also rated them as sharing all the dimensions, except for openness.  Why Is Dog Personality Linked to Human Personality? One explanation why dog behavior and personality is so intertwined with that of their humans is a tendency for people to select animals who complement their own lives. A calm human will often choose a calm dog, or an anxious person will adopt a frightened dog, for example, says Jenn Fiendish, a veterinary behavior technician who runs Happy Power Behavior and Training in Portland, Oregon. She believes people do this on a subconscious level.  “When my husband and I went to pick up our new puppy 12 years ago, I immediately chose the one who was more active, feisty and a little scared of things, which is much like my own personality. My husband chose the laid-back, calm and not-bothered-by-things puppy, a perfect match for his personality. This also happened with my other two dogs that we own, both of whom I picked out because they were feisty and a bit out of control (me again!).” Through the years, she says that the dogs have maintained, and even strengthened, some of these personality traits. Dr. Patrick Mahaney, a veterinarian who owns Los Angeles-based California Pet Acupuncture and Wellness (CPAW), Inc., says he’s seen clients with seemingly neurotic tendencies gravitate towards higher-energy dogs. “Such neurotic owners seem to seek out Weimaraners, Viszlas, herding dogs and other breeds and their mixes that often would feed off of the amped-up energy of their owners.” Dog Emotions Mirror Human Emotions Given that people and pups have shared a relationship for at least 15 thousand years (scientists debate this timeline), it’s no surprise that dog personality has been impacted. Fiendish says that dogs have an ability to read and match human emotions. “When a person is very anxious, our dogs understand this and often become anxious as well. If the anxiety is chronic, the dog may also develop chronic anxiety,” she says. Dr. Mahaney has witnessed this in his practice. “I have observed pets in households where the owners are under a lot of stress [who will] subsequently exhibit behavior problems which could be attributed to the owners’ lack of calming energy.” Some of the behavior problems he sees include inappropriate urination and defecation, destructive tendencies, barking and howling, and decreased appetite.   Dogs are true empaths, says Dr. Lisa Pinn McFaddin, DVM, GDCVHM, CVSMT, CCOAC, CVA, CVFT, medical director at Independent Hill Veterinary Clinic in Manassas, Virginia, and host of a podcast called Vetsplaining. “They can sense minute physiologic changes in people and other animals and respond accordingly.” The closer the human-animal relationship, the greater the response, adds Dr. McFaddin. “Dogs frequently try to comfort and calm upset owners. People do not always recognize these cues from dogs, as they may be subtle: laying down next to the person, putting their head on the person’s leg, making physical contact with the person or trying to distract the person with a toy.”   Can a Dog’s Personality Rub Off on Humans? While experts say it’s more common for dogs to acquire personality traits from their pet parents, it’s possible for dog emotions and behavior to impact humans, says Dr. McFaddin. Dr. McFaddin explains, “I most often observe this when people own dogs who are innately anxious. The dog’s anxiety often results in owner anxiety. The person feels helpless to alleviate the anxious behaviors expressed by their pet. This helplessness makes the owner feel uncomfortable, vulnerable and, thus, anxious.” Physical cues and behaviors that an anxious dog might exhibit—like panting, whining, pacing, destruction of items and incessant barking—can also overstimulate a pet parent, Dr. McFaddin says. “The constant movement and noise become annoying and disruptive to the owner’s lifestyle, which causes anxiety. On the flip side, some insanely calm dogs (I call them Buddha dogs) help calm owners. The dog’s innate serenity is contagious, physically and emotionally,” she adds.  “Numerous studies have shown a reduction in anxiety, slowing of heart rate, lowering of blood pressure, and increased release of calming hormones and neurotransmitters in the body of both humans and dogs following positive interactions, primarily after petting,” says Dr. McFaddin. So it seems that both parties can benefit from the human-animal bond. By: Paula Fitzsimmons Featured Image: iStock.com/Akeem Ranmai"}]