[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "This Nonprofit Helps Pit Bull Dogs and the People Who Love Them", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/playing-with-happy-dog-picture-id484405487.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/playing-with-happy-dog-picture-id484405487.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Breed, Adoption, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/nonprofit-helps-pit-bull-dogs-and-people-who-love-them"}, "datePublished": "October 11, 2018", "dateModified": "September 7, 2022", "description": "My Pit Bull is Family is a nonprofit organization that is dedicated to helping people find Pit Bull -friendly housing. They help Pit Bull dogs find homes and stay with their families when they move.", "articleBody": "Image via iStock.com/WhitneyLewisPhotography By Victoria Schade Finding a pet-friendly rental is hard enough, but trying to find one when your best friend is a Pit Bull-type dog is close to impossible. That’s why a Minneapolis-based nonprofit called My Pit Bull is Family is working to help families keep Pit Bulls and other large breeds. They are doing this by compiling a list of rental properties that welcome four-legged tenants, no matter the size or breed type. My Pit Bull is Family was founded in 2011 to address the issue of canine housing discrimination—one rental at a time—regardless of a dog’s appearance or weight. They believe that all dogs are individuals and shouldn’t be judged by the way they look. They want to dispel the myth that Pit Bulls are dangerous dogs by showing that they deserve to stay with the families that love them. The sad fact is that even “pet-friendly” rentals often have stipulations about certain breed types or sizes, preventing people with bully breeds from renting. Many dog breeds, like Great Danes, Chow Chows and German Shepherds, are often also excluded on an ever-changing list. Why Restrictive Rental Policies Hurt Dogs According to the Humane Society of the United States, one of the most common reasons animals are surrendered to shelters is a due to housing, moving or landlord issues, which means that these rental policies can tear families apart. Shannon Glenn, executive director of My Pit Bull is Family, states, “We have been told by shelters across the country that the number one reason why large dogs are surrendered is the lack of housing that will accept them.” Unfortunately, these restrictive rental policies are typically based on misinformation and generalizations about dogs with a certain look, which leads to more dogs ending up in shelters. To combat this problem, My Pit Bull is Family, a completely volunteer-based organization, has created the nation’s largest non-discriminatory dog-friendly housing database. “Each month, our volunteers call 400 dog-friendly apartments that are listed on Rent.com—these are apartments that advertise that they accept dogs already,” Glenn says. “Our volunteers call or research each one online, and we then enter the listings that accept all dogs into our database.” At this point, the organization has contacted over 2,500 listings in 2018. The site also offers tips for renters with dogs, like how to be an “extraordinary tenant,” as well as information for landlords about why renting to families with dogs of all sizes makes good business sense. Pet-Friendly Housing and Affordability Unfortunately, discriminatory pet rental practices aren’t restricted to a single region of the US. The organization has been contacted by close to 3,000 families this year who are searching for truly pet-friendly housing throughout the country.  Add to that the fact that even if rentals accept dogs of all breeds and sizes, those options might not be within financial reach for the average renter. Glenn says, “Affordable, pet-friendly housing that accepts all dogs is nearly impossible to find, so we are often contacted by families that cannot afford the listings in their areas.” My Pit Bull is Family recently launched a new initiative to help address the monetary hardships of keeping families together. The Together at Home Fund can assist with expenses like training costs, pet deposits, legal fees and even occasional repairs. Created in August of 2018, this fund is yet another way My Pit Bull is Family is attempting to level the playing field for Pit Bull lovers who are forced to juggle their devotion to their dogs with financial challenges. Renting With a Pit Bull Dog: A Happy Tale Though the organization’s rental search is typically used by families with dogs who are trying to find non-discriminatory housing, in one instance, the service assisted in the creation of a brand new family. Kathy Schuh had wanted to adopt a Pit Bull dog, but because she’d heard of the difficulties of trying to rent with a bully breed, she assumed that she’d have to wait to rescue one until she bought a house. But Kathy discovered My Pit Bull is Family on Facebook and found a truly pet-friendly apartment. With that, she was able to rescue a Pit Bull named Zeus into her new home a few weeks later. Now, 5-year-old Zeus the Pit Bull is paying it forward. He’s the ultimate host, helping to make his feline and canine foster siblings feel welcome as they search for their forever homes. Through community outreach, education and an ever-growing breed-neutral database, My Pit Bull is Family continues to support their mission to “lick discrimination” for Pit Bulls and the people who love them."}]