[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Do You Know Proper Etiquette for Service Dogs?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/blind-person-with-service-dog-picture-id918341388.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/blind-person-with-service-dog-picture-id918341388.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/do-you-know-proper-etiquette-service-dogs"}, "datePublished": "November 26, 2018", "dateModified": "September 7, 2022", "description": "Learn how you should react when you see a service dog in public.", "articleBody": "Image via iStock.com/FatCamera By Paula Fitzsimmons The initial reaction most people have when encountering a dog is to pet him. Dogs are irresistible, after all, but you should always use caution before approaching any dog. Making contact with a service dog, in particular, can inadvertently place his person at risk. Learning proper service dog etiquette can prevent mishaps and help human handlers preserve the special bond they have with their animals. What Is a Service Dog, and How Can You Identify Them? The Americans with Disabilities Act (ADA) considers an ADA service dog as one who’s been specifically trained to assist a person with a disability. In most cases, trained service dogs are required to be tethered, leashed or harnessed while in public. Although the ADA doesn’t require it, service dogs often wear vests or patches, like the Doggie Stylz do not pet dog patch. How Service Dogs Differ From Companion Dogs “Service dogs are only different from companion dogs in the training they receive and that their behavior is to always be amicable towards other people and other animals. This means too, that they cannot get distracted from their work,” says Mark Castillero, director of Pro-Train in the San Diego, California area. While any breed can become a service dog, it’s essential that he not have behavioral issues, be aggressive or fearful, says Marsha Tonkinson, owner and lead trainer of K9 Paws Behavior Dog Training in Golden Valley, Arizona. The dogs go through extensive training that experts say can last from several months to two years. The length of the training period depends on the dog’s age and how much training he’s already received. “In addition to learning basic obedience and leash manners, the dog should be able to pass a public-access test, and be trained to perform work or a specific task for their human,” says Morgan Karol, dog training manager with Freedom Service Dogs of America based in Englewood, Colorado. Service Dogs Are Lifelines for People With Disabilities Guiding a blind person, alerting a patient to low blood sugar, or preventing someone with post-traumatic stress disorder (PTSD) or autism from performing a destructive behavior, are examples of life-saving tasks service dogs perform,” says Karol. Trainers say the dogs are lifelines for people with disabilities. “To watch a person who wouldn’t really leave their home from fear, to getting a service dog and watching them getting involved in their community helping others, is the greatest thing ever,” says Tonkinson. Learning to Respect Boundaries To be a lifeline to a disabled person, a service dog needs to be able to focus on his job. Trainers are adamant that people should ignore service dogs completely—no petting, calling or staring. “I wish people would just smile at the handler and move on. We see more adults acting up than kids out in public. Treat the service dog team with respect and think, ‘If this was my loved one, how would I feel if a stranger ran up to the dog and was talking to the dog in baby talk and making kissy sounds?’” says Tonkinson. She adds that people make assumptions of what a disabled person looks like, and will even question the handler. “People need to understand that most disabilities are invisible.” “Distracting service dogs is an issue,” says Karol. “The interference we receive as service dog trainers on a daily basis while we are in public training these dogs, is immense. We know our clients face this struggle as well. A simple task, such as going to the grocery store, can take much, much longer than it should when a person working with a dog is constantly interrupted with questions, comments, stories and requests to pet the dog.” Consequences of Not Following Proper Service Dog Etiquette By distracting a service dog, you could literally be putting someone’s life in danger, says Karol. “It may prevent them from alerting their person to a drop in blood sugar or a seizure. It may be that person’s first time in a public place in five years, and they are doing everything they can to complete a task or errand, and your interference could set them back immensely.” Picture a scenario in which a service dog is walking down a busy sidewalk, focusing on keeping his human safe, when someone stops to pet him, offers Castillero. “The dog most likely will smash its handler into some obstacle or pole instead of clearing its handler around it. And the blind person most likely had no idea that someone was distracting his dog.” In some cases, the service dog may have to reenter training or be rendered unable to work. This can result in a loss of thousands of dollars and hours of training, says Tonkinson. Service dogs help people with disabilities to stay healthy, survive and even thrive. In order for this relationship to work, the dog has to stay focused. Proper service dog etiquette boils down to respecting these boundaries."}]