[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Does Saying Goodbye Help Prevent Dog Separation Anxiety?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/small-dog-inside-the-house-looking-out-from-window-picture-id1016137974.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/small-dog-inside-the-house-looking-out-from-window-picture-id1016137974.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Anxiety, Behavior, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/does-saying-goodbye-help-prevent-dog-separation-anxiety"}, "datePublished": "April 23, 2019", "dateModified": "October 13, 2022", "description": "How you go about leaving your dog for the day may have an impact on your dog’s mental wellness.", "articleBody": "Are you one of those dog owners who says goodbye to your pets as you walk out the door? Don’t be embarrassed—you are not alone. Why do many dog owners feel the need to say goodbye or tell their dogs that they will be back? Pet parents will say goodbye to their pets mostly because it is part of our human culture to notify our family of our imminent departure or to let them know when to expect us back. But the question is, does your dog care if you do or don’t? Find out if it means anything to your dog, whether it actually makes things worse, and what you can do about dog separation anxiety. Does Your Dog Need You to Say Goodbye to Him? Research on dogs suffering from separation anxiety has indicated that dogs know well in advance when their owners are going to leave. You may not realize that you are projecting your pending departure as you prepare to leave—well before you say “goodbye.” Most people will put their shoes on, grab their jackets, pick up a bag or purse and keys, and head towards the front door. Some owners may put out special dog toys or treats for their dog right before they leave. These are all signals that tell your dog that you are going to leave. Other pet parents will go through elaborate displays of affection such as hugging their dogs and/or kissing them and telling them they love them and will be back. Every dog’s reaction to their owner’s departure will vary according to their personality. It is not unusual to hear dogs vocalize after their owners leave. Some may whine, bark or howl briefly as the owners leave and, within a few minutes, settle down.  These dogs are exhibiting contact-calling behavior, which is a series of vocalizations some social species will use to try to contact other members of the group that may have wandered off beyond the immediate area. Dogs will typically demonstrate this behavior with barking or howling; it’s like they are saying, “Hello, are you there?” Some dogs may even scratch at the door or run to the window to watch their owners leave. The majority of dogs appear to tolerate their owners’ absence with minimal drama. However, 14-29 percent of the dog population may suffer from owner-separation-related distress. For a dog with separation anxiety, making the departure and return greeting routine very exciting and dramatic may enhance the dog’s anxiety when they are all alone. How to Know If Your Dog Suffers From Separation Anxiety Most pet parents rely on signs that something’s amiss in their home—such as scratches on the door, items that are chewed up, or evidence of house soiling—to detect separation anxiety. If they do not see anything amiss, they usually think that their dogs were fine. Some people may not find the house torn apart but may later hear from their neighbors or landlord that their dogs were vocalizing intensely when they first left or throughout the entire length of their absence.  If you are unsure whether your dog suffers from separation anxiety, record his behavior for 15-20 minutes after your departure using a device such as the Petcube Bites Wi-Fi pet camera or Pawbo+ Wi-Fi interactive pet camera. You can also use the camera on your computer or leave your phone behind to record their activity. It is really important that you actually walk out the door, lock it, and walk or drive away. The dogs will know if you are just pretending to leave because they won’t hear the familiar indicators, such as your footsteps fading away or the start of the car engine. Then you can review your dog’s behavior and show the recording to your veterinarian or a trainer or behaviorist. Dogs suffering from separation anxiety will exhibit the most intense anxiety and distress during the first moments the owners are absent. Treating Separation Anxiety in Dogs If your dog does not appear to get upset after you have left, then you can continue to say goodbye to them when you leave. If you have determined that your dog does get upset in your absence, it is best to seek professional help right away. They can help determine whether your dog is suffering from mild, moderate or severe separation anxiety. Mild Separation Anxiety Dogs that show some mild anxiety may be less upset if they receive long-lasting dog treats, like WHIMZEES Stix dental dog treats, or if they have to work for their favorite treats in a dog puzzle toy, like the Milk-Bone Active biscuit-dispensing ball. Moderate to Severe Separation Anxiety For dogs that exhibit a moderate to severe level of anxiety, it is best to downplay your departures by not saying effusive goodbyes or greeting them excitedly when you return home.  A board-certified veterinary behaviorist can provide a diagnosis and recommend a treatment plan that includes immediate management options, behavior modification exercises and the potential use of anti-anxiety medication, if warranted. Other educated dog professionals, such as Certified Applied Animal Behaviorists (CAAB) can also help but will not be able to make any recommendations regarding pet behavior meds. Dogs that become so upset that they exhibit panicked behavior that may cause injury to themselves or damage the house might need prescription pet medication. In some cases of severe separation anxiety, injuries have included dogs breaking their teeth, pulling out toenails, jumping out of windows, or chewing holes through the walls. When the owners do not have other options, such as the use of daycare or a pet sitter, medication can sometimes help to decrease the dog’s anxiety so that they can tolerate being left home alone. The distress these dogs experience is a mental health crisis. The quicker the problem is addressed, the better the prognosis. By: Dr. Wailani Sung Featured Image: iStock.com/tarnrit"}]