[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Dog Breeds for Cat People", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/catlike-dog-breeds.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/catlike-dog-breeds.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cat, Breed, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/8-dog-breeds-cat-people"}, "datePublished": "May 6, 2019", "dateModified": "September 7, 2022", "description": "Cat people may be hesitant to bring a canine into their family, but there are actually quite a few dog breeds that act like cats.", "articleBody": "Reviewed for accuracy on May 6, 2019, by Dr. Katie Grzyb, DVM The polarizing debate about dog people versus cat people has led many to believe that cats and dogs are on opposite sides of a spectrum with no common ground. “Dogs are not cats,” says Jessica Gore, CPDT-KA, a professional dog trainer based in Los Angeles. “However, there are certain, very broad stereotypes that we associate with both cats and dogs alike.” But that doesn’t mean that cat people can’t become dog people. While cat people appreciate their feline companions for traits like independence, intelligence and cleanliness, there are dog breeds that also display these characteristics. There are even dog breeds that can slink around your house with catlike stealth. So, if you are a cat person looking to expand your horizons with a canine companion, here are several dog breeds for you to consider. Shiba Inu  Image via iStock.com/alynst The Shiba Inu is an ancient Japanese dog breed that looks like a canine through and through. However, when you start to dissect the Shiba Inu’s personality traits, it’s easy to see why this breed makes the cut when it comes to catlike dog breeds. “Daring, courageous and extremely pleasant to be around, the Shiba Inu is catlike in more than just his temperament,” says Gina DiNardo, executive secretary of the American Kennel Club. “He enjoys keeping himself clean and groomed, and you’ll often catch this pup meticulously licking himself like his kitty friends do.” Besides grooming maintenance, Gore adds that the Shiba Inu shares some of a cat’s reserved qualities. “Similar to feline friends, the Shiba will let you know if they&#039;re interested in participating—or not,” she says. Afghan Hound  Image via iStock.com/Laura Fay Gore says that the regality and the glamour of the Afghan Hound makes the breed line up with glamorous cat breeds, such as Persians and Himalayans. But in addition to its lustrous looks, the Afghan Hound is a very independent dog breed. Sound like any felines you know? “Afghan Hounds are bred to work independently rather than taking cues from people,” says DiNardo. This independent streak, coupled with the breed’s high prey drive, makes this breed very catlike in nature. Italian Greyhound  Image via iStock.com/MarkHatfield A miniature version of the Greyhound, the Italian Greyhound’s small size and ideal grace make them very catlike. The Italian Greyhound also “enjoys sunbathing like kitties and really hates getting wet,” says DiNardo. “And, just like cats, the Italian Greyhound loves being up on elevated surfaces.” These hounds are also known for their instinct for pursuit—a trait undeniably shared by both domestic and wild cats alike. Saluki  Image via iStock.com/CaptureLight While the Saluki is much larger and taller than a feline housemate, Gore explains that Salukis have low-key personalities that put them in the category of dogs that act like cats. “Dainty and gentle, this wispy breed can be shy, sweet and reserved, containing a catlike quietude and serenity,” she says. DiNardo agrees that the Saluki, a sighthound often used for hunting and racing, is a dog that acts similarly to a cat. “They are gentle and affectionate toward their families but aloof toward strangers,” she says. Pharaoh Hound  Image via iStock.com/Eudyptula When it comes to hunting skills, cats usually have dogs beat. They stalk and track prey with great efficiency. But, certain dog breeds are adept at hunting too, and the Pharaoh Hound is one dog breed that can give felines a run for their money. “Pharaoh Hounds are known for their exceptional hunting skills magnified by their incomparable scenting power, speed and stamina,” says DiNardo. “They have been bred to become reliable sighthounds and rabbit hunters.” Whippet  Image via iStock.com/BiancaGrueneberg If you know anything about cats, you understand that they tend to have the midnight crazies where they play and hunt at ungodly hours while their humans are trying to sleep. Whippets, says DiNardo, are not dissimilar. “Whippets and cats share a strong prey drive,” she explains. “They both go nuts hunting down smaller animals. Finally, when their exercise needs are met, Whippets tend to be lazy around the house. Like cats, they love to lounge in warm spaces.” Papillon  Image via iStock.com/Bigandt_Photography These family-friendly dogs make great companion animals, especially for families with children. The Papillon dog breed is smart, cunning and competes with cats when it comes to wits. “Papillons are extremely friendly with children and adults alike. However, this breed needs training to be socialized in a proper way,” says DiNardo. “These canines are as intelligent as cats. In addition, this dog breed is highly self-assured and confident as well.” Shar-Pei  Image via iStock.com/bruev The Shar-Pei is an extremely strong, muscular dog, so they might not be the first breed to come to mind when you think about catlike dogs. “Shar-Peis are strong, regal, independent guardians famous for intelligence and loyalty,” says DiNardo. “They are suspicious of strangers and other dogs.” Gore agrees that the Shar-Pei is aloof, but when they warm up to you, their true, noticeably catlike personalities come through. By: Deidre Grieves Featured Image: iStock.com/mikedabell"}]