[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "4 Ways Veterinary Science Has Advanced in the Past 10 Years", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cat-and-dog-together-cute-pets-portrait-picture-id648878608.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cat-and-dog-together-cute-pets-portrait-picture-id648878608.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Vet visits, General Care, Wellness exam", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/4-ways-veterinary-science-has-advanced-past-10-years"}, "datePublished": "April 22, 2019", "dateModified": "September 7, 2022", "description": "Veterinary science has advanced rapidly in the past decade—and there are several new treatments that can benefit pets. Here are four exciting advancements in vet science.", "articleBody": "Reviewed for accuracy on April 22, 2019, by Dr. Katie Grzyb, DVM The past few years have seen a cultural shift in how people are caring for their animals, which has impacted not only the equipment used by veterinarians but also how much research is being done and the number of new treatments being developed. “Societal demands for quality veterinary care have resulted in the expansion and availability of veterinary services, including board-certified specialists in nearly every medical and surgical discipline that is available in human health care,” says Dr. Ryan Cavanaugh, DVM, assistant professor of small animal surgery at Ross University School of Veterinary Medicine and a veterinary surgical oncologist.  “And with the advent of specialty medicine, veterinary scientists have been driven to improve the technology utilized to help treat our companion animal patients more effectively,” says Dr. Cavanaugh. Some of the areas that veterinary science is delving into are 3-D printing, advancements in prosthetics and laser surgery, and the use of cannabidiol (CBD). 3-D Printing as a Tool for Veterinary Science The veterinary science industry is just starting to really explore the possible uses for 3-D printing, as it has become more accessible and affordable in the last decade. “Ten years ago, 3-D printers were expensive to purchase, and the software to run them was complex and costly,” says Dr. Rory Lubold, DVM, who actively uses 3-D printers in his practice at Paion Veterinary. “Prior to the entrance of 3-D printing into the veterinary science space, we were using books and 3-D renderings on computers—but this comes with the inherent limitations of not being able to visualize all aspects of an object,” says Dr. Lubold. Dr. Lubold says that there are a number of companies providing complete printing solutions today. They take CT images from hospitals, create a printed model and then send them back to the hospital, which makes getting 3-D models a very easy process for any hospital with access to a 3-D scanner (such as CT or MRI). Nowadays, 3-D models are being used extensively in orthopedics. “This helps surgeons to have a physical object to evaluate fractures and plan procedures, and there is at least one company (Orthopets) doing some really great work with 3-D printing to help with developing custom prosthetics,” says Dr. Lubold. Dr. Lubold says that 3-D printing is also commonly being used by veterinarians to help them visualize normal and abnormal anatomy as a part of soft-tissue surgical planning and vascular surgery. They will also use the 3-D renderings for the evaluation of cancerous masses for removal. Advanced Veterinary Care With Prosthetics For many decades, the use of prosthetics in vet science was limited to the setting of an exoprosthesis, where an external “splint-like” device is fashioned over a portion of an animal’s limb. These splints have been used to either stabilize that region or provide length to serve as an extension of the limb after partial amputation of an extremity, explains Dr. Cavanaugh. “Over the past five to 10 years, the veterinary scientific community has initiated quality research endeavors that have resulted in significant progress with regard to harnessing prosthetic technology,” says Dr. Cavanaugh. He uses prosthetic engineering to develop implantable biomaterials to reconstruct bone defects after they have been removed to treat a tumor. The field of medical prostheses has benefited extensively from 3-D printing, according to Dr. Cavanaugh. “Complicated prosthetics are able to be designed, printed and then manufactured into an implantable medical device that can be used to reconstruct sections of bone that were lost secondary to accidental trauma or even from purposeful removal when treating a tumor involving bone.”  “And although veterinarians have only recently embraced this technology, there have already been incredible reports of practitioners reconstructing patients’ skulls and facial bones after surgery to remove tumors and saving limbs that would have otherwise needed to be amputated,” says Dr. Cavanaugh. Using Lasers in Surgery and Healing Laser surgery is rapidly evolving in the veterinary profession, and its use is increasing every year—with the biggest boom occurring over the past decade. However, since the equipment is quite expensive and requires specialized training to use, surgical lasers are still found more commonly in Veterinary Surgical Referral Centers, like university teaching hospitals or specialty surgery centers, says Dr. Benjamin Colburn, DVM, from Palm Springs, Florida.  While the surgical laser has many applications, Dr. Colburn says it’s most often used to reduce pain and provide a quicker healing time in elongated soft palate surgeries and to remove sarcoids (locally invasive tumors) from horses. Laser therapy uses a very different type of laser than the one employed for surgeries. In simple words, the light emitted by this laser heals and changes tissue, rather than cutting into it, according to Dr. Colburn.  The technology itself isn’t new—Dr. Colburn explains that therapeutic lasers first appeared in medical literature back in 1968. But the use of laser therapy has exploded recently, and there are more companies than ever making therapeutic lasers.  “Lasers have allowed another noninvasive option for pain relief in animals,” says Dr. Colburn. “In certain cases, where pets have comorbidities (like liver and kidney problems) and can’t take pain medication because of the contraindications of some of those drugs, laser therapy is a valid option to consider for those patients.” Integrating Cannabinoids in Veterinary Care Cannabinoids have steadily become more common in human medicine, but until recently, there were only few studies about their benefits in veterinary medicine; however that, too, is rapidly changing. “The use of cannabinoids has evolved greatly over the past decade, although it has been used for hundreds of years for medicinal purposes,” says Dr. Joe Wakshlag, DVM, an associate professor at Cornell University who recently conducted a clinical trial on the use of cannabinoids on dogs with osteoarthritis. “The discovery that cannabidiol, or CBD, can stand on its own as a treatment option without THC, which is the psychoactive component, has gone a long way to make treatment more accepted in veterinary medicine,” says Dr. Wakshlag. Today, the use of cannabinoids has completely changed the way clinicians can treat osteoarthritis and multi-joint pain in pets, according to Dr. Wakshlag. “I had an owner literally crying in my office two days after starting the oil because her dog came up the stairs and slept in her room for the first time in two years,” Dr. Wakshlag says.  In fact, Dr. Wakshlag believes CBD oil is as good or better than many of the traditional prescription pet medications currently in use for pain management. “Right now, we are doing three clinical trials in oncology, seizures and post-operative pain management; we believe it will be an effective tool for addressing these areas of veterinary medicine, and our preliminary oncology studies show great promise.”  By: Diana Bocco Featured Image: iStock.com/kozorog"}]