[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Type of Dog Carrier Do You Need?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/small-dog-pomaranian-spitz-in-a-travel-bag-on-board-of-plane-focus-picture-id1011834458.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/small-dog-pomaranian-spitz-in-a-travel-bag-on-board-of-plane-focus-picture-id1011834458.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/what-type-dog-carrier-do-you-need"}, "datePublished": "January 14, 2019", "dateModified": "September 7, 2022", "description": "When it comes to traveling with your dog, it is important to have the right dog carrier. Learn how to pick the best dog carrier option for you and your pup.", "articleBody": "Image via iStock.com/nadisja By Rebecca Desfosse Do you enjoy taking your dog on exciting adventures? Or do you just need a safe way to take her to the vet? Either way, a good dog carrier is essential. There are so many types of dog carriers available that it’s easy to get overwhelmed when trying to find the best carrier for your dog. According to dog trainer and founder of Fun Paw Care, Russell Hartstein, CDBC, you don’t have to worry about finding one perfect dog carrier that works for all situations. “Many families have more than one carrier—one for travel [and] one for the vet,” he says. In fact, you likely won’t use the same dog carrier for strolling around the neighborhood as you would for traveling on an airplane. So, let’s break it down and explore how to determine which type of dog carrier (or carriers) may be the best fit for you and your dog. Measure Your Dog First First, you’ll need to measure and weigh your dog so you can choose the right size dog carrier. For hard and soft dog carriers, you’ll need to choose a carrier that’s big enough for your dog to stand up in and turn around. Measure from the tip of his nose to the base of his tail and add 3 inches. Then, measure him from the top of his head to the ground and add 3 inches. For wearable carriers, like a dog backpack or a sling dog carrier, your dog doesn’t need much extra room to move around. However, these dog carrier bags will most often specify a maximum weight, so you’ll need to keep that in mind as well. Consider What You’ll Use the Dog Carrier For Next, think about how and where you’ll use the dog carrier most. Are you looking to take your dog on a plane? Or maybe you need a safe way to transport your pup in the car. According to Erin Terjesen, a PR representative for Sherpa, airlines have strict regulations for pet carriers regarding size and constriction. Sherpa works in partnership with all major airlines to ensure that Sherpa dog carriers—like the Sherpa Original Deluxe pet carrier—are guaranteed to board with no stress or hassle. It’s always a good idea to check with the airline for their specific rules and regulations regarding pet travel. Car travel has its own set of safety concerns. “We buckle in our kids, but a poorly designed carrier can actually be more dangerous in an accident,” says Nicole Ellis, certified professional dog trainer, American Kennel Club CGC evaluator and APDT trainer. Make sure that the dog carrier you are considering passes third-party crash tests—like the Sleepypod Air in-cabin dog and cat carrier, which has been certified by the Center for Pet Safety. Choose a Style Dog carriers come in several basic styles. Here are each of the styles explained a little more in-depth: Hard-Sided Dog Carrier Hard dog carriers or travel dog kennels, like the Frisco plastic kennel, provide the best protection for your dog. “These types of carriers are often used more for longer travels” says Hartstein. Think plane, train, boat and long car rides. They can work for any size dog but are especially useful for medium-size and large dogs who don’t fit into other types of dog carriers. They’re also tough enough to stand up to heavy chewers and escape artists. Soft-Sided Dog Carrier Soft dog carrier bags, like the Frisco basic pet carrier, are more often used for small to medium-size dogs and are best used with a dog that is a known good traveler. Nervous travelers or dogs that will try to escape by digging or chewing should not be put in soft-sided dog carriers. “These have more casual uses—[going] around town, [to a] restaurant, out and about, and shorter distances,” says Hartstein. Soft-sided dog carriers are easier to carry than hard carriers and are much more portable and convenient. They’re perfect for traveling when you’ll be in arms reach of your dog at all times. Dog Carriers With Wheels Wheeled dog carriers, like the Sherpa Ultimate on wheels pet carrier, make traveling with a pet a whole lot easier on your back and shoulders. Since the carrier can also be pulled behind you smoothly on wheels, it can keep your dog from being jostled around. Wheeled dog carriers aren’t intended for hiking or rough terrain but are an excellent choice for city walking or airplane travel. Dog Backpack Carriers Backpack carriers for dogs, like the Outward Hound PoochPouch dog backpack, are also portable and convenient options for carrying your dog around with you. They’re perfect for small to medium-size dogs who love to be a part of the action. In a dog backpack, they can enjoy the sights and sounds along with you during your outings. “They’re an easy way for our dogs to join on our adventures when it may be a bit too much for them to always be running alongside us. I also love taking it hiking—just in case someone injures a paw, I have a safe, easy way to get them back home safely,” says Ellis. Slings for Carrying Dogs Sling dog carriers, like the FurryFido reversible pet sling, are great for little dogs, whether they are young or a senior. “A sling can be bumpy as you walk, so make sure your pet is in the sling securely and won’t bounce out. When [you are] rushing around the house or town or have a very young dog with you who you want to see sights of the city (without touching the floor if they are pre-vaccinations), a sling can be a great way to stay by your side,” says Ellis. Dog carriers aren’t just for tiny dogs or senior dogs who need some help getting around. Finding the right type of carrier is essential for airplane travel, car travel or just taking your pup along with you on your adventures."}]