[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Empathize With Other Dogs&#039; Emotions?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/two-puppies-sleeping-picture-id954391066.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/two-puppies-sleeping-picture-id954391066.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/pet-lover/can-dogs-empathize-other-dogs-emotions"}, "datePublished": "May 7, 2019", "dateModified": "September 7, 2022", "description": "Find out if dogs can recognize other dogs’ emotions and empathize with them.", "articleBody": "Reviewed for accuracy on May 7, 2019, by Dr. Jennifer Coates, DVM If you have a dog, you’ve probably had an emotional connection with them. Most dog owners claim that their pups are incredible at empathizing—picking up on their emotional cues and taking action to make them feel better when they’re sad or distressed. And the evidence isn’t just anecdotal; a 2018 study on dog empathy found that when their owners made distressing sounds—like saying “help” or crying—dogs would try to reach them much faster than if they made neutral sounds. It was also discovered that the higher the dog scored on a “bond test” (which measured the level of attachment a dog felt to their owner), the faster they’d try to reach them when they were in distress. Dogs oftentimes mirror our emotions, says Russell Hartstein, certified dog behaviorist, dog trainer and founder of Fun Paw Care. So clearly, dogs can empathize with humans. But can dogs feel sympathy for other dogs? Can Dogs Read Other Dogs’ Emotions? “I would argue that yes, dogs may have empathy for other [dogs],” says Hartstein. And while there isn’t a large amount of research on dog empathy, there is one promising study that explores how dogs react to other dogs’ emotions. In a 2017 study, researchers from the University of Vienna sought to test how dogs would react to human and dog emotions. The researchers had pet owners bring their dogs into a laboratory that was equipped with speakers at different points in the room. The researchers then played a series of human and dog sounds. For human emotions, they used laughing (positive) or crying (negative). For dog emotions, they used lighthearted and playful barking (positive) and dog whining (negative). They also played neutral sounds, like nature sounds or a person speaking in a neutral voice. The researchers then observed whether the dogs paid greater attention to the positive, negative or neutral audio. They also looked to see whether the dogs showed signs of distress, like paw licking, whining or barking. The researchers tallied the behaviors and assigned a “score” to each auditory cue. The study found that dogs paid more attention to emotional auditory cues than neutral ones. Even more tellingly, they found that dogs scored significantly higher when exposed to negative auditory cues, which implies that dogs can differentiate between positive and negative emotions in both humans and other dogs. They also found that dogs show higher levels of distress when exposed to negative emotions. According to the study, there was no difference in emotional reactions when dogs heard human sounds compared to when they heard dog sounds. While this study isn’t irrefutable proof that dogs experience empathy for other dogs, it certainly makes a strong argument that dogs have the ability to empathize with other canines. But Hartstein cautions, “[A dog’s] ability—or any animal’s ability—to put themselves in another’s shoes to experience what [another dog] is feeling or experiencing is not possible to measure.” Do Dogs Have More Sympathy for Dogs They Know? So, the study shows that dogs have strong reactions to hearing other dogs in distress. But what about their dog friends? If they share a home with another dog, will they have more empathy for them versus a dog they do not know? The same study suggests that dogs do empathize even more with their canine housemates. Researchers from the study explored whether dogs would behave any differently when played emotional auditory cues of unfamiliar dogs versus dogs they shared a home with. They found that the dogs showed much higher levels of stress (and scored higher overall) when played negative auditory cues from their dog friends. How to Encourage Empathy Within Your Dog If you want to encourage your dog to be more empathetic—to you, your family and to your other dogs—it starts with you. “My suggestion for creating more empathy in your pet is working on a respectful, kind relationship. This can mean simply hanging out, spending time together, and enjoying walks and playtime that is nurturing and kind,” says Dr. Jim D Carlson, DVM CVA CVTP, owner of Riverside Animal Clinic McHenry and Grove Animal Hospital &amp; Holistic Center in Chicago. “Truly connecting with the human-animal bond will help you start to spot some humanlike emotions in your pet.” If you want to encourage more empathy between your dogs, foster your relationship with each dog and encourage their relationship and interactions with each other. “Dogs develop their own relationships within their pack. Encouraging positive behavior, comfort and fun will help dogs bond over time,” says Dr. Carlson. And don’t be surprised or discouraged if your dog’s way of showing empathy is different than yours. “Dogs have their own cues for reading emotions in each other. Many of them are physical. But they will also seek each other out during times of stress or emotion.” So, if you notice one dog licking the other’s face after a trip to the vet or rubbing his body against the other during a thunderstorm, recognize it as their way of showing empathy. If you want that empathy to continue, reward the behaviors with plenty of praise. By: Deanna deBara Featured Image: iStock.com/RedThinkHead"}]