[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is a Christmas Cactus Poisonous to Dogs?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-511790666.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-511790666.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Holidays, Christmas", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/poisons/-is-a-christmas-cactus-poisonous-to-dogs"}, "datePublished": "October 7, 2022", "dateModified": "January 26, 2023", "description": "Dr. Sandra Mitchell breaks down everything you need to know about the Christmas cactus–including whether it is toxic to dogs.", "articleBody": "With all the festive items we bring home for the holidays, our house can become a winter wonderland with lots of new things for our pets to explore! With so many changes, it can be hard to keep track of what is safe for our pets and what is poisonous to them. Read on to learn about Christmas cactuses, as well as some of the other plants that may be part of your holiday cheer. Are Christmas Cactuses Poisonous to Dogs? The good news about the Christmas cactus is that it is not toxic to our pets. The other important thing to know is that it isn’t actually a cactus at all; it’s a plant called an epiphyte, which doesn’t have the spines traditionally found with a cactus, so it won’t cause your pet any injury. That being said, eating any plant could irritate your dog’s gastrointestinal tract—the fiber and roughage from the plant might trigger a bout of vomiting, nausea, diarrhea, or constipation. If this occurs, for most pets this will be minor and short-lived. However, if your pet is sensitive or eats a large amount, it could be more severe. When in doubt, seek the advice of your veterinarian. What to Do If Your Dog Eats a Christmas Cactus If your dog did decide that the Christmas cactus looked tasty enough to sample, a call to your veterinarian is in order. While it may be fine to monitor your pet, it’s always best to keep your vet informed. Even for mild symptoms, the vet may recommend bringing your pet in, just to be on the safe side. And if your pet really seems to not be feeling well, is very young or very old, or has any additional health problems, chatting with your veterinarian to determine the best next step (if any) is ideal. What Holiday Plants Are Poisonous to Dogs? While the Christmas cactus is considered to be non-toxic, many other holiday plants can cause much more serious concerns if ingested. These plants include: Mistletoe Holly Daffodil Lily (primarily toxic to cats) Amaryllis Yew Snowdrop Laurel (bay) Christmas tree (causes oral irritation)         Poinsettia (causes oral irritation) Many more plants are either considered toxic or, at a very minimum, cause discomfort for your pets if eaten—so be sure to do some research before bringing new greenery into the house. Since some plants are more dangerous than others, and a plant’s scientific name (made up of the plant’s genus and species) is much more helpful than its common name to identify it, keep the tags that come from the store for reference. Taking a photo of the plant (or what is left of it) might also help your veterinarian or poison control expert identify it.  If you know that your pet has eaten a plant, particularly one that might be toxic, notify your veterinarian for advice right away and have the number of the local emergency clinic handy, just in case Time matters with a possible poisoning. Call as soon as you suspect a problem. How to Keep Dogs Safe During the Holiday Season There are many ways to enjoy holiday greenery without putting your pets at risk. One way is to choose pet-friendly plants, like the Christmas or Easter cactus. These come in a variety of colors, can be small and compact or grow quite large, and are safe even if your pet decides to nibble. For plants that are considered mostly non-toxic but may cause irritation of the GI tract, place the plant where your pets can’t reach it. This might mean putting it on a shelf, such as with a poinsettia, or using a pet fence, such as in the case of a Christmas tree. For the right situation, you might even install an indoor invisible fence to protect both your pet and your greenery. Then there are some plants that are simply best not kept in the house if you have pets (refer to the list above), or at the very least kept well out of the reach of curious mouths and paws. With a little research, the holiday season doesn’t have to be dangerous for your pets. Knowing which plants are safe, as well as whom to call should your pet be exposed, gives you a great head start to a healthy holiday for all! Featured Image: iStock.com/Nadezhda_Nesterova"}]