[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Are Hydrangeas Poisonous to Dogs?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1722985385.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1722985385.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Safety, Poison, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/poisons/are-hydrangeas-poisonous-to-dogs"}, "datePublished": "October 30, 2023", "dateModified": "October 30, 2023", "description": "Hydrangeas are beautiful, flower-producing shrubs that have broad, flat green leaves and a large flower bunch that can come in a variety of colors, including pink, red, blue, purple, and white. However, are they toxic to dogs? In this article, Dr. Barri Morrison breaks down hydrangea toxicity in pups.", "articleBody": "Hydrangeas are beautiful, flower-producing shrubs that have broad, flat green leaves and a large flower bunch that can come in a variety of colors, including pink, red, blue, purple, and white. All parts of the hydrangea plant—including the buds, flowers, leaves, and stems—can cause toxicity in dogs, cats, and horses. What Is Hydrangea Poisoning in Dogs?  Also called the hortensia plant, hills of snow, or seven bark, hydrangeas contain a toxin called amygdalin, which is a cyanogenic glycoside. Cyanogenic glycosides are toxic compounds also found in almonds, apple, and pear seeds, and pits from cherries, peaches, apricots, and plums. Although they rarely cause severe toxicity in dogs, cyanogenic glycosides commonly cause mild stomach upset and signs such as lethargy, vomiting, and diarrhea. The highest concentration of amygdalin is found in a hydrangea’s leaves and flowers, and a large ingestion of hydrangeas can cause cyanide poisoning. When a dog chews the hydrangea plant and ingests amygdalin, the chemical is metabolized in the dog’s body to produce cyanide. Cyanide causes toxicity in dogs by reducing the body&#039;s ability to use oxygen. The exact amount of hydrangea needed to cause toxicity is not currently known. Because of this, contact your veterinarian or the Pet Poison Helpline at (855) 764-7661 if you believe your dog has ingested any amount of this flowering plant. How Many Hydrangeas Are Toxic to Dogs?  This condition has not been studied extensively because cyanide toxicity from hydrangeas is so rare in dogs. Because this toxicity is dose-dependent, smaller dogs are believed to be at higher risk than larger dogs. A smaller dog could ingest less than a larger dog and show signs of toxicity. Symptoms of Hydrangea Poisoning in Dogs  Signs of cyanide poisoning can occur within 15 or 20 minutes of a large ingestion of hydrangeas. Watch for: Increased heart rate Fever Excitement (wagging of the tail, bouncy gait, whining, or whimpering) Rapid breathing Drooling Watery eyes Urinary or fecal accidents Muscle spasms Bright red, then blue gums Signs that your dog ingested a smaller amount of hydrangea can include: Lethargy Vomiting Diarrhea Depression Decreased or loss of appetite Abdominal pain What Should I Do if My Dog Eats a Hydrangea? Call your veterinarian or the Pet Poison Helpline if your dog has ingested any amount of any part of the hydrangea shrub. If a large amount of the hydrangea plant has been ingested, time is of the essence. Toxicity will worsen as your dog continues to absorb the toxin. If your dog is showing signs of mild or severe toxicity and your veterinarian is not available, take them to your local veterinary emergency hospital immediately.  When taking your dog to the veterinarian, bring any part of the plant or flowers with you so it can be properly identified. Your veterinarian will perform a physical exam and check your pup’s baseline blood and urine tests to ensure there are no other health concerns. They might also suggest an X-ray of your dog’s abdomen to rule out other causes of digestive upset. Treatment of Hydrangea Poisoning in Dogs  Treatment of hydrangea toxicity in dogs will depend on your dog’s size and how much they potentially ingested. Mild hydrangea toxicity can usually be treated from home. Your veterinarian will likely prescribe antinausea medications and antibiotics for diarrhea. They may also recommend probiotics to help repopulate the gut with the good bacteria that’s often lost with diarrhea. If your dog is dehydrated or not eating well, your veterinarian may recommend that they stay in the hospital for the day or overnight to receive IV fluid therapy. If your dog’s hydrangea ingestion occurred within the past few hours, your veterinarian might choose to induce vomiting to help decrease the amount of toxin that is absorbed. Never induce vomiting in your pet at home. In severe cases, your dog will need to be hospitalized to receive IV fluids and medications, as well as oxygen therapy if needed. If your dog has a fever, the veterinary team may use cool towels, ice packs, and fans to help decrease it. An ECG monitor and medications might be used if your dog’s heart rate is elevated or irregular. If your dog’s hydrangea ingestion occurred within the past few hours, your veterinarian might choose to induce vomiting to help decrease the amount of toxin that is absorbed. Never induce vomiting in your pet at home.Prognosis of Hydrangea Poisoning in Dogs  Dogs who show signs of severe hydrangea toxicity but haven’t succumbed to the condition after two hours or more will typically recover—unless cyanide continues to be absorbed by the digestive system by prolonged ingestion of the plant. In rare cases, a prolonged elevated body temperature can lead to brain damage. In mild cases, after the vomiting and diarrhea have stopped and the toxin has been removed from your dog’s digestive system, the prognosis for complete recovery is excellent. Your dog’s appetite and mood should also improve quickly after the toxin has been removed. Prevention of Hydrangea Poisoning in Dogs Fortunately, protecting your dog from hydrangea toxicity is simple. Do not leave your dog alone in an area where hydrangeas are located. If you have hydrangeas in your home, keep them far away from your dog’s reach. Many dog lovers also love flowers and plants. Know which plants are safe and which are not, so that you can keep your pup safe. Remember, when in doubt, ask your veterinarian! Featured Image: Eudyptula/iStock / Getty Images Plus/via Getty Images"}]