[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Presidential Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/evr_multi_presidential_pets"}, "datePublished": "February 16, 2009", "dateModified": "August 31, 2022", "description": "Nearly everyone you know has a pet. Your boss. Your hairdresser. Yes, even your mailman (although he probably leans towards the feline persuasion). But did you know that nearly all of our 44 U.S. presidents have had some kind of domesticated animal?", "articleBody": "Nearly everyone you know has a pet. Your boss. Your hairdresser. Yes, even your mailman (although he probably leans towards the feline persuasion). But did you know that nearly all of our 44 U.S. presidents have had some kind of domesticated animal? President Obama has Bo, a Portuguese Water Dog, and according to the Presidential Pet Museum, well over 200 pets have resided in the White House, and it was only recently that the pets  became more conventional in nature.  Presidents have brought cows, horses, canaries, goats and raccoons to the White House. Probably the most unusual pet was an alligator, which was given to President John Quincy Adams by Marquis de Lafayette, a French military officer who served in the Continental Army under George Washington. About 12 years later, Martin Van Buren, our eighth president, was gifted a pair of tiger cubs by the Sultan of Oman. But alas, the cubs&#039; time at the White House was short-lived -- Congress bade President Van Buren to send them to the zoo.  Speaking of zoos, President Calvin Coolidge showed a sense of style and panache when it came to acquiring pets. Upon the death of President Warren G. Harding, Coolidge took over the presidency and assembled a menagerie that would rival most zoo collections. Among the curious creatures, Coolidge had a goose, a wallaby, a donkey, a bobcat, lion cubs, raccoons, a pigmy hippo, and a bear. There were also the popular presidential pets -- Socks the cat (President Clinton), Macaroni the pony (President Kennedy&#039;s daughter, Caroline), and Fala the Scottish Terrier (President Franklin D. Roosevelt) -- each of which would receive thousands of fan letters from the American public. Some may ask, why have some of our most powerful and distinguished U.S. presidents sought the companionship of a pet? Doesn&#039;t the leader of the free world have enough on his plate? &quot;It is pretty much the reasons most people get an animal,&quot; says Claire McLean, founder and president of Presidential Pet Museum. &quot;Pets are non-judgemental, loving, and utterly devoted. Animals give warmth and privacy. They don&#039;t talk back, they relieve stress, and most importantly, they are the president&#039;s best friends.  The Presidential Pet Museum, which opens its doors to nearly 70,000 visitors per year, was founded in 1999 &quot;as a repository and means of preserving information, artifacts, and items related to the Presidential Pets.&quot; With over 500 items of interest, including portraits of presidential pets (some even made from their own hair), the museum is part of the Presidents Park, located in Williamsburg, Virginia. To learn more about the museum and other curious facts about presidential pets, please visit www.PresidentialPetMuseum.com. "}]