[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chlorine in Pools: Is it Safe for Pets?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/chlroinedog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/chlroinedog.jpg"}, "author": {"@type": "Person", "name": "Jessica Vogelsang, DVM", "url": "https://www.petmd.com/author/dr-jessica-vogelsang"}, "keywords": "Dog, Safety, Hot weather", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/chlorine-pools-it-safe-pets"}, "datePublished": "May 17, 2016", "dateModified": "August 31, 2022", "description": "Pool owners likely use chlorine to keep their pools maintained. But what is chlorine? What does chlorine do? And is chlorinated water safe for pets? Find out whether chlorine poisoning is something to worry about for your pet.", "articleBody": "By Jessica Vogelsang, DVM As temperatures rise and a hairy creature’s thoughts turn to summer swimming, owners across the country are asking themselves: is it ok for my pet to take a dip in the family pool? As pet owners become more educated and inquisitive about the effects of various chemical exposures in their pet’s day-to-day life, it’s natural for people to wonder if chlorine poisoning is possible in pets. Here’s what you need to know: What is Chlorine and What Does Chlorine Do? When added to water, chlorine breaks down into hypochlorous acid and hypochlorite ion. These chemicals oxidize microorganisms in water by breaking down the cell wall and destroying the structures inside. Without chlorine, pools quickly turn green or even black as algae and bacteria build up in the water. Is Chlorine Toxic for Dogs and Cats? Like many chemicals with the potential to be dangerous, the hazards of chlorine exposure are dose dependent. Pool water contains very dilute levels of chlorine, and is unlikely to cause chlorine poisoning in humans or animals. From a risk management standpoint, a pet is more likely to become ill from a dunk in a standing pool of water, or a lake filled with unknown microorganisms such as amoeba, than they are from swimming in a properly maintained pool full of chlorinated water. Chlorine Tablets: Keeping Your Pets Safe The biggest risk to both pets and people are related to handling the chlorine in its concentrated form before it is placed in the pool. Chlorine tablets should always be stored in their original containers and kept in a safe place inaccessible to pets and children. Chlorine gas can be dangerous if inhaled, and direct contact with undiluted chlorine can damage skin and eyes. It would be very unusual for a pet to ingest chlorine tablets as the scent is often unappealing to dogs and cats, but proper storage should eliminate the risk of chlorine poisoning entirely. What Are the Risks of My Pet’s Exposure to Chlorinated Pool Water? Drinking chlorinated water may cause minor GI irritation, but it should not cause serious issues for pets. Pets who love to gulp water as they paddle should be discouraged. Fortunately, most symptoms related to chlorine are minor. Pets who swim for long periods in chlorinated pool water may exhibit some signs of sensitivity, such as red eyes or itchy skin. Pools with high levels of chlorine may cause irritation to the airways due to the release of chlorine gas, particularly in poorly ventilated areas. Pets who swim regularly may experience more frequent ear infections. While owners may wonder if this is related to chlorine exposure, recurrent infections are more likely related to damp ears than the chlorine itself. Your veterinarian can recommend a drying solution to use after swimming if your pet is prone to recurrent ear infections. Are There Chlorine Alternatives For Pool Owners? Bromine is the most common chlorine alternative for pool and spa use. A close cousin to chlorine, bromine has a less pungent odor and less prominent bleaching side effects. People who find chlorine irritating to their eyes or skin report that bromine is less likely to cause these symptoms. While people may prefer bromine because of these milder properties, it is more expensive than chlorine and also less stable when exposed to sunlight, which makes it a poor choice for outdoor pools. A pool care professional can guide you as to whether bromine is a good choice for your situation. Other Pool Safety Risks for Pets When it comes to swimming, the biggest health risk for any pet is drowning. Although people mistakenly assume a dog’s instinctive paddling behavior means all dogs are water-safe, dogs can panic, tire, and drown in any body of water, chlorinated or not. Owners should always supervise pets when swimming, which allows you to spot any minor problems before they become major ones, whether it’s a cough, exhaustion, or red eyes. With a little monitoring and attention to your pet’s behavior, there’s no reason you can’t all enjoy a nice summer dip."}]