[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Get Sunburned?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-sunscreen.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-sunscreen.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Hot weather", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/can-dogs-wear-sunscreen"}, "datePublished": "June 1, 2020", "dateModified": "August 31, 2022", "description": "Do dogs need sunscreen? Find out whether dogs can get sunburned and how to protect your dog from sun exposure and heat.", "articleBody": "Reviewed and updated on June 1, 2020 by Dr. Jennifer Coates, DVM  Whether we’re hitting the beach, taking the field at a ball game, or simply heading out for a walk, we know that during the summer months, wearing sunscreen is key to our health and safety. But what about our four-legged friends? In addition to providing your dog with access to shade and hydration during the summer months, sunscreen should be part of your warm-weather care routine. Should I Worry About My Dog Getting Sunburned? Just like us, dogs can get burned from sun exposure, particularly on parts of the body that are sparsely covered with hair. Millie Rosales DVM, DACVD, of Miami Veterinary Dermatology, says that a sunburned dog can suffer from red, inflamed skin that becomes irritated and painful. Sunburns on dogs can also lead to hair loss and scaly skin. Do Dogs Need Sunscreen? Yes, you should put sunscreen on your dog. “It’s actually very important to put sunscreen on dogs, especially those with light skin and white fur or hair,” says Richard Goldstein, DVM, and chief medical officer of the Animal Medical Center in New York City. “A dog’s skin can be damaged by the sun just like our own, so they require the same protection against the development of sunburn and skin cancer.” Dr. Rosales points out that the types of skin cancer in dogs that can be associated with sun exposure include: Squamous cell carcinoma Malignant melanomas  Hemangiomas  Hemangiosarcomas She urges that if a dog has to be outdoors during peak sun exposure hours (10 a.m. to 4 p.m.), sunscreen should be reapplied to sun-sensitive areas of the body—the nose, around the lips, tips of the ears, the groin, and the belly—throughout the day. Dr. Goldstein says if the dog has gone swimming, the sunscreen should be immediately reapplied. What Is the Best Sunscreen for Dogs? The safest and most effective sunscreen to put on your dogs is one that is specifically designed for canine use, says Dr. Rosales. These sunscreens are designed with dogs in mind and don’t pose any health risks. If dog sunscreen isn’t available, Dr. Goldstein says that pet parents can purchase a broad-spectrum sunscreen for babies and children with an SPF of 15 or higher. Make Sure It Is Pet-Friendly It’s EXTREMELY important for pet parents to read the labels on baby sunscreen before applying it, since dogs may lick their skin and accidentally ingest the sunscreen, many of which contain ingredients that are potentially toxic if ingested. “When choosing baby sunscreen, pet owners should choose a fragrance-free product that doesn’t contain zinc oxide,” Dr. Rosales explains. “Ingestion of zinc oxide can lead to hemolytic anemia.” Titanium dioxide is widely regarded as being a safe active ingredient in sunscreens for dogs, but when in doubt, ask your veterinarian for a recommendation. Never apply tanning lotions or oils to your pet. How to Apply Your Dog’s Sunscreen “Pet owners may want to apply the sunscreen to a small area on the body first to see if it causes a reaction before using it all over the body,” Dr. Rosales says. She adds, “When applying sunscreen to the face region, it is important to be careful with it getting into the eyes.” After applying sunscreen, allow the lotion or cream to soak in or set for several minutes, and monitor your dog to be sure they doesn’t lick it, says Dr. Rosales. Which Dog Breeds Are More Likely to Get Sunburned? “White dogs with short hair, like Bull Terriers, Pit Bulls, Dalmatians, French Bulldogs, Greyhounds, and Boxers, are more susceptible to sunburn than dogs with darker skin and thicker coats,” Dr. Goldstein points out. Still, even though these breeds are more likely to burn, all pet parents should consider the use of sunscreen for their dogs in the summer. Additional Heat and Sun Protection for Dogs If your dog has to be outside during peak sun hours, you can also utilize accessories like bodysuits, shirts, and hats with ultraviolet protection to prevent sunburns. Dog goggles can also be used to protect your pet’s eyes from the sun, which is particularly important if your dog has been diagnosed with an eye disease known as pannus.  Tips to Protect Your Dog From Sun Exposure and Heatstroke While adding sunscreen to your dog’s summertime safety routine is a good idea, you should still be aware of the risks associated with excessive sun exposure. In addition to potential sunburns, dogs can also experience heatstroke in the summer. Making sure your dog has access to water and shade is an essential part of keeping your pet safe on hot days. “The use of sunscreen should not give pet owners the sense of security that their pet will not get skin cancer,” Rosales says. “Keeping a dog indoors from 10 am to 4 pm is the best way to protect from the sun’s harmful rays.” Image: lazyllama via Shutterstock"}]