[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Grill Safety for Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/grill-safety-for-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/grill-safety-for-pets.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/grill-safety-pets"}, "datePublished": "July 8, 2016", "dateModified": "August 31, 2022", "description": "Grilling is a favorite past time, but barbecues may pose dangers for pets. Learn the risks associated with grilling and some safety tips for grilling around pets.", "articleBody": "By Aly Semigran Firing up the grill is one of the best—and, let’s face it, most delicious—outdoor activities to partake in during the summertime. While grilling up meats and veggies can be a wonderful treat for family and friends at a cookout, it can be a dangerous activity if you have dogs or cats. Of course, you don’t have to skip out on BBQ season if you are a pet parent. Rather, take the proper precautions to ensure that you and all your guests (furry, or otherwise) have a safe experience this summer. By following this simple, but efficient guide, you’ll be able to grill up some yummy foods, all while ensuring your cat or dog is out of harm’s way. The Risks of Grilling Around Pets There are multiple risks when it comes to grills in pets, including the possibilities of burns, skin irritations, eye trauma, choking, and ingesting harmful foods, bones, and objects, such as grilling tools.  How to Keep Your Pet Safe Around the Grill The National Fire Prevention Association states that all grills should be kept at least three feet away from pets and children. The same goes for keeping charcoal fluid out of their reach, which can be toxic if ingested. You should never leave your grill unattended, as curious pets could make their way over to the area and accidentally cause harm to themselves or others. Of course, if a cat or dog does find their way to the vicinity of the grill, you’ll want to be as prepared as possible in terms of their safety and protection against possible injuries. The NFPA states that fat and grease buildups should be trapped below the grill, and removed. According to Dr. Robin Bohaty, DVM, of Roscoe Village Veterinary Hospital, ingestion of grill drippings “could lead to severe gastrointestinal upset or even pancreatitis, which can be a very serious or even deadly condition in some pets.” It’s also essential to keep grilling tools and items away from pets, as they could cause serious harm, too, Bohaty notes. If wood or metal skewers are accidentally ingested, it could puncture their gastrointestinal tracts, resulting in surgery, or even death. Other grilling-related items to keep away from pets include aluminum foil and plastic wraps, which, if ingested, can cause intestinal blockage. This rule doesn’t just apply to cats and dogs, either, as Dr. Barton C. Huber, DVM, of the Animal Medical Center of Corona points out. He recalled one incident in which a patient’s sulcata tortoise ingested aluminum foil which blew away in the backyard at a BBQ. “Aluminum foil does not show up on X-rays,” warns Huber, who had to give the constipated tortoise a laxative to pass the foil. If a Pet Ingests Harmful Foods or Items Bohaty says some of the most harmful foods for pets are common ones we find on our grills, including raw meats , bones, onions (which are toxic to dogs and cats and can lead to stomach issues and anemia), and corn-on-the-cob. Bohaty points out that the corn itself is not harmful, rather the whole cob which is too large to be digested properly and could require surgery to remove if ingested. “Bones from meat (chicken, pork, beef) can cause damage to the intestinal tract when swallowed,” Bohaty adds. Cooked bones also tend to splinter, which could result in “sharp pieces that can ulcerate and/or puncture esophagus, or intestines.” Even if you know not to feed your pets your BBQ scraps, the same can’t be said for your guests. “Other people are going to feed your animals,” Huber warns, which is another reason to keep them away from the grilling area and the party itself. If a pet does choke on food or other items, Huber says that any pet parent trained in the heimlich maneuver should attempt it, but should immediately head for their vet afterwards, even if the item was removed. Other non-grill items that may be present at a BBQ and are also harmful to pets include avocado, grapes, chocolate, chives, garlic, raw eggs, and alcohol, so these foods and drinks should be kept away from dogs and cats at all times. Bohaty recommends that when discarding these foods, they should be placed in a tight-fitting, lock-lid container, so that pets cannot get to them. If your pet has ingested any of the harmful foods or grilling items listed, take them to get veterinary care immediately. If a Pet Gets Burned By a Grill “First, extinguish any flames that may be present,” Bohaty points out. “Next, remember that your pet is likely scared and in pain and may not be acting like [his] normal self, so approach with caution and avoid getting scratched or bitten.” Dr. Kevin Windsor, DVM, of Beverly Hills Veterinary Associates, says that the next step is to carefully clean the burn area. “Rinse [the burn] immediately with cold water, cover the area with a light bandage to prevent the [animal] from licking [the area] and take the pet to an emergency vet,” he says.  Image: tiverylucky via Shutterstock"}]