[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cold Weather Hazards: Rodenticides", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning, Safety, Cold weather", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/evr_dg_rodenticides"}, "datePublished": "May 11, 2011", "dateModified": "August 31, 2022", "description": "Rodenticides, as the poisons are known, can be very effective, but they can also be a source of danger for household pets as well.", "articleBody": "How to Prevent Your Dog from Ingesting Rat Poison in the Winter As temperatures fall into the lower digits, most mammals take refuge in their species-specific homes. Some animals, particularly ones that live in urban and suburban environments, find their refuge within the homes of larger mammals. Such is the case with rats and mice, whose living arrangements often become more obvious in the cold weather months as they search for foodstuff from inside rather than from outside -- as they are able to do when the temperatures are warmer. For most all humans, this is not a welcome arrangement, and they have employed various devices for the eradication of these &quot;pests.&quot; These devices primarily involve mechanical and chemical traps, and poisons. Rodenticides, as the poisons are known, can be very effective, but they can also be a source of danger for household pets as well. Should your dog come into contact with one of these chemical toxins, or in some cases, ingest a rodent that has been poisoned by one of these chemicals, it can become very ill, and even die if not treated immediately or if the level of toxicity is too high and fast acting for your dog to survive. How Rodenticides Work There are several different varieties of rodenticides, and they all work a bit differently. Listed here are the most common types of poisons used. Anticoagulants (indanediones, coumarin) interfere with the body’s ability to produce the proteins necessary for blood clotting, resulting in internal and external hemorrhaging. They are available as powders, pellets, and blocks. Bromethalin affects the cells of the body and their ability to use oxygen for energy. It can also lead to swelling of the brain tissue. They are available as pellets and blocks. Cholecalciferol works by disrupting the balance of calcium in the body, resulting in excess levels of calcium in the bloodstream and eventually kidney failure. Poisons made with aluminum phosphides, zinc, calcium or other ingredients are formulated to damage the kidneys, liver, nervous system, or digestive system. They can be found in many forms as well. What are the Symptoms of Rodenticide Poisoning? In the case of anticoagulant poisons, because bleeding is often internal, you may first notice that your dog appears to be depressed or lethargic, has a decreased appetite, is reluctant to move, and is breathing rapidly. In some cases, external bleeding is present in the form of bleeding from the nose or gums, or blood in the urine or stool. These signs and symptoms can quickly become serious, but how quickly or slowly they progress can vary depending on whether the poison is fast acting or slow acting, how much of the poison has been ingested all at once, or how much has been ingested over a period of time.  Bromethalin poisons, depending on your dog’s size, health and amount ingested, can bring about symptoms within hours, or may take a few days to become apparent. When symptoms do become apparent, they are usually seen as seizures and tremors, weakness and loss of coordination, progressive depression and loss of energy, and vomiting. Severe reactions may also include coma -- complete lack of consciousness. Cholecalciferol is commonly packaged as small pellets. It is considered to be amongst the most dangerous of the rodenticides. Symptoms include weakness, vomiting, complete loss of appetite (anorexia), and an increase in thirst and need to urinate. Other, less common, ingredients can also cause severe toxicity. Poisons made with aluminum phosphides, zinc, or calcium are designed to attack the digestive system, resulting in severe bloat and shock. Some other types of poisons can result in vomiting, and diarrhea, severe abdominal pain, and you may see signs of neurologic damage, such as staggering or seizures. Diagnosis and Treatment of Rodenticide Poisoning If you believe your dog has gotten into a rodenticide, contact your veterinarian immediately. Bring along the box or bottle so that he or she can identify the poison and develop an appropriate treatment plan. Diagnosis of rodenticide poisoning is based primarily on the apparent signs. Blood and X-ray tests can be used to confirm poisoning, but action most often needs to be taken quickly and cannot wait for the results of tests. Anticoagulants are generally the easiest to treat, if caught quickly, since they can often be halted and reversed with vomiting, activated charcoal and vitamin K1. Vomiting will be induced if ingestion was within two hours of the first sign of symptoms or if ingestion was witnessed. If the symptoms are more severe and there are signs of blood clotting deficiencies, your dog may need to be given blood transfusions of whole blood or packed red blood cells to replace the destroyed blood clotting proteins. Bromethalin is more complicated, and is often mistreated. If the dog is treated on the bases of an assumption of anticoagulant poisoning, the other more severe symptoms can go untreated, resulting in progressive damage to the brain as a result of swelling. Vomiting must be induced as soon as possible to remove as much of the poison as possible, and if necessary, stomach pumping and lavage will be used to cleanse the stomach’s contents. Activated charcoal can be used to neutralize any remaining poison in the system, but the prognosis is guarded to poor for dogs that have ingested this type of poison. In most cases, dogs will need to be hospitalized for days with no guarantee of complete recovery. Cholecalciferol can be fatally toxic with only a small amount ingested. As with the other poison, the first priority is to get as much of the poison out of the body as quickly as possible. Induced vomiting, stomach lavage and activated charcoal will all be used if ingestion occurred shortly before the dog has been taken for treatment. Toxicity of this poison requires intensive and aggressive treatment, with IV fluids, diuretics, monitoring of blood calcium levels, in-hospital care and several weeks of treatment to rebalance the blood calcium levels. Even with aggressive treatment, many animals do not survive cholecalciferol poisoning.  The treatment your veterinarian decides on may also depend on how your dog is reacting. If the ingestion was witnessed and is treated immediately, your veterinarian may choose to induce vomiting and give activated charcoal to absorb as much toxin as possible in the stomach, basing further treatments on how your dog responds from there. Additional supportive medications can then be given as necessary to treat any further symptoms. Safety Tips When Using Rodenticides If you do use rodenticides around your home or property, use extreme care in where you choose to place the poison. Dogs are known for trying just about any type of food once, and are just as attracted to the poison as rats and mice are. Keep that in mind as you decide on a good place to lay the poison down.  Even poisons still in their respective containers must be kept in a difficult to reach location. Leaving poisons out in the open where a dog can jump up on the counter and grab it is tragedy waiting to happen. The best, most ideal location for poisons of any kind is in a locked cabinet or box in which neither animals nor children can gain access. Finally, read the instructions on the package thoroughly before laying the poison bait out. Many labels include warnings and tips for handling and storage, amongst other information that can be life saving."}]