[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "12 Holiday Gifts for Pets to Surprise Your Four-Legged Friends With", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/ginger-british-shorthair-cat-in-the-christmas-interior-picture-id487149176%20%281%29.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/ginger-british-shorthair-cat-in-the-christmas-interior-picture-id487149176%20%281%29.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Holidays", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/12-holiday-gifts-pets-surprise-your-four-legged-friends"}, "datePublished": "November 30, 2018", "dateModified": "August 31, 2022", "description": "The holidays are a great time to surprise your dog or cat with some new fun pet supplies. Check out these great gifts for pets for some inspiration for this holiday season.", "articleBody": "Image via iStock.com/elenaleonova By Teresa K. Traverse Our pets are part of our families, and the holiday season is a great time to make them feel extra special. Refreshing your inventory of pet supplies is a great way to keep them happy, healthy and entertained. Check out this list of 12 great gifts for pets for a fun holiday surprise for your beloved furry family members. Frisco Cat Tree With Hammock  The Frisco 78-inch cat tree with hammock makes a great cat gift that keeps on giving. Your cat will be entertained for hours climbing up and around the tree, using the cat scratching posts and taking relaxing catnaps in the hammock. This extra-large cat tree is perfect for an energetic cat or multi-cat families. With ten different sisal-wrapped scratching posts and three dangling cat toys, your furry felines will never run out of activities. Katris Mix &amp; Match Block Cat Scratchers  Katris has turned cat scratchers into fun and stylish home decor. Their cardboard cat scratchers come in a variety of geometric shapes so you can mix and match them to fit your home and create your own custom cat scratcher design. These heavy-duty cardboard scratchers come with securing clips so they can be anchored to a wall or stacked on the ground. They can be combined to form a cat tree, a climbing tower or even a condo furniture system. Each sturdy scratcher is designed to hold up to 300 pounds, so they are great for multi-cat homes. They even include five bags of catnip to help entice your kitty to play! Greenies Feline Catnip Flavor Dental Cat Treats  Cat dental care is an important part of your kitty’s overall health. If you are looking for a tasty way to include dental care in your cat’s daily routine, Greenies feline catnip flavor dental cat treats are a great option. These cat dental treats use a unique shape and delicious crunch to help scrape away plaque and tartar as your feline chews. They’re made with chicken meal as the first ingredient, and they include dried catnip to create a tasty flavor that cats will love. And at just over one calorie per treat, they make the perfect morning, afternoon or nighttime cat treat. Greenies dental cat treats are also certified by the Veterinary Oral Health Council (VOHC)—the gold standard in the veterinary dentistry industry.  Pet Zone Caged Canary Interactive Cat Toy  When it comes to cat gifts, you can never go wrong with a new cat toy. For cats with strong hunting instincts, the Pet Zone caged canary interactive cat toy will make a great holiday surprise. The canary toy inside moves, chirps and flutters like a real bird, so it is sure to get your kitty’s attention and keep her mentally stimulated. The wobbling base helps to keep your cat engaged and keeps playtime going. ViviPet Mykonos Elevated Cat Feeder  Are you looking to upgrade your cat’s feeding arrangements? It might be time to try a raised cat bowl. The ViviPet Mykonos elevated cat feeder has been thoughtfully designed to help create a stylish and functional cat bowl for mealtime. This elevated cat feeder has two removable, shallow ceramic bowls that are set at an angle to help reduce whisker stress. The square side compartment has been included to house cat toys or pet grass to create an all-in-one pet bowl.  To make this durable cat feeder even better, the bowls are microwaveable and dishwasher-friendly. iFetch Mini Automatic Ball Launcher Dog Toy  If you’re searching for the perfect dog gift, you’ll need a present that will provide your pet with endless entertainment and exercise. The iFetch mini automatic ball launcher dog toy will help keep your dog entertained and active while you’re away. With this dog electronic toy, you can set a launching distance of 10, 20 or 30 feet, drop a ball inside the machine, and let your dog play. And with some training, you can even teach your pup to drop the ball inside so he can play until his little heart is content.    GoughNuts TuG Dog Toy  The GoughNuts TuG dog toy has a figure-eight design crafted out of natural rubber that is sure to elevate you and your pup’s tug-of-war playtime. The two handles make it an ideal toy for tugging—your dog can grab ahold of one ring while you safely hold other side. This dog toy is a great option for a holiday gift because it is meant for interactive play with your canine companion. Not only does he get a new toy, but he also gets to spend some quality playtime with his favorite human. USA Bones &amp; Chews Jumbo Bully Stick Dog Treats  If you have a dog that loves to chew, try an edible gift that keeps them preoccupied while engaging in their favorite activity. Bully sticks are functional dog gifts that promote safe and productive chewing habits. The USA Bones &amp; Chews jumbo bully stick is a great option for dogs of any size and is sure to be a hit this holiday season. The 100-percent digestible and extra-thick size will provide your pup with an engaging and challenging chewing experience. Besides relieving your dog of boredom, these bully sticks can also help clean your dog’s teeth by scraping at plaque and tartar as they chew. Each batch is sourced in the United States and free of chemicals, bleach and formaldehyde. Petcube Play Wi-Fi Pet Camera  If you like to keep an eye on your pet while you are at work or out running errands, why not consider a pet camera? These digital lifesavers allow you to make sure your pet isn’t up to no good while you aren’t home, so that you can have peace of mind knowing your furry family member is safe. The Petcube Play Wi-Fi pet camera syncs to your phone and gives you the opportunity to talk to your pet when you’re away. It also has a night vision feature so you can see and check in on your pet at night. You can even “play” with your pet using the built-in laser toy that you can use in real time or during a scheduled play time. Frisco Orthopedic Textured Plush Bolster Sofa Dog Bed  If you have a senior pet or a one that simply loves their nap time, then perhaps a new pet bed is the perfect holiday pet gift. The Frisco orthopedic textured plush sofa dog bed is super comfortable and is sure to create the optimal sleeping spot for your furry family member. The shredded foam filling provides your pet with cushioned support, while the three bolstered edges give your pet the perfect place to rest their head. The bed cover is also removable and machine-washable, so you can keep their new favorite sleeping spot clean and smelling fresh year-round. PureBites Chicken Breast Freeze-Dried Dog Treats  Dog treats are always a welcome surprise for our canine companions. PureBites chicken breast freeze-dried dog treats would make a healthy holiday dog gift for your canine companion. These PureBites dog treats feature just one ingredient—chicken breast. This makes them great dog treats for dogs that may have food sensitivities or a sensitive stomach. They are made using a freeze-drying process that removes the water but preserves the aroma, flavor, texture and freshness. They’re also high in protein but low in calories, at just three per treat, making these good treats for dogs on a diet or for dog training sessions.    PetSafe FroliCat Dart Interactive Automatic Rotating Laser Pet Toy  If you are looking for an engaging cat interactive toy that will get your kitty up and active, the PetSafe FroliCat DART interactive rotating laser pet toy will make a great cat gift. This automatic laser cat toy will keep your cat guessing and pouncing with its 360-degree laser patterns, four speeds and 16 engaging play combinations. It also has an adjustable timer so you can set your kitty up for a future playtime and have it turn off on its own when the play session is complete. Just remember to keep some cat treats on hand as a reward for their hard work and hunting prowess!"}]