[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Irish Dog Breeds for St. Patrick&#039;s Day", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Holidays, Breed", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/evr_dg_st_pattys_day"}, "datePublished": "March 16, 2009", "dateModified": "August 31, 2022", "description": "Call it the power of the shamrock, the charm of the leprechaun, or just the luck of the Irish. One thing is for certain: the great people of the Emerald Isle have produced some of the most curious, independent, and enthusiastic dogs in the world.", "articleBody": "Me Lucky Charms Call it the power of the shamrock, the charm of the leprechaun, or just the luck of the Irish. One thing is for certain: the great people of the Emerald Isle have produced some of the most curious, independent, and enthusiastic dogs in the world. Impress your friends at the pub this St. Patrick&#039;s Day with some fun facts for the most popular Irish dog breeds. The Glen of Imaal is more of a working terrier than a fashionable show dog. One of its original jobs was to dig into burrows to root out nuisance badgers, its weight and strength matching the badger&#039;s, and its powerful tail acting as a handle for being pulled from the hole, if necessary. A member of the Terrier group, the Glen of Imaal is still classified as a working dog, as it remains entirely capable of serving as vermin control. This breed differs from many types of terriers in that it is not a barker.The Irish Setter is a member of the Sporting Group. Its distinctive and eye-catching deep red mahogany coat and full, silky hair makes the Setter a favorite with the well-heeled set. Add in the Setter&#039;s unbound enthusiasm, superior hunting skills and happy disposition, few can match this breed as an ideal companion pet.       Speculated to be among the first of terrier breeds, the Irish Terrier is very true to typical terrier traits with its loyalty, adaptability, and spunk. This breed is very well-rounded and makes for an excellent companion.    Though the Irish Water Spaniel is one of the oldest spaniels today, it is also very rare. Unique in appearance with its curly coat, this breed is a fun-loving and spritely dog that makes an excellent pet.    Known as the world&#039;s largest breed, the Irish Wolfhound is a strong and sturdy giant whose temperament is gentle and noble. The Irish Wolfhound makes an excellent addition to any family that can offer plenty of space to accommodate this breed&#039;s size.   The Soft Coated Wheaten Terrier is a medium-sized dog that is not only powerful but gentle and affectionate. This Irish terrier, most often noted for its warm, wheaten-colored coat, is also athletic and able to compete in dog trials or shows that require agility. A wonderful companion for those looking for a curious indoor dog.   Originally bred as a farm dog in the mountainous regions of Ireland, the Kerry Blue Terrier is a stunning show dog and a giddy house pet. If you want an active dog that will be begging you to run, explore, and play with it, then this athletic fur ball with a blue-gray coat should be your pet of choice."}]