[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Safety Tips for Your Puppy’s First Christmas", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/christmas-puppy-picture-id636953748.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/christmas-puppy-picture-id636953748.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Christmas", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/seasonal/7-safety-tips-your-puppys-first-christmas"}, "datePublished": "November 12, 2019", "dateModified": "November 14, 2022", "description": "Your first Christmas with your new puppy will be exciting, but are you prepared to keep him safe during the holiday celebrations?", "articleBody": "Nothing brings on the holly jollies like sharing the celebrations with a new puppy. But it’s important to remember that puppies are as mischievous as they are adorable. Perhaps more than any other holiday, Christmas brings a host of potential puppy hazards, from toxic foods to dangerous decor. So when you have a new puppy, it’s important to keep safety in mind. Holiday Pet Safety Tips for Your Puppy’s First Christmas 1. Beware of the Bar Whether you’re hosting or taking your puppy to visit friends or family this holiday season, keep an eye on the cocktails. A curious puppy might be tempted to sample a few unattended drinks. “We’ve noticed that dogs especially seem to like creamy drinks like White Russians, but some pets will readily drink unattended glasses of beer, wine, and other alcoholic drinks if given the opportunity,” says Dr. Charlotte Flint, a senior consulting veterinarian with the Pet Poison Helpline, a 24-hour animal poison control service. And it’s not just the drinks you have to worry about. Dr. Flint says, “During the holidays, we also run into issues with dogs getting drunk after eating alcohol-soaked desserts, like rum balls.” If pets ingest enough alcohol, they can develop symptoms of drunkenness, Dr. Flint says, including: Incoordination Sleepiness Weakness Vomiting Large amounts can cause more dangerous symptoms, such as: Low blood sugar Low body temperature Changes in heart rate, breathing, and blood pressure Tremors Seizures Coma Death So, it’s important to be aware of what your puppy has access to during your holiday celebrations. 2. Keep an Eye on the Buffet Puppies will try to eat anything and everything. Unfortunately, the table scraps from the Christmas feast contain many potential puppy problems. Be especially careful of the following foods, warns Dr. Flint: Raisins and grapes: Traditional holiday treats like fruitcakes, Christmas puddings, and mince pies usually contain raisins, which are extremely toxic to dogs. “Raisin and grape toxicity is poorly understood, but can result in kidney failure in dogs,” Dr. Flint says. Yeast dough: To a puppy’s curious nose, rising dough smells great. Yeast, however, can wreak havoc on the stomach. “When ingested, the dough rapidly expands, gas is produced, and dangerous distension of the dog’s stomach can result,” warns Dr. Flint. Sugar-free candy: Avoid candy canes and other treats containing xylitol, a popular sugar substitute that’s toxic to dogs. If ingested, it can cause low blood sugar and lead to liver failure. Macadamia nuts: Macadamia nuts are popular during the holiday season, but they’re toxic to dogs and can cause symptoms ranging from hind-end weakness and tremors to vomiting, diarrhea, and pancreatitis. Fatty foods: While not truly toxic, consuming fatty foods can cause your puppy to experience vomiting, diarrhea, and pancreatitis. “We have had cases of dogs who eat pounds of butter left on the counter to soften before holiday baking begins,” says Dr. Flint.If your puppy ingests any of the above holiday foods, contact your veterinarian immediately. Prompt treatment is crucial. 3. Skip the Mistletoe Many pet parents have heard that poinsettias are poisonous to our four-legged friends. However, this is a myth, says Dr. Flint. Ingesting the sap of the poinsettia may cause drooling or GI upset, but not serious symptoms. A more concerning holiday plant that is toxic to dogs is mistletoe. “Large ingestions of mistletoe have the potential to cause cardiovascular and possibly neurologic signs,” says Dr. Flint. 4. Provide a Safe Space The holidays are the most hustling, bustling time of the year. While your puppy may enjoy partaking in the fun, he also needs space to decompress. “If you’re hosting a party, consider the number of guests and amount of noise,” says Dr. Charlotte Means, director of toxicology at the ASPCA Animal Poison Control Center. “Many pets will benefit from having a safe, secure, and quiet place in the house away from the festivities.” A big pet holiday safety tip is to set up a separate room for your puppy with the essentials: food, water, favorite toys, and a soft bed. You can even play relaxing music or use a white noise machine to provide some background noise and dampen the holiday clamor. It’s also a good idea to crate train your pup before the holidays arrive. 5. Puppy-Proof Your Tree With flashy lights and dangling ornaments, Christmas trees are extremely interesting to puppies. Dr. Means highlights some of the hazards Christmas trees pose to puppies: Ornaments: Antique ornaments may contain lead, and glass ornaments can cause lacerations, including in the digestive tract if ingested. Opt for plastic ornaments and place them higher on the tree, out of your puppy’s reach, says Dr. Means, because they could still cause an obstruction if swallowed. Wires and electric cords: “It’s important to prevent your puppy from accessing electric cords and extension cords, which can cause electrocution if chewed while plugged in,” says Dr. Means. Chew-proof cord protectors are available and easy to use to keep your puppy safe. Tree water: “Be mindful that your puppy isn’t drinking the water around your Christmas tree,” says Dr. Means. “If it includes a solution of sugar or fertilizers, it can lead to vomiting and diarrhea.” Even plain water, she notes, can serve as a breeding ground for bacteria and lead to similar symptoms. Tree needles: If consumed, tree needles could irritate the mouth and stomach; in large amounts, they could even lead to an intestinal obstruction. Sweep needles daily, suggests Dr. Means. 6. Pass on the Potpourri Who on earth would try to eat potpourri? Your puppy, that’s who. A wintry blend may smell nice, but it can also be dangerous. “While ingestion of dried potpourri generally causes only mild stomach upset, there is the potential for an obstruction in the stomach if the mixture contains large wood chips or pinecones,” warns Dr. Means. Additionally, some potpourri contains toxic plants, she says, and some of the essential oils included in potpourri can be toxic to dogs. 7. Educate Your Guests If you’re entertaining during the holidays, provide your guests with a quick Puppy 101 lesson. “If your puppy will be interacting with guests, make sure that people know how to properly interact with your pets, including asking your guests not to feed your pets any human food or beverages,” says Dr. Means. Additionally, ask houseguests to properly secure their luggage. Suitcases include all kinds of puppy temptations, from designer shoes to prescription medicines. “Houseguests are often not aware of a pet’s curiosity, and it may not occur to them that they need to keep their medications out of reach of pets, as it is not something they routinely do at their own home,” says Dr. Flint. “Dogs will chew up weekly pill organizers or other medication containers, and will eat pills.”     "}]