[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Things You Should NEVER Do When Adopting a Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/petmd-adopting-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/petmd-adopting-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Adoption, Shelters and rescue", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/6-things-you-should-never-do-when-adopting-dog"}, "datePublished": "September 22, 2017", "dateModified": "September 7, 2022", "description": "A new dog needs attention, physical and emotional support, and requires new financial commitments. So while you’re going through the dog adoption process, make sure you NEVER do these six things.", "articleBody": "  By John Gilpatrick   Adopting a dog is a joyful decision. You’re choosing to bring home a new family member that you will love unconditionally.   But just because it’s an overall positive and pleasant experience doesn’t mean you should act on a whim. A new dog needs attention, physical and emotional support, and requires new financial commitments. “Pets are not an accessory, a fashion statement, or in any way some ‘thing’ to be tossed to the side,” says Kristi Littrell, adoption manager for Best Friends Animal Society. “Dogs are living, feeling creatures who are a member of your family.”   In making this life change, you need to be fair to yourself, your human family, and your new dog. So while you’re going through the dog adoption process, make sure you NEVER do these six things.   One of the biggest mistakes people make pre-adoption, Littrell says, is making up their mind about what they want before even meeting a dog. “Dogs deserve to be treated as individuals, so don&#039;t focus too much on the breed or breed mix,” she says. “Take the time to get to know the particular dog you are considering.”   Certain breeds, of course, have common traits: Golden Retrievers might be very friendly. German Shepherds tend to be protective. Bulldogs are usually easy-going. But these are not hard and fast rules, and people with certain preconceived notions, who adopt a dog based on specific personality expectations, might end up disappointed.   “Take the dog you are considering on a walk, play with him or her, and talk to the people taking care of the dog to find out their impressions,” Littrell says. While you can’t ever know for sure how a dog will behave in a new environment, you’ll at least see how your personalities mesh, which is crucial to a successful experience.   For 95 percent of dogs, being adopted by a family is a very positive development, but for 100 percent of dogs, being adopted by a family is a massive life change. “You’ve just turned their world upside-down,” Littrell says. “Dogs need time to adjust and develop a routine.”   While it’s easy to get frustrated during the first few weeks with your new dog, make sure to think about the experience from the dog’s perspective and give him or her time to adjust. Whether you adopt an old dog or a young dog, a male or female—they need time and space to explore their surroundings and feel comfortable. This is especially true for dogs entering a home with other pets in it, Littrell says.   How long do you need to wait before becoming concerned about the lack of adjustment? “I always ask adopters to give the animal at least a month, as long as no one is in danger, of course,” Littrell says. “And as needed, contact a trainer with positive training methods.”   Older dog or puppy? It’s one of the biggest questions new adopters have to take into consideration. There’s no objectively right answer. It just depends on your lifestyle and personal preferences. Older dogs might have more medical problems and expenses, but they will probably require less day-to-day management. Puppies, on the other hand, will probably be with you longer, but need a lot training and attention—especially early on in their lives.   To that end, Littrell says people who work super long hours and don’t have anyone at home who can help parent a puppy during the work day should really consider an older dog. “Puppies need tons of socialization to grow up to be healthy adult dogs,” she says. “They also need potty breaks every [couple of] hours.”    Meeting with a veterinarian shortly after adopting a dog is a must, says Dr. Nicole Breda, lead veterinarian for Boston Veterinary Care at the Animal Rescue League of Boston, in order to assess overall health and establish a baseline for future tests. You’ll also want to have a fecal test done to check for intestinal parasites, as well as routine bloodwork that will evaluate cell counts and kidney and liver health.   Breda says a heartworm test is another must. “Heartworm disease is spread by infected mosquitos when they bite a dog. However, it takes up to six months from infection to show up positive on this test,” she says.   That means a follow-up is necessary six months later (and every year after that) to make sure nothing was missed the first time around. And you really don’t want to skip that follow-up. “If a dog is infected with heartworms, the treatment can be very costly, and without catching the disease early, it could be deadly,” Breda says.   Breda says a lot of new dog owners think of crating as cruel. While it’s true that new dogs are generally happiest when they’re free to roam and be around their owners, crating them while you leave for the day is important.   “I often see young dogs for ingesting items that can cause an intestinal blockage,” she says. “I also see them for eating medication or something toxic when they’re left unattended.”   This sounds like a no-brainer, but a lot of people like the idea of adopting a dog more than the reality of it.   Breda suggests making a list of the things you’re looking for in a new dog. Bring that with you to a shelter and see if the managers can match you with a furry friend that meets your needs. “The biggest mistake I see potential adopters making is falling in love with a cute dog on a website without realizing that in reality that dog may not be a good fit,” she says.   Littrell adds that some shelters might allow you to foster the dog. It’s a less permanent way to spend a little more time with the pup and see how he or she interacts with you and your family at home."}]