[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Ways to Keep Your Dog Feeling Full", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/keep-dog-full-main.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/keep-dog-full-main.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Weight management", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/5-ways-keep-your-dog-feeling-full"}, "datePublished": "April 28, 2016", "dateModified": "September 7, 2022", "description": "If your dog seems hungry all the time, it&#039;s important to know why. Here are some tips on identifying when your dog is hungry and how to keep him feeling full.", "articleBody": "By John Gilpatrick   It&#039;s something nearly every dog owner has gone through. Thirty minutes before your alarm goes off, as you cling to those precious last moments of slumber, there&#039;s an overeager and purposeful series of scratches on the bedroom door. Someone&#039;s hungry.   But is he really? &quot;Speaking in terms of evolution, dogs are opportunistic scavengers,&quot; says Dr. Rebecca Remillard, a veterinary nutrition consultant and diplomate for the American College of Veterinary Nutrition (ACVN). “If given the opportunity, they might eat everything in sight including the refrigerator.”   Remillard, through her PetDiets.com business, specializes in creating custom, homemade diets for pets. She says actually managing and accurately judging your dog&#039;s satiety (fullness) is a difficult science because dogs eat for many reasons beyond feeling hungry. “Just think about humans,” she says. “Food is love. We eat as a form of community. Conversely, we eat because we’re lonely and stressed, too.”   Follow these techniques to better understand when your dog is hungry and what to feed him to keep him full.    The first step to measuring how much and what type of food keeps your dog full is to understand his body composition score, Remillard says. Not all dogs are built alike. A 50-pound Great Dane compares very differently to a 50-pound Cocker Spaniel. Odds are your vet has already noted your dog’s body composition score, and if they don’t, it’s simply an observation of weight to expected weight. A score of “one” is severely underweight, while “nine” represents a seriously obese dog. Sometimes vets will use a scale from one to five, rather than one to nine.   Remillard notes that all dogs eat differently and one dog might eat differently every day. But what’s important is that score. If he’s between 4-6, or around a 2.5 on a five-point scale, his weight is healthy. That means if your dog is maintaining his body condition score despite not eating everything in his bowl, he’s good, Remillard says. Similarly, if he’s maintaining and still appears to be begging for food, “He doesn’t need it and isn’t even hungry. He’s probably just looking for attention.”   Dr. Valerie Parker, assistant professor in the Department of Veterinary Clinical Sciences at Ohio State University and an ACVN diplomate, explains that dogs often eat simply because food is tasty and it’s an enjoyable activity for them. “We as pet owners need to retrain ourselves to not give in when [a dog is] asking for food.”   Positive reinforcement and pet/owner bonding take many forms. “Play with him, take him outside for a walk, brush him,” Parker suggests. “Fifteen minutes of quality time will help get his mind off of food.”   Some brands of kibble look bigger than others because they’ve been “popped”—filled with air by using high heat during preparation. This type of food can make your dog feel full, but the feeling dissipates very quickly as your dog expels the air through burps, Remillard says.   Foods with high water content are slightly more satisfying, but they’re also satiety placebos as this water simply forces the dog to urinate more.   Finding a food that’s high in fiber is key to managing your dog’s appetite. Which leads to…   “Fiber is the best nutrient for a dog’s satiety because it can’t be digested,” Remillard explains. “It just stays with a dog throughout the entire digestive process.” Parker agrees: “Fiber is the most crucial ingredient in commercial foods when it comes to gastrointestinal health and satiety.” Indigestible fiber makes a dog feel full while adding no calories to his diet.   Remillard warns that it’s not so easy to find a bag of food that’s clearly marked as high in fiber, however. “Marketers have determined that ‘high-fiber’ food won’t sell quite as well as ‘lite’ or ‘light’ dog food,” she says. If you take a closer look at such foods, you’ll see they’re lower in calories and have the requisite fiber you’re looking for. It’s best to check with your vet or a veterinary nutritionist to determine how much daily fiber is ideal for your dog.   Looking for a quick, belly-filling fix for your dog? Reach for your refrigerator’s veggie drawer.   Remillard and Parker agree that cucumbers, green beans, carrots, celery, and broccoli are all good choices. Steaming or boiling them is an acceptable option, but Remillard adds that these methods begin to break down some of the fiber which makes these great options to start with. Your best bet for feeding veggies to your pup? Clean and raw. They’re as good as or better than any commercial dog treat. "}]