[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "4 Scary Things Living in Your Dog&#039;s Bed", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/dog-bed-germs-main.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/dog-bed-germs-main.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/scary-things-in-dog-bed"}, "datePublished": "March 24, 2016", "dateModified": "September 7, 2022", "description": "Your dog&#039;s bed may include thousands of dangerous microorganisms—parasites, bacteria, viruses and fungi. Find out how to limit the spread of these not-so-welcome guests and how to properly clean your dog’s bed to ensure a safe sleeping environment.", "articleBody": "By Stacia Friedman   The scariest things in your dog’s bed are the ones that can be hard to see. They include thousands of microorganisms – parasites, bacteria, viruses and fungi. Find out how to limit the spread of these not-so-welcome guests and how to properly clean your dog’s bed to ensure a safe sleeping environment.     Your dog may catch fleas or mites from another animal (or from you in some cases) and bring them into your home and his dog bed. “Fleas can hitch a ride into your home on your pant leg or shoe,” says Dr. Jeffrey Stupine, head veterinarian at the Pennsylvania SPCA. “If you get little red spots on your ankles or your pet is scratching, it’s probably fleas. If you have an infestation, there may be invisible larvae waiting to hatch in your dog’s bedding.”     “Ringworm is not a worm but a fungal infection, medically known as dermatophytosis, that infects a dog’s skin, hair and claws and gets its name from the round, pink lesion it forms on the skin [in people],” says Dr. Daniel Morris, a veterinary dermatologist at University of Pennsylvania Veterinary School. Symptoms in dogs include redness, itching, hair loss, crusty patches and brittle claws.   Ringworm spores shed by a dog can live in the environment—including his bedding—for up to two years. If left untreated, the fungal infection can spread and infect other animals or humans living in your home.      Roundworms (nematodes or ascarids) are parasites that live in the intestine of dogs. These parasites feed off of partially digested intestinal contents. According to the Companion Animal Parasite Council (CAPC) many  infected dogs shed roundworm eggs in their feces, and your dog may be infected by ingesting the infected feces or by eating a small, infected animal such as a mouse. Roundworms may also be passed from a mother to her puppies. Symptoms include diarrhea, vomiting, weight loss, dull hair, coughing and a potbellied appearance. If your dog is infected with roundworms, his bedding may contain invisible eggs.   Named for their fishing hook shape, hookworms live in the small intestine, ingest their host’s blood, and shed their eggs in feces. Your dog may get hookworm from eating contaminated soil or infected prey animals, larvae may burrow through the skin, or puppies may contract hookworms from their mothers. Symptoms of hookworms include weight loss and diarrhea. If your dog has hookworm, his bedding may contain hookworm larvae, which are transmitted through fecal matter that may be invisible to the eye.     People usually associate Salmonella and Listeria with human food-borne illnesses but the Centers for Disease Control and Prevention (CDC) has found that 25 percent of commercial raw dog food tested positive for these harmful bacteria. Symptoms of Salmonella and Listeria infection in dogs include high temperature, refusal to eat, weight loss, diarrhea, vomiting and lethargy.   According to the CDC, dogs can carry the harmful bacteria in their intestines without showing signs of illness and expose humans in the household. To avoid the risk, the CDC recommends cleaning all surfaces, including bedding, on a regular basis, washing your hands thoroughly, safely storing and handling raw pet food, not letting your dog lick you around your face, and cleaning up your dog’s poop carefully.       Wash dog bedding regularly. When buying a bed for your dog, pay close attention to the washing instructions. If the bedding can be machine washed in hot water and dried on a high setting, you’ve got a winner. “High heat is the only way to kill parasites, their larvae and bacteria,” says Morris, who recommends washing your dog’s bedding weekly.   Keep your dog clean and well groomed.  “Adequate brushing can often decrease the need for bathing,” says veterinary dermatologist Staci Wiemelt, VMD. “The average dog that isn’t out having fun in the mud and doesn’t have any skin conditions can safely be bathed every three months.”   If your best friend loves getting dirty and needs to be bathed more often, try a mild vet-approved dog shampoo or use plain, lukewarm water. Between shampoos, you may want to use vet-approved wet wipes to clean your dog’s paws before he enters the house.   Use prescription flea and tick medication. Don’t forget to keep giving flea and tick medication year-round to avoid the presence of these nasty parasites in your home. Work with your veterinarian to find the best option for your dog.    "}]