[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Ways to Comfort Your Dog While Flying", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/calmdogflying.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/calmdogflying.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel, Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/7-ways-comfort-your-dog-while-flying"}, "datePublished": "April 18, 2018", "dateModified": "September 7, 2022", "description": "", "articleBody": "By Nancy Dunham   Flying with a dog may seem simple, but you need plenty of prep to ensure a calm, safe flight. Putting the work in ahead of time will also make you less nervous, which will in turn help keep your pup calm in the air.   “We are so fearful of [our dogs] misbehaving, we transmit our anxiety to them through our breathing [and] nervous movements,” says Harrison Forbes, celebrity dog trainer and animal behaviorist. “The dog thinks ‘mom or dad is nervous, something awful is going to happen. I am nervous, too.’ We feed off each other and become more and more anxious. I’ve witnessed that on airplanes, trains and other confined spaces.”   This doesn’t necessarily mean you shouldn’t fly with your dog, however. It just means that you’ll want to spend plenty of time coming up with a plan to keep your dog happy and comfortable in the air. Here’s how: Before you book a ticket, talk to your veterinarian to determine if your dog can fly. Dogs that are very young, old, in heat, pregnant or have chronic illnesses or poor temperaments should not fly, says Dr. Carol Osborne of Chagrin Falls Veterinary Center and Clinic in Ohio.   Then, you’ll want to confirm airline restrictions and regulations.   “The first thing to do before you travel is to check with the airlines,” says Osborne, noting that some airlines ban certain breeds. “Find out all the restrictions including the weight of the pet, type of carrier and other specifics.”   Finally, you’ll want to ask yourself why you’re bringing your pet with you. Is it for a long trip or a quick vacation? If it’s the latter, your dog might be better off not travelling.   “You know your dog better than anyone else does,” says Forbes. “Do an honest assessment before your trip to determine if your dog should travel and how.” Some airlines only allow large dogs, often those in excess of 70 pounds, into cargo. Placing a dog into cargo is controversial, but Forbes says that, in general, flying with a dog in cargo is usually not a problem.   Osborne, however, does not recommend flying a dog in cargo but says that pet owners who opt to go this route need to take extra precautions. It’s best to fly with dogs in cargo in spring or fall, on direct flights and at non-peak times, she says. Flat-nosed dogs, such as Pugs and French Bulldogs, should never fly in cargo.   “Always ask if flowers will be shipped on the same flight,” she adds. “They are packed in dry ice and those fumes can be toxic.”   Make sure your dog’s name, photo and all of your contact information is on the crate or carrier that your dog will be flying in. Always carry your dog’s recently-issued health certificate, says Osborne, as some airlines require a health certificate dated within ten days of travel. Also, check to see if the state or country you visit requires special vaccinations, laboratory tests, or a quarantine period.   No matter how your dog travels, he should be wearing a collar with his identification on it, and keep a recent photo of our dog on your phone in case of emergency, says certified professional trainer Nicole Ellis. Microchips linked to current contact information are also a good idea. Airlines have specific rules about what pet carriers can and can’t be used on a flight. Check with your airline for specifics. Remember that your dog should be able to lie down, sit, stand up and turn around in the carrier, says Osborne.   If you opt to bring your dog on a leash, always bring an extra one in case of emergencies, says Ellis. In addition, Ellis always checks all of her luggage when she travels with a dog. That way she can concentrate on the dog’s safety and comfort. Once you select the crate or carrier you’ll be transporting your dog in, work on making him comfortable getting in and out of it ahead of time.   “Teach the dog to go into the carrier, then slide it under a coffee table and read the paper for ten minutes. Then slide it out,” Forbes says. “You want your dog to feel that getting in and out of the carrier is normal and even fun. We underestimate how simple it is to train a dog and create a positive association.”   You’ll also want to get your dog used to the sights and sounds of an airplane and airport. Take him to the airport in his carrier if you’re able to and sit in the public waiting area so he can experience the environment, Ellis says. If that’s not possible, Osborne recommends finding audio of airplane and airport noise to play for the dog. Supplies are key to a happy, healthy trip. Here’s what Ellis recommends bringing:   Your dog’s food  Treats  Collapsible food and water bowls.  An extra leash  Plastic bags and hand cleaners in case of accidents.  A safe toy or bone for chewing on during the flightAccording to Osborne, giving your dog a sedative or medication before flying is not recommended. “They cause a drop in blood pressure and heart rate and make the pet unsteady,” she says. “Ask your vet to recommend holistic alternatives such as essential oils made specifically for pets.” If your dog is so anxious or rambunctious that you feel a sedative will absolutely be required, you probably need to reconsider whether putting him on a plane is in his best interests."}]