[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Cleaning Products That Could Harm Your Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/harmful-cleaners-main.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/harmful-cleaners-main.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/5-cleaning-products-could-harm-your-dog"}, "datePublished": "April 26, 2016", "dateModified": "September 7, 2022", "description": "If you don&#039;t use natural cleaning products in your home, your dog might be at risk. Here are five potentially dangerous cleaning products for dogs.", "articleBody": "By Elizabeth Xu   Dogs fill your home with love—and muddy paw prints, smelly dog toys and globs of fur stuck to your floors and all your furniture. For the sake of your sanity, and general sanitary reasons, cleaning a home with dogs is not optional.   Whether you have a new pet or you’ve been a dog owner for years, you may not have considered how your cleaning products affect your pets. Is Fabuloso safe for pets? Is Lysol safe for pets? Learn more about the products that can cause your dog harm and some simple, dog-friendly solutions that work just as well. Many traditional cleaning products contain chemicals that could harm your dog in a number of ways. Bleach, ammonia, chlorine, formaldehyde, phenol and isopropyl alcohol—all of which are used often in cleaning products—can all be harmful, says Dr. Rachel Barrack of Animal Acupuncture in New York. Unfortunately, it’s not always easy to tell when cleaning products have harmed a dog.   “Signs of poison vary depending on what the product is and how it was contacted,” Barrack says. “If it is something that was from direct contact, it can cause a rash or a burn on the skin. If the harmful ingredient was ingested, it can cause lethargy, malaise, seizures, coma, vomiting, diarrhea and even death.”   Common symptoms of cleaning product irritation in pets can also include skin and eye irritation or breathing problems for asthmatic animals brought on by strong fumes, says Dr. Cathy Alinovi, a retired holistic veterinarian in Indiana. Where does your dog spend a lot of time? On the floor. It’s probably an area you use various cleaning products on, too. “If [the product is] something you wouldn’t put in your mouth, then you need to make sure it’s not anywhere dogs will lick,” Alinovi says, noting that dogs do sometimes lick floors. If your dog has a habit of drinking out of the toilet, you should consider what you use to clean it. Toilet bowl cleaners that clip on to the edge of the toilet or cleaners that are put in the back of the tank both pose a risk because the chemicals could burn your dog’s mouth and throat, Alinovi says. According to the ASPCA, fabric-softening sheets, especially unused ones, contain detergents that could harm your dog. If too many are ingested, oral ulcers, vomiting and intestinal blockage may occur. Cleaners used on counters are potentially harmful, especially if your dog is known for counter-surfing. Additionally, kitchen cleaners that come in a spray bottle have the potential to travel through the air and get into your pet’s water bowl, Alinovi says. Although not technically used to clean your home, air fresheners can unfortunately have a negative impact on your dog, Alinovi says. This includes candles, air freshener sprays and plug-in air fresheners, which can all cause problems for dogs with allergies, she says. Instead, she suggests making your own potpourri out of cloves, dried rose petals and fruits, or squeezing lemons or limes to give your home a fresh citrus scent. “It’s good for the environment, it’s good for your wallet and it’s good for the nose,” she says. While certain chemicals might have a negative effect on your dog, most cleaning products are okay to use in homes with pets as long as you follow the directions on the package, according to the ASPCA. More pet-friendly alternatives do exist, however, and can be simple to make with products you probably have in your home.   Alinovi uses apple cider vinegar to clean her home. Using a 1:1 ratio of vinegar to water, the mixture can be used in laundry, on windows and to wipe down counters, she says. Tougher messes might need a less diluted ratio, but that might lead to a stronger vinegar smell in your home.   Baking soda is another product that can be used for cleaning when mixed with water, and is good for areas where scrubbing’s required, like the toilet, Alinovi says.   Of course, you don’t need to make your own cleaning products to get safer ones these days. In general, newer cleaners that claim to be environmentally-friendly are also pet-safe because they’re made from vinegar-based solutions, Alinovi says. She adds that it’s important to keep in mind that any cleaning product, even natural ones, may cause your pet to have an unexpected reaction or allergy. Be sure to check with your veterinarian if you have questions about any specific cleaning products."}]