[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Common Bath-Time Mistakes Pet Owners Make", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/dog-bath-mistakes-main.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/dog-bath-mistakes-main.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Grooming", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/7-common-bath-time-mistakes-pet-owners-make"}, "datePublished": "April 25, 2016", "dateModified": "September 7, 2022", "description": "If you&#039;re planning to give your cat or dog a bath, it&#039;s best to avoid these common grooming mistakes.", "articleBody": "By Jill Fanslau   For most of us, taking a shower or bath is usually a calming experience. For our pets, however, bathing may be anything but relaxing. Between the water, the noise, the confinement, the scrubbing and the suds, it’s no wonder why your cat or dog may sprint in the other direction of the tub.   Unfortunately, grooming our pets is a necessary evil. It minimizes shedding, keeps your pet’s coat healthy, reduces allergies, decreases chances of infection and diminishes the spread of dirt and germs throughout your home.   While your dog or cat may never willingly jump under the faucet, you can make bath time as positive, easy and fast an experience as possible by avoiding these common mistakes: Shoot for lukewarm water, says Jocelyn Robles, a professional groomer at Holiday House Pet Resort, a veterinarian-owned pet resort and training center in Doylestown, Pa. Water that’s too hot or too cold will create a negative stimulus for your pet, which may turn them off of bath time for the long haul.   So how do you know it’s the right temperature? Spray the nozzle on your forearm first, just like you would if you were giving a baby a bath, Robles says. The area of skin is more sensitive to temperature than your hands.  The easiest way to bathe your cat or dog is with a handheld shower head or faucet nozzle in a tub or sink (if you have one, there’s no need to fill the tub or sink with water when you bathe your pet), but the sound of the loud running water combined with the water pressure may frighten and upset your pet.   Instead of spraying the water jet straight on to his fur, try to keep your pet calm by letting the water hit the back of your hand first as you move the nozzle across your pet’s body, Robles says. Your dog or cat will feel your comforting touch as opposed to the pounding of the water. Once he is at ease, you can move your hand away—just make sure you get his entire coat wet.  Don’t automatically grab your own shampoo—even if it’s an “all-natural” solution or a mild baby shampoo, Robles says. “A pet’s skin has a different pH balance than humans,” she added. “Your shampoo will be drying to them.”   Your veterinarian can help you with product recommendations, but you’ll generally want to look for brands that are specifically formulated for cats or dogs and follow the directions for shampooing on the label. Oatmeal-based shampoos are a gentle option. Medicated shampoos are an essential part of treating many skin conditions. Ask your veterinarian which might be right for your dog or cat.   If your pet has sensitive skin, test the shampoo on a patch on the back of his leg first, and then look for any signs of irritation a couple days before a bath.  You may want to apply soap to your pet’s fur and then let it “soak in” for a couple minutes, but you won’t remove all the dirt and oil that way, Robles says. You need to agitate the shampoo to trap the grime and wash it away.   Actively massage the soap into your dog or cat’s fur with your hands and fingers for four minutes. Start with your pet’s legs and work your way up to his face (the most sensitive area), Robles says. Clean his face with a cotton ball or washcloth and be careful to avoid his eyes.   Wash the outside of his ears with a tiny bit of shampoo on your fingers, a washcloth or a cotton ball. Tilt your pet’s head down before rinsing (for instance, if you’re washing his left ear, angle the left side of his head down) to keep water from going into the ear canal and to prevent ear infections, Robles says. Pay extra attention to your pet’s paw pads, too, as these areas can sweat and trap odor.    Then rinse away the shampoo with the shower nozzle, reversing the order in which you shampooed. Start with your pet’s head this time and then work your way down to his legs. That way, if any soap got in your pet’s eyes, they’ll be rinsed first. Make sure the water runs clear of suds before you finish. You should brush your dog or cat before and after a bath, but only if you regularly brush him at least three times a week, Robles says.   Brushing can be painful and uncomfortable if there are matts or knots in your pet’s fur. “This can turn grooming into a negative,” she says. “You can’t just brush them out.”   If your dog or cat has tangled fur, take him to a professional groomer first, then start a regular brushing routine. This will not only keep your pet’s coat shinier and tangle-free, but also keep him cleaner between baths.   For breeds with double coats that shed (such as Labrador Retrievers and German Shepherds), you can brush your pet while he is shampooed to help remove some of the excess undercoat, but for all other breeds, make sure your pet is as dry as possible after the bath and before brushing, Robles said. If his fur is too saturated with water, you’ll only create mats. You can even wait until the next day to brush.   A slicker brush and/or long-tooth comb will work best for most breeds. Some de-shedding tools and undercoat rakes have been known to knick the skin and cause infections, so double check all tools with a professional groomer or veterinarian you trust before using them, Robles says. A groomer will also be able to demonstrate the proper way to brush your pet from head to paw.  Make sure you have towels ready to go before the bath (the last thing you want is a soaking wet pet sprinting through your home!) and, if you own a dog, have a few towels on the floor and one ready to drape over his back in case he wants to shake off during the bath.   After a bath most pet owners quickly towel down their pet, but you should try to get the fur as dry as possible, Robles says.   Use a towel to gently squeeze the fur and pull out as much water as possible, she said. By the end, your pet should be damp but not dripping wet.   You’ll want to leave using a blow dryer or any other type of drying tool to the professional groomer, Robles says. It’s difficult to regulate the temperature of the airflow, which increases the risk of burning your pet’s skin. Plus, most animals are scared of the noise, which may put a damper on the end of an otherwise positive bath time experience.  Dogs and cats naturally groom themselves, so you probably don’t need to bathe your pet more than once a month, Robles says. Too many baths can actually strip away the natural oils in your pet’s coat and cause skin irritation. Speak with your veterinarian to determine the best grooming schedule and best type of shampoo for your pet’s breed and activity level."}]