[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Trash Can Dangers for Your Pet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_240171916.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_240171916.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/5-trash-can-dangers-your-pet"}, "datePublished": "January 13, 2017", "dateModified": "September 7, 2022", "description": "If your cat or dog gets into the trash can, it can leave you with a gross mess to clean up. But it can also be potentially dangerous for pets. Read about these trash can dangers for pets.", "articleBody": "By David F. Kramer   Pet owners often go to great lengths to feed dogs and cats healthy foods. But despite a proper portion size and the right food choice, many pets still enjoy digging through the trash for extra morsels. Whether pets are acting out of boredom or are simply scavaging for additional treats, kitchen and bathroom trash bins seem to have a gravitational pull for four-legged family members.   But eating out of the trash can be more than an off-putting behavior—it can be downright dangerous for pets.   “While a dog&#039;s stomach can usually handle overindulging on some simple leftovers directly off your plate, a more serious concern occurs when non-food items are ingested,” says Dr. Howard Small of Forest Lakes Animal Clinic in Sarasota, Florida. “Items such as raw meat, chicken bones, and oily or deep fried scraps are particularly dangerous. Typical symptoms occur in the first few hours after ingestion, and may include protracted vomiting and diarrhea, with or without blood.”   “The most important thing that I stress to pet owners is that prevention is the best medicine,” says Dr. Adam Denish of Rhawnhurst Animal Hospital in Elkins Park, Pennsylvania. “If a toy or trash is on the ground or accessible, will your pet eat it? If so, be vigilant and clean up first. Second, try to find out what they actually ate. Was it the stuffing from the plush monkey, or the zipper and button from its coat?”   Read on to learn about common trash can items that can pose a danger for your pet. The consumption of old or potentially spoiled food from the trash has a great potential to cause illness to an animal, says Small. Spoiled or raw foods have a greater chance to cause sickness from Salmonella or Campylobacter bacteria. Symptoms of Salmonellosis include fever, shock, lethargy, diarrhea, vomiting, weight loss and dehydration, and could end up with your pet in a vet’s care. Salmonella can also be transmitted from pets to people, so preventing infections in animals can help keep the whole family healthy.   Eating paper products—such as napkins, towels, and toilet paper—probably won’t injure your pet, unless the amount consumed is excessive. Pet owners also need to consider what sort of substances cast off napkins and paper towels might contain. If some paper towels were used to clean up raw or spoiled food, cleaning products, or some other chemical items, then gastric distress or actual poisoning could occur. While Styrofoam and plastic themselves are not toxic to pets, says Denish, if too much is consumed, they can lead to trouble, and potentially a gastrointestinal obstruction. So, a small animal that eats a large amount could be asking for trouble. However, pets have a strong mechanism to vomit up non-food items from their stomachs, so chances are, any Styrofoam or plastic your pet eats isn’t bound to stay down for too long. If, however, your pet becomes lethargic, appears uncomfortable, won’t eat or continues to vomit, a trip to the veterinarian is necessary. There always seems to be a holiday around the corner, and each one has its own variety of decorations, snacks and foods that can end up in the trash. While eating a Christmas decoration is probably just as risky as eating a Halloween decoration, relates Denish, some types of objects are particularly dangerous. Tinsel or anything string-like can cause a condition called a “linear foreign body.” Cats are particularly susceptible, but the condition does also occur in dogs. Linear foreign bodies are especially dangerous because they can become stuck and cut through the gastrointestinal tract, leading to potentially fatal abdominal infections. While some items may pass through your pet’s digestive system, others may require endoscopic or surgical retrieval by your vet, which can be risky as well as expensive. Vets and animal behaviorists are divided on the reasons a pet might ingest any of these unsavory items. Dogs, by nature, are sniffers, lickers and tasters – and they use these senses in the way we use touch. Not only are dogs attracted to things that smell like people, but they are also enticed by the smell of blood, feces or decay—as they often lead to food, or even just things to play with. However, the ingestion of diapers, tampons and related items can easily cause a blockage in your pet’s digestive tract.   “Most dog owners have experienced the embarrassment of their pet eating these objects,” says Small. “It can be a sign of separation anxiety if your pet chews the garbage after you depart for the day.” Or, he adds, it may just be simple curiosity or boredom.  “From a veterinary perspective, there is no good trash for a dog. I strongly recommend a covered trash can, preferably in a closet, anchored or elevated,” says Denish. “It is also very important to start training your dog from the beginning. That means minimizing your dog’s diet to no table food; don&#039;t let them beg; and crate train them if possible. This way you have some control over the dog&#039;s behavior when you are not home.”   So, when it comes to keeping your pet safe from trash bin hazards, think about what you’re throwing in the garbage and take precautions since many of those items can be dangerous to pets. "}]