[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mold Poisoning in Pets – Causes, Symptoms and Treatment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/1-mold-poison-in-pets-506400804_0.gif", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/1-mold-poison-in-pets-506400804_0.gif"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/mold-poisoning-pets-causes-symptoms-and-treatment"}, "datePublished": "October 26, 2016", "dateModified": "September 7, 2022", "description": "Molds are a crucial function for our ecosystem, and can even be good for our health, but some molds can lead to serious consequences for our pets, as well as for us, when they are inhaled or ingested. Learn more here.", "articleBody": "By David F. Kramer   For far longer than there have been pets and their people, there has been mold. Mold is neither a plant nor an animal but a member of the fungus family. Molds help in the biodegradation of organic matter, which is a crucial function for our ecosystem. But some molds can lead to serious consequences for our pets, as well as for us. The problem with mold is that it can be found almost anywhere—both inside our homes and outside—provided there’s sufficient warmth and moisture to support it.   According to Dr. Patrick Mahaney of Los Angeles, mold can be found in drywall, around windows and floors, and even in clothing and towels that we’re about to wash—and sometimes even after they’re washed. Mold can easily be inhaled or licked off of a tainted surface. That smelly towel your dog is always chewing on might be more than just smelly.   Dr. Jennifer Coates, veterinary advisor with petMD adds, “Toxic mold is of particular concern for pets because these organisms produce mycotoxins that can cause health problems.”   There are five categories of toxic mold: Cladosporium, Penicilium, Fusarium, Aspergillus, and Stachybotrys. These molds can cause anything from a sneezing or coughing fit to, in extreme cases, neurologic problems and death.   Mold can be found pretty much anywhere pets like to spend time, whether in your dog’s prime snoozing or play area, or on your cat’s favorite sunning spot on the windowsill. Once you let your pet outside, mold can be found in decaying food, rotten tree stumps, and in the soil itself. So even in the relative safety of your own backyard, pets aren’t necessarily safe from mold. According to Coates, problems with mold in pets fall into three categories: inhalation, ingestion, and allergic reactions:   Inhaling mold can cause respiratory distress (breathing that takes more effort or occurs more rapidly than normal), nasal discharge, coughing, wheezing, sneezing, lethargy, and sometimes bleeding from the mouth and/or nose.According to Dr. Mahaney, the ingestion of mold can lead to gastric symptoms such as decreased appetite, vomiting, and stool changes.Signs of an allergy to mold might include excessive scratching, chewing, or licking, which sometimes progresses to the point of fur loss and the development of sores.  In all cases, getting to the vet is crucial. According to Mahaney, veterinary treatment for mold inhalation or ingestion is generally focused on supportive care, including the management of respiratory symptoms, vomiting, and the administering of IV fluids for dehydration from gastric distress. Mold allergies can be treated with medications that lessen the immune system’s response.    The prognosis for a pet afflicted by mold is generally good, and provided the source of the mold is properly removed to prevent continued problems, your pet should fully recover. As is the case with any sort of health problem, getting your animal to the vet as soon as possible is key. According to Coates, this last point is especially true if you are dealing with one of the mycotoxin-producing molds that can cause serious health problems in pets. If you suspect mold growth in your home, there are several ways to confirm it. While professionals are available who specialize in discovering and treating household mold, there are also some do-it-yourself methods, including test kits that can be purchased in stores and online. If you discover mold yourself, you can tackle it with a mix of water and bleach, but if the affected area is large, it’s best to call in a professional. It’s best to keep your pet away from any areas in your home that are contaminated with mold. If a case is particularly bad, it might be a good idea to relocate your pet to a friend or relative’s house while yours is being professionally treated.   Store pet food in an air-tight container to discourage mold growth. Water bowls, food bowls, and plastic or rubber chew toys should be thoroughly cleaned at least once a week. Launder and completely dry pet beds, plush toys, and other similar items your pet may use frequently to lessen the chances of mold growth. A best practice is to keep anything your pet touches clean and dry.   It’s also important to keep your pet from eating out of the trash or from having access to spoiled food or drink. People often leave containers and leftover food on the ground, so when you and your pet are out for walks, always be aware of anything they might get into.   “Protect your pet from dietary indiscretions; no eating things they shouldn’t, both inside and outside of the home,” says Mahaney. “That means not letting your pets have free rein outside by walking them on a leash. Inside, we need to make sure that our baseboards, drywall, and windows are not growing mold that the pets could potentially be exposed to, and keeping down the humidity in our homes to prevent the growth of mold.” Mushroom, Mold, Yeast Poisoning in Dogs   Mushroom, Mold, Yeast Poisoning in Cats   Geography Matters with Blastomycosis   Water Mold Infection (Pythiosis) in Dogs   Water Mold Infection (Pythiosis) in Cats   4 Pet Food Storage Tips to Keep Your Dog Safe   4 Pet Food Storage Tips to Keep Your Cat Safe   What You Don&#039;t Know About Mushrooms Can Kill Your Dog   6 Poisonous Mushrooms That Are Toxic to Dogs   Mushroom Poisoning in Dogs"}]