[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Types of Water That Can Make Your Dog Sick", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/slide-1-99469768.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/slide-1-99469768.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/7-types-water-can-make-your-dog-sick"}, "datePublished": "September 28, 2016", "dateModified": "September 7, 2022", "description": "", "articleBody": "by Nicole Pajer   Just because your dog has a nice fresh bowl of filtered water waiting for him at home doesn’t mean that’s his only drinking source throughout the day. When your pup sees water—in any form—it’s instinctual for him to want to take a sip.   Many times, this is harmless, but occasionally, ingesting the wrong type of water can lead to all sorts of health problems for your dog. We consulted with several veterinarians to find out the most common types of water that can make your dog sick and how you can keep your dog from having a run-in with them.    This article was verified and edited for accuracy by Dr. Jennifer Coates, DVM Pups will often make a beeline to stagnant puddles of water they find at places like off-leash dog parks. To them, it is no different than drinking from a bowl of fresh and filtered water.   “Water in random public locations where pets wander or socialize, such as a dog park or walking trails, opens pets up to more risk of infection from bacteria and virus exposure,” says Jennifer Hennessey, owner of Animal ER of NW Houston. This type of water may contain run-off from animal feces and can lead to exposure of many different types of bacteria, viruses, and intestinal parasites.   Symptoms of Infection: Vomiting, diarrhea, dehydration, and/or abdominal pain. Per Hennessey, many of these illnesses and symptoms will need veterinary care. “It’s important to report the puddle exposure to the veterinary team,” she explains. “Care often is medications for stomach upset, fluid therapy, and sometimes hospitalization.” If a specific infectious agent can be identified, it will also need to be treated.   Prevention Tips: Keep your pet well supplied with a water bottle and offer them a sip from a travel bowl between play for proper hydration. Also keep pets on leashes when you are in areas with large bodies of stagnant and tempting water. Pools (whether saltwater or fresh) can be hazardous to your dog if he consumes a large amount of water from them. Hennessey notes that pools are typically clean. However, the chemicals, even diluted, can become too much if a pool is the constant source of water for your pet.   “Drinking small amounts every now and then will cause only additional thirst from the chlorine or salt additives used for treatment,” she says. “But your pet will urinate more and can become dehydrated with continued pool sources as their favorite drinking spot.”   Symptoms of Toxicity: Excessive urination, accidents if indoors for long periods of time, and extra thirst.   Prevention Tips: Keep a bowl of fresh water outside as an alternative to pool water. When you see your dog drinking out of the bowl instead of the pool, give him some praise and reward him with a treat. It is also important to limit your dog’s access to the pool, either by closing the gate or by not allowing your pet to play around the pool unattended, which is a good rule to follow at any time. Due to a lack of circulation, this type of still water can harbor large numbers of potentially pathogenic bacteria, viruses, fungi, algae, and parasites like Coccidia and Giardia. Ponds or lakes are specifically susceptible to significant amounts of blue-green algae growth during warm weather months, according to Jeff Werber, DVM, a Los Angeles-based veterinarian.   “The algae releases toxins into the water as it begins to die. Dogs often respond to the smell produced by the algae and drink the algae-contaminated water,” he explains. This can result in damage to the kidneys, liver, intestines and nervous system. In fact, the mere act of swimming in the algae-contaminated water can be enough to cause skin rashes.   Another issue with stagnant water is the potential for dogs to contract a bacterial infection known as leptospirosis. Because of its ability to do irreparable damage to the kidneys, “next to antifreeze exposure, lepto is one of the most life threatening diseases we deal with,” says IndyVet veterinarian Tracey Gillespie.   Symptoms of Toxicity: “If your dog has been in a lake or pond with blue-green algae, be sure to wash him or her immediately, and keep an eye out for symptoms such as diarrhea, vomiting, difficulty walking, and general weakness,” explains Werber.   Gillespie adds that signs of leptospirosis—including lethargy, malaise, and fever—can be subtle at first. “They often progress to vomiting, diarrhea, increased thirst and urination, and in some cases, jaundice (yellowing of the mucus membranes, seen best in the whites of the eyes),” she says. Symptoms usually show up any time between a few hours to a few days after the exposure.   Prevention Tips: If your dog exhibits any of these symptoms after drinking or swimming in potentially contaminated water, see your veterinarian immediately. The best way to prevent your dog from being affected is to avoid these types of standing bodies of water, particularly if algae growth is evident. Keep pets on the boat if participating in recreational family time or on a leash when walking near open standing water. Avoid tossing toys and balls into untreated water, especially if a colorful film adorns its top (this could be harmful algae).   To keep them sanitary, toilets are often treated with an array of cleaners, toilet bowl disks, or bleach additives. And according to Hennessey, many of these products can seep into toilet water.   “These chemicals are often diluted so that they won’t cause fatal issues in pets,” she explains. “But that doesn’t mean that they can’t do their share of harm.” Pets that are exposed to toilet water can still ingest harmful toxins that can wreak havoc on their fragile systems, especially if they drink out of bathroom commodes regularly.   Symptoms of Toxicity: Vomiting and stomach irritation. “If a pet is vomiting, hydration support and medications are recommended to avoid further dehydration or stomach irritation,” Hennessey notes.   Prevention Tips: Keep the toilet bowl closed or make sure that the door to your bathroom is closed to your pet. Ocean water contains excessive amounts of sodium (about 100 times more sodium than tap water). If your dog consumes it, the sodium draws water into the gut, leading to several immediate issues, including dehydration of tissues as well as diarrhea.   Symptoms of Toxicity: Weakness, diarrhea, and sometimes vomiting. “With severe over ingestion, symptoms can become more serious, from high sodium in the body and excessive thirst, to weakness, neurologic dysfunction, seizures, and coma,” says Hennessey.   Prevention Tips: When playing with your pet on the beach, take frequent breaks to offer rest and fresh water. “Even if your dog is not actively drinking ocean water, tennis balls and toys become saturated with salt water, which is inevitably swallowed during play time,” warns Werber. A small amount of distilled water is not harmful to your pet, but as a sole source of water, it is not recommended and can lead to serious side effects.   “Distilled water lacks minerals and can cause the body to loose important electrolytes through the kidneys, leading to low blood levels,” says Hennessey. This type of water can also soak into tissues more than water with minerals, thereby causing edema or over-hydration and water toxicity, which can be harmful to cells and tissues.   Symptoms of Toxicity: Fatigue, irregular heartbeat, and neurologic changes   Prevention Tips: Avoid providing distilled water as a sole drinking source. “It’s important to remember that water can present dangers even close to home,” says Werber. Water found around the house and garage may contain hidden dangers that can poison pets. Water that collects in the garage or yard may be at risk of run-off yard chemicals, pesticides, fertilizers, cleaners, and antifreeze (ethylene glycol).   Symptoms of Toxicity: Vomiting, diarrhea, dehydration, nervous system dysfunction including tremors, depression, or a semi-comatose state of awareness, agitation, and seizures.   Prevention Tips: It is best to keep your pet away from puddles that form around the house. Be aware and selective in products placed in the yard as far as their toxicity potentials, and change automotive fluids away from the home."}]