[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Things Commonly Found in Your Dog’s Poop", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/things-in-dog-poop1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/things-in-dog-poop1.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Digestive health, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/6-things-commonly-found-your-dogs-poop"}, "datePublished": "August 23, 2016", "dateModified": "September 7, 2022", "description": "", "articleBody": "By Jennifer Coates, DVM   One of the more unpleasant chores associated with pet parenting is picking up dog poop, but it actually presents a useful opportunity to gather information about your fur kid’s health. Next time you are cleaning up after your dog, take a moment to examine what he or she is producing. If you notice any of the following, your dog’s health could be at risk. Bright red blood is an obvious cause for alarm. It can be a sign of potentially serious problems affecting the lower part of the gastrointestinal tract or tissues around the anus. Many diseases can lead to bloody stools including constipation, anal gland rupture, intestinal foreign bodies, parvovirus, hemorrhagic gastroenteritis, infections, inflammatory disorders, perianal fistulas, coagulopathies and cancer.   If you notice a small amount of blood in your dog’s stool but it otherwise looks normal and your dog seems to feel fine, a wait-and-see approach is reasonable, but if the bloody stools continue and/or your dog starts to act sick in any way, make an appointment with your veterinarian.   When dogs bleed from the upper gastrointestinal tract or swallow blood, the digestive tract partially digests the blood, making their stools dark and tarry. This is called melena. Melena has many potential causes including gastrointestinal ulcers, foreign bodies, cancer, blood clotting disorders, and respiratory diseases that cause dogs to cough up and/or swallow blood.   Small amounts of digested blood are hard to see in normally brown dog poop. Therefore, if your dog has enough blood in his stool to make it dark and tarry, call your veterinarian as soon as possible. A dog’s intestinal tract produces mucus to help move poop along and to protect its delicate tissues. Normally, mucus is not visible on dog poop, but every now and then dogs will produce so much mucus that their poop becomes a slimy mess. Anything that is irritating to the intestinal tract can cause mucus production to increase, including intestinal parasites, foreign material, infections, dietary intolerances or allergies, inflammatory disorders and tumors.   If a healthy dog has one or two mucus-covered poops that resolve on their own, you don’t need to worry. However, if the problem continues for a few days or is associated with signs of illness or discomfort, make a call to your veterinarian. Intestinal worms are usually not visible in a dog’s stool. While worms are alive, they are very good at staying inside a dog’s body. When just a few die at any given time, the canine digestive tract breaks them down just like it digests food. However, there are two cases when worms are commonly seen in dog poop.   Tapeworms shed body segments as part of their reproductive cycle, and these body segments can look like flattened pieces of rice in a dog’s stool, in the fur around the anus, or on dog bedding. To get rid of tapeworms, give your dog a deworming medication specifically labeled for tapeworms (look for the active ingredients praziquantel, epsiprantel, or fenbendazole) and closely follow the product’s instructions.   After deworming, large numbers of worms may die at one time and be passed from the body in bowel movements. This is nothing to worry about as long as a dog continues to poop without too much straining and seems to feel fine. If, however, your dog’s condition worsens after deworming, call your veterinarian. Some types of mouse and rat poison are dyed a bright green color so that they can easily be identified in the environment, or in your dog’s poop. These poisons smell and taste good to attract mice and rats, but unfortunately dogs also see them as a yummy treat. If your dog’s poop is bright green (or if his vomit is similarly colored) make a trip to your veterinarian immediately. Delaying treatment can have fatal consequences. Some dogs will chew on and swallow almost anything, which can result in plastic, rubber, rocks, wood, etc. being visible in their poop a few days later. If the pieces are small and soft enough, there is a good chance they will pass through the gastrointestinal tract without causing problems. Larger objects can become lodged along the way, however. If your dog starts vomiting, has a poor appetite, isn’t pooping normally, or seems to be uncomfortable, make an appointment with your veterinarian. Normal digestion should break down dog food to the point where what comes out in the poop no longer looks like food. If you are seeing what looks like food in your dog’s poop, take notice. Unless you are feeding your dog lots of notoriously hard-to-digest ingredients (like raw carrots or whole corn), their digestive system may not be working properly.   For example, dogs who routinely produce stools that look greasy should be evaluated for exocrine pancreatic insufficiency. The pancreas is responsible for producing many digestive enzymes, including those that break down fat. When the pancreas isn’t making enough of these enzymes, dietary fat passes through the gastrointestinal tract more or less unchanged and is visible in the stool. Healthy dog poop can vary a lot from one individual to another due to dietary and digestive differences. What may be normal for one dog can be signs of a problem in another. That said, healthy dog poop is usually some shade of brown, is relatively uniform in consistency and color, and should be firm enough to hold its shape without being so hard as to be difficult to pass. If you monitor your dog’s poop as you clean it up, you’ll get a good idea of what is normal for him. Persistent changes that can’t be explained by a change in diet are worth bringing to your veterinarian’s attention."}]