[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Pet Safety Tips for After a Hurricane Hits", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/after-hurricane-pet-safety-1022286592.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/after-hurricane-pet-safety-1022286592.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/6-pet-safety-tips-after-hurricane-hits"}, "datePublished": "September 17, 2018", "dateModified": "September 7, 2022", "description": "There are many guides for pet hurricane safety when it comes to preparing for a hurricane, but what about tips for after? Learn how to properly care for your pet and keep them safe during hurricane aftermath.", "articleBody": "Reviewed and updated for accuracy on September 17, 2018 by Katie Grzyb, DVM   While hurricane safety is often a topic of conversation—how to prepare for it and what to do if disaster strikes—few pet parents are actually ready for what comes after.   From contaminated waters to dangerous animals to mosquito-borne illnesses, the hurricane aftermath requires just as much preparation as the actual storm does.   Here are six ways to prepare your pets for the dangers that come after the storm. One of the biggest pet safety issues to worry about during the hurricane aftermath is excess moisture and the trouble that it can create for your furry companion.   “Excess moisture during or immediately after natural disasters like hurricanes and floods can increase the risk of both skin and ear infections in pets from bacteria and yeast/fungus,” says Dr. Jacquelyn Schrock, DVM, Director of Veterinary Quality at Banfield Pet Hospital. Dr. Schrock was on the ground when Hurricane Harvey hit.   In addition, you should also watch out for moist dermatitis, also known as hot spots. “Hot spots can develop not because of being drenched, but because the dog is stressed from the storm and does things like chewing on its paw or scratching one spot a lot,” says Dr. Mary Carlson, DVM, MA, CVA.   Dr. Carlson was a former guest researcher at the Centers for Disease Control and Prevention and author of the veterinarian’s memoir, Drinking from the Trough. “Hot spots are more common in dogs that have a heavy undercoat, especially in humid environments, where the undercoat tends to stay damp. The skin gets irritated, the dog scratches, the scratches become swollen and infected, and you&#039;re on the way to the vet.”   As a first line of defense, Dr. Schrock recommends packing towels for dogs in a waterproof bag and drying off your dog as soon as possible. “Wash your dog with clean water and soothing dog shampoo (chamomile or lavender are good choices) if possible,” Dr. Carlson says. “There are medicated dog shampoos that can help, too.” Hurricane safety sometimes includes dealing with unexpected guests in the form of dangerous animals. “Although it depends on the region and wildlife that inhabit it, during natural disasters, we often see wild animals ranging from snakes to alligators in places they aren’t usually found, including near or inside our homes, as they seek safety or higher ground—or are inadvertently relocated by high wind, rushing water or a wildfire,” says Dr. Schrock.   In addition, Dr. Carlson points out that any animal can be dangerous after a severe weather event, including those you wouldn’t normally consider dangerous. Following natural disasters, animals are stressed and disoriented, as well as possibly ill, which can cause abnormal behavior.   To keep your pets safe, Dr. Schrock recommends keeping them leashed or in a small pet carrier and always out of standing water. This becomes essential after a flood, hurricane or major storm. Dr. Carlson warns that you have to watch out for anything from broken glass and building materials from damaged homes to sharp metal objects (like nails or torn siding).   “After a natural disaster like a hurricane, you may also see limbs from trees, roofing material, downed power lines, siding from homes and various other hazards on the ground,” says Dr. Schrock. “These can pose various risks to pets, ranging from scrapes to lacerations to electrocution.”   While dog boots might offer some protection on dry ground, Dr. Carlson says you shouldn’t rely on them too much. “They might provide some minor protection, but they&#039;re going to get soaked and they&#039;ll slip off,” Dr. Carlson says. Drinking contaminated water can bring about a lot of trouble after a hurricane or flood. “Salt water, brackish water, dirty water and even clean-looking standing water all pose disease threats,” says Dr. Edward M. Wakem, DVM, Ceva Veterinary Services Manager and American Heartworm Society board member.   As a general rule, Dr. Wakem says that if water from a particular source is unsafe for human consumption, then a pet shouldn’t drink it either. “Preparing for a disaster includes providing for a safe water supply,” says Dr. Wakem. “Bottled water, water filters and decontamination supplies should all be considered in preparing for a hurricane.” Heartworms are very serious and potentially fatal parasites for dogs and cats—and you’ll find heartworms wherever you find mosquitoes.   “Unfortunately, natural disasters that result in heavy rains and flooding give mosquitoes the opportunity to multiply in standing water, further increasing the likelihood of the spread of heartworm disease to your pet in the weeks and months that follow,” says Dr. Schrock.   Preventing these parasites by using pet prescription heartworm medicine is key when it comes to heartworms. Monthly oral medications, monthly topical medications, and even a twice-a-year injection (for dogs only) are all available and should be used without a lapse in protection.     When it comes to post-storm pet safety dangers, some of the biggest ones can&#039;t be seen with the naked eye. Fungal agents, some molds and a host of bacteria, especially in warm, moist places, can all cause serious infections in people and pets, explains Dr. Carlson.   “Leptospirosis is a dangerous bacterium that can cause kidney and liver failure,” says Dr. Carlson, adding that you should also watch out for things like feces/urine waste contamination, which can result in e. coli and giardia (protozoan parasite) infections.   It is important to keep your pets up to date on vaccines and heartworm prevention, as rabies, distemper, leptospirosis and heartworm disease outbreaks tend to occur in these areas due to the wet environment. Even tiny scratches or cuts can get easily infected if your pet is walking in dirty water or rough terrain, so having a cat or dog first aid kit ready is essential if disaster strikes—like the Kurgo first aid kit.   Aside from basic things like gauze and nonstick pads, bandage material and cold packs, Dr. Wakem also recommends a 90-day supply of pet meds to manage any chronic disease your pet might have.   In the hurricane aftermath, delivery trucks carrying your pet’s medications might not be able to access your area due to downed trees or flooding. Order them from your pet pharmacy well before evacuation orders, because delivery trucks will not be able to enter areas that are under evacuation.   “Particular conditions to be concerned with are diabetes, heart disease and epilepsy,” says Dr. Wakem. “If your pet is on controlled medications, discuss with your veterinarian the best way to secure these drugs—and consider medical alert tags or collars.”   Your kit should also contain supplies to manage temporary gastrointestinal upsets and minor wounds and infections, and Dr. Wakem suggests speaking to your veterinarian about medications, supplements and products to manage fear anxiety and stress in your pets.   “Elderly pets may be particularly affected,” says Dr. Wakem. “Products such as pheromone sprays and collars, together with comforting garments, shelter covers, and blankets can contribute to alleviating stress.”"}]