[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Essential Tips for Picking Up Dog Poop", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/poop-scooping-tips1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/poop-scooping-tips1.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/8-essential-tips-picking-dog-poop"}, "datePublished": "August 29, 2016", "dateModified": "September 7, 2022", "description": "Dog waste carries harmful microorganisms that can have a major impact on wildlife and the environment, so picking it up is not only good manners, in most locations it’s the law. The following tips will help you get down and dirty with all things poop removal.", "articleBody": "By Victoria Schade   No one likes scooping pet waste. It’s messy and smelly, but cleaning up is a very necessary part of being a responsible pet parent. Dog waste carries harmful microorganisms that can have a major impact on wildlife and the environment, so picking it up is not only good manners, in most locations it’s the law. The following tips will help you get down and dirty with all things poop-removal related. You’re ready to embark on weekly yard cleanup, and even though you know your dog has been eliminating at least twice a day every day, you can’t seem to find a single pile! Rather than wandering aimlessly, start in the corner of your yard and work methodically across your property. Walk in a straight line from one corner of your yard to the other, scanning the ground not only in front of you (to avoid stepping in it) but also on either side of you. Zig-zag carefully, picking up after your dog along the way, until you’ve covered the entire space. Some dogs like to put distance between their piles, while others are creatures of habit that prefer to deposit in the same vicinity over and over. No matter what your dog’s pooping preference is, scour the entire surrounding area once you find a single pile. It’s likely that you’ll find others either very close to the original pile, or within the general region. Your dog is off leash at the dog park and decides to do his business on the other side of the field from where you’re standing. You’re a responsible pet parent, so of course you’re going to clean it up, but when you get to the spot you can’t locate the evidence. The best strategy to assist with long-distance pickups is to find a landmark like a branch on the ground, fence post or plant that’s close to where your dog is doing the deed. That way you’ll be able to close in on the precise spot quicker when you get there. If you walk your dog at night, or are in the process of potty training a young puppy, you’re probably well-acquainted with the challenges of finding deposits in the dark. Rather than relying on the moon and squinting at the grass, grab a flashlight so you can zone in on the pile quicker.  You know if your dog is a wandering pooper (meaning, she travels as she goes), so don’t shirk on picking up the extra nuggets that fall outside the main pile, no matter how small they are. Similarly, if your dog’s stools are loose, do your best to “exfoliate” the grass or sidewalk under the business. Sure, even modest cleanup efforts are appreciated considering that some people don’t pick up after their dog at all, but stepping in hidden poo residue can be just as offensive as stepping in a full pile. We’ve all used grocery store bags to clean up, and while picking up poop is always the right idea, this tool isn’t necessarily the best one for the job. Plastic bags stick around for years and actually “preserve” your dog waste in landfills. While there is no perfect solution for cleaning dog waste, biodegradable bags are a much more environmentally-friendly option. These bags are made from recycled materials and eventually break down, some types within a year. Flushable poop bags might seem like an even better option, but many waste systems, whether municipal or septic, can’t handle the unique properties found in canine excrement, like extra hair. Research your bathroom setup before flushing your dog’s deposits. Waste is waste, and waste is compostable, right? By now, it should be clear that dog waste is in a category by itself. Unfortunately, the constant heat required to kill the parasites present in dog poo far exceeds what the typical DIY composting set-up can produce. It is possible to compost dog waste in the right conditions, but even then it should only be used as fertilizer for ornamental plantings, not edible plants.  Because dog waste contains so many parasites, it’s critical that indoor “number two” accidents are properly sanitized. An odor eliminator created for pet messes will tackle the smell, and an environmentally friendly, dog-specific disinfecting cleanser will kill the dangerous parasites. Remember, even though it might look clean it doesn’t mean that it actually is clean until you take care of the invisible nasties.   Victoria Schade is a certified dog trainer and author."}]