[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Signs of a Bad Boarding Kennel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/bad-boarding-kennels-main.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/bad-boarding-kennels-main.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Travel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/8-signs-bad-boarding-kennel"}, "datePublished": "July 18, 2016", "dateModified": "September 7, 2022", "description": "How do you know that a boarding kennels is a safe place to leave your pet while away? Learn what signs you should look for to identify bad boarding kennels.", "articleBody": "  By Monica Weymouth   Getting ready to leave for vacation can be hectic. There’s work to square away, suitcases to pack, neighbors to inform and thirsty petunias to consider. One thing you don’t want to overlook? Thoroughly researching your pet’s boarding kennel. Not all facilities are created equal, so we checked in with the experts for some common red-flags and signs that you should book Fluffy a room elsewhere.   Your dog can’t call you to report a problem, and cats rarely text back. With that in mind, it’s important to personally inspect the boarding facility. “You should physically see the space your pet will be kept in, and the staff should want you to see it and be proud of it,” says Carmen Rustenbeck, executive director and founder of the International Boarding and Pet Services Association (IBPSA), which provides education and certification programs. “If they aren’t happy to show you the facilities, no matter how many good reviews they have, I wouldn’t leave my pet there.” Showing up unannounced and asking for a tour is the best way to get a feeling for what the place is like on a day to day basis.   As pet parents know, accidents happen. That said, you shouldn’t be greeted with unpleasant odors when arriving to the kennel. “There’s no reason a facility should smell,” says Rustenbeck. Even if things do seem sanitary, she recommends asking what type of cleaning products are used to make sure they’re pet-friendly.    When checking your pet in, a reputable kennel will ask you to provide paperwork documenting your pet’s vaccination history. If not, your pet is at risk of contracting a potentially serious illnesses.    The kennel staff should be able to provide you with a detailed emergency plan that’s both species-specific and location-specific. If the kennel is in a flood-prone area, for example, they should know how to evacuate the cockatoos and the Chihuahuas. Furthermore, make sure to ask about around-the-clock staffing. “A lot of people assume that there’s a human on-site 24 hours, but that’s not always the case,” warns Rustenbeck. “If there isn’t, you need to know what happens if there’s an emergency at the facility and no one is there.”   Although the industry is largely unregulated, check to see if your kennel went the extra mile and invested in training. “We firmly believe that anyone who works in a pet care facility, including the receptionist, should be trained in pet care,” says Laaman. “They’re getting up and going to work every morning and taking on a huge responsibility.”   It’s important that your dog has plenty of opportunities to play and socialize while at a boarding facility, but it’s also important that everyone is safe. “Playgroups should be divided by size and by temperament,” says Rustenbeck. “Sometimes we forget that all dogs have their own personalities. If you have a 75-pound geriatric dog, you don’t want to just put him with the larger dogs—he may be big, but he’s probably less playful.”   Simply having access to the outdoors isn’t enough. Make sure the area is clean, that dogs have access to shade and water, and that there is a high, double-fence system to prevent any escapes. That said, pet parents have to do their part, too. “If your dog is a gymnast, no matter how high the fence, let the facility know,” advises Rustenbeck.   When it’s time to check out, you should expect to hear about how your pet did—after all, your pup can’t quite fill you in on the ride home. “Minimally, they should be able to provide you with a verbal report of how well your dog did, and there should be some detail—who their best friend was, how they were eating, how were their walks,” says Laaman. "}]