[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Things That Give Your Pet Gas", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/pet-gas-causes1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/pet-gas-causes1.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Digestive health, General Care, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/6-things-give-your-pet-gas"}, "datePublished": "August 10, 2016", "dateModified": "September 7, 2022", "description": "Gassy pets are no fun to live with. While the occasional toot is normal and necessary, too much stinky gas can seriously affect the bond between people and their pets. Thankfully, most causes of excess pet gas can be managed with a few simple interventions.", "articleBody": "By Jennifer Coates, DVM   Gassy pets are no fun to live with. While the occasional toot is normal and necessary, too much stinky gas can seriously affect the bond between people and their pets. Thankfully, most causes of excess pet gas can be managed with a few simple interventions. Here’s a look at the common things that give pets gas and how pet parents can handle them. Pets that eat quickly can swallow a lot of air, and what isn’t burped up will make its way into the large intestine (colon), where it is destined to become a fart. While the gas that is created by swallowed air generally isn’t smelly, it increases that overall volume of gas that is produced.   Encouraging pets to eat more slowly will usually reduce that amount of air that they swallow, and many top pet retailers carry bowls specifically designed to slow the rate at which pets eat. For a quick at-home remedy, try putting a large (too large to fit in his mouth), clean rock in your pet’s bowl so he has to pick around it to eat his food.  Low-quality ingredients or diets made with lots of fermentable fiber tend to cause a lot of pet gas. Any ingredient that isn’t absorbed in the small intestine will make its way into the large intestine, which is home to masses of bacteria that use this material as food and produce gas as byproduct. Cutting back on the amount of food these bacteria receive will reduce the amount of gas that is produced.   Look at the ingredients used to make your pet’s food. A high-quality diet will have one or more animal-based protein sources (meat, fish or eggs) at the top of the ingredient list, and most of the ingredients should sound like something you’d eat. Avoid diets that contain a lot of fermentable fiber including chicory, inulin, fructooligosacharides, pectins, psyllium, plant gums, oats, barley, beet pulp, fruits and legumes.   Additionally, some pet foods are designed to be highly digestible, which by definition means that less material will make it to the large intestine. Look for the words “highly digestible” or “low residue” on the label. If you can’t find an appropriate diet at the pet supply store, talk to your veterinarian about products that are available by prescription only. Dogs and cats need a lot of protein in their diets, but too much meat can be a cause of particularly stinky gas. Meat, especially red meat, contains a lot of sulfur, some of which will make its way into the large intestine. When gut bacteria get to work on sulfur, the gasses they produce truly reek. If your pet is eating a high-protein diet and produces especially foul smelling gas, the meat may be to blame.   Try switching to a diet that is slightly lower in protein and is not made from red meat. Most adult dogs do extremely well if their food consists of around 25 percent protein on a dry matter basis (a calculation that removes the food’s water content). Adult cats need more. A food in the range of 33 to 36 percent protein on a dry matter basis will meet all their needs without potentially providing the extra protein that can lead to stinky gas. When dogs and cats are young, they make a lot of lactase, the enzyme responsible for breaking down lactose, a sugar contained in milk. But as pets age, they lose some of this lactase. If they lose enough, they can become lactose intolerant. When a pet with lactose intolerance eats food containing a lot of lactose (which includes most dairy products), the sugar isn’t absorbed but travels to the large intestine where bacteria break it down, producing a lot of gas.   While most pet foods don’t contain dairy products, check yours if your pet is producing excess gas and, if it contains any dairy, try switching to another diet. Additionally, refrain from giving your pet cheese, milk, yogurt, ice cream, etc. If your pet’s gas improves after you eliminate dairy, he could very well be lactose intolerant. Just like people, some pets simply can’t handle a lot of variety in their diet or withstand ingredients that make their digestive systems work harder than normal. While some humans have the proverbial stomach of steel, just the thought of eating a deep-fried jalapeno pepper is enough to make others queasy. This type of variability affects our pets’ and their digestive tracts, too. Intermittent excess gas production is a common symptom of a sensitive stomach, particularly if the gas increases after your pet has eaten something new or unusual.   If you think that your pet might have a sensitive stomach, the first thing to do is to eliminate all the extras in his diet. Feed your pet only his regular diet and water – no table scraps or treats – and make sure he’s not getting into anything around the kitchen, dining room, in the yard, or on walks. Do this for about two weeks, and if his gas is much improved, you know that at least one of the extras was to blame. You can now reintroduce food items one-by-one to try determine the culprit of the gas. Sometimes pet gas is more than an annoyance, and it can be a sign that your pet is ill. Diseases that are commonly associated with excess gas production include:   Exocrine pancreatic insufficiencyGastrointestinal infectionsIntestinal parasitismPancreatitisFood allergy or intoleranceInflammatory bowel disease  Most of these conditions will cause symptoms like weight loss, changes in appetite, vomiting, or diarrhea in addition to gas. If your pet is acting sick in any way, make an appointment with your veterinarian.   Finally, if your vet has given your pet a clean bill of health and nothing else you’ve tried has worked, Yucca schidigera (which several studies have shown can make farts less smelly) might help. Yucca schidigera is available as a supplement and is now even being included in some dog foods."}]