[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Poisonous Mushrooms That Are Toxic to Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/poisonous-mushrooms-dogs-main_1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/poisonous-mushrooms-dogs-main_1.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning, Safety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/6-poisonous-mushrooms-are-toxic-dogs"}, "datePublished": "May 25, 2016", "dateModified": "September 7, 2022", "description": "Can dogs eat mushrooms? The answer is—not all of them. Find out all about poisonous mushrooms and which wild mushrooms your dog should avoid at all costs.", "articleBody": "By Caitlin Ultimo   Poisonous mushrooms that grow in the wild can be extremely difficult to identify, but they cause serious harm to your dog if you’re not careful. While some dangerous mushrooms may have obvious warning signs, like stay-away red caps, others can appear rather benign and look similar to the mushrooms you may buy at tho grocery store. And while store-bought mushrooms are actually safe for your dog, the ones that grow in the wild—even if they look similar—are not.   “Some wild mushrooms are liver toxic, others cause neurological issues, and even the least potentially dangerous species can cause severe signs of stomach upset,” explains Tina Wismer, a board-certified veterinarians and medical director of the ASPCA Animal Poison Control Center.   “Owners must always be aware that there are poisonous plant and fungal species that exist in the wild,” says Jennifer Good, DVM, and staff doctor at NYC’s Animal Medical Center. “Given the difficulty in identifying which species a dog may come across, all mushroom ingestions should be treated as emergencies by owners and veterinarians alike.”   As a general rule, try your best to keep your dog away from mysterious mushrooms growing outdoors and read on for some common poisonous mushrooms that you may encounter:   Poisonous liver-toxic mushrooms include: - Amanita phalloides (Death Cap Mushroom) - Amanita ocreata (Angel of Death) - Lepiota (False Parasol) - Galerina   Mushrooms that present the greatest threat for dogs are what veterinarians refer to as liver-toxic mushrooms. “The most dangerous species of mushrooms contain hepatotoxic cyclopeptides, such as amatoxins (the most toxic), phallotoxins, and virotoxins,” says Good. Species that contain these toxins include Amanita phalloides, known as the Death Cap or Death Angel, Amanita ocreata also referred to as the Angel of Death, the Lepiota or False Parasol and Galerina, which are small nondescript, brown mushrooms that grow in mossy or forested areas after a heavy rain. “This class of mushroom is responsible for the vast majority of both human and pet fatalities worldwide,” says Good.   These species of mushrooms are especially dangerous, because not only do they attack a major organ, but you won’t see signs for several hours after ingestion. “In people, who have accidentally ingested these mushrooms, you can do a liver transplant, but we don’t do those in dogs,” shares Wismer. “We can support them and try to protect the liver, but typically if the symptoms persist for two to three days after exposure, it’s too late.”   Some of these liver-toxic amanita mushrooms are common in areas of California, but can be found in others locations across the U.S. too. If your dog is brought to the vet right after ingesting the mushroom, veterinarians may induce vomiting and use activated charcoal to bind the toxins to stop them from being absorbed.    Hallucinogenic Mushrooms include: - Conocybe - Gymnopilus - Psilocybe - Panaeolus   Mushrooms of the Conocybe, Gymnopilus, Psilocybe and Panaeolus species contain psilocin and psilocybin as their toxic components and are typically brown in color with differing cap shapes and patterns.  Hallucinogenic mushrooms, also referred to as magic mushrooms, can cause hallucinations, temporary weakness, disorientation, howling, abnormal mental activity and/ or seizures in dogs. “Ingestion of these species by dogs results in clinical signs within 30 minutes to 4 hours,” says Good.   Your vet may give your dog a mild sedative to help keep him calm until the toxins have worked their way out of his system. “It can take a couple of days for your dog to get back to normal, but hallucinogenic mushrooms are rarely fatal,” says Wismer.    Toadstool Mushrooms include: - Amanita pantherina (Panther Cap) - Amanita muscaria (Fly Agaric)   “Ingestion of the species Amanita pantherina known as the Panther Cap and Amanita muscaria also referred to as the Fly Agaric, are more commonly poisonous to humans, but can also affect your dog, due to the presence of isoxazole toxins.   “The toxicity results in psychotropic signs involving the central nervous system, including confusion, visual distortion, a feeling of greater strength, delusions or convulsions,” says Good. These mushrooms commonly grow in wooded areas throughout North America and have a red cap, which can also appear orange or yellow in color, and have white spots on the stem.    “Clinical signs can be seen within 30 minutes to 12 hours following ingestion, and include excessive sedation, trouble walking (ataxia), disorientation, pinpoint pupils (miosis), stiffness, weakness, seizures, tremors, respiratory depression and even coma or death,” says Good. That being said, the prognosis for dogs that consumes these mushrooms is fair to good with early, aggressive treatment.   Mushrooms that include muscarinic agents include: - Inocybe - Clitocybe   Mushrooms of the Inocybe species or Clitocybe species contain muscarinic agents, these toxins produce dysfunction at certain nerve endings. Commonly found across Western North America, these mushrooms can appear white or light brown in color and have white spores and white or pale-colored gills.   “With early detection and treatment, your dog will have a fair to good prognosis,” says Good. Clinical signs can be seen within two hours of ingestion, or even sooner in some cases. Some signs to look out for include: Hypersalivation, diarrhea, excessive tear production, urinary incontinence, vomiting and abdominal pain, while more severe signs may include trouble breathing, wheezing or coughing. Seek help from your vet right away, as, “Your veterinarian may be able to provide an antidote, called atropine, to help reverse those symptoms,” says Wismer.    False morel mushrooms include: - Gyromitra esculenta (Beefsteak) - Gyromitra caroliniana - Mushrooms in the Verpa genre - Mushrooms in the Helvella genre   Commonly found in areas with sandy soils under coniferous trees across North America, these species are slightly less poisonous in nature than the previously mentioned mushrooms. Typically, their caps will appear reddish brown, with a shriveled texture. The mushrooms contain hydrazines as their toxic substance, and clinical signs will generally appear within six to eight hours after ingestion, and are generally limited to gastrointestinal signs such as vomiting and diarrhea. “On rare occasions, central nervous system signs can present themselves, including seizures, lethargy and coma,” says Good.    These mushrooms include: - Boletus - Chlorophyllum - Entolomo   Found throughout the US, “The least toxic species of the poisonous mushrooms include the Boletus, Chlorophyllum and Entoloma species,” says Dr. Good. These fast-acting mushrooms vary in shape, color and size and are gastrointestinal irritants that rarely result in life-threatening signs. You’ll see clinical signs, including vomiting, diarrhea and loss of appetite typically within an hour or less after ingestion. These symptoms often resolve themselves without treatment. Still, you will want to consult your vet, “who may recommend your dog receive fluids and anti-vomiting medication to help prevent possible dehydration,” says Wismer.   Before visiting a new outdoor area with your pet, take some time to check the out the North American Mycological Association, that lists poisonous mushrooms that are popular in different regions across the U.S. And, keep your dog on a leash while exploring new trails, off-leash walks make discouraging your pet from scavenging and accidentally eating a poisonous mushroom more difficult. “Mushrooms will grow where there is dead organic matter in the soil, say under a rotting piece of wood or in a compost pile and will typically pop up after a rain,” says Wismer, “So check your yard after it rains and pick any mushrooms growing in your yard before letting your dog outside.”    “If you witness or even suspect that your dog has eaten all or part of a mushroom, try to get a sample of the fungus to bring with you to the veterinary hospital,” Good explains. This will help with quick identification and appropriate action. “Make sure to place mushroom samples in a paper or wax-paper bag, and refrigerate until it can be given to you vet,” says Good. “Plastic bags should be avoided, as they can cause the sample to change color, deteriorate or liquefy, making identification difficult.”"}]