[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Manners: Why It’s Important to Teach Your Dog to “Say Please”", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/walking-a-weimaraner-picture-id172279213.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/walking-a-weimaraner-picture-id172279213.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/dog-manners-why-its-important-teach-your-dog-say-please"}, "datePublished": "May 7, 2019", "dateModified": "September 6, 2022", "description": "Find out why dog manners are so important and how you can help your dog brush up on their dog etiquette.", "articleBody": "Is your dog bossy? When it’s time to go for a walk, does he leap on you when you try to leash him up? Or, does he demand his meals by barking as you prep his food? Bossy dogs have learned that manners don’t matter because they usually get what they want if they push hard enough. But, teaching your dog manners, specifically how to say “please,” can transform your dog’s behavior as well as your relationship. The “nothing in life is free” program is a dog training protocol you can use to help your dog understand that being polite is the only way to get what they want. Why Dog Manners Help Teaching your dog to say please is actually a radical change for both ends of the dog leash. It requires dogs to adjust how they ask for resources and forces pet parents to be mindful about the many ways they can implement the technique. Since dogs will usually stop acting obnoxious once they get what they want, we often give into to our dogs’ pushy requests because it’s easier than trying to deal with inappropriate behavior. For example, to keep a dog from scratching at the door, most pet parents simply open it. To quiet pre-breakfast barking, many pet parents might hurry through the prep routine. By accommodating these behaviors, we are accidentally teaching our dogs that scratching, barking and begging work. Learning to say please is a simple but powerful way to short-circuit that belief in your dog while teaching him self-control. How to Train Your Dog to Say Please You can teach your dog any calm behavior as a way to say please, but sit is the easiest to use. The goal is for your dog to automatically assume the sit position when he wants something rather than waiting for you to ask for him to sit. In time, your dog should generalize the concept that sitting makes good stuff happen! To teach this, simply wait for your dog to sit before you begin “working” for him. Dogs that have a lot of practice being bossy probably won’t offer the position, so you might have to subtly lure your dog into the sit. Dog Manners Troubleshooting Try to avoid asking your dog to sit, because doing so won’t make him realize that he can trigger you to begin doing something for him by sitting. Your dog might have a hard time quitting the tricks that used to work to get him what he wanted, particularly if he’s been doing them for a while. The secret is showing him that barking, whining and pushy behaviors will actually make you stop working for him! If he barks louder as you begin meal prep, put his bowl down and walk away until he’s quiet. Doing so actually adds a second layer of manners to your dog’s repertoire; your dog must say please with silence and sitting before he gets what he wants. When to Implement the “Say Please” Program There’s no limit to the situations where you can use the “say please” program. Imagine you’re interacting with a friend or family member; if you’d expect them to say please for your assistance, then your dog should be able to do the same. The following are just a few examples of how to get your dog to say please in everyday life:  Meals: Instead of dealing with pushy pre-meal behavior, wait for your dog to sit before you begin food prep. It can be tough for dogs to tone down over-the-top behavior because mealtime is exciting. So you might have to put down the dog bowl and pause the process until your dog is able to settle down.  Walks: Getting ready to go for a stroll is especially tough for many dogs, because going outside is the highlight of their day! Instead of letting your dog bark and leap as you get ready, wait for his rump to hit the ground before you leash him up. Outdoor access: Rather than letting your dog scratch up your door when he wants to go out, wait for a polite sit instead. Car manners: Getting your dog to say please when he’s ready to get out of the car isn’t just about manners—this polite behavior doubles as a safety measure. You can try opening the door and blocking it with your body until your dog sits. Before you throw a ball: Incorporating a quick sit into a round of fetch is a great way to unite basic dog training, manners and fun! Wait for your dog’s rump to hit the ground, and then quickly toss the ball so he makes the connection between his behavior and the continuation of the game. Get creative: Many dogs act as alarm clocks for their people, and you probably don’t want to work on obedience training before you’re awake. However, you can teach your dog to say please on the go by remaining in bed until he’s quiet. That way he’ll figure out that being noisy makes you stay in bed, but being quiet will convince you to start the day.   By: Victoria Schade Featured Image: iStock.com/sbrogan"}]