[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Are Vapor Wake Dogs?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-vapor-wake.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-vapor-wake.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/what-are-vapor-wake-dogs"}, "datePublished": "January 30, 2018", "dateModified": "September 6, 2022", "description": "Law enforcement agencies have had to find effective ways to defend the public from growing terrorist threats. Enter Vapor Wake Dogs, a class of K-9s trained to detect and deter suicide bombers.", "articleBody": "By Paula Fitzsimmons Law enforcement agencies have had to find effective ways to defend the public from growing terrorist threats. Enter Vapor Wake Dogs, a class of K-9s trained to detect and deter suicide bombers. The demand for Vapor Wake technology is growing, and with good reason. Many in the security industry consider it the gold standard for public safety, says Dr. Calvin Johnson, dean of the College of Veterinary Medicine at Auburn University in Alabama, where the technology was developed. “When I see Vapor Wake dogs working at an airport or a stadium, I am confident that the venue has taken the appropriate steps to secure the facility beyond the capabilities of screening personnel, mechanical detection systems, or passenger imaging systems,” Johnson says. This added level of security doesn’t come easily, however. A lot of thought and training goes into the grooming of these four-legged powerhouses.   Vapor Wake Technology Researchers with Auburn’s Canine Performance Sciences (CPS) program began developing Vapor Wake technology over a decade ago to address terrorism, says Kristie Dober, business development and sales manager at VWK9, the company that holds exclusive rights to this patented technology. Vapor Wake dogs are trained to sample the air for human heat “plumes” that may contain explosive particles. When a person begins moving, that plume trails behind, similar to how a boat or flock of geese may leave a wake pattern in the water. The dogs can detect explosives in large, moving crowds and in distracting environments like airports, concert venues, and theme parks. Although the technology has been available for almost a decade, it has just recently entered the mainstream. These K-9s are perhaps most widely recognized for their participation in the Macy’s Day Thanksgiving Day Parade in New York City, but Dober says there are 150 Vapor Wake dogs working throughout the country at a variety of venues. Clients include Disney, Amtrak (currently their largest customer), and certain Major League Baseball, National Football League, and college football teams. Police departments, including those in Chicago, Los Angeles, and New York City, recognize their value, too. The Lexington Police Department in Kentucky works with Tilly, a black Labrador Vapor Wake dog, says Sgt. David Sadler, the canine unit supervisor. “We have conducted sweeps at multiple festivals, including our annual Fourth of July event, Pride Day Festival, several University of Kentucky sporting events, and concerts held at Rupp Arena.”   What Makes Vapor Wake Dogs Unique? Traditional bomb-sniffing dogs—called Explosive Detector Dogs (EDD)—depend on their human handlers for instruction, Dober says. “They search where their handler asks them to sniff. These are dogs that check luggage, vehicles, office buildings, and suite venues.” Vapor Wake dogs can do this, too. “But what makes them different is that they’re trained to detect a suicide bomber in a crowd of moving people,” she explains. “So the dogs are not led by the handler, the dog is out front, the dog smells the air around people.” They trust their own finely-tuned sense of smell and are not compromised by the human handler’s behavior, says Auburn’s Johnson, who is board-certified in veterinary anatomic pathology. When a Vapor Wake K-9 senses an odor of interest, she reacts by leading the handler toward that person. “Typically, the dog follows the person and may be trained to sit when the source of the odor has been identified,” Johnson explains. “The person carrying the object of interest is never directly confronted by the dog—a security officer is alerted to the situation.” How Vapor Wake Dogs Are Chosen Auburn’s Canine Performance Sciences program fosters puppies through many generations of scientific selection, Johnson says. “Vapor Wake dogs from Auburn University begin with outstanding genetic composition as a result of a science-based breeding program that enriches the population for desirable traits.” Vapor Wake dogs need to possess certain key characteristics, including motivation, drive, excellent sense of smell, intelligence, socialization, versatility, and athletic performance, he says. Labrador Retrievers—which Dober says comprise 95 percent of Vapor Wake dogs—fit this bill.  “On occasion, other breeds are introduced into the Vapor Wake line to incorporate desired traits or to diversify the genetic profile,” Johnson adds. The 5 percent remainin consists of other floppy-eared, sporty breeds, like the German Shorthair, Dober says. Public perception is also taken into account, she says. “For example, if I’m a [law enforcement officer] and I’m walking through a crowd of people, say at an NFL game, and I have a German Shepherd or a Malinois, people will automatically move away from me because of the perception associated with police K-9s.” Labradors don’t have that same reputation. “When you have a Lab, people are less likely to move out of your path, which gives the dog the ability to search more people,” Dober says. “They’re not threatening, they’re unobtrusive. Most people don’t even know the dog is there because everyone knows someone who has a Lab. Labs are very user-friendly across all spectrums. They’re good with kids, they’re good with elderly people, they’re good with crowds. They’re not aggressive toward other animals.” A Rigorous Training Process Vapor Wake training begins at puppyhood. Dogs enter an 11-month “puppy school” program that incorporates socialization, health assessments, basic training, acclimation, and olfactory testing, Johnson says. “Individual prison inmates are paired with these dogs to develop basic skills and to become acclimated to a busy, regimented environment.”  The dogs complete their training over the next several months through the VWK9 Academy and are usually ready for service when they’re about 18 months old. “We don’t start putting them on explosives until they’re about a year old. At the 18- to 24-month mark is when they introduce a handler for another seven weeks of training,” Dober says. “The dogs given to the handlers are pre-trained. When they graduate the course, they graduate as a team and are certified by VWK9.” The dogs and their handlers are typically retrained and reassessed annually, “but it can occur more frequently depending on the environment in which the dog is performing and the odors the dog is being deployed to detect,” Johnson adds. Success rates of Vapor Wake dogs are tough to measure at this point because dogs working in the United States have not yet encountered an actual explosive device, Dober says. This may, in part, be because they’re effective deterrents—people are less inclined to bring explosives to events if they know a Vapor Wake dog is working there. “But that is changing and the reason why Vapor Wake has become so popular,” Dober says. “We will be moving into a time where the threat will be more real. We’ve seen that overseas, we’ve seen it in Manchester, so it’s just a matter of time before it’s on our doorstep.” It is our canine companions—with their unfailing loyalty—who may be our best hope for defense. Photo courtesy of VWK9"}]