[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Nip Problem Barking in the Bud", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/1918435619_a6b51812af.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/1918435619_a6b51812af.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/puppycenter/training/evr_dg_how_to_nip_problem_barking_in_the_bud"}, "datePublished": "June 2, 2011", "dateModified": "September 6, 2022", "description": "In addition to being cute, sweet, and cuddly, a new puppy can also be quite noisy. Those little yaps sound innocent enough in the beginning, but once he gets some bass in his bark, it becomes a big problem.", "articleBody": "Stop an annoyance before it becomes a major problem   This article is courtesy of Grandparents.com. By Phoebe Assenza In addition to being cute, sweet, and cuddly, a new puppy can also be quite noisy. Those little yaps sound innocent enough in the beginning, but once he gets some bass in his bark, it becomes a big problem. We&#039;ve listed some common reasons for barking and easy solutions for turning a little yapper into a quiet, happy pup. 1. Seeking Attention. In the beginning, a puppy will bark to get attention (and anything else he wants). The trick is not to reinforce this behavior by giving in and responding with food, treats, water or toys, as you would a crying baby. You can ignore the barks by walking away, then rewarding the puppy with treats or toys once he&#039;s quieted down. 2. Separation Anxiety. When your puppy barks as soon as you leave the house, you might not be leaving the right way. Don&#039;t make a big fuss when you&#039;re on your way out the door by cuddling, saying good-bye, and telling the dog you&#039;ll be back soon. Dogs don&#039;t get it. Make sure you&#039;re dog is occupied with toys and comfortable in his crate, and simply leave without saying anything. It seems harsh, but it will cut down on your puppy&#039;s anxiety tremendously. Also, don&#039;t shower your puppy with love and attention as soon as you return home, as much as you want to. In fact, don&#039;t even look at the puppy or say anything when you come through the door. Take five minutes, then retrieve the puppy from his crate. After some practice, he&#039;ll learn that your coming and going is no big deal, and that you&#039;ll always come back. 3. Boredom. Bored dogs bark simply because there is nothing else to do. If you always make sure to leave your dog with his favorite toys, a rawhide bone, food, and water, chances are he won&#039;t start barking. One of our favorite toys is the Kong, which you can fill with peanut butter or doggie treats. Dogs can spend hours on their own with one of these as they try to retrieve its treats. Grandparents.com loves pets! Read this article and some of their other columns here. Image: lucianvenutian / via Flickr"}]