[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Diving Dogs: Everything You Wanted to Know About Dock Diving", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-11/GettyImages-1591971718.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-11/GettyImages-1591971718.jpg"}, "author": {"@type": "Person", "name": "Janelle Leeson", "url": "https://www.petmd.com"}, "keywords": "Dog, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/everything-about-dock-diving-dogs"}, "datePublished": "November 3, 2023", "dateModified": "November 3, 2023", "description": "Dock diving for dogs is a great way to bond with your pup while they exercise. Lean all about diving dogs, including what you need, and how to join dock competitions near you.", "articleBody": "If your dog loves leaping into pools and lakes or soaring through the air to fetch their favorite toy, dock diving might be for them! This high-energy water sport is like a short-distance triathlon for your canine companion, says Sean Prichard, a certified canine fitness coach (CCFC) and head fitness coach at Pant &amp; Wag. Ready to take the plunge? Prichard says dock diving is highly rewarding and one of the most beginner-friendly canine sports for both dogs and their humans to learn. What Is Dock Diving? Dock diving is a combination of sprinting, leaping, and swimming. Dogs zoom down a platform before leaping into a body of water to retrieve a high-reward toy. The pup that launches themselves the longest distance or the highest before making a splash wins the competition. It’s a great mental and physical workout for any water-loving dog, providing a safe space to chase and retrieve. Dock diving also provides you and your dog the chance to meet other dock diving enthusiasts and their pups. The first competitive dock diving event took place in 1998, as part of Purina®&#039;s Incredible Dog Challenge. Scooter, a yellow Lab, clinched the title that year when he leaped an impressive 20 feet off the dock and into the small lake. Today, a 7-year-old Whippet named Sounders who holds the world record for the longest dock dive, an astonishing 36 feet and 6 inches. Can All Dogs Dock Dive? You don’t have to have a competitive bone to try dock diving, and no pup is too senior to enjoy the sport. “The minimum age to compete is 6 months and many competitions will have a special heat for dogs 8 years and older,” Prichard says. Or, you may choose to leisurely dock dive with your dog. Competitive handlers can be as young as 5 years old when accompanied by a parent or legal guardian on the dock. Once a handler turns 7, they can cue their dog to retrieve from the dock on their own. Just keep in mind that dock diving isn’t for every dog. Some dogs simply don’t enjoy the water, while others may not know how to swim or be healthy enough to do so. Pups with natural retrieval and swimming instincts, like Labrador Retrievers, Irish Setters, and Portuguese Water Dogs, are well-suited for the sport. However, any dog who enjoys water and fetching can participate. How To Train Dogs for Dock Diving According to Prichard, dock diving is one of the easiest canine sports to train for—as long as your dog has learned how to swim. Competitive dock diving requires dogs to sprint down and leap from a regulation 40-foot-long platform. The beauty of this doggie sport is that you can practice almost anywhere. In fact, dog diving training can start with “land work.” “Land work is training your dog for dock diving when you don&#039;t have access to water,” Prichard explains. Basically, you and your dog start with basic skills, like toy retrieval. This improves your dog’s confidence and awareness before you ever hit the pool. Dock diving may be easier than other canine sports for your pup to get the hang of, but it&#039;s not without important considerations. Before jumping in, consult your vet about introducing your dog to high-impact sports like dock diving.Many dogs naturally enjoy running and leaping into the water for a toy, instinctively knowing what to do with almost no training at all. That said, it&#039;s not uncommon to see pups plop into the water rather than gracefully soar. “If you have access to another dog that does leap, put both dogs on the dock at the same time and throw the toy. The non-leaping dog will quickly learn by example,” Prichard says. You can also practice on a downward-sloping ramp to encourage your dog to jump rather than plop. Dock diving classes or one-on-one work with a trainer can be found on websites such as North American Diving Dogs (NADD). Dog Diving Products Unlike some other extreme dog sports, dock diving doesn&#039;t require much gear. To practice dock diving, you’ll need to purchase a high-reward, water-safe toy. For water practice, you’ll also need access to a body of water and a platform (dock or pier) for your dog to jump off. If you&#039;re practicing land work only, a toy is the only dock-diving gear you’ll need. Other helpful products for dock diving include: Doggie life jacket: If your pup is just getting started, learning how to swim, or is a brachycephalic breed, a doggie life jacket is highly recommended. High-reward toy: The best dock diving toys are ones that don&#039;t force your dog to open their mouth too wide, as this can cause them to swallow water as they swim back. Some popular dog diving toys include floating bumpers, balls, and Wubbas. Note: your dog should associate this toy with dock diving only, so have another toy on hand for everyday play. Quick-dry towel for dogs: Dry your dog’s ears thoroughly after any water activities to avoid ear infections. Waterproof dog collar: To keep your dog&#039;s identification tags safely in sight. Only flat buckle-type or Martingale harnesses and collars are permitted at competitions. Leash: When not actively competing, dogs must be kept on a slip lead or standard leash that is a maximum of 4 feet long (DockDog Events) or 6 feet long (NADD events). Poop bags: Arrive at every practice and competition prepared to leave no trace with these biodegradable poop bags and convenient dispenser. Getting Involved in Dog Diving Competitions If you think your water-loving pooch might enjoy dock diving, “start with a simple game of fetch into a body of water. If the dog chases the toy into the water, that&#039;s a great sign your dog will enjoy dock diving,” Prichard says. Then, find a dock diving club near you. Organizations such as NADD and DockDogs offer training sessions and even tryouts where newbies can jump from an official dock. NADD and DockDogs both host regional and national competitions. To qualify for these events, your dog will need to earn a certain number of points at club events. Heats, or waves, are organized by your dog’s size and age. Always Discuss New Sports With Your Veterinarian Dock diving may be easier than other canine sports for your pup to get the hang of, but it&#039;s not without important considerations. Before jumping in, consult your vet about introducing your dog to high-impact sports like dock diving. Starting high-intensity activities is not advisable for puppies who haven&#039;t fully developed and are still growing. Additionally, dogs should generally be in good health to practice and compete in this sport. If your dog isn’t a strong swimmer or is a breed with brachycephalic airway syndrome, your vet may recommend extra precautions, such as wearing a life jacket to practice and compete. It&#039;s worth noting that dogs in heat or those who have been in heat within the last 30 days are not permitted to participate in DockDogs competitions. By following these simple precautions, you and your pup might just discover a sport that you can enjoy for a lifetime. Featured Image: Bill Chizek/iStock via Getty Images Plus"}]