[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Extreme Sports for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/australian-cattle-dog-catching-frisbee-disc-picture-id987190790.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/australian-cattle-dog-catching-frisbee-disc-picture-id987190790.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise, Play, Zoo Competitive Animal Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/8-extreme-sports-dogs"}, "datePublished": "April 22, 2019", "dateModified": "August 30, 2023", "description": "Check out these extreme sports for dogs and find out how you can get started training with your pup.", "articleBody": "Reviewed for accuracy on April 22, 2019, by Dr. Katie Grzyb, DVM Sure, you could play fetch with your dog in the backyard and call it a day. But if you really want to boost your pup’s workouts and mental stimulation, get her involved in some extreme sports for dogs. Many dog sports have organizations or training classes you can join where you can work on training but also make some new friends—both canine and human. “For owners, it is a great opportunity to meet other owners, learn from the experience and enjoy a social activity,” says Doug Ljungren, executive vice president for the American Kennel Club’s Sports &amp; Events. Plus, “The more exposure your dog has to others, the better socialized she’ll be.” Which Dog Sport Is Right for Your Dog? Not sure which particular sports for dogs to go for? Check out a few videos on social media to get familiar with the events first, and then attend an event, recommends Ljungren. Prior to starting any of these dog sports, you should always discuss your plan with your veterinarian. They will be able to factor in your dog’s age and health into the decision so you can make sure they are up to the challenge. Many of the high-impact dog sports—those that require sharp turns, speed and jumps, like agility and flyball—usually require a dog to be at least 12-15 months old, he explains. Ljungren also says that you will want your dog to have knowledge of basic commands. “The most important thing about the sport is that you and your dog are enjoying it, regardless if you are the best,” Ljungren says. Dock-Diving Dogs In dock diving, dogs compete for the highest or longest jump into a pool. In the distance event, you toss your dog’s favorite toy into the water and, on your command, he runs down the dock and leaps into the water to retrieve the toy. Some dogs can jump 5 or 6 feet, while others can jump 20 feet or more. Best suited for: Dogs that swim well enough to fetch a toy in water.  “There has to be enough of a balance between [having] a toy drive and being unafraid of the water,” explains Steve Mize, the operations manager for North American Diving Dogs (NADD), who has several dock-diving dogs himself. Training: While some dogs (many Labs and Goldens) are naturals, it’s always a good idea to take a class or do a few one-on-ones with a dock-diving pro. You’ll be able to train your dog to run faster and jump farther, and the pro can teach you how to time your throw so you don’t injure your dog, says Mize. You don’t need much in the way of equipment: a towel (for drying you and your pup off) and a floating dog toy, like the SportDog’s plastic training dummy, are all you really need to train your dog for dock diving.    Good to know: NADD events have tryouts where you and your pup get two turns at the dock with a coach to see if this is a dog sport your pup enjoys. Dog Lure Coursing In dog lure coursing, dogs chase a white plastic bag that’s attached to a mechanical line around an open field. Dogs must be able to keep their eye on the lure as it zips around in all sorts of directions and, of course, make sharp turns as they run after it. They’re judged on their ability to follow the lure as well as their speed, agility and endurance. Best suited for: Dogs with a prey-and-chase drive, says Janette Mackey, who has been racing and coursing dogs for nearly 30 years. These include sighthounds (like Greyhounds, Rhodesian Ridgebacks, Whippets and Basenjis) or mixes that have been bred to hunt or course game. But even the muttiest mutt who loves to chase anything that moves will enjoy dog lure coursing! Find a lure-coursing or racing club by checking with the American Kennel Club (AKC) and the American Sighthound Field Association (ASFA) nearest you for lure practices and fun runs. Training:  Your dog already loves to chase things, so now you will have to teach her to keep her focus on the lure and not the other dogs. She also has to run without stopping or getting distracted, says Mackey. If you start training your pup from the get-go, it will take about a year for your dog to be able to compete. “But training time varies by the dog’s mental and physical maturity,” Mackey adds. Good to know: “It is very important the dog is fit and not overweight to help prevent injuries. Older dogs are also more prone to injury,” says Mackey. Dog Agility Dog agility competitions consist of a timed race where dogs must navigate a series of about 15-20 obstacles, including tire jumps, weave poles, tunnels and seesaws. Dogs are judged on their ability to get through those obstacles as flawlessly as possible. Owners have to work, too—they have to keep up with their dogs as they go through the course and spur on their dogs with gestures and commands. Best suited for: Any active dog that enjoys being with his owner, says Katy Chadwick, owner of the Brightside Training and Boarding in Dacula, Georgia. Herding dogs like Border Collies, Aussies and Shepherd mixes excel at agility because of their high energy levels and need for a job, she adds. Training: There are a lot of skills and obstacles involved, so training your dog for agility is time-consuming. “Typically, the average dog and handler team will need to train for a year before having the skills needed to compete successfully,” says Chadwick. If you want to compete, there are classes as well as private lessons. But even if you want to do it for fun, it’s good to get the basics under your belt with a pro to make sure your dog stays safe while navigating jumps and turns. Good to know: Hone your dog’s skills by practicing at home or in the yard. Keep practice sessions short and invest in some obstacles, like the Trixie agility dog training tunnel and the adjustable Trixie Agility dog training ring for jumping. Flyball Think of flyball dogs as canine relay racers. Each dog on the team has to run down a 50-foot lane, jump over four hurdles, and push a flyball box to release a tennis ball and catch it. Then, they race back with the ball to the start line so the following dog can go. The fastest team wins. Best suited for: Any dog that’s agile and speedy, says Kirsten Holt, who trains dogs in flyball and dock diving in Beavercreek, Ohio. That said, dogs should have the drive and motivation to work for rewards (whether dog toys or food). Training: Flyball dogs must learn to do five things: Wait their turn, jump the hurdles, push the box to release the ball, catch it, and run back to the start line with the ball in their mouths. “So, training involves breaking these things down into smaller puzzle pieces, then combining them once the dog fully understands each piece,” says Holt. It helps to find a Flyball club, which you can look up by going to the North American Flyball Association (NAFA) or the United Flyball League International (UFLI). Good to know: The minimum age for dogs entering competitions for both associations was 1 year old, but as of spring 2019, NAFA is changing it to 15 months old. Disc Dog This is a sport for dogs who love to catch flying discs and owners who love to throw them. “Disc dog” competitions have two types of divisions: one is distance throwing, where you toss a dog flyer disc and your dog catches it, earning points for a disc caught in midair or at a great distance. The other is freestyle, where your dog does tricks and jumps with multiple discs in a choreographed routine set to music. Best suited for: Dogs who love to tug, chase and retrieve discs, says Andrea Rigler, a dog trainer with Purina and a disc dog champion. Herders, terriers and sighthounds are particularly agile disc dogs, but any breed or mix can take part in competitions. Training: “I’d recommend attending a beginners’ seminar or taking a lesson with an experienced player to get the basics down—what to do to start and what to look for or avoid as potential problem areas,” says Rigler. Your job will be easier if your dog already catches and retrieves discs, though you may need to sharpen your throw. For freestyle, you’ll need to teach your dog the pattern and skills she needs for the routine. You know your furry companion is able to compete when your dog can catch the disc and bring it back without getting distracted by her surroundings, says Rigler. Good to know: Rigler says, “We have a high percentage of rescue dogs in the sport, which does mix up the breed type quite a bit.” So no matter your dog’s breed, you he can try out disc dog. Treibball Think of treibball (which literally means “push ball”) as herding, but instead of sheep, your dog is maneuvering big rubber balls. Dogs have seven minutes to push eight yoga or fitness balls into a goal using their noses or shoulders while taking cues from their owners. Then, they must lie down in front of the goal. Best suited for: Literally any dog that is able to be off-leash without getting distracted. It also helps if your dog has a lot of energy and likes having a job to do. Training: There is a lot of training involved in treibball, says Becky Johnson, owner of Pivotal Moment Dogworks in Arlington, Washington. Johnson trains dogs for such sports as dock diving, treibball and agility. “Dogs need to learn directions—like left, right, go out, come here—and have a steady stay,” she says. Then, you must teach your pooch to push the balls in a sustained way into a goal. “Treibball is a super-welcoming sport, and each step can be broken down so your dog feels successful,” says Johnson. Good to know: Treibball is a relatively new sport, but you can find a trainer in your area by going to the American Treibball Association. Dog Skijoring Dog skijoring is like a short, cross-country ski race—you’re on skis as your furry family member (or a team of up to three dogs) pulls you along. You must be a good skier yourself, and while any size dog can compete, a dog over 35 pounds will be better able to pull you along the trail. Best suited for: “Any dog that likes to pull can be trained to be a skijor dog!” says Mikki Douglass, who trains sled dogs and skijorers and competes herself.  “If your dog naturally wants to be out front on walks and you are frustrated by him pulling you along the trail, you have a sled dog!” Labs, mutts, Huskies—any breed or mix can turn into a dog skijoring natural. Training: Start on dry land, and make sure your pup knows that pulling only happens when he’s in his dog harness. (A back-pull harness works well, as does a training harness.) Once the dog harness is on, use one word (like “hike!” or “go!”) to let him know it’s time to stay out in front of you, gently pulling. Other skijoring commands to teach your dog before you go out on a public trail in skis are “whoa,” “wait” and “on-by” (“leave it” in skijoring), as well as left and right (“haw” and “gee”), says Douglass. If your canine companion doesn’t reliably understand these commands, he may get tangled up with other skijoring teams (or passersby), resulting in fights and bad feelings, adds Douglass. Good to know: Don’t use skis that have metal edges, which can seriously hurt your dog if he stops suddenly and you glide into him, says Douglass. If you don’t want to race, local sled dog clubs hold fun runs. Dog Surfing Dog surfing competitions are just that—beaches or large lakes where your dog can hang ten on a board and ride a wave to the shore. Dogs are judged by their technique (whether they sit or stand on a board), confidence and ability to stay on the surfboard. During the competitions, every dog must wear a dog life jacket (as do their owners). Best suited for: Like dock-diving dogs, surfer pups have to be comfortable in the water and know how to swim. It helps if your furry family member is a natural water lover, but even Bulldogs can ride the waves! Training: If you want to enter your pooch in a dog surfing competition, begin teaching her how to sit on the back half of the surfboard on dry land, says Debra Markwardt, the president of NADD and the proud owner of a competitive surfing dog. Then, go to the shallow end of the pool or lake to get your soon-to-be-surfer used to maintaining his balance on the board as it floats. Once he’s got that down, push the board out short distances. Next, move on to a beach to ride the small waves. “As your dog gets more comfortable on the surfboard, your dog may start to stand up, lay down, turn around and ride it backwards,” says Markwardt—all of which is allowed in surfing events. Good to know: Opt for a soft-top surfboard for your pup, says Markwardt. The soft foam and deck pads are easier for furry paws to grip. By Linda Rodgers Featured Image: iStock.com/Capuski"}]