[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Canine Positive Portable Kennel Training", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/395941977_81b5d412fb.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/395941977_81b5d412fb.jpg"}, "author": {"@type": "Person", "name": "Rolan Tripp, DVM, CABC", "url": "https://www.petmd.com/author/dr-rolan-tripp"}, "keywords": "Dog, Training, Crates and beds", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_canine_positive_portable_kennel_training"}, "datePublished": "February 2, 2011", "dateModified": "September 6, 2022", "description": "This article is courtesy of The Hannah Society. By Rolan Tripp, DVM, CABC From the human perspective, a portable kennel might resemble solitary confinement and punishment. Many pet owners think of their dogs as furry four-legged people so they&#039;re appalled by this type of confinement. What&#039;s not considered is that dogs are den animals by nature since they evolved from wolves. Unlike humans, dogs seek out confined spaces under tables or desks for a sense of security.", "articleBody": "This article is courtesy of The Hannah Society. By Rolan Tripp, DVM, CABC From the human perspective, a portable kennel might resemble solitary confinement and punishment. Many pet owners think of their dogs as furry four-legged people so they&#039;re appalled by this type of confinement. What&#039;s not considered is that dogs are den animals by nature since they evolved from wolves. Unlike humans, dogs seek out confined spaces under tables or desks for a sense of security. A portable kennel is a wonderful tool for curbing hyperactivity and all sorts of destructive behavior like chewing, digging, and housesoiling. When introduced properly and if they receive the daily exercise they need, many dogs adopt their kennels as their lifelong contented sleeping area; overnight, or while the owner is at work. A kennel can be a safe place for a dog during wild child visits. It makes car or truck travel safer than using a pet tether. Some molded plastic kennels are airline approved while the wire kennels have the advantage of folding down for transport or storage. To mimic a den, a wire kennel should have a pad inside and a blanket draped over it. Positive portable kennel-training requires a proper introduction. This &quot;contented confinement mind set&quot; can take from a few hours to a week, depending on the pet’s innate personality. Air travel should be preceded by a few short car rides in the kennel before a trip to the airport. Follow these steps to introduce a portable kennel, and use your observation of the pet’s relaxed body language as your guide when to move to the next step. Five Steps To Positive Portable Kennel Training 1. Introduce just the bottom half of the kennel (at any location you want) as the pet’s new dining room. Feed a few meals and leave food puzzles inside. You don’t get a second chance to make a positive first impression. 2. When the pet is not busy eating, remove the food and provide a comfy bed. Lure the pet with a treat or chew to encourage resting in the kennel. Praise and stroke the pet when laying inside the bottom of the kennel. 3. Assemble the kennel but leave the door open and toss special food treats to lure her inside. At some point, insist the pet stay in the kennel with hand and verbal cues. If she comes out, simply put her back in (toss a treat inside) and physically prevent her leaving until you give permission. The key is that the dog understands it is your will, (not the door) keeping her inside. Wait until she visibly relaxes, then call her out and praise her. Repeat until she will go in, wait, and come out all under your control. &quot;Kennel Up!&quot; traditionally means, &quot;Go Inside.&quot; Make it fun. 4. Begin to close the door during feeding. Also temporarily limit access to favored chew items to the times she is locked inside. This is an excellent way to teach the dog to only chew on approved items. Chew toys left inside should be too large to be swallowed, and only made of a substance that is acceptable to be destroyed. (No squeaky or plush toys.) 5. After observing a relaxed dog at previous steps, and after extra exercise that day, close the dog inside overnight. Provide chew toys but no dog food or water, which simulates elimination. The first night the best location is next to your bed so the pet can smell and hear you sleeping. Interrupt fussing by tapping the kennel, then praise quiet rest.       Resistant Cases If the pet has persistent trouble with elimination training, do a complete medical checkup. During introduction don’t release the pet during a tantrum but avoid scolding or punishment. A good way to get a dog to stop fussing is to jangle the handle on the kennel without opening it. This sound either causes quiet anticipation, or startles the dog into a few seconds of silence — that you can praise. Try to get 3+ seconds of quiet, and then begin praising that. Release the dog if quiet 10 seconds, but require a longer quiet period each time. If the dog is fussing at night and you are unsure of toileting needs, take the dog outside with a flashlight and watch to confirm if something is eliminated. Don’t allow any midnight rewarding experience and return to the kennel without praise. Begin withholding food and water earlier in the evening. For anxious pets, go slower during the introduction. Include a worn T-shirt inside the kennel, and fit a commercial anti-anxiety pet pheromone (D.A.P.) collar. Smaller dogs accustomed to sleeping on the bed can be put in a kennel on the owner’s bed overnight as a transition. If barking, some dogs may need to temporarily wear a head collar with a line strung under the kennel door to your bed stand. A gentle pull will move the head down and close the mouth so that you can praise, and then reward that silence by releasing the head collar pressure. If fearful of the kennel, feed each meal one foot closer until inside the kennel bottom, and leave a trail of treats leading to the back of the kennel. Go slowly but allow no other access to food. If the pet panics repeatedly when left alone in the kennel it is possible that Separation Anxiety is part of the problem. Once any behavior problems are properly diagnosed, this category of pet might benefit from veterinary medication and a pet behavior modification program. Bio for Rolan Tripp, DVM, CABC Dr. Tripp received his doctorate from UC Davis School of Veterinary Medicine and also holds a bachelor’s degree in music and a minor in philosophy. A regular guest on the Animal Planet Network, Dr. Tripp appears on both &quot;Petsburgh, USA&quot; and &quot;Good Dog U.&quot; He is a Veterinary Behavior Consultant for Antech Laboratory’s &quot;Dr. Consult Line&quot; and an Affiliate Professor of Applied Animal Behavior at both Colorado State University College of Veterinary Medicine and University of Wisconsin School of Veterinary Medicine. Dr. Tripp is the founder of the national behavior consulting practice, www.AnimalBehavior.Net. He is now the Chief Veterinary Pet Behaviorist of The Hannah Society (www.hannahsociety.com) which helps match people and pets, then keeps them together. Contact info: Rolan.Tripp@HannahSociety.com. Image: Martin Cathrae / via Flickr"}]