[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Teach a Dog to Lie Down No Matter Where You Are", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS-Dog-Training-Lie-Down-767673541.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS-Dog-Training-Lie-Down-767673541.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-teach-dog-lie-down-no-matter-where-you-are"}, "datePublished": "August 22, 2018", "dateModified": "September 6, 2022", "description": "Training a dog to lie down can be a very valuable skill, here are some tips for getting your dog to lie down no matter where you are.", "articleBody": "Image via DenisProduction.com/Shutterstock By Russell Hartstein, CDBC, CPDT and owner of Fun Paw Care in Los Angeles If you’re like most pet parents, getting your dog to lie down and relax while out in the “real world” can be frustrating. But if we become frustrated, we are not at our best, and the dog is not learning in an ideal setting. Not only is it important to teach a dog the “down” cue, but it’s also important to transition your dog from lying down in your living room to following the cue in real-world settings. Of course, you should first teach a dog the down cue at home, since dogs learn best in less stressful, less distracting, familiar environments. But once your pup has mastered the cue, it won’t be useful if your dog only listens to you while you’re in your pajamas at home. Clients often tell me, “My dog does great in the living room but doesn&#039;t even know I exist in a restaurant, park or store.” You want to be sure that your dog can follow the down cue while out on a walk or surrounded by unfamiliar stimuli, animals, sights, sounds and smells. What’s the secret for getting your dog to lie down in any environment? In dog training and obedience, there are no secrets. Your success in teaching a dog down is based on practice, your skill set, the dog’s athleticism and consistency in teaching your dog. The more you learn about your individual dog&#039;s temperament and what motivates them, the faster your dog will learn to lie down. A good dog trainer or behaviorist will not only teach your dog, but will primarily teach you and your family how to teach your dog.  How do you teach the basic lie down cue? Here are the steps: 1. Hold a high-value treat and ask your dog to sit. 2. Place the treat near your dog’s nose, close enough for him to smell it, but not so close that he can grab it. 3. Lower the treat down to the floor, close to your dog’s chest. 4. Praise and reward your pup when he lies down. 5. Once your dog has successfully performed the behavior, add the cue, “down” as he lowers himself to the ground in Step 3. If your pup starts to lift up out of the sit position, go back to Step 1. If your dog knows how to lie down at home, why can’t they do it elsewhere?    Dogs are not usually great at generalizations, but they are excellent at specifics. This is very important to remember so that you don&#039;t get frustrated and think your dog is just being stubborn. More than likely, they just don&#039;t know what you&#039;re asking because something in the environment has changed. Here just a few examples of subtle yet significant changes that could alter your dog&#039;s understanding of what you are asking them to do: Facing in a different directionStanding on a different surface (carpet, concrete, tar, tile, grass, etc.)Different noises that come with a different settingNew and exciting smellsChange in your appearance (you put on a jacket or hat, or you’re carrying a backpack, etc.)Environmental and atmospheric changes (barometric pressure, time of day/night, changes in the weather, etc.)Different body language or tone of voiceYou get the idea—the list is endless. The point is, if your dog isn’t understanding or responding to what you’re asking, or seems slow to perform the behavior, one of these factors is likely at play, or you just have not practiced enough for them to understand. Eventually, your dog will learn to generalize these cues for all environments If you practice in many situations with many iterations, your dog will be confident and will look forward to performing these behaviors anywhere. How can you teach a dog to lie down anywhere? After you have mastered the down in your home or a familiar environment, you can move into more distracting settings. Begin dog training and obedience behaviors in the backyard or the front lawn of your house.  If you live in an apartment building, you can begin practicing in the hallway, on a balcony, or in an elevator or stairwell. If your dog is too distracted in any of these new environments, just find a less distracting environment than the one you are in and start over. For example, if an open door is distracting your pup from lying down, try cracking the door open just a foot or a few inches instead. Try training at a different time of day or night. After your dog does well in each environment, slowly move on to environments with more distractions. Helpful Tips Remember to slowly build in duration, distance and distraction in each new environment. Use high-value dog treats as rewards to train with, not their usual treats. Do not use coercion, force or intimidation. When you teach a dog to lie down, choose the best time to do it—ideally, after the dog is fully exercised. A good idea is to practice lying down with your dog after a period of exercise, not after they just woke up or during dusk or dawn when a dog is most active. Before you progress to a new environment, make sure they are responding reliably eight out of 10 times. It is important to remember that we are also cultivating your dog’s attention. Having your dog pay attention to you and defer to you is very important for all behaviors. We want your dog to be conditioned to look at you when she feels nervous, scared or unsure. It is your responsibility as a pet parent to acknowledge that attention and to ask for and reward appropriate behaviors. Provide loving guidance for your dog, and remember to take your time and work with your dog only when you can give them all of your attention and are not in a rush. "}]