[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Do When Your Puppy Whines in His Crate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/chocolate-labrador-puppy-in-wire-crate-with-paw-on-door-closeup-7-picture-id889008474.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/chocolate-labrador-puppy-in-wire-crate-with-paw-on-door-closeup-7-picture-id889008474.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Crates and beds, Puppy", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/what-do-when-your-puppy-whines-his-crate"}, "datePublished": "March 11, 2019", "dateModified": "March 20, 2023", "description": "If your puppy whines in his crate, remember that it’s a completely normal behavior. Here are some tips for getting your puppy comfortable with using his crate to help reduce the whining.", "articleBody": "Reviewed for accuracy on March 12, 2019, by Dr. Katie Grzyb, DVM Puppies do plenty of adorable things that we love. They pounce around with their big, clumsy paws, snooze in all sorts of weird positions and unknowingly pose for the cutest pictures. But, puppies require diligent training in order to grow into well-behaved adult dogs. And crate training puppies is often necessary to keep these young canines safe and out of trouble. However, if you’ve tried crate training a puppy, you know it’s not easy. One of the most frustrating—and heartbreaking—parts of crate training is when a puppy whines in his crate. It’s important to take the right steps in order to minimize stress and frustration for both you and your puppy. That means training your puppy to feel at ease and comfortable in his crate. Why Do Puppies Whine in Their Crates? Puppies whining in their crates is normal behavior, says Linda Campbell, RVT, VTS, shelter animal behavior manager at the Humane Society of Missouri. “Dogs new to being crated may whine or cry because they are not accustomed to the confinement,” she says. “Puppies, recently separated from their littermates, are often confused and lonely and will vocalize.”  Dr. Jennifer Coates, a veterinarian based in Fort Collins, Colorado, agrees that isolation and loneliness is often the culprit and reason for why puppies cry in their crates. “Dogs, and especially puppies, are social and want nothing more than to be with their ‘pack,’” she says. “It’s not too surprising that they would try to get your attention when they feel isolated.” How to Get a Puppy to Stop Whining in His Crate While pet parents may not be able to completely curb whining behavior in puppies, there are ways to minimize it. It’s important to practice proper crate training and to avoid teaching your puppy bad habits early on. Here are some steps you can take to help cut down on your puppy whining in his crate. Ignore the whining behavior. One of the biggest mistakes that new pet parents make is giving their puppies attention or taking their puppies out of the crate once the whining begins. “Ignoring the whining is your best option,” says Dr. Coates. “Any type of attention will just reinforce the behavior.” Campbell says that pet parents should avoid giving attention or taking a puppy out of the crate until he is quiet. “The goal is to teach the puppy that quiet, calm behavior results in a release,” she says. “The puppy can be released after waking up from his nap or after a few minutes of quiet behavior.” Pick the right-size crate. Puppies should have enough space in their crates to help them stay comfortable. “The crate must be large enough that the pet can stand up, turn around and play with toys,” says Campbell. Consider dog crates that have a divider that you can use to adjust the size of the crate as your puppy grows, like the Frisco fold and carry single door collapsable wire door crate.  Get your puppy comfortable with the crate. Familiarizing your puppy with his crate is one way to help cut down on anxiety and reduce whining. “The first rule is to take your time acclimating your puppy to the crate,” says Victoria Schade, a professional dog trainer and author of “Life on the Leash.” “Your pup needs the opportunity to learn that the crate is a comfortable and happy space, and if you start crating without an adequate ‘getting to know you’ period, your puppy will be more likely to protest.” Never use your puppy’s crate as punishment, adds Campbell. “Providing treats, chew toys and bedding in the crate will help with the experience,” she says. Use dog treats to reward your puppy when he is being quiet and calm in his crate. “Once accustomed to the crate, most dogs will enter it readily on their own,” says Campbell, who suggests leaving the crate door open when it’s not in use. “It becomes their safe haven to enjoy time chewing on toys, relaxing and watching their families,” she adds.   Make sure to provide plenty of potty breaks. Puppies cannot “hold it” for as long as adult dogs, so it’s a pet parent’s responsibility to make sure that young puppies have ample opportunities to go outside—even in the middle of the night. “Kennel soiling is often caused by leaving the puppy longer than he can control himself,” says Campbell. She explains that figuring out the number of hours a puppy needs between bathroom breaks is by adding his age plus one. So, a 2-month-old puppy can usually hold it for three hours, and a 3-month-old puppy can generally hold it for four hours. Schade says that it’s better to be safe than sorry and to use your puppy’s age as a good estimate for how long he can go between bathroom breaks. “There&#039;s no such thing as too many trips outside when a pup is potty training,” she says. Make sure to consider crate placement. Where you have your puppy’s crate located may be a factor in whether or not he whines. “Crate placement can definitely impact a dog&#039;s reaction to it,” says Schade. “If the crate is put in a faraway room, or worse yet, the garage or basement, the puppy might feel too isolated and react by crying.” Campbell recommends keeping the crate in an area where the family spends a lot of time. She even says that some pet parents decide to use two crates—one in a family room or living room and another for the bedroom where the puppy will sleep. In addition to helping your puppy feel less anxious, keeping the crate close will allow you to hear when your puppy needs to go outside. “Most young puppies can&#039;t hold it for the entire night, so pet parents must be able to hear when the puppy wakes and cries to go out,” says Schade. “If not, the puppy might be forced to soil the crate.” Give your puppy plenty of exercise. To stop your puppy from whining in the crate, don’t underestimate the power of playtime. “Make sure your puppy is getting lots of exercise and attention outside of the crate,” says Dr. Coates. “If this is the case, chances are good that your pup will be ready for a nap when crated.” Schade suggests adding interactive or dog treat toys to your puppy’s crate to help keep your puppy busy and reduce boredom. “Give your dog a safe, hard, rubber busy toy stuffed with a little peanut butter or a few treats whenever you crate him,” she says. “With consistency, this delicious ritual might help your puppy get excited to go into the crate.” Pet parents can try a KONG puppy dog toy, but Schade recommends testing toys with your puppy prior to giving them to him to make sure he can&#039;t rip pieces off. Puppy Crying in His Crate: When to Worry While puppy whining is not uncommon, pet parents should be on the lookout for any excessive whining or unusual behavior—whether a puppy is crated or not. “Talk to your veterinarian if whining is a new behavior for a dog who has previously handled being crated well or if you notice any other worrisome symptoms,” says Dr. Coates. Schade agrees that pet parents should stay alert and reach out for help if puppy crying doesn’t subside. “A little bit of puppy whining in the crate is to be expected,” she says. “If a puppy is reactive the entire time he is crated—no matter the duration—or self-injures in an attempt to escape, it&#039;s important to connect with a trainer or veterinary behaviorist.” By Deidre Grieves Featured Image: iStock.com/cmannphoto"}]