[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/vmq5z1dcaq", "@type": "VideoObject", "duration": "PT2M24S", "name": "5324820008001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/4ef44185d32620e1bb2b7ca2a2e8a321da36c479.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/vmq5z1dcaq", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/91924574e48fd40c3b88adc61320cf974b0df759.m3u8", "transcript": "It's exciting to add a new dog to your household in order to make the transition smooth for your resident dog, as well as your new dog. It's best to choreograph all of their interactions as they get used to each other. On the day you bring your new dog home. Start off by going to a neutral location and doing parallel walking.\n\nGet a friend or family member to help out. You're basically walking both dogs about 20 feet apart from each other double back on the areas that you've already crossed. So the dogs can actually catch each other's scent. Now pay close attention to their body language.\n\nYou're looking for loose happy curiosity about each other with no tension hard stares or high tails if they seem relaxed you can slowly close the distance between them, allowing them to meet. Keeping the leash is loose at the same time. Praise all appropriate interactions then go back to your yard and do an abbreviated version of parallel walking with both dogs when their body language tells you that they're getting along. You can drop the leashes and allow them to play.\n\nAllow your new dog some time to explore his home before you let your resident dog back inside. Make sure to pick up any resources that could cause a scuffle between them like bones toys or half filled food bowls. Then once your new dog has had a chance to survey his new home you can let your resident dog back in. It's helpful to give both dogs alone time during the transition.\n\nYou can set up a quiet room for your new dog where he can go to relax or if he's comfortable. Use a crate. This gives both dogs a chance to relax. You can also put up a baby gate so they can get used to each other slowly on their own time.\n\nEven if your new dog and your resident dogs seem like the best of friends from the very first day it's still a good idea to separate them when they eat. You can either use a baby gate or just close the door between them so they can eat in peace until they learn to understand each other. Try to acknowledge positive encounters between your dogs. If your new dog offers a play about to your resident dog as an invitation to play praise that behavior.\n\nIf your resident dog sits quietly beside your new dog praise that as well. This type of feedback helps your dogs understand the behaviors that you appreciate it. Finally to be 100% safe always separate your dogs when you leave the house and you can't supervise them. You can use a baby gate or crates if your dogs are comfortable in them Follow these tips and before you know it your new dog and your resident dog will be best.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/training/evr_dg_tips-for-keeping-dog-off-furniture?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tips for Keeping Your Dog Off the Furniture", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/boxer-mix-on-sofa_159927818_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/boxer-mix-on-sofa_159927818_0.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_tips-for-keeping-dog-off-furniture"}, "datePublished": "February 10, 2016", "dateModified": "September 6, 2022", "description": "If your dog is getting comfortable on the couch -- without your approval -- try these tips to get your dog off the furniture and help him understand where he should hang out instead.", "articleBody": "Victoria Schade Dogs like to get comfortable when they take a break, so when they see the opportunity to snuggle up on a soft couch it often proves to be too great a temptation to resist. There’s nothing wrong with allowing your dog to hang out with you on the couch, but not everyone enjoys sharing the space with their furry best friend. Unfortunately, once your dog has a taste for the good life it can feel like an endless battle to try to keep him off the couch. The following tips will show you how to keep your dog off the furniture and help him understand where he should hang out instead. To Share or Not to Share? The decision to allow your dog on the furniture is a personal one. If you don’t mind some extra fur and occasional muddy paw prints on your cushions, it’s a fine way to spend quality time with your best friend. However, there is an important exception: the dog who thinks that he owns the couch. If your dog has ever growled or snapped at you to maintain his spot on the furniture, or gets surly when you try to move him over, it’s time for his couch privileges to end. Address your dog’s location guarding issues with a professional and then reassess if it’s appropriate to reintroduce couch privileges post-training. Start Off on the Right Paw Consistency is important in keeping your dog off the furniture. Make sure that everyone in the household agrees to the “no dogs allowed” policy, because part-time privileges make it harder for your dog to understand the rules. It’s best to keep your dog off the couch from the very beginning, even when he’s a tiny puppy, because it’s much more difficult to un-train the behavior once your dog has gotten used to it. A Place of His Own If you opt to keep your dog off the couch, make sure to provide him with a comfy alternative. Instead of giving your dog a flat pad-style dog bed, select a donut bed that has a bolster, which gives him something to lean up against. Keep the bed close to where you hang out and consider investing in a few beds so that your dog has a home base in all of your primary living spaces, like the kitchen, bedroom and family room. You can make his special bed even more enticing by frequently anchoring a treat-stuffed toy to it. Attach a thin rope to a hard rubber toy, fill it with peanut butter or treats, then tie the rope to a nearby table leg or other piece of heavy furniture that’s close to your dog’s bed. Your dog will soon understand that delicious things happen when he hangs out on his bed! Management Techniques for Keeping Dogs Off Furniture Does your dog jump on the couch the minute you leave the house? The best way to deal with the stealth sitter is to make furniture inaccessible and less enticing. Keep your dog off the couch by placing a baby gate or two flat on top of furniture, pulling the cushions up so that they’re vertical, placing empty laundry baskets on the cushions or stacking books near the edge of the couch. You can also consider a commercially available pet-safe “scat mat” that makes a shrill noise when your dog touches it. (Mats that deliver a shock to keep your dog off the couch aren’t recommended, however. There’s no need to train with pain.) An inexpensive alternative is to purchase a car floor mat and place it upside down on your furniture. The gripping “teeth” on the bottom of it will make the couch feel prickly and uncomfortable. Training Your Dog to Get Off the Couch So, you busted your dog on the couch, oblivious and dreaming. It’s time to teach him the “off” cue, a dog-friendly way to get your dog to move from the furniture. Take a small treat and throw it on the ground a few feet away from the couch where your dog is resting. Say “off” and make a sweeping hand gesture as your dog moves from the couch. Saying the cue as your dog is doing the movement is a way of creating an association between his action and the cue – you’re basically teaching your dog English (and sign language)! If possible, immediately lead your dog to his bed and give him a treat and lots of praise for going to his bed instead of the couch. Always make sure to acknowledge your dog any time he opts to sleep on his own bed instead of the furniture. Some dog training advice suggests encouraging your dog to get up on the furniture in order to work on the “off” cue. While this will certainly help to help your dog learn the “off” cue, it might teach him an accidental lesson as well. Clever dogs often make the association between getting up on the couch in order to get a reward for getting off, and they might jump up on the furniture more frequently in an effort get you to use the “off” cue and give him treats. Though it can take longer to look for naturally occurring opportunities to work on the “off” cue, it’s less likely to teach your dog an accidental “up then off” lesson. See Also Image: Anna Hoychuk / Shutterstock"}]