[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Teach a Dog to Lie Down", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/small-purebred-dog-on-a-grass-picture-id1031099554.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/small-purebred-dog-on-a-grass-picture-id1031099554.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-teach-dog-lie-down"}, "datePublished": "November 16, 2018", "dateModified": "September 6, 2022", "description": "Learning how to teach a dog to lie down doesn’t have to be difficult. These dog training tips can simplify the process.", "articleBody": "Teaching your dog to respond to the “down” cue by putting her belly on the ground requires creativity and patience. Down is a more complex dog training behavior than sit, and it can be more challenging for both student and teacher. The following overview will help streamline the training process and lead to down-dog success! How to Teach a Dog to Lie Down: Getting Started The first step of how to teach a dog to lie down is grabbing a handful of tasty dog treats, like Blue Buffalo Wilderness Trail treats. Small treats are best for training dogs since you’ll be giving your dog quite a few during the process! To begin, hold a treat in your hand so that it’s almost touching your dog’s nose, then slowly move your hand towards the floor in a straight line. Act as if you’re tracing a path from your dog’s nose to a spot on the ground in between her front feet. Keep in mind that your dog will follow the treat in your hand wherever you move it, so once you reach the ground, try to keep it stationary. At this stage, most dogs will respond in one of two ways; your dog will either immediately collapse into the down position, or more likely, will your dog will contort herself into a half-down/half-up stance. Option One: The Immediate Down If your dog goes into the belly-on-the-ground position right away, you’re almost at the finish line of teaching your dog to lie down! Repeat the same luring process using a small meaty treat, like Hill&#039;s Science Diet soft &amp; chewy training treats, to encourage your dog into the down position a few more times. Then put the dog treats in your pocket and repeat the luring movement with an empty hand. This keeps your dog from becoming dependent on knowing that a treat is present in order to perform. When your dog responds to the empty hand lure, reward her with the goody in your pocket. At this point, you should begin to fade the prompt, meaning that you should make the pointing gesture less obvious. The goal is for your dog to be able to respond to the word “down” and a minimal pointing gesture rather than requiring you to bend at the waist and slap the ground. With each successive attempt, bring your hand slightly farther away from the ground. If your dog is responding to the pointing gesture with your hand about a foot away from the ground, on the next attempt, move your pointer hand a foot and a half away. Reward your dog when she moves into position, then cue her again from a slightly higher pointing position. Do this until you can stand straight up, point at the ground and have your dog respond. Add the word “down” once your dog moves into position with minimal pointing. Simply say “down” right as she starts to go into the down, then reward her with a treat like Primal Beef Liver Munchies freeze-dried dog and cat treats. Freeze-dried dog treats are excellent rewards because have a concentrated meaty flavor and they won’t make your pockets greasy! Within ten to twenty repetitions, your dog will make the association between the word and the action, and you’ll be able to say the word “down” and have your dog respond to it. Option Two: The Contorted Down If your dog twists herself into a pretzel or only dips her shoulders instead of collapsing into the belly-on-the-ground position, you have a bit more work to do to get to a completed down! It helps to use dog clicker training for this approach, as you’ll be rewarding tiny approximations of the finished behavior. The precision of the dog clicker allows your dog to understand what she did correctly. Have a supply of small treats ready to go in your hand, like Blue Buffalo Blue Bits chicken recipe dog treats, and lure your dog by tracing a straight line down to the ground, in between her paws. If she does anything that resembles the beginning of the down position—like moving one foot to the side or rolling onto her shoulder—mark her progress by clicking a Starmark pro-training clicker, and then give her a treat. Try to reward her without moving her out of position so you can keep building on the initial progress. Continue to reward the beginning stages of down, clicking and treating each time your dog gets closer to an actual down. Rewarding these small versions of the finished behavior prevents your dog from getting frustrated and keeps her playing the training game. When your dog finally plops into position, celebrate with a jackpot of treats, like Vital Essentials minnows freeze-dried dog treats. These high-value treats have a unique scent and texture that dogs love. Finish training the behavior by fading the pointing prompt as described above, until you can stand up straight and do a subtle point to get your dog to go into the down. Then add the word “down,” and you’ve got a dog that will plop any time you ask! Image via iStock.com/urbazon"}]