[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Citizen Train: Certifying Your Dog as a Good Citizen", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_212222101.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_212222101.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_canine_citizen"}, "datePublished": "November 14, 2008", "dateModified": "September 6, 2022", "description": "Do you have a dog that excels at all forms of training? Do you want something to show for your dog&#039;s abilities? If you answered yes, then you may be interested in getting your dog certified as a Canine Good Citizen (CGC).", "articleBody": "Do you have a dog that excels at all forms of training? Do you want something to show for your dog&#039;s abilities? Are you interested in showing off your dog’s talents? If you answered yes to any of these questions, then you may be interested in getting your dog certified as a Canine Good Citizen (CGC). Once it passes the CGC test, your dog is certified as a well-behaved animal in the community and in home environments. Many training schools offer CGC training, and a good number of specialty dog clubs offer the certificate. But before you sign up, you should first learn a bit about this certification.   The CGC is a program developed by the American Kennel Club (AKC) to recognize and reward &quot;responsible pet ownership for owners and basic good manners for dogs.&quot; In addition to receiving a from the AKC, the dog is automatically recorded in the AKC&#039;s Canine Good Citizen archive.   To receive a CGC certificate, your dog must pass a 10-part test.   Test 1: Accepting a friendly stranger.   This test demonstrates that the dog can be still and not break position when a friendly stranger approaches the handler. The dog must then speaks with the handler and shakes his or her hand, all while the handler gives the dog minimal attention.   Test 2: Sitting politely for a petting.   This test demonstrates that the dog will stand in place, without fear or resentment, and allow a friendly stranger to touch and pet it while it is out with its handler.   Test 3: Appearance and grooming.   There are two aspects of this test. First, the evaluator checks the dog to see whether it is well groomed and healthy. Second, the dog is tested on its compliance during physical examinations or grooming.   Test 4: Out for a walk (walking on a loose lead).   This test demonstrates that the handler is in control of the dog, and that the dog is attentive to all of the handler’s moves, even when walking on a loose lead.   Test 5: Walking through a crowd.   This test demonstrates that the dog is under control and can be walked on a leash, or in a public place with humans close by, without getting over-excited or straining at its lead.   Test 6: Sit and down on command and staying in place.   This test demonstrates that the dog has been trained and will respond to the handler&#039;s commands: &quot;sit&quot; or &quot;down.&quot; The dog must then remain in place until the handler releases it by command.   Test 7: Coming when called.   As the name suggests, this test demonstrates that the dog will come to the handler when he calls.   Test 8: Reaction to another dog.   This test demonstrates that the dog can behave appropriately when it is around other dogs, maintaining a neutral stance.   Test 9: Reaction to distraction.   This test demonstrates that the dog does not panic or get aggressive when faced with common distractions, such as items being dropped or people running.   Test 10: Supervised separation.   This test demonstrates that the dog can be left with a trusted person while its handler is away, without getting overly anxious.   If your dog passes these tests, it is eligible to receive a Canine Good Citizen certificate from the American Kennel Club. The cost of entering this program is minimal, though you should check on the current rates before you decide. You can find the location of trainers and evaluators nearby by contacting the AKC — you can start here: AKC Clubs That Offer CGC Image: dezi / Shutterstock"}]