[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "You’re Not a Bad Pet Parent if Your Dog Hates Fetch", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/minature-goldendoodle-ready-to-play-fetch-picture-id986100048.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/minature-goldendoodle-ready-to-play-fetch-picture-id986100048.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Exercise, Play", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/youre-not-bad-pet-parent-if-your-dog-hates-fetch"}, "datePublished": "January 24, 2019", "dateModified": "September 6, 2022", "description": "Not all dogs like fetch. Luckily, you can encourage your pup to play with these tips from a certified dog trainer.", "articleBody": "Image via iStock.com/nycshooter By Victoria Schade Fetch is the go-to game for many pet parents because it’s simple; a dog plus ball equals fun. It’s a great way to exercise dogs, and most pups love to play it. Show them a tennis ball and they’re good to go! But that’s not the case for every dog. Some dogs have no interest in playing fetch with their person, and even though it’s far from a make-or-break problem, a fetch-resistant dog can be a bummer. However, there’s hope for dogs that don’t dig fetching. Whether it’s introducing the parts of the game in segments or trying a new version of the game, there’s a way to go from “My dog won’t fetch” to “My dog loves fetch.”   Breaking Down Fetch Refusal Some dog breeds are literally born to retrieve, so making a game of that inherent desire is simple. For others, running after a ball over and over doesn’t make sense, so they opt out. Dogs that won’t fetch often react to the game in the following ways: No interest in chasing the ball: These dogs refuse the very first step of the game. The ball flies overhead and they just watch it sail by. Chase but no retrieve: Going after the ball isn’t a problem, but these pups don’t want to pick it up or bring it back to their person. Retrieve but no relinquishment: For these pups the first two steps of the game, the chase and the retrieve, are no problem, but the aspect that keeps the game going (releasing the ball) isn’t an option. These pups either play with the ball by themselves or settle down to chew on it. There’s a chance that fetch-resistant dogs haven’t had exposure to fetch. Even though it seems like a simple game, the sequence of steps isn’t necessarily natural for dogs. Chasing a rapidly retreating object is easy, but relinquishing that object once captured isn’t. The good news is that it might be possible to teach your dog to fetch. Dogs Playing Fetch: How to Make It Happen You can encourage your dog to become a fetching fanatic by breaking down the parts of the game and teaching each step individually. Teaching Release and Retrieval Start by teaching your dog the toughest aspect of the game, releasing the ball. Encourage your dog to latch onto the ball by wiggling it enticingly, then once he’s holding it put a treat in front of his nose. Your dog will likely drop the ball to get the treat, so say “drop” right as he does it to attach a word to the behavior. Repeat this process until your dog is happily dropping the ball in anticipation of getting dog treats when you say “drop.” (Within a few repetitions you shouldn’t have to put it in front of his nose). The drop/treat sequence will also likely encourage your dog to grab the ball and bring it back to you. Tap Into Their Desire to Chase As soon as your dog becomes proficient at dropping the ball, add the next step; toss the ball about a foot away. This is an exciting part of the game and should tap into your dog’s natural desire to chase, so get excited about it and make a big deal when he goes after it. Repeat the short throws and encouragement until your dog is happily going after the ball and bringing it back to you when you throw it.   Finally, add distance to the game. Throw the ball a few feet away, and praise your dog for going after it. When he brings it back to you and drops it immediately, throw it again, this time a little farther away. At this point the game’s speedy pace and your cheerleading should encourage your dog to get excited about the game. Get Creative With Dog Fetch Toys If your dog is reluctant to chase after tennis balls, try a different size ball or one with a unique texture. Some dogs might have a hard time grabbing onto tennis balls, so offer rubber dog ball toys with more “squish” like the Planet Dog Orbee-Tough squeak ball or a plush ball like the Chuckit! indoor ball. For dogs that enjoy tug, try a ball on a string so you can play both games at the same time, like the Jolly Pets Romp and Roll ball. Keep in mind, you don’t have to use a ball to play fetch—any dog toy that your dog enjoys can work! Finally, if your dog has no desire to fetch no matter how many different techniques and dog fetch toys you try, there’s nothing wrong with playing something else. Get your dog going with a game of tug or “find the toy,” and have a blast that way, instead."}]