[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Reasons Why Your Dog Runs Away When You Call", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/youngfree-and-happy-picture-id184325061.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/youngfree-and-happy-picture-id184325061.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/5-reasons-why-your-dog-runs-away-when-you-call"}, "datePublished": "October 23, 2018", "dateModified": "September 6, 2022", "description": "If your dog runs away when you call him, or simply doesn’t come to you, try these dog training tips for teaching your dog to come when called.", "articleBody": "There’s nothing more frustrating than calling your dog over and over again, only to have him ignore you—or worse yet, if your dog runs away in the opposite direction. The basic steps of training a dog to come when called are straightforward, but many pet parents don’t realize just how much work goes into building a long-term, reliable recall. Add to that the fact that we can accidentally “un-train” the behavior, and you have a recipe for a very frustrating dog training scenario. The following are some typical mistakes made when trying to teach a dog to come when called. The Dog Was Punished in the Past Sometimes frustration can get the best of pet parents when a dog won’t come, which can result in the dog getting scolded, or worse yet, physically punished, when he finally does listen. Unfortunately, getting mad at your dog once he’s at your side won’t teach him what he should do; it will only make him less likely to come running to you in the future, because he knows you’ll be upset when he gets there. You want your dog to think that coming to you is a wonderful thing, so even if you’re disappointed by his less-than-speedy response, make sure to avoid scolding him when he gets to you. Then, try to set him up for success in future training sessions by making it easy for him to “win” the recall game. Always reward him with high-value dog treats like Pet Botanics Training Rewards, which have a bacon flavor that’s sure to rev up your dog’s recall responses.    You Sounded Angry When You Called Your Dog If someone shouted, “Get over here NOW!” at you, would you be eager to listen? The same goes for our dogs, yet many pet parents let their tone of voice convey anger when calling their dog. A loud, mad voice will make your dog less likely to run to you since he can tell that you’re displeased. Instead, always keep your tone upbeat as you call your dog, and don’t forget to praise your dog as he starts his trip toward you. You might discover that he picks up speed when he hears that he’s doing a great job! Remember to reward your dog with a small, meaty treat every time he reaches you, particularly when you’re in a distracting environment. Switching to a novel protein, like Merrick Power Bites rabbit and sweet potato treats, will help keep your dog interested in what’s in your pocket. You Trained Your Dog to Come in Limited Environments The early training you did with your dog probably took place in a dog training facility and continued in a few rooms in your house as well as in your yard. Your dog probably became proficient at responding in those environments, which made you feel confident that your dog fully understood the recall cue. However, dogs typically don’t generalize behaviors well, which means that even though your dog was responsive in familiar environments, he might not be able to translate coming when called to brand new locations. To increase your dog’s recall “fluency” it’s important to train your dog to come when called in a variety of settings. Practice with your dog in new environments, like a friend’s fenced-in yard or community tennis courts during the off season, and then gradually expand to more distracting spaces, like the dog park. The Word “Come” Means the Fun Is Over Some dogs ignore the recall because they understand that the word “come” means that they have to leave the dog park, or stop chasing squirrels in the yard, or go into their dog crate because you’re heading to work. Consistently pairing the recall cue with something that your dog doesn’t like will result in a dog who equates the word “come” with negatives. That’s not to say that you should only use your recall word in positive situations, but you should be aware of how your dog might perceive what the word “come” means. To combat the idea that coming when called equates to the end of fun, try to do “surprise” recall practice in situations when your dog is just hanging out around the house, and reward him with a tasty treat and a quick game of tug. Or call him in from the yard, praise and reward him, then send him out to continue playing. That way your dog won’t be able to tell if the fun is truly ending or if it’s just a practice run! If you’re concerned about the number of treats you’re giving your dog, opt for a low-calorie goody like Fruitables Skinny Minis pumpkin and berry treats, which have less than five calories per treat. You Repeat the Word “Come” So Much That It’s “Verbal Wallpaper” “Fido, come” is a very different cue than “Fido, come, come, come, come on, c’mere, Fido come!” Many dogs delay responding to the recall cue because they’ve figured out that they don’t have to do it until you say it a few thousand times. Instead of having a conversation with your dog when you want him to come running, it’s better to use a single-word cue, like “come” or “here,” and then follow up with upbeat kissy noises, whistling or hand clapping to encourage him along. Plus, it’s important to continue to reward your dog with a high-value treat, like Crazy Dog Train Me! Minis, for longer than you might think is necessary. Keep in mind that racing to you, particularly when your dog is hanging out with a canine buddy or a enjoying a good smell, is huge compliment. It makes sense to pay your dog for a job well done! Image via iStock.com/dageldog"}]