[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tips for Finding Your Pup&#039;s Million-Dollar Dog Training Treats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/sit-to-attention-picture-id175544982.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/sit-to-attention-picture-id175544982.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Puppy, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/tips-finding-your-pups-million-dollar-dog-training-treats"}, "datePublished": "November 26, 2018", "dateModified": "September 6, 2022", "description": "When it comes to dog training, finding the right dog treats to motivate your pup is key.", "articleBody": "Image via iStock.com/Groomee By Kate Hughes Dog training is a critical component of responsible dog ownership. Beyond simple cues like sit, stay and roll over, a well-trained dog knows how to behave around unfamiliar people, pets and environments. Positive reinforcement is key during the dog training process, and many pet owners use dog treats to reinforce desired behaviors and responses in their pups. But with a seemingly endless variety of dog treats available, how can you narrow down your options to find the best dog training treats for your dog? How Do Treats Impact Training? In the most basic terms, in positive reinforcement training, dog treats act as the reward for good behavior. “When training a dog, this reward can be anything that the learner deems valuable. We trainers like food because most dogs find food extremely valuable, and it fits right in our pockets,” says Molly Sumridge, a certified professional dog trainer and behavior consultant. Sumridge owns Kindred Companions LLC, a dog training company in Frenchtown, New Jersey. Some dogs are highly food-motivated and will respond to basic dog food kibble, but as behaviors become more complex and training becomes more demanding, it may be necessary to up the quality of the dog training treat. Dr. Carlo Siracusa, DVM, PhD, MS, a clinical assistant professor of behavior medicine at the University of Pennsylvania School of Veterinary Medicine in Philadelphia, says that as a dog’s environment become more stimulating, the value of the dog training treats must increase to maintain his or her attention. “As a general rule, the more hectic the environment, the better the value of the treat has to be. You need a treat that will hold the dog’s attention and keep him focused on the training exercise,” Dr. Siracusa explains. So, dog treats seem to be a must for positive dog training, but how do you find the best ones? What Makes a Good Dog Training Treat? Generally speaking, any dog treat your canine responds to is a good training treat, but Sumridge and Dr. Siracusa have a few guidelines that humans should follow when seeking the perfect training treat. “Training treats should be soft and small—the size of a pencil eraser, or even half that. You also want them to be quick to eat, so avoid foods like dog biscuits that take time to chew through,” Sumridge says. She adds that training treats should be small, regardless of the size of the dog. “We don’t give bigger treats to bigger dogs. All dogs get little tastes,” she says. Dr. Siracusa notes that food with a strong aroma makes a good training treat, as the scent will grab a dog’s attention. “This is why cheese is usually so effective. Even a tiny piece will leave a smell on your hands, which can be very motivating for your dog.” Beyond cheese, Dr. Siracusa also recommends Cat-Man-Doo dried bonito flakes cat and dog treats. “They’re really small, but really smelly. They grab a pet’s attention without having a significant impact on overall diet.” Both Sumridge and Dr. Siracusa agree that dog owners should try to balance treats with a dog’s overall diet so that the dog doesn’t gain weight. According to Sumridge, the best way to ensure that treats don’t impact your dog’s waistline is to stick to real meat treats. These could include chicken you cook up yourself, deli meats, freeze-dried dog food or treats like PureBites chicken breast freeze-dried dog treats or Halo Liv-a-Littles grain-free 100 percent wild salmon freeze-dried dog and cat treats. “The caloric intake for real meat treats is going to be much lower than the processed food, just like for humans,” she explains. For everyday training or overweight dogs, a good rule of thumb is to use healthy treats such as slices of apples or baby carrots to lessen calorie intake. Finding the Best Training Treat for Your Dog Knowing what makes a good dog training treat is useful, but there’s still the step of figuring out what works best for your dog. This is just trial and error. “It’s just a matter of figuring out which your dog likes best,” says Sumridge. It is important to use one type of training treat for a few days and monitor for any gastrointestinal signs. If your dog does well with that one type, then you can start adding newer/or higher value treats, one by one.  Dr. Siracusa adds, “Your dog is going to tell you which treats he likes best. Those are the treats he’ll perform for. They won’t do the work if they don’t want the reward.”"}]