[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Service Dogs: How to Make Your Dog a Service Dog and More", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_service_dogs"}, "datePublished": "November 14, 2008", "dateModified": "September 6, 2022", "description": "Dogs can work in many different capacities, but they excel in service. Learn about the service areas they work in &amp; how to make your dog a service dog on petMD.", "articleBody": "  Dogs are capable of working in many different capacities, but one area they excel in is service. Some service dogs protect, others save lives, but all strive to help humankind. Of these, there are five main types of service dogs: assistance, rescue, personal protection, estate guard, and sled dog. Assistance Dogs Assistance dogs are trained to assist those with mental or physical disabilities, giving their human companions a more independent life. The Golden and Labrador Retrievers are among the most popular breeds used in this category. Other assistance dogs include the Samoyed and the Smooth Coated and Rough Coated Collies. Rescue Dogs Used in a search-and-rescue capacity, these dogs work in various conditions, many of them harsh. Great stamina, intelligence and skill are required of rescue dogs, of which the most popular breeds include the Saint Bernard, Newfoundland, and Portuguese Water Dog. Personal Protection Dogs The canine equivalent of the bodyguard (and better at it than Kevin Costner), these dogs protect people and homes. They are highly trained, strong, smart, and devoted to their owners. If they are to be a family pet, they need someone who is confident and calm. Popular breeds in this category are the Doberman Pinscher, Standard Schnauzer, Giant Schnauzer, and Boxer. Estate Guard Dogs Estate guard dogs pretty much do what their name suggests: protect family, property, and the surrounding grounds. They tend to be territorial in nature. The Mastiff, Rottweiller, Komondor, Great Dane, Bullmastiff, Kuvasz, Akita, Anatolian Shepherd, and Great Pyrenees make for great estate guard dogs. Sled dogs Sled dogs are strong and hard working animals that pull wheel-less vehicles on runners (a sleigh or sled) over snow or ice. Because of this, they also must work well in the cold (in fact, they prefer it to the heat). Popular sled dogs include the Samoyed, Siberian Husky, and Alaskan Malamute. Many retired service dogs make great pets, so long as they are brought up to be non-aggressive and calm. Check with your local service dog agencies to see if there are any available. How to Make Your Dog a Service Dog Most service dogs have been bred and raised to be service dogs by organizations and foster families who are dedicated to training the dogs and getting them certified to help others. According to Assistance Dogs International, assistance dog programs usually certify their own graduate teams, but some programs will certify owner-trained dogs as well. For more information, contact a local service dog program in your area. Image: Steve Jurvertson / via Flickr"}]