[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Out and About: Meeting and Greeting &#039;Strange&#039; Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/3515955602_bf85cd0c15.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/3515955602_bf85cd0c15.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_meeting_and_greeting_strange_dogs"}, "datePublished": "May 20, 2011", "dateModified": "September 6, 2022", "description": "The lyrics are true: it’s a small world. Unless you live in a deeply rural area with no other homes for miles around, the chances that you will meet other, “strange” dogs are pretty high. You want your encounters to be civil and controlled, so the early walks, while your dog is still a puppy, will be important for setting the ground rules for walking and meeting behavior. A proactive approach is the best approach, so that you can guide your dog through the proper responses and behaviors in a controlled setting.", "articleBody": "The lyrics are true: it’s a small world. Unless you live in a deeply rural area with no other homes for miles around, the chances that you will meet other, “strange” dogs are pretty high. You want your encounters to be civil and controlled, so the early walks, while your dog is still a puppy, will be important for setting the ground rules for walking and meeting behavior. A proactive approach is the best approach, so that you can guide your dog through the proper responses and behaviors in a controlled setting. Dos and Don&#039;ts Both verbal and physical (body language) cues are important when meeting new dogs and their people. Try not to allow your body to tense up, and do not suddenly tighten your grip on your dog’s leash. Your dog will get the message that something is wrong and will respond accordingly. If you respond in a hesitant or fearful way at the approach of another dog, your dog may also react fearfully, or even aggressively, toward the new arrival. There are some justified circumstances for not wanting to interact with another dog, and this is why it is so important to keep your dog on a leash at all times. Whether your concern is due to the other dog’s appearance or to its owner’s appearance (they appear threatening), because you know from previous experience that your dog gets skittish around strange dogs, or any other reason you have for not wanting an interaction, just calmly change your direction to one that is opposite to the path of the other dog. Continue to walk at a normal, steady pace, keeping your dog on a short leash, and your dog should follow. If there is no other option but to pass the other dog, try to keep some space between your dog and the other dog so your dog does not feel threatened or crowded. You may even try distracting your dog with some direct commands while passing by the other dog. Once your dog has successfully passed the other dog without responding in a fearful or aggressive way, verbally praise him and give him a training treat.   Setting Up the Meet and Greet One of the best ways to train your dog to respond appropriately to another dog is to set up meet and greets in a controlled setting -- such as with a friend, or in a dog park with a fellow dog owner who has agreed to help you along with your socialization training. It may not be a great idea to just choose an unknown owner and dog for an impromptu meet and greet while out on your walk, since the unknown stranger may be unintentionally sending hesitation or fear signals to his own dog in response to your request for interaction. It is better to engage a dog owner who is already prepared for interacting with other dogs. The dog park is one of the best places for this. If there is a situation where you wish to allow your dog to greet another dog while out walking, perhaps because the two dogs are showing interest in each other and appear to be disposed to a friendly interaction, ask the owner of the dog if he or she is comfortable with letting the dogs greet each other. The owner should let you know if the other dog has aggression issues or doesn’t like other dogs, but it would be wise to ask this question plainly rather than find out the hard way. If the owner says no, do not take it personally. Simply respect the owner’s wishes, and know that one day you will also need to say no to a friendly but unknown-to-you dog owner who wishes to stop and chat while the dogs meet. There are a lot of reasons for not wanting to interact, and most of the reasons have nothing personal attached. If the owner does agree to allow the dogs to interact, keep it short and simple. Have your dog first sit back a short distance from the other dog, and then allow them the chance to sniff each other briefly. If your dog behaves appropriately and does not bark or lunge at the other dog, give him praise and then lead him away. If either dog displays any behavior that would indicate aggression or fear, end the greeting quickly but calmly and remove your dog from the situation. Watch for Body Language – Yours, Your Dog’s and Everyone Else’s Dogs that are friendly and wish to interact with other animals will be relaxed, wag their tails gently, and appear interested but not intense. When a dog is aggressive, you will see certain postures and behaviors, such as a rigid stance with ears pulled back or forward, and teeth bared. If you see a dog displaying these behaviors, steer clear and do not make eye contact with the animal (eye contact is taken as a challenge by most dogs). Giving your dog the opportunity to greet other animals is entirely your choice. It can be a great way to make new friends, and to teach your dog appropriate social behaviors. Just use common sense and always be cautious when you are meeting a new dog at the park or on your walks -- even when it is an arranged play date. Keeping your dog safe from other dogs, and other dogs safe from your dog, is your responsibility. So have fun -- and play safe! Image: Quinn Dombrowski / via Flickr"}]