[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dos and Don&#039;ts of Recall Training", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/3872169130_8a54bb06c5.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/3872169130_8a54bb06c5.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_dos_and_donts_of_recall_training"}, "datePublished": "March 8, 2011", "dateModified": "September 6, 2022", "description": "I sometimes wonder if &quot;dog-sledding&quot; was invented when some Eskimos gave up trying to train their dogs to come when called and tied them to their sleds instead. Okay, just kidding! But seriously, if we don’t train our dogs to come when we call them, we may have to treat them as hostages!", "articleBody": "By Pat Sullivan I sometimes wonder if &quot;dog-sledding&quot; was invented when some Eskimos gave up trying to train their dogs to come when called and tied them to their sleds instead. Okay, just kidding! But seriously, if we don’t train our dogs to come when we call them, we may have to treat them as hostages! I think we all must know at least one person who has to watch the open front door or yard gate like a hawk when the dog is nearby lest Fluffy make a break for it and fail to return. Having a dog who comes immediately when you call him is sometimes a happy accident of nature. More often, it’s the product of lengthy training, repetition and rewards. But before you throw up your hands and say, &quot;Oh no, not another boring skill I’m going to have to drill Fido in for the rest of his life!&quot;, consider the alternative. If your dog cannot be depended upon to instantly return to your side when you call him, you will either be stuck keeping him on a very short leash, or risk losing him to a host of dangers ranging from heavy traffic to wild animals to just plain getting lost. There are two basic parts to the &quot;recall rule&quot;. The first is to always treat your dog or puppy nicely every time he comes to you -- kind words or a pat on the head are a must because little treats reinforce the good feelings. The second rule is to have a line, from six to twenty feet long, on the dog so that every time you want him, you can get him back by simply reeling in the line if he doesn’t come on his own steam. With this method, the dog is held responsible for his behavior, but you have to make sure you do your part too. Repetition is a must, and you must be careful that the dog doesn’t get a chance to bolt from you while you’re reeling him in. Even if the dog is standing still when you’ve called and the dog does not move, that still means that he’s not coming. If you have a line on him, reel him in. If you don’t, then go get him and bring him back to where you wanted him. When this happens, give no rewards, and also no punishment. He did neither what you wanted him to do, nor something bad by leaving, so you just want to downplay the situation and try again some other time. Remember to enforce the behavior that you want immediately. Don&#039;t keep repeating a command over and over; the dog should respond to the first command. This process can be long. A month is certainly not enough, even a year may not be, but you’ll reap rewards for your diligence. But if it’s that simple, why do we have so much trouble getting our dogs to come? Probably because we didn’t do the above every time we wanted the dog to come to us. By not insisting Fido come every time we called him and on the first command to come when we started our training, we taught him he didn’t really have to do it. Your dog learns a negative lesson if, after you’ve called him and he just sits there or trots off, you start chasing him around the yard. Wanting to throttle him when you finally catch him is a perfectly understandable human reaction. FIGHT IT OFF! Unfortunately, acting on these impulses will set you back even farther -- your dog will start to fear you, particularly when you’re angry, and will try to put even more distance between you and him in the future. A dog will be a dog, and he learns much from your actions. Picture yourself at 10 p.m. in your robe and slippers, letting him out before going to bed. If he doesn’t come right back in when you think he should, you stand at the screen door, unwilling to go outside in your pajamas, and start screaming his name. At this point, the dog doesn’t care that you feel foolish, frustrated, embarrassed and are in no position to chase him. He’s probably afraid of you by now, and will come in later when he darn well pleases. In a nutshell, you’ve unintentionally sent the dog away by not being prepared to reinforce your command RIGHT HERE and RIGHT NOW! Next time, resist the urge to put on your pajamas until the dog has been let out for the last time. Then, if he doesn’t come back in the first time you call him, go out in the yard and calmly, matter-of-factly, retrieve him immediately. The dog has to believe you will enforce your commands. If, despite your best intentions and efforts, your situation has gotten out of hand and you’ve had some close calls, then seek professional help. This may sound drastic, but remember that running away, or not coming when called, can result in serious injury or death to your pet. Untrained dogs are an endangered species. Just ask your humane society how many dogs are euthanized for behavior problems or are strays with no one to adopt them. If we are to hold our dogs responsible for their actions, we must be aware of what part we play in influencing their behavior as well. Image: daveynin / via Flickr"}]