[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Training Senior Dogs to Play Games on Touch Screens", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cute-french-bulldog-sitting-on-sofa-by-tablet-picture-id938535512.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cute-french-bulldog-sitting-on-sofa-by-tablet-picture-id938535512.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Senior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/training-senior-dogs-play-games-touch-screens"}, "datePublished": "April 19, 2019", "dateModified": "September 6, 2022", "description": "Mental stimulation is an important part of keeping a senior pet active and healthy. Learn how to get your senior pet playing touch screen games on your tablet.", "articleBody": "Your senior dog might be less willing to get off the couch than before, but he still needs new experiences to enrich his daily life and keep his brain active. The latest way to connect with dogs of any age is through touch screen games, and since app games for dogs don’t require much movement, they’re fantastic for senior dogs dealing with aches and pains. While low-impact games and basic training will always be the best way to connect with your older pooch, occasional screen time is a unique way to have fun together while keeping your dog’s mind sharp. App Games for Dogs Not every touch screen game is a fit for our furry friends. The best touch screen games for dogs only require simple taps or nuzzles to play and can be divided into four basic categories: Creating Art: These apps use nose or paw input on the screen to create one-of-a-kind designs. Noise-Makers: These basic games encourage your dog to touch the screen to make a variety of sounds, like squeaks and animal noises. Chase: One of the most popular uses of technology for pets, these apps tempt your dog with a scurrying creature that he has to try to catch. Question and Answer: This straightforward but adorable app allows dogs to “answer” simple questions by touching a yes or no button on the device. Pet parents looking to entertain their senior pets can also check out apps designed to encourage motor skill development in young children for similar basic touch features. Before You Begin: Device Safety Enthusiastic canine gamers can be tough on touch screen devices. Between the eager paws (and claws), slobbery tongues, wet noses and teeth, your tablet might end up worse for wear after your dog goes a few rounds. When introducing your dog to touch screen games, make sure to use a screen protector, and always keep your device on a flat surface so there’s no risk of it falling. Training Older Dogs to Play Touch Screen Games One of the easiest ways to encourage your senior dog to interact with a touch screen is to train the “touch” cue. This basic behavior encourages your dog to touch a body part, usually his nose or a paw, to a specific location or object. This type of target training works best for games like painting, noise-maker or Q&amp;A app games for dogs. Teach the Nose Bump First, get your dog used to targeting your hand with a nose bump. Simply present your open hand in front of your dog with your palm facing him. Most curious dogs will approach and sniff, but if not, you can rub a few dog treats across your palm to encourage investigation. Mark the behavior with a “yes!” or click—using a dog training clicker—when your dog touches his nose to your palm, then give your dog a small treat, like Zukes Mini Naturals peanut butter and oats dog treats, from your other hand. Transition to a Piece of Paper Repeat the process several times, and then begin the transition step by attaching a small piece of paper to your palm. Continue marking and rewarding your dog each time he touches his nose to the paper on your hand for several repetitions. Start to attach a word to the behavior by saying “touch” as your dog performs it. Try moving your designated “touch” hand to different positions, like on the ground or against the wall, so your dog gets used to trying different versions of the same behavior. Once he’s confidently touching your hand in a variety of positions, try sticking just the piece of paper to the ground or wall. This will help him to start to understand that he should be targeting the paper and not your hand. Next, stick the paper to your device and ask him to “touch.” Transfer the Touch to the Screen Finally, begin to make the paper target less obvious by cutting it in half and attaching it to your device. Ask your dog to touch the smaller paper for a few repetitions, and then remove it. Then, ask your dog to touch just the screen. These types of apps don’t feature something for your dog to chase, so they don’t tap into your dog’s natural inclination to pursue. The easiest way to encourage your dog to play a chase-based game is to simply present the device to him at a distance where he can see it, and let instinct take over! How to Tell Whether Your Senior Dog Enjoys Playing App Games While it can be adorable for us to watch our dogs furiously pawing at the screen while they try to catch the creature inside, it might be annoying for them to hunt unsuccessfully. Watch your dog while he plays to see if he’s vocalizing, looking “behind” the screen to find his prey or isn’t focusing on anything other than the object he’s chasing. This might mean that the game is more frustrating than fun for him. It’s fine to let your dog have a few turns trying to capture the animal in the device, but end any screen session by allowing your dog to connect with something real. You can do this by engaging in a few rounds of fetch or playing with a dog plush toy with a squeaker that sounds like the one in the app. The best games for dogs to play encourage interaction with their real-life best friend! By: Victoria Schade Featured Image: iStock.com/LightFieldStudios"}]