[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "At what age do puppies stop biting?", "acceptedAnswer": {"@type": "Answer", "text": "Puppy biting reaches its peak when the puppy is transitioning from baby teeth to adult teeth, around 12–13 weeks of age. All adult teeth are typically present by the age of 7 months. At this point, teething is no longer a factor and the biting behavior—with clear and consistent responses from people and other dogs—should begin to subside. But some dogs learn that biting works to get certain things to happen. If biting has been reinforced, even accidentally, it could continue long into adulthood. Note: If your puppy is not biting anything at any time, there may be something amiss. To be sure, consult your vet or a behavior professional for an evaluation to help identify any potential issues."}}, {"@type": "Question", "name": "How do I get my puppy to stop biting my hands and feet?", "acceptedAnswer": {"@type": "Answer", "text": "Because our hands and feet move a lot, they can quickly become things that puppies like to chase and bite. To get a puppy to stop biting: Always play with your puppy using toys so there’s something appropriate for them to engage with. Walk calmly so your feet don’t become targets. If your puppy bites your hands while being pet, redirect them to a preferred chewing outlet. If the bites also include any combination of holding with pressure, tension in their body, deep growling, and or shaking of their head from side to side, contact a behavior professional."}}, {"@type": "Question", "name": "How do I stop my puppy from biting my ankles when I walk?", "acceptedAnswer": {"@type": "Answer", "text": "If you puppy is biting your ankles, try dragging a tug toy on the floor so they target that instead. Another way to stop puppy biting is to encourage the puppy to follow you, with his eyes looking up, while you reinforce the behavior with food. This can also double as a foundation for teaching your puppy to walk on a loose leash. If your puppy seems unable to respond and continues to bite, they may be overly tired. Put them in their crate or designated area with a treat to encourage them to nap. Featured Image: Adobe/Lubo Ivanko"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How To Stop a Puppy From Biting", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Training", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/how-to-stop-puppy-biting.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/how-to-stop-puppy-biting.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Puppy, Training, Behavior, Zoo Puppy Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/puppy-biting"}, "datePublished": "July 31, 2020", "dateModified": "September 25, 2023", "description": "Is your new puppy’s biting getting a bit out of control? Here’s veterinary behaviorist Wailani Sung’s insight into why puppies bite and how to stop a puppy from biting you, your clothes, and your stuff.", "articleBody": "Bringing home a new puppy is an exciting time. But it’s not all puppy breath and playtime—soon, your puppy will bite everything they can get their mouth on. But why do puppies bite so much when they are young? Is it normal? Should you be trying to stop your puppy from biting you? When does it indicate there’s a problem? Here’s a breakdown of puppy biting behavior and what you can do to help your puppy learn how (and when!) to use their mouth appropriately. Why Do Puppies Bite? It’s normal for puppies to use their teeth during play and exploration. It’s how they learn about the world, and it plays an important role in their socialization. Not to mention, puppies also chew on everything—including you and your clothes—while they are teething. Here are a few reasons why puppies bite. 1. They’re Exploring the World Puppies learn a lot from biting things, including other puppies, their pet parents, and inanimate objects. They receive sensory information about how hard they can bite that particular object, what it tastes like, and whether they should modify their behavior. Depending on the feedback a puppy receives, like the taste and consistency of the object or the reaction they get, a puppy may continue to bite, change their bite pressure, or stop entirely. 2. Your Puppy Is Teething Adult dog teeth start to grow in when your puppy is 12–16 weeks old, and your puppy’s gums may be a bit sore during this time. Because of this, puppy biting tends to hit its peak when a pup is about 13 weeks old. During this time, you’re likely to see an increase in chewing on objects—including you, your clothes, and maybe even your hair. 3. It’s Play Behavior Some puppies nip or bite to entice play. When puppies bite each other, they learn a very important skill: bite inhibition. With play biting, puppies learn how much pressure they can apply with their teeth and what happens when they bite too hard. For example, let’s say Puppy A and Puppy B are playing together. When Puppy A bites too hard and causes pain in Puppy B, Puppy B will cry out and refuse to continue to play with Puppy A. Puppy B may even move away from Puppy A. Through this interaction, Puppy A learns that if he bites too hard, other puppies won’t play with him. So, Puppy A makes his play bites softer, so they don’t result in play with Puppy B ending. Some puppies may learn through a one-time process, while other puppies need multiple play sessions with multiple puppies to learn to soften their bite. Your puppy will try to engage in play by biting you because, to them, this is a normal dog behavior. When this happens, you will need to understand how to respond so your puppy has clear and gentle guidance. How To Get a Puppy to Stop Biting Curbing your puppy’s biting and nipping largely depends on why he’s doing it in the first place. Here’s how to stop your puppy from biting for common reasons. If Your Puppy’s Chewing Your Belongings Schedule exercise, play, and sessions for mental stimulation for your puppy. In addition, they will need time to sleep undisturbed. When they have extra energy, are bored, or are overtired, your puppy may chew on random items (or you) as a result. Give your puppy a wide variety of puppy toys to chew on, and pick up other household items within their reach that they shouldn’t chew on. If you see your puppy biting on inappropriate objects around the house, calmly redirect them to a toy instead. Once they engage with the toy, praise them. If Your Puppy’s Teething Puppy teething toys ease sore gums and are typically made with softer plastic so they won’t hurt the baby teeth or incoming adult teeth. Some teething-friendly toys include: N-Bone Puppy Teething Ring Nylabone Puppy Chew Freezer Dog Toy Playology Puppy Teething Bone Always supervise your puppy when they play with any toys to make sure that they do not chew off small pieces and swallow them. If Your Puppy’s Biting You to Play If your puppy bites to start play or during play and will not be redirected to a toy, immediately get up and remove yourself from the puppy’s area. Go into another room or to the other side of a gate or barrier so the puppy can’t follow. Remain out of the area for about 30 seconds. When you return, get a toy and resume play. You may need to repeat this process. Remember: If your puppy is tired, this can increase biting. Your puppy may need to be encouraged to nap. Never encourage nipping by enticing a puppy to chase your hands or toes. Soon enough, your puppy will get bigger and their teeth will be sharper. The puppy nip that used to be harmless will turn into a bite that is no longer fun. Tips for Stopping Puppy Biting While puppy biting is a normal part of a dog’s development, it’s important that you manage the behavior appropriately. You need to be patient and consistent. If you are frustrated by your puppy’s behavior, seek professional help from a certified behavior consultant, an applied animal behaviorist, your vet, or a vet behaviorist. Here are some tips for success in stopping your puppy from biting you. Avoid Harsh Verbal or Physical Corrections Verbal and physical corrections do not teach your puppy how to behave; they only teach a puppy to suppress a behavior or escalate their behavior to defend themselves. Using punishment to train your puppy will lead to fear and anxiety. Always use positive reinforcement when training your dog, whether it’s to stop your puppy from biting or teaching basic cues like “sit” and “stay.” While puppy biting is a normal part of a dog’s development, it’s important that you manage the behavior appropriately.Give Your Puppy Age-Appropriate Toys Start off with a good supply of various puppy-safe toys, such as soft rubber toys, a puppy-sized rubber ball, a rope toy, and a stuffed toy with a squeaker. Dogs have preferences, and it’s good to identify them early. Encourage your puppy to play by showing them the toy and rolling or moving the toy around. Whenever your puppy grabs onto the toy, offer plenty of verbal praise. If your puppy grabs your hand or clothing, stop moving or providing any resistance. Instead, stop the play and leave, using the procedure described above. If the puppy follows you and continues to bite your feet, ankles, or legs, exit the play area, moving into another room or behind a gate. It will send a clear message that every time your puppy bites you, you will stop interacting with them. Wait 20–30 seconds, then come back out. When your puppy comes running to you, immediately engage them with a toy. Pretty soon, they will learn that it’s more fun to bite toys instead of you. Try Puppy Socialization Classes Attending puppy socialization classes is also a helpful (and crucial!) part of your puppy’s education. Here, puppies learn how to read other dogs’ body language, bite inhibition, and how to communicate with a wide variety of similarly aged pups. Puppy classes also provide a controlled environment where they can learn from interactions with other puppies what is appropriate play behavior and what is not acceptable. Note: Please be sure that if socializing is allowed in a class environment, that all of the participants are actually puppies. Dogs with adult teeth should not be included. Nipping and Biting in Adult Dogs It’s much easier to teach bite inhibition to puppies because their jaws are not fully developed. Otherwise, you would be dealing with a dog that may bite hard enough to cause bruising, abrasions, or punctures. If you do not teach your puppy bite inhibition and provide them with appropriate objects to chew on, they may grow into an exuberant adolescent dog that may be more difficult to manage due to their inability to inhibit their biting. If your dog has their adult teeth and continues to bite hard enough to cause pain, broken skin, or bleeding and none of your bite inhibition approaches are working, get in touch with a behavior professional. A certified behavior consultant (CDBC), a certified applied animal behaviorist (CAAB), or a veterinary behaviorist (DACVB) are all qualified to help you."}]