[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Reducing Pet Fear in the Veterinary Setting: One Veterinarian’s Experience", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/3440898654_0742888152.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/3440898654_0742888152.jpg"}, "author": {"@type": "Person", "name": "Rolan Tripp, DVM, CABC", "url": "https://www.petmd.com/author/dr-rolan-tripp"}, "keywords": "Dog, Anxiety, Wellness exam, Vet visits", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_reducing_pet_fear_in_the_veterinary_setting"}, "datePublished": "March 21, 2011", "dateModified": "September 6, 2022", "description": "Anxiety at a veterinarian&#039;s office can be a common occurrence in pets. Read how Dr. Rolan Tripp was able to reduce the &quot;frightening&quot; feeling of his small practice and how it can help you with your pet.", "articleBody": "This article is courtesy of The Hannah Society. By Rolan Tripp, DVM, CABC &quot;Shame on me!&quot; I thought as I stood in the lobby of my own veterinary hospital 15 years ago. I was watching as one of my valued clients was dragging her dog into the hospital. The dog was a delightful Border Collie who obviously did not want to be there. There were two questions that came to mind: (1) Does this animal act like this at other locations? (Answer, no); and (2) Has she been to another veterinary hospital that I can blame for her fear? (No again.) Dogs simply don’t lie or make up stories. This dog had been treated in such a way that she didn’t want to ever come here again. Not only was I embarrassed, but I wondered if this veterinary phobia might also influence loving owners who would not want to come to a place that frightens pets. Being a veterinarian, and owning my own practice had long been a dream for me. Now I felt terrible that either I or someone I was responsible for had treated this otherwise wonderful animal (and others) in a way that made my supposed haven for animals seem like the dungeon of terror. That moment was a turning point in my life. Since then I have been looking for ways to make the veterinary visit more fun and less scary for the pets under my care and have been attempting to influence other veterinarians to do the same. Can you imagine a veterinary practice where virtually all pets LIKE to come in the door? I can now. After years of staff training, and implementing numerous protocols, my wife Susan and I gradually transformed our practice into something I was really proud of. Our basic strategy was to imagine what it was like to visit the hospital from the pet’s point of view. We had one Husky mix who repeatedly ran away from home to come to the hospital. I later attributed our high practice growth rate largely to managing the pet’s perception of the visit. If I were to own another practice, I would review every staff veterinarian’s performance partially on how much pets liked them. We stocked tasty pet treats, and I became our very own practice, “Cookie Police.” I would come to any staff member and in a light hearted way say, “Got cookies?” If not, we would share a little laugh and go stock up his or her smock pocket. Soon staff members proudly showed me their Ziploc baggies with tasty treats. Staff was trained to give a small piece to every healthy pet who would accept one. I have come to believe that one &quot;stress test&quot; of the pet’s mental state, is simply &quot;acceptance of a treat.&quot; Refusing a treat is a flag to inquire if the pet would have accepted the same treat at home. If the response at home is different, this treat refusal may be the first sign of a pet developing veterinary phobia. Through my study of animal behavior, I learned that the canine brain goes through distinct developmental periods. I learned that the canine critical socialization period was from 4-12 weeks of age, with some tapering effect up to about 16 weeks. We were already offering puppy classes, but many puppies weren’t enrolled, so we initiated steps to increase enrollment. I finally understood that those pets deprived of early positive social experience could never be as great a companion animal as their genetic potential. It bothered me that we veterinarians were actually part of &quot;the problem&quot; when giving the outdated advice many of us learned in veterinary school (i.e., telling people to isolate their puppy). Instead I now encourage the owner to take the 8-week+ old puppy with them everywhere they legally can, avoiding contact with “sick or mean” dogs or people!   To supplement our puppy classes, we started offering &quot;Puppy Day Care.&quot; When the puppies developed adult teeth, we occasionally had to inform the client that the dog was now an adult and not eligible for puppy day care any longer. Some clients begged to allow their dog to continue to come to his favorite place, so we developed protocols and a separate area for adult dog day care. I now believe those dogs that periodically go to day care get tremendous mental and social stimulation, and I feel sorry for those poor dogs isolated at home who stare at a wall or fence every day. Most day care dogs learned the &quot;social skills&quot; necessary to get along with new dogs and people, and got to experience what I imagine is the deep canine psychological satisfaction of &quot;hanging with their pack.&quot; There were also some dogs that even with the best of socialization just could not get along with other dogs and were expelled from day care. When this happens I think it probably reflects some mix of genetic predisposition, negative experience, or lack of early socialization. I taught the staff how to do &quot;Gentling&quot; exercises with every puppy and kitten to desensitize them to human handling, always linking body handling to a little treat. We made it hospital policy to use very small needles, and learned techniques to distract the pet during any injection. We began enrolling every puppy owner in an online education course, and implemented a “fear prevention protocol” offering sedation before any procedure that might be painful. Our goal was for pets to remember lots of positive experiences, but not remember any negative ones. A &quot;Pet Centered Practice&quot; is what I now call a veterinary hospital where every staff member looks at the visit from the pet’s point of view. It is important to note that we were not able to successfully allay every pet’s fears, and those pets still required special handling, but our goal was to prevent new cases and reduce the severity of the existing ones. I encourage every small animal veterinary hospital to host puppy parties in the lobby one hour a week after the hospital closes, and allocate a small area for puppy day care. These positive visits help overcome unavoidable unpleasant memories. Positive socialization along with owner education, treats, injection distraction, and preemptive pain sedation result in pets that are friendly instead of fear aggressive. When these dogs come in the front door they are wagging their tail looking for the next cookie or the next party with their dog friends. Dr. Tripp received his doctorate from UC Davis School of Veterinary Medicine and also holds a bachelor’s degree in music and a minor in philosophy.  A regular guest on the Animal Planet Network, Dr. Tripp appears on both “Petsburgh, USA” and “Good Dog U.”   He is a Veterinary Behavior Consultant for Antech Laboratory’s “Dr. Consult Line” and an Affiliate Professor of Applied Animal Behavior at both Colorado State University College of Veterinary Medicine and University of Wisconsin School of Veterinary Medicine.  Dr. Tripp is the founder of the national behavior consulting practice, www.AnimalBehavior.Net. He is now the Chief Veterinary Pet Behaviorist of The Hannah Society (www.hannahsociety.com) which helps match people and pets, then keeps them together.  Contact info: Rolan.Tripp@HannahSociety.com. Image: Bas Lammers / via Flickr"}]