[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Your Dog Won’t Walk on the Leash, From Dog Training to Health Issues", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS-Dog-Refusing-to-Walk-on-Dog-Leash-681606061.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS-Dog-Refusing-to-Walk-on-Dog-Leash-681606061.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise, Training, Leash", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/why-your-dog-wont-walk-leash-dog-training-health-issues"}, "datePublished": "August 7, 2018", "dateModified": "September 6, 2022", "description": "When your dog refuses to walk on a dog leash, it can be very frustrating. Here are some reasons why your dog may not be walking on their leash, from dog training to dog health issues.", "articleBody": "Image via Olena Kurashova/Shutterstock.com By Teresa Traverse Going for a walk is an important part of almost every dog’s life. Many dogs require and enjoy daily strolls with their owners. So, if you’re the owner of a new puppy or an older dog and they are refusing to walk on a dog leash, it can be frustrating and concerning. From dog training issues to dog health issues, a pet owner’s mind can run the gauntlet when their dog refuses to walk on a leash. Here is a list of some of the reasons why a dog won’t behave while on leash. She’s a Puppy “A lot of people just sort of assume putting a leash and attaching it to a dog is natural to the dog, but it’s not,” says Megan Stanley, chair of the board of directors for the Association of Professional Dog Trainers, and owner of Dogma Training &amp; Pet Services in Calgary, Alberta, Canada. Take your time when leash training a dog or new puppy, and introduce the equipment slowly, suggests Stanley. “Anytime they’re introducing a new piece of equipment, it’s good to just bring it out and let the dog explore it. Smell it. Check it out. Versus just going and putting it on it,” says Stanley. Make sure your dog’s okay with her dog collar by slowly introducing it so she can get accustomed to wearing it. Stanley suggests pairing the dog supplies, like dog leashes and collars, with food rewards. Once your puppy feels safe and secure with the collar on, attach the leash to it. Let your puppy drag the leash around. You should also offer your puppy rewards as she moves around with the leash on to create positive associations. Start in your home, and then take it outside. But always remember to be patient. The next step is to pick up the leash but to let your puppy lead you where she wants to go (within reason!). Only once your pup is comfortable wearing her collar and leash and having you on the other end of the leash should you try directing her movements. Stanley says that most people just expect their puppy to understand leash training and to immediately walk nicely. But Stanley explains, “They get out, and there are so many distractions. There are smells. There are people. There’s wildlife like squirrels.” When your dog starts to walk forward after you’ve asked, be sure to reward her when she’s moving and not stopping. Many owners will go back to their dog and reward the stopping, which is counterproductive. When it comes to picking dog treats, aim for a high-value treat you know your dog loves. Stanley recommends freeze-dried liver treats. Don’t forget to also verbally praise them for walking forward, too. She’s a Shelter Dog If your adult dog came from a rough background and is not used to walking on a leash, it will take her time to learn how to walk nicely on one. “An adult dog can be more challenging. They’ve got to relearn the behavior. You’re reteaching them. Everything they’re doing is learned behavior. You have to teach them something new. It’s going to be a longer process,” says Stanley.  The training process is identical to one you’d use with a puppy—start slowly, reward your dog positively and don’t give up. “Patience really goes the longest way,” says Dr. Ryane Englar, DVM, assistant professor of clinical education coordinator at K-State University. She explains that just because they are an adult dog, it does not mean they already have leash skills or experience being on a leash. She’s Anxious or Fearful “They might just find going out into the world scary. They just need to find that confidence,” says Stanley. To help out your dog, start gradually. Introduce her to the world and reassure her that she’s safe. If your dog sees something that scares her, soothe her and interact with her. Try not to make such a big deal out of something that’s not a real threat, like a garbage truck. If your dog is fearful of a garbage truck, be proactive and try to avoid walking your dog when the truck is out, suggests Stanley. “Usually they just need a few minutes to recover and realize they’re not in danger,” says Stanley. Sometimes it’s best to take breaks if your dog just won’t walk. “If you’re getting frustrated, then it’s best just to give up and start a different day,” says Dr. Englar. She also recommends being gentle and positive, speaking in warm tones. You also can try to praise your dog or engage her during a walk to encourage her. She’s in Pain “I’m much more worried about the dog that always walks fine and then it doesn’t walk fine. That to me would be a concern,” says Dr. Englar. “It might be a sign of pain.” Some possible causes of your dog not wanting to walk could be an infection, an illness, a metabolic disease, undiagnosed diabetes, organ failure or Lyme’s disease, says Dr. Englar.   If you have concerns or if you notice a marked change in behavior that doesn’t resolve itself quickly, book an appointment with your veterinarian. “Anytime that you’re uncomfortable with how they’re acting, meaning something’s consistently off about them, it’s always better to be safe than sorry,” says Dr. Englar.  How Dog Harnesses Can Help If your pup has never been trained to walk on a leash, it might be easier with a dog harness. Stanley recommends trying a dog harness like the 2 Hounds Design Freedom No Pull Dog Harness. Harnesses prevent dogs from straining their necks, too. Dog harnesses “don’t put any pressure on unnecessary spots on dogs but still alleviating the pulling,” says Stanley. Dr. Englar advises using the PetSafe Gentle Leader quick release dog headcollar if your dog pulls. She advises against using choke chains. If your dog has received a clean bill of health and you’ve tried, and failed, to train her to walk on a leash yourself, it’s time to enlist the help of a dog trainer. Trainers who use only positive forms of reinforcement (no punishment!) can quickly get your dog looking forward to calmly walking by your side on her leash. "}]