[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "When Barking is a Problem", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_when_barking_is_a_problem"}, "datePublished": "May 9, 2011", "dateModified": "September 6, 2022", "description": "", "articleBody": "by Turid Rugass Excerpted from the book Barking - The Sound of Language, with permission from Dogwise Publishing. Barking is a natural way for dogs to express themselves -- it is a part of their language. Nobody would ever dream about “training away” or “punishing away” a cat that meows or a horse that whinnies. But many people believe that dogs should not be allowed to bark or growl. First and foremost you must understand and accept that dogs actually have a language, and that a part of that language is to make sounds. It is as simple as that. But given that, it must be admitted that vocal expressions in dogs can have formidable dimensions, and can be a problem for their surroundings including the people nearby. The key to finding a solution to this is to learn to recognize the point at which barking has become exaggerated because of a need for attention, stress, or has developed into “yelling” because nobody listened when the dog tried to communicate in a more normal way. It can happen in an isolated situation or it can be chronic. But in either case, when there is stress involved, it often comes out through the mouth -- not unlike people! No matter what the cause is, you can do something about it. You have to find the reason for the problem, what kind of barking you are confronted with, and understand the circumstances around it. Then you can identify ways to minimize the barking, remove whatever caused it, and in that way, get control of the problem. The aim should not be to stop all barking for good. You should not be trying to take away from dogs the language they naturally have. The goal should be to get it down to a level and intensity that you can live with and that permits the dog to act in a way that is natural to him. And, of course, you need to look at your own reactions to a particular barking event since you may be over-reacting. *** In Barking, author Turid Rugaas, well known for her work on identifying and utilizing canine &quot;calming signals,&quot; turns her attention to understanding and managing barking behavior. If you can identify what your dog is expressing when he barks, you can take steps to minimize the negative effects of barking in cases where you find it a problem. Image: Luke Joyce / via Flickr"}]