[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Become a Professional Pet Sitter/Dog Walker", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2yqqb8a3.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2yqqb8a3.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_pet_sitter_dog_walker"}, "datePublished": "November 14, 2008", "dateModified": "September 6, 2022", "description": "Job hunting can be a frustrating task. There is the résumé building, the narrowing down of prospective employers, the interview process, not to mention the obligatory &quot;jumping through hoops.&quot;", "articleBody": "Job hunting can be a frustrating task. There is the résumé building, the narrowing down of prospective employers, the interview process, not to mention the obligatory &quot;jumping through hoops.&quot; But if you love pets, are reliable, honest and hard working, and are interested in a career that is both fun and challenging, you&#039;ll want to join the wonderful world of professional pet sitting and dog walking. That way the pets can do all the hoop jumping for you (which will really only be when you&#039;re sitting or walking circus pets). Let&#039;s start with pet sitting. There are two ways to get your foot in the proverbial door. First of all, you can join an already established agency or train under someone who has set up a solid business and needs to hand jobs over to someone else. Or open door number two and start your own pet sitting company. Of course, both options have their ups and downs. Working for someone else will mean a boss, and perhaps less money than if you were working for yourself, but you’re also not doing the difficult behind-the-scenes tasks, such as getting clients, liaising with clients and dealing with problems as they arise. Working for others means you just have to be available when you say you are. None of this, “I’m not getting out of bed for less than $10,000 a day,” a la Linda Evangelista, the Canadian supermodel. Just make sure you are reliable when it counts. If you do decide to work for yourself, you need to build a reputation. Bully all your friends into using your services and get their friends to hire you, too. Post ads on veterinary bulletin boards, Craigslist, and pass out fliers around town. It may take awhile to see the fruits of your labor, but usually the larger the effort, the larger the payout.   Regardless which path you choose, pet sitting is just as much about the client, as it is about the client&#039;s pet(s). When meeting a potential client, remember that person is letting you into their home and entrusting you with their beloved companion. Treat each client and animal with the respect they deserve. Be yourself and take the time to get to know the animal; it may take awhile for it to get adjusted to your presence. If the person wants to hire you, take notes, listen closely and do everything you can to make the client feel comfortable with you being in their home. If they have a dog, then definitely make sure dog walking is part of the package. Often, this can lead to a regular dog walking gig. You should never limit yourself to purely pet sitting. Dog walking is very lucrative, especially in big cities where people are too busy making money to walk their dog during the day. Likewise, dog walking can lead to pet sitting, too. When you are dog walking or pet sitting, you will have access to people’s private homes. This does not mean you can make yourself at home and throw parties. And don&#039;t even think about drinking their booze. Treat all spaces you are allowed into with the utmost respect and make sure it looks as good as when you walked in. It is just common courtesy. Enjoy your new career. You are going to make some incredible four-legged (and even feathered or scaled) friends. Image: jackiembarr / via Flickr"}]