[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Search and Rescue Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_rescue_dog_training"}, "datePublished": "December 2, 2008", "dateModified": "September 6, 2022", "description": "We all love a hero, and rescue dogs are some of the biggest heroes of all. You will often find them going above and beyond duty to save someone, risking -- and at times losing -- their lives in the process.", "articleBody": "Search-And-Rescue Heroes We all love a hero, and rescue dogs are some of the biggest heroes of all. You will often find them going above and beyond duty to save someone, risking -- and at times losing -- their lives in the process. Rescue dogs are generally found in the Sporting and Hunting Groups, or from the traditional Herding Group. These breeds include the Bloodhound, Labrador Retriever, Newfoundland, German Shepherd, Golden Retriever, and Belgian Malinois -- all of which are chosen for search-and-rescue duty because of their incredible physical strength, unfailing loyalty, and their tendency for mental stability. These breeds also have a heightened sense of hearing and smell -- to better locate lost individuals -- and are often able to access hard-to-reach areas. As highly trained animals, they serve in many different fields, including specialist search, avalanche rescue, cadaver location, and tracking. To overcome obstacles and succeed when performing the demanding duties of a search-and-rescue worker, a dog must display certain qualities. In addition to intelligence and strength, the dog must be agile, confident, easily trainable, adaptable, and have a high level of stamina and endurance. A strong sense of pack cooperation and an ability to engage in friendly play during &quot;down&quot; time is also required of search-and-rescue dogs. A rescue dog undergoes many, many hours of intensive training to be fit for duty. Training is not for the faint of heart. Certification training can take from two to three years, working three to four hours a day, three to six days a week, often in group, team-oriented sessions. Each search-and-rescue field requires different types of training. Rescue training, for instance, includes the tactic &quot;air scenting&quot; -- where dogs are trained to sniff the air for the victim’s scent and then follow the scent to the person. This ability is crucial to finding victims trapped under collapsed buildings and avalanches. The same confidence, flexibility, mental strength, and stamina required of a dog is required in a human handler as well, perhaps even more so. Many search and rescue operations will not end happily. A good dog handler needs to maintain grace and stoicism in the face of tragedy. In addition, a successful handler needs humility, to allow the dog to take the lead in situations that require it, and to be diplomatic and confident when the dog&#039;s, or handler&#039;s, techniques or answers are in question. Also necessary is an ability to thrive under pressure, both emotionally and physically. Although this job may not pay out in the millions you may have imagined making as a youngster, it does pay in unlimited personal rewards, as you and your rescue dog set off for adventures that the rest of us can only watch from our living room couches. A dog handler must truly want to go into this line of work, and must wholeheartedly love his or her dog. As these furry friends are heroes, we don&#039;t imagine it being too hard of a task. Image: U.S. Navy photo by Journalist 1st Class Preston Keres"}]