[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Make a Dog Bark", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/barking-howling-golden-retriever-puppy_276762800_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/barking-howling-golden-retriever-puppy_276762800_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_how-to-make-a-dog-bark"}, "datePublished": "February 16, 2016", "dateModified": "September 6, 2022", "description": "Barking can be a noisy nuisance to dog parents (and their neighbors!), but canine vocals aren’t all bad. Sometimes, a barking dog can provide a safety warning and other times, teaching a dog to bark on command can make for a fun party trick. Here&#039;s how to teach your dog this new trick.", "articleBody": "By Kellie B. Gormly Barking can be a noisy nuisance to dog parents (and their neighbors!), and is often tops the behavioral problem list. However, canine vocals aren’t all bad. Sometimes, a barking dog can provide a safety warning and other times, teaching a dog to bark on command can make for a fun party trick. “A lot of people would absolutely want their dog to bark when there are strangers around, or something is out of order in the neighborhood,” said Los Angeles-based certified dog trainer and behavior consultant Jonathan P. Klein. “When we teach a dog to do something on cue, the key is to get them to reliably do the behavior one way or another.” How, then, do you teach your dog to bark on command without confusing him or encouraging annoying barking? By teaching a trick and not a bad habit, said Beth McGonigal, certified dog trainer and owner of North Pittsburgh Animal Behavior. “We don’t want to create a little yappy monster.” She compares teaching dogs to bark to a sweet arrangement she has with one of her dogs, Jefferson. When she says the magic words, “give mommy some romance!” Jefferson gives her a kiss on the lips, which is fun on command but not something a pet parent would want done all the time. How to Make a Dog Bark Capture the behavior you want and reward it by enticing your dog with a trigger that excites him, like holding a ball or ringing the doorbell. Right before the dog barks, say the command you want to teach (he will then associate the command with vocalizing) then give your dog a treat for barking on command. If he barks but you haven’t said the command, don’t reward him. After a few repetitions, he will begin to realize that if he barks, he will get a treat, said McGonigal, who also uses clickers to train. You can also trigger the bark by doing something that frustrates the dog, like bouncing a ball out of his reach behind a baby gate. After you say the command, you can then reward the dog by giving him the treat of playing with the ball. Repeat the process by rewarding your dog for barking on command then, once he learns the command, reduce the treats and make them more intermittent, Klein said. A common command to teach is “speak,” but dogs have no inherent knowledge of that English word; they only know it if people teach them to associate it with barking, McGonigal said. Therefore, you can invent a word or phrase of your own to get your dog to bark on command, or just use the simple, “speak.” How Long Will it Take to Teach a Dog to Bark? Every dog is different, McGonigal says, and knowing your dog is key. Some dogs are more talkative and learn more quickly than others, but in general, a few training sessions should produce results. “Because barking is a self-rewarding behavior, [dogs] tend to pick up on it a little more quickly,” she said. “They could catch on in a few weeks. It’s not a very complex behavior.” The training timeframe can also depend on how much training history the particular human and dog have together, Klein said. Consistency is the key to successfully training a dog to bark, he said, which means you must regularly say the magic words and reward your dog for doing what you want. “If you&#039;re inconsistent, then the dog is not going to put two and two together,” he said. Unfortunately, training your dog to speak a little too well can be problematic, and the amount a trained behavior can be un-trained will depend on the individual dog, McGonigal said. The same principles of training will apply, though this time you’ll be rewarding your dog’s silence with a command that means, “quiet.” Whatever you do, don’t yell at your dog when he’s barking, even if the barking is inappropriate. Just like an argument with a human, when both people are yelling, the exchange becomes heated and unproductive. “You’ll reinforce the barking by giving it attention,” said Klein. Instead of yelling at your dog for barking, try to identify the stimulus that triggers that inappropriate barking and either remove the stimulus or remove the dog from the stimulus. Image: Mikkel Bigandt / Shutterstock"}]