[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Properly Put on a Dog Harness", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/properly-put-harness-on-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/properly-put-harness-on-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Leash, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_how-to-properly-put-on-dog-harness"}, "datePublished": "February 11, 2016", "dateModified": "September 6, 2022", "description": "Whether you’ve never used a dog harness before or are considering trying out a new style, it’s easy to get tangled up in the process. Fortunately, there are a few easy ways to find out which harness is best for you and how to properly put it on your dog.", "articleBody": "by Caitlin Ultimo Whether you’ve never used a dog harness before or are considering trying out a new style, it’s easy to get tangled up in the process. With every new style there is a different set of benefits that vary from training to comfort purposes. There are also unique guidelines and different ways to put on the many styles of harness. Fortunately, there are a few easy ways to find out which harness is best for you and how to properly put it on your dog. “Walking your dog should be enjoyable for both pet and walker,” said Susan Konecny, RN, DVM and Medical Director at Best Friends Animal Society®. “Body harnesses are ideal because of the comfort they afford the dog and the ease with which most dogs adjust to them. Different types of harnesses can be used depending on the dog and the situation.” Why Your Dog Might Need a Dog Harness A pet parent might consider getting a harness over a collar for different reasons. “Certain dogs who have medical conditions like megaesophagus (an enlarged esophagus) or a neck injury are better off with a harness because it won’t put any pressure on the neck,” said Ashley Atkinson, CPDT-KA and behavior consultant at Best Friends Animal Sanctuary. You may also consider a harness to help train your dog to not pull or jump. Harnesses are a less severe option when compared to pinch or chain collars as training methods. “We recommend harness over those other styles because pinch and chain collars can actually increase certain behavioral concerns like lunging or growling at other dogs while on leash,” Atkinson said. Types of Dog Harnesses Collars are pretty straight forward, but the harnesses can become overwhelming fast. “There are quite a few different types of harnesses on the market today,” said Annie Angell, CPDT-KA and co-owner of My Two Dogs. The options may look like a bunch of strings and clips, but there is more to it, as each type of harness will have a slightly different style and fit, Atkinson said. Here are the most common options available: Back-clip: this style is generally the easiest style for most dogs to adjust to. Back-clip harnesses are for calm dogs that are trained not to pull on the leash and are especially useful for small dogs with delicate throats that are easily irritated by collars.Front-clip or Training Harness: this style has a leash attachment in front of the harness and should be in the center of your dog’s chest. Trainers often choose front-clip harnesses to help decrease the dog&#039;s pulling on the leash. The chest clip will give better control over the direction that your dog is going and allows him to be redirected if needed.Comfort Wrap or Step-in Harness: this style is typically designed to easily have your dog step into the harness and close on his back. Lay the harness on the ground, have him step in, pull the harness up and around his shoulders and then clip him in.Soft or Vest Harness: this harness option is typically made of a mesh material that comes in a range of colors and patterns. The style will resemble a vest and may seem thicker and wider than other options.  Some slip over the head and some can be stepped into.No-pull Harness: like a training or front clip harness, this style is designed to help discourage your dog from pulling. The leash attachment ring will be at the center of your dog’s chest and harness will tighten and add pressure if the dog pulls (encouraging him to stay closer to you). Some styles also tighten around your dog’s leg area in addition to his chest.Auto Harness: these harnesses have an attachment that hooks into your vehicle’s seat belt and are perfect for the pet that enjoys going on car rides.Dog Mobility Harness: this style is used for senior dogs or those with leg or spine injuries. The full body style is a dog lifting aid and is not used for everyday walks and outings like the other styles.How to Measure a Dog for a Harness “When picking a harness and trying it on your dog, you want to make sure that it is snug and the clip hangs higher up on your dog&#039;s chest,” Atkinson said. “If it dangles too low, then it can&#039;t help control forward momentum.” You’ll also want to be careful that the harness is not too snug or difficult to clip or buckle, making sure it does not rub under a dog&#039;s armpits or anywhere else. If possible, take your dog to try on a few options before making a first-time purchase. Harness sizes are typically offered in sizes extra small through extra large. The size is determined by your dog’s measurement around his rib cage and chest. If your dog cannot try on a potential harness before you purchase it, measure across your dog’s rib cage and chest then add two inches. If your dog is between sizes, select the next size up. Typically, these measurements align with the following sizes:                   • Extra small: 8 to 14 inches                   • Small: 10 to 20 inches                   • Medium: 16 to 28 inches                   • Large: 26 to 40 inches                   • Extra large: 40+ inches How to Put On a Dog Harness Each style of harness has its own set of techniques to consider when putting it on your dog. Typically, the harness will either require your dog to step into it or you’ll have to slip it over your dog’s head and the have him step through the arm holes before you clip him in. With any style, it is important to get your dog used to how you put it on so that you both stay tangle-free. “I recommend teaching the dog to stand still,” Angell said. “You could teach them to stand and put one paw through the harness and then the other.  If the dog is a little fidgety, give him a treat to eat while he gets all harnessed up.&quot; Image: Susan Schmitz / Shutterstock"}]