[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "News", "item": "https://www.petmd.com/news"}, {"@type": "ListItem", "position": 2, "name": "Views", "item": "https://www.petmd.com/news/views"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Lick Your Face, and Is It a Problem?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Views", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cute-boy-being-licked-by-a-puppy-picture-id954762898.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cute-boy-being-licked-by-a-puppy-picture-id954762898.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/news/view/why-do-dogs-lick-your-face-and-it-problem-37799"}, "datePublished": "December 4, 2018", "dateModified": "August 25, 2022", "description": "Dog face licking—is it a problem? Can it pose a health issue to you or your loved ones?", "articleBody": "As a dog owner, you are probably familiar with dog face licking, whether you think it’s cute or not. But why do dogs lick your face? Should you stop the behavior? Why Do Dogs Lick Your Face? The common dog face licking behavior has evolved from the wolf puppy behavior of licking the mouths of adult dogs to prompt the regurgitation of partially digested food. This is how puppies transition from suckling their mother’s milk to eating partially digested food to more solid food. Licking another dog’s face or a human’s face is a normal social behavior. Licking can be an appeasement gesture that signals a dog’s social deference. It can also be a signal to solicit food, more social information, a sign of affection or to solicit attention. A dog licking faces or other body parts can also occur as part of grooming. Your dog may lick his canine housemate’s face and your face or other body parts. When your dog cannot reach your face, he may lick the closest body part, which may be your hand, arm or leg. In certain cases, the licking behavior can be interpreted as a sign of affection. Some dogs may try to lick a complete stranger’s face. Why do they do that? It may be in an attempt to appease the stranger so that the stranger does do anything harmful or threatening to the dog. When dogs lick the face of children, it can be a sign of affection, appeasement or simply the act of cleaning food residue off their face. Is Dog Face Licking a Health Risk? For healthy children and adults, dog saliva is not a health risk for intact skin. It is not healthy, however, to allow your dog to lick an open wound on your skin. Their saliva may continue to keep the wound moist and open and allow bacteria to thrive, leading to a potential skin infection. In the past year, there have been 12 cases reported to the CDC in which people have gotten sick from a bacteria carried in the dog’s saliva. In those cases, the bacteria Capnocytophaga canimorsus was the culprit. This particular bacteria is found in both dogs and cats and is harmless to them. However, in cases where an individual has a compromised immune system, there is potential for the bacteria to cause an infection. The bacteria has to enter the skin through an open wound, such as from a bite or a cut on the skin. Typically the dog has to have a high concentration of that particular bacteria, and their saliva has to come into contact with the open wound. It is best practice to wash your hands after petting any dog. Should You Allow Your Dog To Lick You? For most healthy people, a dog licking faces or other body parts should pose minimal health risk. If you are concerned, then do not let dogs lick your mouth or anywhere near an open skin wound. I sometimes offer dogs the underside of my chin to lick. Then I immediately wash my face or apply antibacterial sanitizing spray or gel to that area of my face. Alternatively, I may allow them to lick my hand, and then I wash my hands afterwards or use an antibacterial spray or gel on my hands. What If You’re Not a Fan of Dog Face Licking? First, recognize that you might be reinforcing the licking behavior. If every time your dog licks your face, you give him attention, he is more likely to repeat the licking behavior. And if your pup licks you on the face or mouth when you are eating, and you give him a piece of your food, you are encouraging the behavior to continue. If you do not like having your dog lick your face, you can always redirect them to exhibit affection and attention in a more acceptable manner to you, and be sure not to encourage the behavior. Featured Image: iStock.com/FatCamera"}]