[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "News", "item": "https://www.petmd.com/news"}, {"@type": "ListItem", "position": 2, "name": "Views", "item": "https://www.petmd.com/news/views"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is It Normal to Talk to Pets?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Views", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-talking-to-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-talking-to-pets.jpg"}, "author": {"@type": "Person", "name": "Hanie Elfenbein, DVM", "url": "https://www.petmd.com/author/dr-hanie-elfenbein"}, "keywords": "Dog, Cat, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/news/view/it-normal-talk-pets-35897"}, "datePublished": "May 18, 2017", "dateModified": "August 25, 2022", "description": "Including our pets in conversation is one way to express how much we love them. The tone of our voice also tells our pets how we feel.", "articleBody": "I talk to my dog. I also talk to all the other dogs at the dog park. I may not be a “normal” person in all respects, but I don’t think this is one of my questionable character traits. I think it’s totally normal to talk to animals—and not just to ask if they want to play fetch. From the time I was a little kid, I talked to my dog. I could tell him anything, and he wouldn’t judge me or tell me what I should do. As I’ve grown up, the contents of the conversations have changed, but I still turn to my animals to say things that I can’t or don’t want to tell another person. Sometimes we just need to say what’s on our minds, and cats and dogs lend a willing ear. There is no need to hold back what we say for their sake. Pets Can Recognize Human Emotion Some people say that talking to my pets means I am anthropomorphizing them, or assigning human characteristics to non-human entities. I disagree. Dogs and cats have evolved side by-side with humans for tens of thousands of years to understand human emotion. Much of that is probably based on our body language, but the tone of our voice also tells our furry family members how we feel. Those clues tell our dogs and cats what we need from them. I don’t think that my dog knows what I’m telling him, but he knows the way my voice sounds when I’m sad, tired, or frustrated, and he tries to make me feel better. There were many nights during veterinary school when I put my head next to my cat to listen to his purr as I cried to him about feeling overwhelmed. Talking to my pets helps me feel better and, bigger picture, it’s a way to strengthen our bond. On the flipside, your dog will learn to understand more words than just “sit” and “dog park.” Be consistent when you are talking to your pet with the intention that they learn the meaning of what you say or take an action as a result of the word. For example, “off” and “down” might mean the same thing to you when your puppy jumps, but you might also use “down” to mean a laying position. That can be confusing for your pup, which can slow down the training process. Pets Offer Unconditional Love We invite dogs and cats into our family for their unconditional love—their willingness to listen to all of our complaints and tolerate all of our bad habits and love us anyway. In my opinion, anything we can do to make our pets know how important they are is a good thing. Talking to them, unlike giving them treats, won’t cause side effects like weight gain. Pets are meant to be spoiled, and including them in conversation is one way to express how much we love them. Talking to our dogs and cats is also key to the science that says pets are important for mental and physical health. According to the Centers for Disease Control and Prevention, pet parents are less likely to feel lonely than those who live without pets. I think part of that is having someone who always listens. There is also research that shows that talking in a happy tone if you are feeling sad or angry can actually help you feel happier—just like fake laughing can turn into real laughing. My dog is my companion. He goes on walks and runs with me, he hangs out with me in the apartment, he drives with me to work, and he’s always ready for an adventure. With that much time together, I can’t imagine not talking to him about all the things that happen in between our cuddle sessions. Dr. Elfenbein is a veterinarian and animal behaviorist located in Atlanta. Her mission is to provide pet parents with the information they need to have happy, and healthy, and fulfilled relationships with their dogs and cats."}]