[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "News", "item": "https://www.petmd.com/news"}, {"@type": "ListItem", "position": 2, "name": "Views", "item": "https://www.petmd.com/news/views"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Canine Influenza Vaccination: Does Your Dog Need It?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Views", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/canine-flu-vaccination.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/canine-flu-vaccination.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General health, Preventative health, Vaccine", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/news/view/canine-influenza-vaccination-does-your-dog-need-it-35403"}, "datePublished": "January 31, 2017", "dateModified": "August 25, 2022", "description": "Find out if you should be protecting your dog against the canine flu with a newly-developed vaccination to combat the illness.", "articleBody": "Living in the Northeast, there are those of us that dread the snow, ice and frigid temperatures while others can’t wait to frolic in the fresh powder or bundle up for some sledding. We will remain split down the middle on that debate, but one thing we all can agree on is that there is nothing worse than flu season. As humans, we’re fortunate enough that the flu is generally limited to a season. Our canine friends, however, are not so lucky. Canine Influenza (or dog flu) is a highly contagious disease that is a threat all year round. What is Dog Flu and Where Did It Come From? There are two identified strains of influenza virus that can affect our dogs and are classified as H3N8 and H3N2. The first recognized outbreak of the H3N8 strain of canine influenza occurred in January 2004 at a greyhound race track in Florida. There have been reported cases in a total of 11 states in the U.S., but only among dogs in race track facilities. The H3N2 virus was first identified in Asia in 2006. There is no evidence to confirm, but it is suspected that in 2015 the H3N2 strain was introduced to the United States by dogs that were rescued and imported from Asia. This U.S. introduction occurred in Chicago when several dogs at a boarding facility became ill. The company quickly shut down multiple Chicago locations for disinfection, but not before the city experienced the worst outbreak in 35 years. At that time there were over 1,000 cases of infectious respiratory disease reported. From there the H3N2 virus spread through the Midwest and continued to stretch throughout the country. Do I Need to Worry About Dog Flu? Canine influenza is transmitted from dog to dog by respiratory secretions (i.e. coughing, sneezing, and barking). The virus can live on surfaces for up to 48 hours, so dogs can pick up the virus from kennel surfaces, water and food bowls, collars, leashes, etc. The virus can live on clothing for 24 hours and on human hands for 12 hours, so people can also carry the virus from infected dogs to uninfected dogs. All dogs are susceptible to the virus at any time but dogs in restricted spaces (like shelters, boarding kennels, day care, etc.) are at a much higher risk. Symptoms of Dog Flu Dogs infected with the virus will show symptoms two to three days after being exposed. They will have a cough that can present as a moist, soft cough or a dry hacking cough that can persist for anywhere from 10 to 21 days. The cough can be accompanied by discharge from the eyes and nose, sneezing, lethargy (decrease in activity), decrease in appetite and fever. Dogs with a weaker immune system (young puppies, geriatric dogs or dogs with complicated medical histories) can be more severely affected and present with symptoms of pneumonia (high-grade fever, increased respiratory rate and labored breathing). Because these symptoms are the same as any number of respiratory infections, canine influenza cannot be diagnosed on symptoms alone. There are tests that can be preformed to confirm the diagnosis. Because the cough can persist for up to 21 days, a 21-day quarantine is recommended for infected dogs. Treatment can include fluids to maintain hydration, anti-inflammatory medications for fever reduction and discomfort and antibiotics for any suspected secondary bacterial infections are used to support the dog’s health until the virus is fought off by the body’s immune system. Should You Vaccinate Against Canine Flu? If your dog needs to be taken to boarding, grooming, or daycare facility, be an advocate for him. Make sure these facilities follow a strict cleaning regiment and schedule using proper disinfecting products and that the personnel are appropriately trained to understand cross contamination and how to prevent it. Lastly, finding a facility that requires all dogs to be vaccinated before entering their facility will also help protect your dog. Dogs that are at higher risk of exposure should be vaccinated. The first canine influenza vaccine was introduced in June of 2009 to aid in controlling infection with canine influenza virus H3N8, since that was the only strain found in the United States at that time. In 2015, following the Chicago epidemic, Merck Animal Health announced the availability of an H3N2 vaccine. Now that both strains have been identified in the U.S. and the occurrence of one strain or the other is unpredictable, it was recommended that high-risk dogs should be protected against both strains of the virus. In October, a vaccine was introduced to aid in the control of infection with both strains of the virus. Healthy dogs seven weeks of age or older can be given the vaccine, which requires two vaccinations given two-to-four weeks apart. Initial studies have shown that dogs do not maintain long duration of immunity so it is important to revaccinate them annually. Although the dog flu has been reported in 40 states (including Washington DC), the vaccine has not become a requirement in all high-risk facilities. In general, only those that have had reported cases of flu in their facility or city feel compelled to require it. Because of this, not all veterinarians are keeping the vaccine in stock. If you have decided to protect your dog using the canine influenza vaccine, be sure to speak to your veterinarian so they can order it for you if they don’t normally stock it. To ensure that your dog is receiving the vaccine’s full protection, it should be given at least two weeks prior to possible exposure. We as parents do need to understand, however, that vaccinated dogs CAN still become infected and develop the illness. The purpose of the vaccination is to control the spread of the disease by reducing the severity and duration of illness and symptoms, reduce the amount of virus that is shed by infected dogs and how long they shed the virus. If you have more questions about dog flu, are uncertain if your dog is at risk or wonder if the vaccination is needed/appropriate for your four-legged friend, please have a conversation with your veterinarian. They will help you decide the best way to protect your best friend! Charlie has been in the veterinary field for the last 18+ years, 14 of which she has spent as a board certified technician. She graduated with honors, from Harcum College as a member of Phi Theta Kappa, with an Associate’s of Science degree in Veterinary Technology."}]