[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "News", "item": "https://www.petmd.com/news"}, {"@type": "ListItem", "position": 2, "name": "Views", "item": "https://www.petmd.com/news/views"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Are Some Dogs More Aggressive?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Views", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-aggressive-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-aggressive-dog.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior, Aggression", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/news/view/why-are-some-dogs-more-aggressive-36736"}, "datePublished": "January 18, 2018", "dateModified": "August 25, 2022", "description": "In a new study, researchers from the University of Arizona examined the influence of two hormones—oxytocin and vasopressin—on canine social behavior and aggression. Here&#039;s what the findings mean for dog owners.", "articleBody": "In a new study, researchers from the University of Arizona examined the influence of two hormones—oxytocin and vasopressin—on canine social behavior and aggression. Oxytocin has been popularized by the media as the “love” hormone. It plays an important role in birth, the formation of bonds, and social behavior. It may also work to suppress the release of cortisol (the body’s main stress hormone) and may work in opposition to vasopressin. Vasopressin has been implicated as a trigger for what’s called the hypothalamic-pituitary-adrenal (HPA) axis, which enables the body’s “flight-or-fight” response. The study was featured in a recent National Geographic article, which stirred up a lot of interest in the role vasopressin and oxytocin may have in affecting aggressive behavior in dogs. Psychologist and anthropologist Evan MacLean and his colleagues found that the presence of vasopressin was more strongly associated with aggressive behavior in dogs than oxytocin. Two groups of dogs were recruited for the study. The case group consisted of dogs who have exhibited aggressive behavior toward other unfamiliar dogs. The control group consisted of dogs who did not exhibit aggressive behavior toward other dogs. In random order, the two different groups of dogs were exposed at a distance to either a person interacting with an inanimate object or a stuffed dog of three different sizes. Each dog experienced a total of six trials so they were exposed to all three dog decoys and three inanimate objects. Blood samples were taken before and after the trials to measure the dogs’ vasopressin and oxytocin levels. The study found that high levels of vasopressin were associated with the higher degree of aggression exhibited during the trials. In the second part of the study, dogs bred to be assistance (service) dogs were evaluated in two conditions: exposure to a threatening person and an unfamiliar dog. The service dogs had higher blood oxytocin levels than normal pet dogs. This may imply that the service dogs are calmer due to higher levels of oxytocin in their system. It is not surprising that the service dogs were calmer, since these dogs have been selectively bred for calm temperament for over 40 years. Treating Aggressive Behavior in Dogs So, what do the findings of this study mean for pet owners? Should we routinely check the oxytocin and vasopressin levels of all dogs who exhibit aggressive behavior? If we have an aggressive dog, should we have our veterinarian prescribe the use of oxytocin or administer a vasopressin antagonist? Before everyone rushes out to have blood samples drawn from their dogs, they must keep in mind that this was the first study of its kind to look specifically at the levels of oxytocin and vasopressin. It does not necessarily mean that modulating these hormones will resolve a dog’s aggressive behavior. Remember that aggressive behavior is distance-increasing behavior and can be a part of a normal behavior repertoire in response to what the dog has perceived as a threat. Behavior involves a complex interaction of genetics, learned experiences, and physiological responses. The authors of this study discussed other studies in which administration of vasopressin at times inhibited aggressive behavior. But there are too many unknown variables involved in the study of aggression in both humans and animals. We need to take into account the concentrations of the neuropeptides in the body, where the receptors are located, and whether the receptors are actively working along with the presence of other neurotransmitters that also affect behavior. We do not know if vasopressin causes the aggressive behavior or if the high vasopressin levels are in response to a perceived threat. Discussions with some of my colleagues who have used oxytocin to treat fear-related or aggressive behavior revealed that some cases were met with success, but in other cases, oxytocin did not appear to be helpful. The difficulty also lies in finding a commercially available and stable product to be used. Currently, I still rely on my serotonin-modulating medications in addition to behavior modification exercises to treat a dog who exhibits aggressive behavior. More studies are needed to test the efficacy of oxytocin in treatment of aggressive behavior and if blocking or reducing vasopressin levels can be another treatment option. Dr. Wailani Sung is a board-certified veterinary behaviorist and co-author of “From Fearful to Fear Free: A Positive Program to Free Your Dog From Anxiety, Fears, and Phobias.”"}]