[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/z0i407z3tl", "@type": "VideoObject", "duration": "PT1M49S", "name": "5327102497001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/ea7709fdbc759549224097238bb370337fc39e25.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/z0i407z3tl", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/3526b3e6f6867844a804b85330a53a9832683a46.m3u8", "transcript": "Saying goodbye to our pets is one of life's most difficult hurdles and making the decision to euthanize a pet is even more challenging. How do you know when it's the right time. What should you expect and how do you let go. These are all common questions that pet parents ask when confronted with a sad situation.\n\nGenerally when your pets quality of life has declined substantially you should consider speaking with your veterinarian about this delicate choice. If your pet stops eating stopped doing things that usually make him happy or seems to be in constant pain it may be time if and when you make the decision to let your pet go you can likely schedule the procedure with your primary veterinarian. They can walk you through the specifics of what will happen as each vet near in has their own protocols. You will have the option of being present or not.\n\nAnd in most cases, you'll be given the option of cremation or burial following your pets passing some that New Orleans will offer your pet a light sedative medication to ease them through the IV catheter placement. Once you're ready your veterinarian will administer the euthanasia solution. This medication is essentially an overdose of barbiturates and intended to let your pet pass peacefully without pain or suffering. This is a fast acting solution and your pets heart will stop.\n\nGenerally less than a minute after administration. It's common for pets to take a few final breaths or look like they're even gasping for air. This is caused by muscle contractions and is not an indication that your pet is in any pain. Your vet nearing will allow you to take some time after the passing of your pet.\n\nIt's normal to grieve cry feel angry and experience. Many other emotions but if you feel like you need help coping with your grief your veterinarian can refer you to counselors or support groups in your area.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/news/view/why-losing-dog-can-be-harder-losing-relative-35932?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "News", "item": "https://www.petmd.com/news"}, {"@type": "ListItem", "position": 2, "name": "Views", "item": "https://www.petmd.com/news/views"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Losing a Dog Can Be Harder Than Losing a Relative", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Views", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-losing-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-losing-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, End of life", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/news/view/why-losing-dog-can-be-harder-losing-relative-35932"}, "datePublished": "June 5, 2017", "dateModified": "August 25, 2022", "description": "For some pet owners, the death of a dog can hurt more than the loss of a relative or a close friend.", "articleBody": "I was 20 years old when I got my first dog. Of course, there were family dogs growing up, but this was my dog. I was living on my own for the first time, and he was mine to care for, love, and teach. It was like having a child. He relied on me for his basic life needs, like feeding, walking, and love. I relied on him for emotional support, entertainment, and love. Though unlike a child who would grow up, move out, and start a life of his own, my dog was always going to be by my side, needing me as much as I needed him. We did everything together—we were inseparable. He meant more to me than most people in my life did, and we had a bond that no one could break. Our lives revolved around each other, in the most co-dependent kind of way. I had to plan my days around him, and he had to wait for me for anything he needed. And we gave each other our all. Twelve years went by, and our bond only grew stronger with each passing day. We traveled, explored the world, and grew up together. We moved to new places and went on so many new adventures—some of which were intimidating and scary, but we faced them together. And then...he was gone. Cancer took him away from me in a very short time. I felt like half of me died that day. I felt lost, like I was alone in the world and had no one to turn to. Of course, all of my human friends and family were there to support me, but it wasn&#039;t the same. I wanted my dog. I have lost many friends and family members over the years, but nothing hurt as bad as losing my beloved canine companion. No relative ever relied on me the way my dog did. He needed me, and only me. People would be able to fulfill their needs in another way. No relative ever required so much of my time, energy, and love. No friend ever showed me such non-judgmental, pure, unconditional love.  Upon his death, I couldn&#039;t function. I couldn&#039;t work, eat, or sleep. Everything reminded me of our daily routine. The sun didn&#039;t shine as bright without him walking next to me. My lunch didn&#039;t taste as good, because I couldn&#039;t share it with him. I didn&#039;t sleep well knowing he wasn&#039;t curled up by my side, keeping watch over me while I slept. The human-animal bond has been proven to change lives. I know he changed mine.  Most people didn&#039;t understand how or why I shut down when Moosh died. He was “just a dog.” I had had other dogs and didn&#039;t “take it so hard.” I knew what to expect going into it, that dogs don&#039;t live very long. Why would I put myself through it? These were all responses to my devastation. I can&#039;t explain or answer any of these questions, but I do know this: I will always have a dog, even knowing that it&#039;s guaranteed heartbreak some day. Research shows parallels between grief following human death and that of a family pet. You can&#039;t replace a family member or a dog when he dies, but you can add a new member to the family. There is always love to give, and always love to get.  Is it wrong that I hurt more over the loss of my pooch than some friends and family members? Maybe. But the relationship I had with Moosh was unique to us. He was my responsibility,  my protector, my friend, my crying towel, and my court jester. He made me laugh, cry, yell, and smile. The mere thought of him makes me happy. He never judged me or thought poorly of me, and he always wanted me around. He was always there for me, which is more than I can say for a lot of humans out there. So no, I don&#039;t think it&#039;s wrong that I was more affected by losing him than some people. After all, he was my dog. Natasha Feduik is a licensed veterinary technician with Garden City Park Animal Hospital in New York, where she has been practicing for 10 years. Natasha received her degree in veterinary technology from Purdue University. Natasha has two dogs, a cat, and three birds at home and is passionate about helping people take the best possible care of their animal companions. Read more: Coping with Your Pet&#039;s Death: An Important Guide See Also:"}]