[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Best Places to Pet Your Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/hand-petting-bulldog-outside_155516462.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/hand-petting-bulldog-outside_155516462.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_the-best-places-to-pet-your-dog"}, "datePublished": "February 23, 2016", "dateModified": "September 6, 2022", "description": "Dogs aren&#039;t too different from us: Sometimes they’re in the mood to be touched and other times not. Respecting the dog’s individuality and reading its body language are the keys to petting a dog in a way that it will enjoy.", "articleBody": "By Kellie Gormly Dogs aren&#039;t too different from us: Sometimes they’re in the mood to be touched and other times not. And just like some humans prefer a back scratch to a head rub, some dogs prefer a chin scratch to a back pat. Respecting the dog’s individuality and reading its body language are the keys to petting a dog in a way that it will enjoy. “‘Does my dog want this?’ I don&#039;t think we ask that often enough,” says Jonathan P. Klein, a Los Angeles-based certified dog trainer and behavior consultant. “The key is to develop a relationship with the dog where the dog trusts you … you can&#039;t change first impressions.” So, before you give a dog a pat, consider these tips. Best Spots for Petting a Dog There isn&#039;t any body area that is inherently off limits to petting, Klein says, different dogs have different preferences. However, if an otherwise docile dog lashes out when you touch a certain area, he may be injured in that spot or in pain from an illness or he may have had a bad experience with touch on that spot in the past. Check with your veterinarian if there are signs of pain. If it is something that comes up suddenly, it is more likely a medical cause, Klein said. You’ll want to pay close attention to the dog&#039;s signals, said Dr. Meghan E. Herron, head of the Behavioral Medicine Clinic at The Ohio State University Veterinary Medical Center. “Sometimes it is hard to tell if the dog reacts from pain or from feeling frightened,” she said. “But if the dog has been showing wiggly body language and suddenly yelps, growls, or snaps when a certain area is touched, it may indicate pain.” The cause of petting sensitivity could be from a number of ailments including, ear infections, or pain in the neck, back or hip. Some dogs might be uncomfortable with people touching their feet because of previous discomfort with nail trims, Herron said. How to Pet a Dog If you are approaching a dog you don&#039;t know, avoid hand movements that could look threatening. Commonly, people reach for the top of a dog&#039;s head, however, this can seem threatening to the dog because your hand is reaching over the dog&#039;s eyes. Petting a dog on the chin or chest is not nearly as threatening, Klein said. Also, as a safety measure with a strange dog, if you put your fingers behind its jawbone, the dog can&#039;t turn and bite as easily. You also should approach the dog with the back of your hand and him sniff it, Klein said. “You can&#039;t grab [a dog] with the back of your hand, and dogs know this,” he said. “The trick is not to threaten the dog.” Herron agrees that dogs do best with more of an indirect approach to petting. She recommends asking the dog&#039;s human for permission to pet, then turning to the side and crouching down by bending at the knees, instead of bending over at the waist. Let the dog approach you, then place your hand, palm up, on your thigh. If the dog leans in, scratch him under the chin, chest and sides of the neck. If the dog leans in, then petting its back and sides should also be fine, Herron said. And if a dog rolls over and shows you his belly? Don&#039;t be fooled. He is not asking for a belly rub, at least not if it&#039;s a dog you don&#039;t know well. “Often, dogs roll over when strangers reach out as a sign they are feeling a bit intimidated and need some space,” Herron said. Tips for Petting a Dog After briefly petting a new dog, back off and let him decide if he wants more. “If we stop after, say, five seconds, the dog can make a choice and we can see what that choice is,” Klein said. “The important thing is to look at the dog’s reactions. Let them make the choice and let them tell you how they feel about what you&#039;re doing.” Look at how the dog reacts to your petting gestures from head to toe. While a wagging tail may mean a dog is ready to interact, it may not mean it wants to interact in a friendly manner, Herron said. “You want to see loose and relaxed body language from tail to head,” she said. Signs a dog is uncomfortable with petting include turning or moving away from your hand, lip licking, yawning, wet-dog shaking, suddenly stiffening, ducking the head and showing the whites of the eyes. Back off if a dog is showing any of these signs, and certainly if the dog is growling or showing his teeth, Herron said. “If the dog freezes or stares at you, or has a furrowed brow or wide eyes, with ears back or forward, those are all signs that the dog has a problem with your approach,” Klein said. Klein recommends tailoring your style of petting toward the emotion of a situation. If you calmly stroke a dog, it will calm him, whereas if you want to excite him (to encourage him to play or retrieve something) give the dog energetic, playful pats. The same careful technique to approaching a strange dog applies to kids. Tell young ones to crouch down, offer their hand on their thigh and let the dog take the lead, Herron said. “Pet in the same direction as the hair grows,” she says. “Never hug, kiss, pet over the top of the head or put your face in the face of a dog you don&#039;t know really well.” Image: hurricanehank / Shutterstock"}]