[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lure Coursing: The Sport for Dogs that are Born to Chase", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2664819642_2d0f34ffba_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2664819642_2d0f34ffba_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_lure_coursing-the_sport_for_dogs_that_are_born_to_chase"}, "datePublished": "June 7, 2011", "dateModified": "September 6, 2022", "description": "If you are the proud owner of a sighthound, you may be looking for ways to meet his high energy needs. Sighthounds are energetic by nature and have a natural inclination to chase – based on generations of breeding for superior sight and speed. As the breed type suggests, these dogs are driven by what they can see, not what they can smell.", "articleBody": "If you are the proud owner of a sighthound, you may be looking for ways to meet his high energy needs. Sighthounds are energetic by nature and have a natural inclination to chase – based on generations of breeding for superior sight and speed. As the breed type suggests, these dogs are driven by what they can see, not what they can smell. Breeds in the sighthound (AKA gazehound) group include Greyhounds (of which there are several types), Italian Greyhounds, Whippets, Basenjis, Sloughis, Azawakhs, Afghan Hounds, Irish Wolfhounds, Salukis, Borzois, Hortaya Borzayas, Rhodesian Ridgebacks, Scottish Deerhounds, and Silken Windhounds. These dogs all come from a line of dogs that have been bred for speed hunting. One of the challenges in owning a sighthound is finding an activity that takes full advantage of their natural abilities to fix their sights and chase after a target. Many sighthound owners, in fact, cannot go leash free at their local parks for fear that their dogs will catch sight of something and run into the nearest intersection. Lure coursing for fun and sport is an ideal solution for these dogs. What is Lure Coursing? Coursing is an old sport, dating back to the nobles and other wealthy landowners who had wide hunting grounds to practice their sport on. Sighthounds were bred and used for sight tracking small game like hares, foxes, and pigs, as well as larger game like deer and antelope. Today, the sport is more likely to use an artificial lure that is made to look like a live animal. The lure is dragged across the ground at a high rate of speed, with a set number or turns and changes in direction to simulate the movements of a live animal or “game.” A standard lure course is 600-1,000 yards in length. The dog that stays focused on the lure will finish the course from the start to the finish without going off course. The dog must also be focused enough not to interfere with the other dogs running the course. Which Dogs Can Participate? There are two groups that sanction lure coursing in the United States, the ASFA (American Sighthound Field Association) and the AKC (American Kennel Club). Participation is generally only open to sighthounds that have been recognized by the AKC as purebred sighthounds, but in recent years some exceptions have been made by the ASFA. Because this intense sport can be hard on a growing dog’s joints, dogs must be at least one year of age before they are allowed to race. And although dogs that have been spayed or neutered are allowed to participate, those with retained testicles are not eligible for competition. How to Get Involved in Lure Coursing If you own a young sighthound, you can begin to measure his interest and ability for lure coursing while he is still young. As you are going through the process of training and teaching your dog the basic obedience commands, you can incorporate dragging a toy or other object along the ground in an attempt to bring out his chasing instincts. You can even attach the object to a long pole and drag it around in a circle, allowing the dog to give chase. As mentioned above, young dogs are still growing, and their joints are especially susceptible to injury. Keep the practice coursing simple, with easy turns and low intensity runs. Be sure to reward and praise your dog for giving chase and allow him to “catch” the prey when you are ready to wind the game down so he gains a feeling of satisfaction from the experience. The best way to learn more about this sport, and to find out what you need to do to prepare your dog specifically for it, is to get in touch with your local coursing club. Get a schedule of events from them so you can observe the dogs and their owners/handlers in action on the field Rules and regulations for lure coursing can be found at the AKC website. You can also find out more, from coursing enthusiasts to traditional coursing clubs, online.   Resources American Kennel ClubAmerican Sighthound Field AssociationImage: Stephen Routh / via Flickr"}]