[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Ordinary Folks Deal with Pet Allergies", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/pet-allergies-happy-couple.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/pet-allergies-happy-couple.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Allergies, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/c_multi_pet_allergies_hi"}, "datePublished": "May 7, 2009", "dateModified": "September 6, 2022", "description": "When Lynne and Mike Petersons’ two youngsters started begging them for a pet more than a few times a day, it was time to think about it seriously. The dilemma: Mike suffers from allergies to cats and dogs.", "articleBody": "The Solution May Be Easier Than You Think When Lynne and Mike Petersons’ two youngsters started begging them for a pet more than a few times a day, it was time to think about it seriously. The dilemma: Mike suffers from allergies to cats and dogs. &quot;The decision to get a pet didn’t come easily,&quot; said Lynne. &quot;We knew things could get difficult with the allergies. But having grown up with pets, I honestly believe they teach you how to be a better person -- not to mention it teaches children the value of caring for another creature.&quot; Mike was in agreement, but he looked into his options before getting a pet. &quot;I decided to keep our bedroom pet-free, to help reduce any allergy attacks. Of course, the usual meds and sprays were going to be more a part of my life from now on in, but it’s worth it to keep your kids happy.&quot; As the Petersons pointed out, the idea of having a designated pet-free room gives a person with allergies a safe haven to retreat to if the allergies get bad. Just make sure the door is kept shut and that the pet isn&#039;t allowed inside under any circumstance. &quot;We also invested in HEPA air filters for all the rooms,&quot; explained Mike. &quot;This kept the allergens in the air to a minimum. Luckily we don’t have cloth curtains, so we didn’t have to worry about pet hair and dander and allergens getting trapped in them. But those were the easy parts.&quot; The hardest part? Deciding on whether to get a dog or a cat. &quot;We were torn,&quot; said Lynne. &quot;I’d grown up with cats and my daughter wanted a cat, but our son wanted a dog.&quot; &quot;That kid’s wiley,&quot; Mike added. &quot;He tried to get both a dog and a cat, but we weren’t having it!&quot; Laughs aside, the Petersons knew they had to pick the right pet -- a pet that would set Mike’s allergies off as little as possible. &quot;We read up and found cats are often higher in allergens than dogs, even the so-called hairless breeds. So we decided to go for a dog. Apparently the longer, constantly growing haired dogs are the best for people with allergies.&quot; Still, they knew it would be a gamble -- often it depends on the person and the animal. &quot;We had narrowed it down to between a Bichon Frisé and a Poodle, when Lynne suggested we all go down and see what we could find at the local pound.&quot; &quot;I thought it was important to rescue an animal,&quot; Lynne said. &quot;Luckily we found a Bichon Frisé mix.&quot; Lynne also emphasized the importance of having the pet neutered, as this also helps reduce the allergens. So how have they faired with the dog? &quot;With the kids put on weekly bathing and grooming duties that helps to reduce the allergens further, medications and our other environmental efforts, things are going great,&quot; Mike said. &quot;My allergies are kept to a minimum, and everyone is in love with our newest family member. I can’t imagine ever being without a pet.&quot; The Petersons&#039; story is uplifting for anyone who suffers allergies and wants (or has) a pet. In this modern world, there should be no reason why you should have to live without the wonderful love of a four-legged friend -- even if it is furry."}]