[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Prosthetics Get Quadruple Amputee Dog Back on His Feet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/BrutusB-dog-quadrupleamputee_0.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/BrutusB-dog-quadrupleamputee_0.jpeg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/prosthetics-get-quadruple-amputee-dog-back-his-feet"}, "datePublished": "May 18, 2015", "dateModified": "September 6, 2022", "description": "A Rottweiler named Brutus who lost all four paws to frostbite has found his forever home with two of the people who are helping him regain his mobility.", "articleBody": "by Samantha Drake A Rottweiler named Brutus who lost all four paws to frostbite has found his forever home with two of the people who are helping him regain his mobility. Foster parents Laura and Rick Aquilina of Loveland, Colo., have been fostering Brutus and announced on April 1 that they were adopting him. It’s a happy outcome for a dog whose short life has been marked by pain and uncertainty. Brutus, now two years old, suffered frostbite as a puppy after he was left outside in freezing temperatures, according to his Facebook page, Better Paws for Brutus. His owner/breeder then crudely amputated all four of the dog’s paws. “Brutus was left maimed and crippled and, due to the poor way in which this was done, he is in pain every day of his life. He cannot run and play like all puppies want to do, he can barely walk,” according to the Go Fund Me Page set up to help pay for the dog’s prosthetics and physical therapy. The site has raised more than $12,600. Brutus’s Rescuers The dog’s rough road to his new life included being put up for sale with his siblings from the back of a truck in a Wal-Mart parking lot, says Laura Aquilina. The owner/breeder gave Brutus to a family who later relinquished him to animal rescuer Laura Ornelas after deciding they couldn’t take care of a crippled puppy. Meanwhile, the owner/breeder disappeared, Aquilina said.  The Aquilinas responded to a call for help fostering Brutus. Aquilina explains that she and her husband have experience fostering special needs pets for a local rescue. “I knew it would be a lot of work but I didn’t understand how much work,” she admits. But nine months later, the couple adopted Brutus. “He deserved a second chance,” says Aquilina. “He’s an awesome boy.” Ornelas enlisted OrthoPets of Denver to create prosthetics for Brutus in 2014 to support and protect his limbs and make his legs equal lengths. Pet orthopedics experts at Colorado State University’s James L. Voss Veterinary Teaching Hospital agreed to provide physical therapy to help Brutus get accustomed to his new “paws.&quot;  OrthoPets fitted Brutus with the prosthetics in 2014. He’s actually the second dog OrthoPets has outfitted with four prosthetic limbs, says founder Martin Kauffman. OrthoPets makes prosthetics for pets as well as for a variety of exotic animals. Learning to Adapt Brutus received prosthetics for his rear legs first, then for his front legs several weeks later, says Aquilina. Brutus is still adapting to his new situation with the help of intensive physical therapy. “Nobody told Brutus these legs would help him,&quot; says Kauffman. The dog didn’t know what to make of the prosthetics and it took him several months to accept the devices, he added. Brutus has had to adjust to the fact that he can’t feel the ground with the prosthetics on, but overall he has handled it “surprisingly well,” Aquilina points out. Brutus’s prosthetics continue to be fine-tuned for comfort and effectiveness, and he’ll ultimately need a final set made, she explained. In spite of all that Brutus has suffered, he’s a playful, smart, and affectionate dog, Aquilina says. The young dog is bursting with energy and sometimes has to be restricted from being as active as he wants to be, she says. That is, at least until he’s fully used to his new paws. Credit: Colorado State University/ John Eisele Brutus’s Facebook page can be found here: Better Paws for Brutus"}]