[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pets and Your Love Life: What the Experts Say", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_509263957.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_509263957.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/pets-and-your-love-life-what-experts-say"}, "datePublished": "January 5, 2017", "dateModified": "September 6, 2022", "description": "", "articleBody": "By Helen Anne Travis Want to be a better spouse or partner? Take a few lessons from your pet. That’s the advice of Dr. Tiffany Margolin, DVM and author of &quot;Relationship Reset: Get Her To Love You As Much As Your Dog Does.&quot; Pets can teach us everything from how to greet our partners when they come home after a long day, the importance of turning off the television and spending quality time with our partners, and even how to end a fight gracefully, she says. Then there’s the art of the agenda-less soft touch. You know how a cat pushes against your hand when you rub her cheek? We humans have the same response to a soft touch, explains Margolin. “There are a lot of relationship subtleties you can learn from having a pet.” Learning To Care For Others For many people, having a pet is how we learn to take care of something other than ourselves, says Dr. Laurie Hess, a board certified avian veterinarian and owner of the Veterinary Center for Birds and Exotics in Bedford Hills, New York. Pets teach us how to bond and how to love; from them we learn the art of reading body language and moods, she says. All of these are very important traits to pay attention to in a romantic partner. “Animals teach you intuition,” says Margolin. They also teach us patience. “You have to be patient,” she adds. “That puppy will [sometimes] pee on the carpet 50 times before it learns.” Pets may make us better people, but does that come across loud and clear to our potential partners? Experts say the answer is yes. And to understand why, you have to go back in time to the early 19th century. Keeping Up With The 1800s Joneses People first started having pets, in the modern sense of the word, in the early 1800s, says Dr. Diana Ahmad, University of Missouri curators’ distinguished teaching professor and author of the book “Success Depends on the Animals: Emigrants, Livestock, and Wild Animals on the Overland Trails, 1840-1869.” A few interesting things led to this pet phenomenon, she explains. Middle and upper class people finally had the means to take care of animals they didn’t plan to eat. The large number of people traveling west at that period were keen to bring along a dog for protection, or a cat that reminded them of the family they’d never see again (remember, there was no Skype or email back then). Finally, a series of books by authors like Charlotte Elizabeth Tonna and Lydia Maria Child suggested that how we treat animals reflected on our family’s social status. “It was a ‘keeping up with the Joneses’ thing,” Ahmad. In today’s world, our pets still tell other people a lot about our personalities and potential to be good partners. Having a well cared for pet tells romantic interests we’re likely a nurturing person capable of making a commitment, says Margolin. It shows people we can take responsibility for someone other than ourselves. So go ahead, put that funny photo of you and your pet in your dating profile, the experts say. “If your pet is a big part of your life, you need to share that with people,” says Hess. “You don’t want something like that to be a surprise.” Think about it this way, says Margolin, if your pets are important to you, and you’re looking for a big-hearted person who accepts that, you can use that photo of you and your pet as a filter of sorts. If a potential partner isn’t willing to accept you for the pet-lover you are, “Maybe they&#039;re not someone you want to be with,” she says. What About Platonic Partners? Even if we’re not looking for love, pets can help us meet new friends and bond over a shared interest, says Hess. Just think of all the dog-walking groups, bird clubs, and rabbit societies out there. “Having a pet fosters a sense of community,” she says. And a common interest in pets can be a great social lubricant. We can also learn a thing or two about making new human friends from the way we interact with animals. Remember the last time you saw someone walking a friendly-looking dog on the street, says Margolin. Didn’t you just want to run over and pet it? Imagine if you applied that same enthusiasm to greeting a stranger, she says, minus the petting, perhaps. Go at it with no preconceived notions or prejudices. Why not wag your tail and see how the conversation unfolds?"}]