[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "BPA-Free and Nontoxic Dog Toys: What Do the Labels Mean?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/german-boxer-dog-playing-outdoors-with-a-ball-picture-id598819028.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/german-boxer-dog-playing-outdoors-with-a-ball-picture-id598819028.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Toys, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/bpa-free-and-nontoxic-dog-toys-what-do-labels-mean"}, "datePublished": "December 11, 2018", "dateModified": "September 6, 2022", "description": "These tips will help you decode the labels when it comes to “BPA-free” and “nontoxic” dog toys so your dog can play safely.", "articleBody": "Image via iStock.com/Alona Rjabceva By Maura McAndrews As pet lovers, we prioritize our pets’ safety—keeping them out of harmful situations, feeding them the proper food and taking them to the vet when they’re sick. But what about the toys we buy for our dogs—are we vigilant enough about safety hazards? “Toys are an important part of a pet&#039;s life,” explains Dr. Rory Lubold, a veterinarian with Paion Veterinary in Scottsdale, Arizona. “They serve as an enrichment tool and source of mental stimulation to keep our pets active and engaged.” But because plastics and other materials can pose hidden dangers, he advises that you should “always monitor your pets after giving them a new toy.” Unlike with children’s toys, there is no body that regulates the safety of dog toys. “Pet toys do not fall under our jurisdiction,” explains Thaddeus Harrington, public affairs specialist with the US Consumer Product Safety Commission, and he notes that the only time a pet toy might be recalled is if it poses a hazard to human consumers through its intended use. That means that the onus is on the consumer to sort the safe from the unsafe, and understanding the labels can help. Some dog toys feature labels like “BPA-free,” “phthalate-free” and “nontoxic,” but for those who are not scientifically inclined, these terms can be confusing. So, what should pet parents look for when purchasing toys, and what should we avoid? What Is BPA? The first step to understanding labels on dog toys is decoding the terms. BPA is short for bisphenol A, a chemical used in the manufacturing of polycarbonate plastics. According to the Center for Disease Control (CDC), BPA is found everywhere—from beverage containers and food can linings to car parts. Both humans and pets are generally exposed to it through food and drink containers. What Are Phthalates? The term “phthalates” refers to a group of chemicals also sometimes called “plasticizers,” which the CDC explains make plastics more flexible. These are found in a lot of plastic packaging, toys for children and pets, and storage containers. As with BPA, exposure to phthalates mainly comes via food and drink that has been stored in plastic containers, or through toys that are placed in the mouth. Labels that read “BPA-free” or “phthalate-free” imply that the company has tested its materials to ensure they are free of these chemicals. As Harrington explains, dog toys are not regulated by the government, meaning there is no law requiring companies to test these toys or meet a certain standard (unlike with children&#039;s toys). Some companies will back up their claims with information about testing on their website, but others don&#039;t have very much information. While a label might imply that they have done testing, the best bet for pet parents is to contact the company directly.  What Does Nontoxic Mean? Still wondering what the “nontoxic” label means? That one is a bit trickier. According to the Environmental Working Group, “This common marketing term implies that the ingredient or product will not harm human health or the environment.” Potential Risks of BPA and Phthalates The dangers of BPA and phthalates are still relatively unknown, but one thing is clear: these chemicals are ubiquitous in the environment and our bodies. According to the National Institute for Environmental Health Sciences, “The 2003-2004 National Health and Nutrition Examination Survey (NHANES III) conducted by the CDC found detectable levels of BPA in 93 percent of 2,517 urine samples from people 6 years and older.” BPA has become a public concern in recent years due to a number of studies that have shown the chemical to be an “endocrine disruptor,” meaning it can alter hormones. These studies have linked BPA with fertility issues in mice (which has implications for human fertility) and altered thyroid hormone levels in pregnant women. Similarly, recent studies on phthalate exposure have indicated that it may have an impact on child development or even an increased risk of diabetes in humans. Though there is less research on the effects of these chemicals on pets, a 2013 study showed that products intended for chewing and mouthing by dogs often contained BPA and phthalates, which can, in some cases, leach out of the plastic and into dogs’ saliva. A more conclusive study conducted just last year indicated that BPA in canned dog food also has an impact on pets’ BPA levels, introducing changes into their gut microbiome. “The amount of BPA in canned dog food is likely more significant than the amount in toys,” Dr. Lubold says, adding that “There is not a lot of data on health concerns with BPA and phthalates or other toxins when it comes to their inclusion in toys.” Because there’s still so much we don’t know about these chemicals, it’s best to be on the safe side. “As a general rule, it would be good to avoid the additional chemicals and plasticizers whenever possible,” Dr. Lubold says, but he notes that the likelihood of pet health issues from these chemicals is fairly low. “Most dogs will chew toys occasionally and not ingest enough of the chemicals to be significant,” he says. “However, the chemicals used can mimic estrogens and have far-reaching environmental impact.” Other Dog Chew Toy Dangers Chemicals aren’t the only things to watch out for when selecting a toy for your pooch—in fact, veterinarians see a fair amount of ailments related to unsafe chew toys. Dr. Rachel Barrack, a licensed veterinarian with experience in both Western and Eastern medicine and owner of Animal Acupuncture in New York City, says that rawhide chews, pig ears and bully sticks can cause gastrointestinal upset and present a choking hazard. Sticks and bones are similarly problematic, she says, as they “can fragment and cause gastrointestinal blockage or perforation, medical emergencies requiring surgical intervention.” “The biggest health concern with unsafe chew toys is the ingestion of small parts,” explains Dr. Lubold, who has years of experience in emergency medicine. “These pieces can become lodged in the stomach or intestines and require surgery to remove. Even toys that claim to be ‘indestructible’ may be chewed apart by some dogs. I have removed many toys from dogs from all different brands.” Because of this, he stresses, look for dog toys that work with your dog’s particular style of play. Dr. Barrack agrees. “Any toy with small parts can be a choking hazard and/or cause intestinal obstruction.” She adds that you should “not leave your pet with soft toys unattended if they tend to destroy them and rip them into little pieces.” What to Look for in a Dog Toy “When choosing chew toys for dogs, there are many options, depending on your goals,” says Dr. Lubold. If your dog is an aggressive chewer and needs a hardier toy, he advises careful selection. “Toys that are too rigid can wear down the teeth over time or even break a tooth. A good general rule is for hard toys to be soft enough that you can press your fingernail into them and leave an indentation,” says Dr. Lubold. Dr. Lubold approves of West Paw’s Zogoflex Hurley, which is made from BPA-free, phthalate-free and latex-free food-grade plastic that is FDA-compliant—this is an extra assurance meaning the product meets FDA guidelines for a material that comes into contact with food. If your dog likes a squeak, try the Gnawsome squeaker football dog toy, which is made from plastic that follows those same guidelines. The Nerf Dog nylon flyer works well for more athletic dogs, and it’s likewise made with BPA-free, FDA-approved, tear-resistant nylon. While not all dog toy companies provide information behind their product labeling, it’s worth taking a moment to investigate companies’ websites for more dog toy safety information. For example, the company Planet Dog provides detailed information on its website about how its toys are made, explaining how they developed their special plastic with white olefinic oil instead of chemical softeners. Armed with a bit of information about labeling practices, chemicals and other potentially dangerous materials, you should find selecting a safe and environmentally friendly dog toy a bit easier. And don’t forget to consult your four-legged friends as well: your pup’s preferences and personality will go a long way in helping you make an appropriate choice. “There isn&#039;t a one-size-fits-all,” Dr. Barrack says. “It is important to know your pet when selecting toys.”"}]