[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "You, Your Dog, and a Flying Disc", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4846684871_b251c27802_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4846684871_b251c27802_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise, Toys", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_your_dog_and_a_flying_disc"}, "datePublished": "May 20, 2011", "dateModified": "September 6, 2022", "description": "Some dogs are just born to fly. You see them at the park, leaping high into the air to catch a flying disc, reveling in the pure joy of the perfect catch.", "articleBody": "Some dogs are just born to fly. You see them at the park, leaping high into the air to catch a flying disc, reveling in the pure joy of the perfect catch. Flying disc games, commonly known as &quot;Frisbee games&quot; and &quot;playing Frisbee,&quot; after the popular trademarked Wham-O Frisbee toy, are popular sport, and in most cities across the country, flying disc enthusiasts will hold organized “disc dog” competitions with their dogs. Dogs that are lean, weigh less than 50 pounds, and have a passion for retrieval are best suited to play flying disc games. What type of disc is best, and how do you go about teaching your dog to play? We will discuss the basics here. Getting Started First, make no mistake: while the flying disc is a toy, playing the game is a sport activity. It takes a lot of energy and stamina to be a good disc player. Before you begin training, have your veterinarian evaluate your dog’s physical condition. If your dog is one of the breeds that are prone to hip dysplasia, for example, you will need to have him checked for any potential issues that could be worsened by this activity. It is also important that your dog has already learned at least basic obedience commands, and that you can rely on your dog to return the disc to you and not go dashing off with it. If your dog is still learning how to control the exuberance of youth and is in the training process, give him time to learn self control and obedience before advancing to more complex maneuvers like disc games. Second: not just any old disc will do. A soft, flexible disc that is resistant to sharp teeth -- made specifically for dogs -- is best for playing disc. Introduce the disc during regular playtime, allowing your dog to hold it in his mouth so he can become accustomed to holding it. Show enthusiasm and praise your dog if he shows an interest in the disc.  In the beginning, throw the disc low, at the dog’s level, as you would a ball. You can also roll the disc on its side -- again, as you would a ball -- and let your dog chase it across the room or yard. Once your dog has gotten into going after the disc and returning it to you to toss again for him, you can move to the next level. Try tossing the disc a short distance outside -- in the yard or at the park. Give lavish praise when your dog gives chase. You may even want to incorporate training treats when he returns the disc to you. Continue to throw the disc low, at the dog’s height level, and for only a short distance. To avoid potential injury, make sure you are throwing the disc to the dog, not directly at the dog. Next is teaching your dog how to properly retrieve the disc. Make sure to choose a safe location, where your dog cannot accidentally dash off onto a roadway in pursuit of the disc, preferably a fenced-in area. Here is where training treats can prove to be beneficial in encouraging your dog to return right to you. A long training lead can also help you to reel your dog back. Just make sure it is a non-tangling type of lead. Choose consistent command words to use for bringing your dog back to your side and for commanding the dog to drop the disc. As your dog gets better at catching, retrieving and returning the disc, you can gradually increase the height and distance at which you are throwing it.  Additional Tips for Success To reduce impact on the joints, a dog should always land on all fours. If you notice that your dog tends to land on two legs, try using a hoop toy to properly train him to jump. This will force him to bring up the hind legs when jumping in the air.Don’t let your pet play with the disc unless you are engaged in play with him. Chewing on a plastic disc can damage your dog&#039;s teeth, and will force you to replace the discs frequently. The disc has to be in good shape in order to fly properly and stay under your control. Plus, bringing it out for interactive play will make it more exciting for your dog. This is a great game for bonding.  Check online and in newspapers for disc dog events in your area. (Note that generally, disc players will refer to the sport as “disc dog” because the Frisbee name is trademarked, but you can also use the term “Frisbee dog” to search for groups and events in your area.) There are dog clubs and events held across the country, and indeed, throughout the world. This is a great way for dog lovers and disc sport enthusiast to get together and hone their skills at any level.Always be aware of your dog’s comfort level during play and make sure he is hydrated and protected from excess sun. Never forget that this is more than play; it is a sporting activity and needs to be treated as such. Muscle and joint injuries can occur, and foot pad injuries need to be treated immediately to avoid infection. If your dog is panting heavily, drooling excessively, vomits, or seems disoriented, immediately take a break from play, get your dog into some shade and give him controlled amounts of water (too much water at once can cause its own problems).Start slow, stay consistent, be patient, and don’t expect your dog to become a champion disc player over night. Above all else, have fun.Image: guistina_ilyusha / via Flickr"}]