[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dancing with Your Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-trainer-works-with-a-sheetland-sheepdog-picture-id946901212.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-trainer-works-with-a-sheetland-sheepdog-picture-id946901212.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_dancing_with_your_dog"}, "datePublished": "June 7, 2011", "dateModified": "September 6, 2022", "description": "Did you know that dog dancing is an actual sport? Learn how to turn your pup into a dancing dog and potentially compete in dog dancing competitions.", "articleBody": "Maybe you have a dog that loves to move around the room with you when you dance to your favorite song, or even gets up on her hind legs to try to join you. If you love to dance and you feel like you and your dog have the dexterity to choreograph your moves, you might have just found the perfect bonding activity. With a little work and training, you can take dog dancing to a new level, including competitions, exhibitions and entertainment events. Who knows, you and your dog might just be the inspiration for a new television show called, “So You Think Your Dog Can Dance?” “Heelwork to music,” “canine musical freestyle,” “canine freestyle” and “freestyle dance”; these are some of the categories of dog dancing that participants take part in. Freestyle dancing as a competitive sport is even catching on worldwide. And while some do it strictly as a hobby and some for the thrill of competition, the one commonality is that everyone is always having fun. What Is Heelwork to Music? Heelwork to music may be one of the most obedience-intensive categories of dog dancing. The dog must be able to heel on both sides of the trainer’s body, not just on one side, as is typical for obedience heeling. In heeling dance routines, the dog must stay in step with her owner at all times, as though on an invisible dog leash. Although it is also called freestyle heeling, this category does not allow for much canine freedom. Moving away from the human partner, passing through the partner’s legs or jumping are not allowable moves for this category. That is not to say that there is not room for complicated footwork. With heelwork to music, the human trainer and dog partner show that they are perfectly coordinated, with steps that include stepping backwards and forwards, pivoting, circles and spirals. Freestyle Dancing With Dogs Freestyle dance allows for a lot more freedom of movement on the dog’s part, and at the same time, allows your dog to demonstrate her ability to stay coordinated and to show off any special talents. This level, which is a step up from heeling, allows for more creativity. Here, you can demonstrate original and complicated routines, with jumping, leaping, spinning, backing through the legs, and doing jumps over each other. This is the team’s chance to showcase their ability to work together in a choreographed way—incorporating complicated moves into the basic framework of the heeling routines. You may choose to wear a costume for your routine; many people do, especially when they want to use a “theme” song—think cowboy hat and boots for a country song, or a Poodle skirt and saddle shoes for a ‘50s swing song. During the routines, the handler can give only verbal cues and hand signals to the dog; treats and training aids are not allowed during competition. In early beginners’ competitions, you can keep your dog on-leash while she gets a feel for performing in front of people. This can also help her to learn not to get distracted and stay focused on you and the routine.  As her skills and focus improve, and she perfects her ability to follow your lead, you can progress to off-leash “dog dancing.” What Is Required for Canine Freestyle? You don’t have to be a professional dancer, and your dog doesn’t need to be an obedience champion, but your dog will need to have passed basic obedience. She will need to be able to heel, sit and lie down, and so on. These cues are the basis for the basic steps of a dance routine, and your dog should know them well before attempting to coordinate them to music. In addition, it is important to note that while dog treats are a necessary part of the training process, your dog must be able to perform these tasks without them in the competition ring. Clicker training is a great option for honing your dance moves, since choreography requires precision. Using a dog clicker and treats to mark the exact moment your dog has performed the correct behavior will help prevent confusion and speed the process. The easiest way for your dog to master a dance step is by breaking it down into manageable pieces. For example, if your goal is for your dog to leap through your arms in the air, first get him used to walking through your arms when they’re close to the ground. From there you can gradually build to the finished product. Consider your dog’s body type as you plan your choreography, as some moves, like extended rear leg walking, might be uncomfortable for top-heavy breeds. And while it may not be written in the rule books, a love of music is an absolute must if you want to be a successful dance team. Experiment with different genres and rhythms until you find the songs your dog responds to best. Look for a wagging tail and gleam in the eye, and you’ll know you have found the right songs.  How Are Teams Judged? In a competitive freestyle competition, points are based on difficulty, precision and ability to stay in rhythm with the music. Judges may also take costumes into consideration, along with your interpretation of the music and your dog’s attitude and enthusiasm for the routine. With canine freestyle clubs and competitions around the world, rules will vary from club to club. So if you have hopes for global freestyle domination, you will need to learn the different rules and teach them to your dog. If you plan on staying local or national, you need only learn the rules of your club. In most competitions, teams are made up of two: the owner/handler and the dog. However, there are also team competitions, from pairs of dogs dancing together to up to several dogs on a team dancing together. Where Can I Learn More? The best way to learn more about canine freestyle as a sport is to visit the association pages, like the Musical Dog Sport Association, Canine Freestyle Federation, Inc. and The World Canine Freestyle Organization. Many websites also include videos of training and of actual competitions and shows. If there is a club in your area, even better, since the best way to learn is to immerse yourself in the culture of dog dancing and competition. But first, go to see a demonstration, talk to members of the group and start dancing around the house with your dog to see if she has enthusiasm for it. Besides the fun and competition of canine freestyle dance, you can also take the joy of dance to your community by entertaining children and seniors. And who knows, if you get really good, you may even be invited to perform on TV. Featured Image: iStock.com/huettenhoelscher"}]