[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Flowers and Plants That Are Safe for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-plant.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-plant.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Safety, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/grow-fresh-air-plants-are-safe-cats-and-dogs"}, "datePublished": "March 19, 2020", "dateModified": "January 26, 2023", "description": "Before you test your green thumb with some floral décor, check out this list of flowers and plants that are safe for dogs.", "articleBody": "Some plants and cut flowers can actually be toxic to dogs, causing symptoms such as swelling of the mouth, vomiting, trembling, loss of coordination, seizures, difficulty breathing, or even death.  But that doesn’t mean you can’t ever decorate your place with indoor plants or accept a gift of flowers from a friend. Before you bring home a nice flower arrangement or new houseplant, you just need to make sure it’s on the list of flowers and plants that are safe for dogs.  Flowers That Are Safe for Dogs Some safe flowers for dogs include: AlstroemeriaAstersGerber DaisiesOrchidRosesSnapdragonStaticeSunflowersHouseplants That Are Safe for Dogs Here a few plants that are safe for dogs: Ferns: Boston FernHerbs: BasilCilantroDillLemon BalmRosemarySagePerennials: African VioletAluminum Plant (aka Watermelon plant)BambooFriendship PlantSpider Ivy (aka Spider Plant)Swedish IvySucculents: Blue Echeveria (aka Wax Rosette, Painted Lady)Christmas CactusHaworthiaHens and ChickensPalms: Areca PalmDwarf Date PalmDwarf Palm (aka Good Luck Palm, Bamboo Palm, Parlor Palm)Lady PalmWhy Do Dogs Eat Plants and Flowers? Pets are curious, so it’s not unlikely that they would try to munch on plants or flowers that you bring into the home. “Exposure of dogs and cats to household plants occurs commonly, especially with younger animals that tend to be very inquisitive. Some plants are extremely toxic to our pets,” says Dr. David Dorman, DVM and professor of Toxicology at North Carolina State University of Veterinary Medicine.  Dr. Dorman says, “It’s important to remember that your pet cannot distinguish between safe-to-eat plants and those that are dangerous. The key to preventing poisonings in your pets is to prevent exposure.” Thus, don’t bring poisonous plants into the home with cats and dogs, period. What to Do If You Suspect That Your Dog Ate a Toxic Plant or Flower  Plants that are considered dangerous for dogs can cause a range of symptoms—some much more serious than others.  If you’re concerned that your pet has ingested a poisonous plant or flower, or they’re showing symptoms of poisoning, contact your veterinarian, or the ASPCA Animal Poison Control Center at 888-426-4435, or the Pet Poison Helpline at 855-764-7661 immediately.  Before you add eco-friendly décor to your home, do your research to keep your pets safe. Image via iStock.com/Cunaplus_M.Faba"}]