[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Doga: Yoga for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/102553875_b29d2b8eaa_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/102553875_b29d2b8eaa_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_doga"}, "datePublished": "September 23, 2009", "dateModified": "September 6, 2022", "description": "We just love to take our dogs with us, wherever we go. In the car, to the beach, for walks, a swim. And now, there’s something else you can do with your dog -- Yoga!", "articleBody": "Let Fido Find His &#039;Inner Dog&#039; We just love to take our dogs with us wherever we go. In the car, to the beach, for walks, a swim. And now, there’s something else you can do with your dog -- Yoga! Dubbed &quot;Doga,&quot; it seems this new craze is taking the nation by storm. There are books and DVDs and even classes to be had … Getting &quot;Down&quot; with Downward-Facing Dog Strange as it may seem, yoga for dogs makes sense. Just watch how your canine buddy stretches -- it&#039;s as if they were built for it. And it’s not only good for Rover’s health, flexibility, and relaxation, but yours, too. Loving the Limelight It should come as no surprise that your dog will love the attention a doga class offers. An instructor (or you) will watch his every move and guide him gently into the proper positions. And even if your dog isn&#039;t down with the doga, he&#039;ll still have a good time peacefully checking out all the ladies in the room. Plus, he&#039;ll be with you -- his favorite person in the whole wide world. Reaching EquilibriumWe all lead super busy lives, and sometimes it’s hard to squeeze in exercise and quality &quot;together&quot; time with your favorite pooch. That’s why Doga is perfect. You get to workout, relax, your dog gets to exercise, and best of all, you both get to spend time ... together! If Doga is something you’re interested in, check and see if there’s a class offered in your neighborhood. Or, pop your favorite yoga workout into the DVD player, get your dog, and just start doing it. You’ll be surprised how quickly both of you become relaxed. Doga. It’s not just for dogs. Image: hisa fujimoto / via Flickr"}]