[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "3 Alternative Veterinary Care Treatments to Consider", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/yorkshire-terrier-picture-id889691174.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/yorkshire-terrier-picture-id889691174.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Alternative therapy, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_multi_alternative_veterinary_treatments"}, "datePublished": "May 19, 2011", "dateModified": "September 6, 2022", "description": "Find out more about alternative veterinary care treatments like hydrotherapy for dogs, pet acupuncture and pet chiropractors.", "articleBody": "Reviewed and updated for accuracy on April 19, 2019 by Dr. Hanie Elfenbein, DVM, PhD Pets, like people, can suffer from a variety of debilitating chronic, degenerative conditions. Treatment options, meanwhile, are sometimes limited—focusing on alleviating symptoms through the use of pet pain medication and other means. But you may have other options—your veterinarian can recommend alternative therapeutic approaches to your pet’s health. Complementary or alternative veterinary care therapies have increased the success rate of postoperative recovery as well as cases involving degenerative spine issues, neurologic disc problems, hip dysplasia and cruciate ligament injuries. The aim of alternative veterinary care therapies is to heal your pet using a whole-body, or holistic,  approach. Complementary therapies treat your pet’s condition by addressing the cause of the disease while keeping you actively involved in your pet’s treatment. Some of the more common complementary therapies include: Hydrotherapy for Dogs Canine hydrotherapy is a beneficial alternative to high-impact exercise for dogs with chronic bone conditions or crippling injuries, such as arthritis or cruciate ligament trauma. During therapy, your dog is assisted in and out of a pool to minimize body stress and possible injury. A dog harness is frequently used to help your dog in maintain an above-water position. The water in the pool may also be heated; heat application helps alleviate muscular discomfort and pain. Some hydrotherapy treatments include using underwater resistance jets to create a current for the dog to swim against. Underwater treadmill therapy is a form of hydrotherapy where the dog walks against the force of the water to build muscle. Like water aerobics, moving through water is gentle on joints while requiring muscles to work hard. This type of hydrotherapy for dogs has become more popular because it requires only a small tank, not a full-size pool. Pet Chiropractor Sometimes your pet’s malaise can be relieved by realigning and balancing their body by using a &quot;force equaling mass times acceleration,&quot; according to Dr. Gerald Johnson, a holistic veterinarian with many years’ experience working primarily with dogs and horses. Dr. Johnson utilizes a variety of alternative therapies for patients at his practice. Dr. Johnson stresses that in order for a veterinarian to incorporate chiropractic treatment, they must have a comprehensive understanding of animal anatomy and the &quot;line of correction,&quot; and must &quot;know the bones.&quot; He explains, &quot;you can feel subtle [tactile] changes when you apply chiropractic or massage therapy [on a pet]. In chiropractic therapy, the veterinarian uses manipulation to realign and adjust the bones. You’ll see an almost immediate change; your pet will start to feel better right away. The basis for chiropractic therapy is balancing the body’s circulation and energy flow. Once that is initiated, the body’s innate ability to heal itself will take over and finish healing what manipulation therapy started.&quot; Dr. Johnson notes that several therapeutic adjustments are usually necessary, because there is memory in the joints. Pet Acupuncture How does pet acupuncture work? Dr. Johnson says, &quot;An acupuncture needle is used to either open up blocked energy flow or reduce [it] when there’s too much energy flow in an area. Basically, acupuncture is used to balance the meridians that crisscross the body; the yin and yang.&quot; “An acupuncture needle is inserted into key points to stimulate that point, [and to] stimulate another area. Or, [acupuncture] is used to interrupt the nerve supply by blocking the switch causing the pain,&quot; he explains. The most common pet problem corrected by acupuncture is arthritis. Dr. Johnson has both seen and used acupuncture to treat all kinds of pet conditions, ranging from neurological problems (such as seizures) to skin disorders, thyroid imbalances and heart conditions. If your pet suffers from a chronically painful condition, there are well-established complementary veterinary care treatments available. These treatments can speed postoperative recovery, assist pets in regaining mobility, and most importantly, help them feel better. Talk to your veterinarian about all the options available to your pet. Sometimes the best medicine includes a variety of types of care. Featured Image: iStock.com/makotomo"}]