[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Herb &#039;N&#039; Living: Growing a Home Garden for Your Pet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4782933498_feb06c529c_1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4782933498_feb06c529c_1.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_multi_herb_n_living"}, "datePublished": "April 20, 2009", "dateModified": "September 6, 2022", "description": "Whether you have a large yard space or a small windowsill, you can grow a healing garden for your cat or dog. Most of these plants are simple to grow and inexpensive to boot. Even better, many double as home remedies for you and your family.", "articleBody": "Some animal experts have asserted that pets intuitively eat plants according to their specific medicinal value -- that is, as long as they have several plants to choose from. The problem, however, is that we choose our plants for beauty rather than edibility. So when a pet has only household plants or landscaping to choose from, it can lead to something more serious than a bellyache, especially if the plants are toxic or sprayed with chemical pesticides and fertilizers. But, given the right plants to choose from, your pet will be able to treat itself and you won’t need to worry about potential side effects.  Whether you have a large yard space, a small four-foot by four-foot plot, or a windowsill, you can grow a healing garden for your cat or dog. Most of these plants are simple to grow and inexpensive to boot. Even better, many double as home remedies for you and your family.   So without further ado, here are a few tips that will earn you an honorary green thumb.   For an outdoor garden, the burdock herb is an ideal plant. Known for its ability to treat allergies and digestive and kidney issues, the burdock is a traditional medicinal plant used worldwide. A rich soil works best, but be careful to not let this plant grow too large, for it will take over your entire garden when given the opportunity.   Milk thistle, good for liver disorders, is low on demands. It can be grown in wet or dry soil, and in a sunny or partly sunny location. However, remove the flowering heads to prevent it from becoming too weedy.   Peppermint is another easy-to-grow herb. Go to the store, buy the plant, and place it in rich, moist soil -- that&#039;s it. Your pet will find the leaves of the peppermint herb, which does well in both sun and shade, useful for indigestion and nausea. Just don’t forget to cut the springs back regularly to encourage healthy growth.   The Astragalus herb, meanwhile, is useful for lowering blood pressure, decreasing blood sugar, improving digestion, and promoting healing. The Astragalus seeds need to be scratched before planting in a sandy soil.   Similarly, garlic is a well-known immune booster. Garlic grass is easy to grow, indoors and outdoors, and can be started from a bulb bought at your local grocery store. Just push the cloves under a quality soil, pointed side up. Keep in mind that the garlic clove, eaten in large amounts, can make your dog ill, and it is toxic to cats. Garlic cloves should not be given to your cat under any circumstance, but the grass that grows from the clove can be nibbled on as your cat feels the need.      Rosemary, another immune booster, is ideal for the indoor gardener, as long as it is trimmed regularly. Rosemary is one of the hardiest of the perennials, but it is prone to root rot if it is over watered. Care must be taken to keep the soil balanced.   And what pet-friendly garden would be complete without grass? A trip to your local health food store will find you a handful of wheat berries or barley grass seeds, which you can germinate in a rich soil. For the best results, cover the pot with plastic wrap and keep it in a dim location until the seeds have sprouted. You can then move it to a sunny spot within reach of your pet, and begin the next grass pot so that your pet always has a fresh supply. For an outdoor garden, set aside a grass plot just for your dog or cat to visit.   Many of these herbs bud beautiful flowers as they mature, making them wonderful additions to your living space. But if you wish to keep them growing longer through the year, you will want to remove the flower tops before they go to seed, since this signals to the plant that it is time to die.   In addition, grouping according to the herb’s type is not always necessary. Many plants will grow in harmony together, while others need to be cultivated, pruned regularly, or deflowered in their own space to prevent them from taking over the garden or dying. Another way to inhibit herb growth is to keep the plant in the pot when placing it in the ground or on your windowsill.   If you do plan on growing the herbs indoors, you will need a window that gets bright, indirect sun, or a fluorescent grow light. Keep in mind that even indoor plants are prone to pests. If necessary, spray your plants’ leaves with a water and soap mixture, or a chemical spray that is labeled for use with edible plants. Fertilizers must also be non-toxic and labeled as edible.   Now that you know how easy it is to grow an herb garden, we hope that you consult with your veterinarian about some other pet-friendly plants to add to your garden. You can also check out our articles: Ten Herbs to Improve Your Cat&#039;s Health and Eight Herbs to Improve Your Dog&#039;s Health.   Image: ahenobarbus / via Flickr  "}]