[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skijoring: A Combination of Cross Country Skiing and Dog Sledding", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/5479377183_018e4b1306_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/5479377183_018e4b1306_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Exercise, Winter", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_skijoring_a_combination_of_cross_country_skiing_and_dog_sledding"}, "datePublished": "June 7, 2011", "dateModified": "September 6, 2022", "description": "The high energy activities don’t have to end with the first snowfall, however. If you live close to an area where you can cross country ski, and your dog is physically capable of spending long amounts of time in the snow, then you may have just found your new winter activity: Skijoring!", "articleBody": "  You had a great summer, with lots of activities that you and your dog were able to share, and fall was just a cooler extension of the fun. But now winter is beginning to blow its first frosty breaths, threatening to spoil the groove you and you dog have going. The high energy activities don’t have to end with the first snowfall, however. If you live close to an area where you can cross country ski, and your dog is physically capable of spending long amounts of time in the snow, then you may have just found your new winter activity: Skijoring!  What is Skijoring? Skijoring, which translates to ski driving in Norwegian, is a combination of cross country skiing and dog sledding. The dog is outfitted with a dog sledding harness, which is attached by rope or towline to a skijoring harness worn by the human. While the human powers him or herself using skis and poles, the dog also pulls the human. This activity can be done with one dog or a team of dogs. As long as your dog weighs at least 35 pounds and has the energy, stamina and willingness to take part, all you will need is some basic training to get started. And you don’t have to be an expert skier to skijor, and your dog doesn’t have to be a Northern breed dog like a Husky or Malamute. She doesn’t even have to be a big dog, because you will be providing some of the power of momentum. Your dog just needs to be healthy, full of energy, and motivated to run for the simple joy of running. (As with any sport or high energy activity, you should take your dog for a health check before beginning a new sport or routine.) Which Dogs are Best for Skijoring? Any dog that loves to run and meets the minimum weight requirement is a good candidate for skijoring. While small dogs are not necessarily excluded from recreational skijoring, they are not often seen participating because they are not able to add much strength or speed. But if you feel that your small dog would have fun skijoring with you, what’s the harm in letting him pretend to pull you with all of his strength?  The breeds that do tend to be seen participating in this sport in greater numbers are the Northern breeds, those with heavy hair coats like Canadian Eskimos, Huskies, Malamutes, Samoyeds and Chows. But other breeds are well suited for this sport as well, pulling dogs such as American Bulldogs, mastiffs, American bull terriers and Staffordshire terriers, and high energy and fast running breeds like greyhounds, Labrador and Golden retrievers, German shepherds and German shorthaired pointers. It is best if your dog already has a desire to pull and run and does well in cold weather, but with positive training and the right cold weather gear, almost any dog can become a class A skijorer. It helps quite a bit if your dog is good at not being distracted, since you will not want to interfere with other skijorers, and you will not want your dog to drag you out of your planned route. The best skijoring dogs are those that can ignore the other dogs on the trail and move ahead of them with nary a glance. In competitions, in fact, points are deducted for dogs that are distracted or that interfere with others. (If you are more interested in skijoring for competition than for simple recreation and fun, you may want to talk to some people who are experienced in the sport to learn more about the sport and about the breeds that are best suited for competitive skijoring.)  What Equipment is Required? You will need the harnesses, both for you and your dog, along with the basic cross country skiing gear. For the health and safety of you and your dog(s), make sure that all of your equipment is approved for use with dogs and for skijoring specifically. If your dog is thinner coated, like the hair coats of Dalmatians and German shorthaired pointers, you may want to insulate your dog with a snug cover up for skijoring in the coldest parts of winter. The lighter coated dogs tend to do better in the warmer days of early and late winter, while heavy coated dogs do best in the height of winter. Check online for suppliers of skijoring harnesses and towlines to compare prices for the best and safest gear. Rules and Precautions Be sure to start out slowly and keep your runs short. Additionally, let your dog become accustomed to wearing the harness alone before she is tasked with pulling a load while running in snow. It&#039;s important to always use common sense when heading outdoors in the winter (or anytime of the year). Keep a first-aid kit and plenty of water in your pack, and watch out for other skiers, horses, snowmobiles, etc. while on the ski trails. There are plenty skijor clubs that get together for runs and seminars. Just do a quick search for skijoring clubs online and you will find many options. Talk to other skijorers and learn as much as possible so that you can safely enjoy this winter sport with your four-legged pal. A final note: You don’t have to wait until the snow starts falling to get started. You can see if your dog has a feel for skijoring even in the summertime by talking her out with you while you bike, run, or skate. Just remember to take all of the same precautions that were mentioned above, and take a look at the articles we have on biking and running with your dog. Resources The Midwest Skijorers ClubSkijor USAImage: PhotoBobil / via Flickr"}]