[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Army Veterinarians: On a Mission to Keep Military Dogs Healthy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/LTCMont_PetExam_Family.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/LTCMont_PetExam_Family.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/army-veterinarians-mission-keep-military-dogs-healthy"}, "datePublished": "March 21, 2017", "dateModified": "September 6, 2022", "description": "The Army Veterinary Corps is responsible for the care of all military working animals. The Corps also ensures care for pets owned by service members stationed around the world.", "articleBody": "By Samantha Drake Like their human counterparts, military dogs can get injured or sick in the field. Thankfully, veterinarians who serve in the U.S. Army Veterinary Corps are prepared for a wide range of scenarios, from scorpion bites to heat stroke. Capt. Crystal Lindaberry, a doctor of veterinary medicine, recalls treating a patrol dog for heat exhaustion and burns sustained while working in the desert in Afghanistan one summer. “The sand and the concrete are so hot from the sun that [the dog] would lay down, but the heat went through his fur and his paws,” she explains. “He did his job and then when he came back, we took care of him.” Fortunately, the dog recovered quickly and returned to work within a week. In addition to patrol duties, military dogs may be trained in explosive and narcotic detection. Some dogs are certified to do both detection and patrol work. The U.S. Army Veterinary Corps celebrated its 100th anniversary in 2016, but many people know little about the breadth of its military mission. The Army Veterinary Corps is responsible for the care of all military working animals. Aside from dogs (usually German Shepherds and Belgian Malinois), this includes horses, who were once part of the cavalry and today are used primarily in ceremonial roles; and dolphins, who are used by the Navy in search operations. The Corps also ensures care for pets owned by service members stationed around the world. “Anywhere the military has personnel, we have animals,” notes Maj. Rose Grimm, assistant to the Veterinary Corps chief at Fort Sam Houston in San Antonio, Texas. Army Veterinary Corps: A Century of Service Congress created the U.S. Army Veterinary Corps in 1916, but the federal government has been ensuring the care of animals used by the military since the Revolutionary War in 1776, when Gen. George Washington ordered the raising of a “regiment of horse with a farrier.” During the Civil War, each cavalry regiment included a veterinary surgeon, but it wasn’t until 1879 that Congress required all cavalry veterinarians to be graduates of a recognized veterinary college, according to the U.S. Army Veterinary Corps website. When the U.S. entered World War I in 1917, the Army employed 57 veterinarians, primarily in equine medicine and surgery. Today, the Army Veterinary Corps has 530 Veterinary Corps officers, 530 veterinary technicians, and 940 veterinary food inspection specialists, along with around 400 civilian support staff, including veterinarians, veterinary technicians, and administrative staff, who provide veterinary services for the Army, Navy, Marine Corps, and Air Force at several locations in the U.S. and in more than 90 countries. Most military veterinarians come straight out of an accredited veterinary school, explains Dr. Clayton D. Chilcoat, a lieutenant colonel and the assistant deputy chief of the Army Veterinary Corps in Washington, D.C. The Army pays for three years of veterinary school in return for four years of service after graduation. Upon entering the Army Veterinary Corps, veterinarians go through an 11-week training program that provides both hands-on and classroom instruction. Veterinarians can opt for either active duty or to serve in the Army Reserve. Chilcoat, who has a Ph.D. in immunology in addition to a veterinary degree, started out as a veterinary research scientist and later served in Korea as the commander of a veterinarian attachment. He also served in Germany, Africa, and Colorado. “We’re expected to be leaders,” says Grimm, whose military career as a veterinarian has included a variety of assignments. “Our civilian counterparts may not think of themselves that way but the Army expects it.” Lindaberry has served in countries including Afghanistan, Iraq, and Kuwait, and is currently stationed at Fort Campbell on the Kentucky-Tennessee border between Hopkinsville, Kentucky, and Clarksville, Tennessee. As a veterinarian deployed overseas, her job included providing routine care for the military dogs, from administering vaccines to treating diarrhea. Less routine were issues related to the harsh Middle East environment, such as heat stroke and scorpion bites. “They’ve got some really, really nasty scorpions over there,” Lindaberry says. People tend to envision Army veterinarians treating military dogs injured by explosive devices because of what they see on television, but the reality is very different, she notes. At the same time, Army veterinarians are trained to be ready for anything. “What do we do when we have an emergency with the dog or we have a sick dog, and we’re not at a very nice veterinary hospital where we have all the nice things [like proper equipment and supplies]?” Lindaberry says. “How do we manage these things so we can get the dog stable—stable enough, anyway—to where he can be transported for definitive treatment?” Additional Duties of an Army Veterinarian Many people would be surprised to know that one of the Army Veterinary Corps’ biggest responsibilities is ensuring the safety of all food consumed by military personnel. Lindaberry says a large part of her job is inspecting food facilities, dining facilities, and the food itself. This duty dates back to the 1890s, when veterinarians were called on to examine meat, poultry, and dairy products before they were sent to frontier posts. “Strong academic background in microbiology, epidemiology, pathology, and public health has always made veterinarians ideally suited for a role in ensuring wholesomeness of food,” according to the Army Veterinary Corps website. Army veterinary food inspection specialists continue to approve all food vendors and inspect all food purchased by the U.S. Department of Defense to make sure it’s safe to eat. The Army Veterinary Corps also devotes significant resources to medical research and development to protect military personnel—including the development of vaccines, antitoxins, and antidotes. It also provides advanced education opportunities for veterinarians. This summer, Lindaberry will be returning to school as part of the Army’s long-term health education training program. She will be enrolling in a residency program in internal medicine at North Carolina State University, with her German Shepherd, two cats, and two horses in tow. Upon completing the program, Lindaberry says she will return to the Army to help train new veterinarians and provide specialized care for military dogs. When asked if she has any advice for those interested in becoming an Army veterinarian, Lindaberry points out that working with animals is only a part of the job. “I tell people not to join the Army unless they want to join the Army. Yes, I’m a veterinarian, but I spend half my time doing good old-fashioned Army stuff.”  Photo: Courtesy of Capt. Crystal Lindaberry p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 10.0px &#039;Times New Roman&#039;; background-color: #ffffff}span.s1 {font-kerning: none}  "}]