[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mushing with Your Dog: The Basics", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4411761813_2441d85c52_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4411761813_2441d85c52_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_mushing_with_your_dog-the_basics"}, "datePublished": "June 7, 2011", "dateModified": "September 6, 2022", "description": "If you live in an area where there is plenty of snow and space to run -- and hopefully someplace to go -- and you have at least two big, energetic dogs and a sled, there is an outdoor activity made just for you: mushing!", "articleBody": "If you live in an area where there is plenty of snow and space to run -- and hopefully someplace to go -- and you have at least two big, energetic dogs and a sled, there is an outdoor activity made just for you: mushing!  We’re not talking “mush” like the stuff you eat for breakfast. This “mush” is based on the French word for marche. Or to put it simply, “Go!” Mushing can be for practical purposes, like getting from here to there (and back again), in which case you need only a team of dogs big enough to haul the loads they are pulling. If you are interested in mushing for sport, well, that’s a whole ‘nother ballgame, and you’re going to need a bigger team for that. And then you have the choice between going pro and joining a competitive racing association, or just staying casual and racing around with your dogs alone, or against your friends and neighbors. Either way, it’s a great way to stay healthy and have fun all winter long. If you live in a location that is not snowy all year long, you can even continue to mush in the warm season with a rig. In fact, mushing is not confined to sledding; it can also include skijoring, weight pulling, sled racing, and almost anything that involves harnessing a dog to a vehicle for the purpose of pulling it. Meet the Dog Sled Team Dog sledding requires a sled, a team of dogs, and a musher -- the person driving the sled. Almost any breed of dog can be used on a sled team, so long as it is a medium to large sized dog (between 45-90 pounds is best). The most common breeds are the Siberian Husky, Alaskan Malamute, Canadian Eskimo and Samoyed, but other breeds and mixed breeds are also used. Pulling breeds like American Bulldogs, mastiffs, American bull terriers and Staffordshire terriers can also benefit from this sport. In cold environments, it does help tremendously if the dogs are heavy coated, but the main components for a successful mushing dog is speed, strength and stamina to spare. The dogs are set up in groups of two, running side by side -- think of how Santa’s reindeer sled team is organized. The team is positioned based on the dogs’ abilities to perform certain roles. The Lead dogs set the pace and steer the rest of the team. They are usually chosen based on their intelligence, since they have to be smart and able to find trails even under tough conditions. The Swing dogs follow the lead dogs and help guide the dogs behind them through the tough turns.  The Team dogs are usually found on larger teams. They provide the main power in the team and are positioned based on their strength. The Wheel dogs are the dogs closest to the sled. They are positioned based on their ability to stay calm under pressure, especially with a moving vehicle right behind them. And because they are directly hitched to the sled, they have to be the strongest; making turns and maneuvers smoothly enough that the sled will not be overturned and pulling the sled out of ruts.  Finally, the Musher rides right behind the sled, giving commands and steering the sled team. The Musher often will participate by running along with the dogs to help speed the team along.  Basic Training Sled dogs begin their training as puppies, when they are put in a harness and allowed to run loose with the adult team dogs. The puppies emulate the adult dogs’ behavior, and through their example acquire the same desire to pull and run. The next point in training is when a short rope is attached to the puppy’s harness and a lightweight object is tied onto it to get him used to the weight. All dogs on a mushing team are taught basic obedience and socialization and mushing commands. Once they have mastered the basics and are used to being in the harness, the young dogs can be put into the lines to practice starting and stopping as a team, as well as standing still and lying down while harnessed together. The next step is to attach a very light sled and gradually get them used to the equipment. Dogs should be taught with consistency and patience, and they should be given lavish amounts of praise during the course of training -- and for that matter, after training. Dogs always work best when they have a goal, and for most dogs, the simple joy of running and the praise of their human master for a job well done (not to mention good food and a warm place to lay their heads) is all the reward they need.   Learning the Reins If you’re just starting out, your local mushing club can help you find the right equipment for your dogs, and can offer the best training tips for leading a successful team. Many of these groups offer clinics for beginners, and some individual mushers may even be available to mentor new mushers. A little research on the Internet and at your local library and bookstore will also help you to learn as much as you need to know, so that you can decide if this is the ideal sport for you and your dogs, and which type of mushing is ideal for you and your dogs. Good luck -- and don’t forget to have fun! Resources Gomush.comMushing MagazineInternational Sled Dog Racing AssociationImage: Frank Kovalchek / via Flickr"}]