[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Not to Say to Someone Who Lost a Pet (and What to Say Instead)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/enjoying-sunset-with-my-dog-picture-id915601020.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/enjoying-sunset-with-my-dog-picture-id915601020.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cat, End of life, General Care, Zoo In Memoriam Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/what-not-say-someone-who-lost-pet-and-what-say-instead"}, "datePublished": "October 27, 2022", "dateModified": "August 30, 2023", "description": "It’s hard to know what to say to someone who has lost a pet. Here are some tips on what NOT to say, plus what to say and do instead.", "articleBody": "Pet loss can be a very emotional experience for everyone whose lives the pet touched. Grieving is also highly personal. It’s difficult to know what to say to someone who is grieving, even though you’ve probably experienced grief yourself. Most people are not comfortable with grief in any form, and even when you try to say something comforting, it could come out all wrong. Perhaps you’ve never grieved a pet, or you’re not really a pet person. Whatever the case may be, here are some things you should not say, along with some suggestions for what you can say instead. “At least you have other pets.” This is inappropriate because no matter how many other pets someone has, the person or family had a special relationship with that pet that can’t be replicated or replaced. Just as you may have a special relationship with a friend or family member that is different than your relationship with any other person, this pet may hold a special place in their heart. Maybe they helped their human through a difficult time or was given to them by a loved one who passed. Try this instead:  “I know that your pet was near and dear to you. I am very sorry for your loss. Hopefully, your other pets will be a source of comfort for you during this difficult time.” “You can always get another pet.” Bringing a new pet into the family might seem like a good way to form the same kind of bond with another furry friend. While adopting another pet may be an option for a grieving pet parent in the future, it is certainly not something you want to suggest now. A new pet, no matter how special, cannot take the place of the pet that passed. Try this instead: “I’m so very sorry for your loss. What can I do to help you through this time?’” “I really didn’t like your pet. Maybe you can get something else next time.” No matter what your personal feelings are for someone’s pet, it’s not the time to express judgement. The fact is that the pet was loved and is now grieved. Your opinion of them does not change the special relationship that their pet parent had with them. Try this instead: “I cannot imagine how difficult this must be for you. Is there anything I can do for you?” “Aren’t you over that yet?” Grief does not have an expiration date. Everyone grieves differently and for different periods of time. It may be easy to check on a friend who lost a pet only a few days ago, but checking in on a friend weeks and months after a loss can go a long way. Try this instead: Continue to check in, maybe even setting a note in your calendar to simply ask “How are you doing?” or “How are you feeling?” “I’m not really a dog/cat/bird/fish person, so I don’t get it.” People who lose pets may hear this from a friend or coworkers. It is especially hard if they need to take a day or so off work and they hear this type of comment from their boss. It doesn’t matter if you don’t understand the attachment or the bond that the person had with their pet. All that matters is that the person is grieving and needs some time to do that. Try this instead: If you are the boss at work and the policy doesn’t allow for a grieving pet parent to take off work, see if they can take a sick day or mental health day. If not, ask if there is anything you can do to make the day easier for them. Friends can do the same—ask what you can do to make each day easier for the person, whether that’s leaving them alone, being there in person, or helping in some other way. “At least he’s gone to heaven (or is running free over the Rainbow Bridge).” This is definitely a nice sentiment, and if this matches your friend’s belief system, they may take great comfort in this type of statement. However, if you don’t know someone&#039;s personal beliefs, this may be an insensitive or inappropriate choice. You also won&#039;t want to make a statement that blatantly disregards your own beliefs, which may come across as condescending. Either way, it still may be too early to say this sort of thing and the person may find no comfort in this at all. Try this instead: It may be helpful for a grieving pet parent to discuss what happens to their pet after they are gone, but only if they bring it up. Your friend may also ask you to participate in a funeral or memorial ceremony to help them find closure. Instead, you can focus on what you do know, and say, “You were both so lucky to have each other, and you gave your pet the best life they could have.”    “At least your pet is not in pain anymore.” Depending on the circumstances surrounding a pet’s passing, euthanasia can be a wonderful gift that a pet parent may give their suffering pet. The knowledge that their pet is no longer in pain can make the decision to let go easier. However, this should not be the end of your support for them. Limiting their grief to the circumstances of their pet’s death or the pain they may have been in at the end does not take all their feelings into consideration. It may also bring up feelings of guilt or thoughts of their pet suffering in the end that they don’t want to experience again. Try this instead: “I cannot begin to imagine what you are going through, but I am thankful you were with them during such a difficult time and could ease their passing. If you need anything at all, please let me know.” Featured image: iStock.com/MilanEXPO"}]