[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Food (What You Need to Know) for Your Pet&#039;s Sake", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/208810939_69840d8daa.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/208810939_69840d8daa.jpg"}, "author": {"@type": "Person", "name": "Donna Spector, DVM", "url": "https://www.petmd.com/author/dr-donna-spector"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/evr_pet_food_for_your_pets_sake"}, "datePublished": "November 17, 2009", "dateModified": "August 16, 2022", "description": "Following is a series of posts that will help educate pet owners about reading labels and choosing foods they can trust for their pets. It is easy to be fooled by marketing gimmicks and misleading label claims … pets don&#039;t question what they eat … so we must.", "articleBody": "By Dr. Donna Spector Following is a series of posts that will help educate pet owners about reading labels and choosing foods they can trust for their pets. It is easy to be fooled by marketing gimmicks and misleading label claims … pets don&#039;t question what they eat … so we must.  What is really in pet food?  The pictures presented on cans and bags of pet food conjure up images of a chef cooking divine meals of wholesome cuts of meat and vegetables for our beloved pets. Although this is a lovely idea, it is rarely the case. When animals are slaughtered for food production, the lean muscle is cut off for human consumption. The remaining carcass (bones, organs, blood, beaks, etc.) is what goes into pet food, commonly known as &quot;by-products,&quot; &quot;meal,&quot; &quot;by-product meal,&quot; or the like. Read on if you are not faint of heart.  In addition to the carcasses described above, other &quot;leftovers&quot; from the human food industry (restaurant grease, out-of-date supermarket meat, etc) and &quot;4D&quot; livestock animals (dead, dying, diseased, disabled) may also be found in pet food through a process called rendering. Rendering is defined as &quot;an industrial process of extraction by melting that converts waste animal tissue into usable materials&quot;.  In other words, rendering involves placing livestock carcasses and possibly &quot;leftovers&quot; into huge vats, grinding it up and cooking it for several hours.  Rendering separates fat, removes water, and kills bacteria, viruses, parasites and other infectious organisms. The fat that is separated becomes &quot;animal fat&quot; that goes into pet food (for example, chicken fat, beef fat, etc). The remaining dried protein solids become &quot;meal&quot; or meat &quot;by-product meal&quot; for addition to pet food.  Read on for some additional disturbing definitions:  By-products (for example, chicken by-products or beef by-products): clean non-rendered &quot;parts&quot;, other than meat, derived from slaughtered mammals. It includes, but is not limited to lungs, spleen, kidneys, brain, blood, bone, fatty tissue and stomachs and intestines freed of their contents. This is a cheap way for pet food companies to keep the protein levels &quot;high&quot; (although not high quality) while keeping food production costs low.  Meat Meal (for example, lamb meal): in this example, all lamb tissues, exclusive of blood, hair, hoof, horn, hide trimmings, manure, stomach and rumen contents that are cooked (rendered). After cooking, the dried solids are added as &quot;meal&quot; to pet food. Meat By-product Meal (for example, chicken by-product meal): chicken by-products (defined above) that are cooked (rendered). After cooking, the dried solids can be added to pet food.  Digest: material from mammals which results from chemical breakdown of clean meat tissues or by-products (&quot;parts&quot; other than meat). This is often used to give a meat &quot;flavor&quot; to pet foods that don&#039;t contain any real meat.  The raw ingredients used in rendering are generally just leftovers of the meat, poultry and fishing industries. It is known that the temperatures used in rendering may also alter or destroy natural enzymes and proteins found in these raw ingredients. These facts indicate there is potentially wide variability in nutrient composition of the final product that ends up in pet food. In fact, the nutritional quality of by-products, meals and digests often varies dramatically from batch to batch.  All rendered products are considered &quot;unfit for human consumption.&quot; If we shouldn&#039;t eat it, either should our pets!  Rendered products typically have relatively high protein levels, however, the quality of those proteins is often questionable. In fact, these inferior protein sources are often unpalatable to pets and artificial flavors or fats must be sprayed on the food in order to get pets to consume it.   Interpreting label claims So how do you decipher what pet foods are truly high quality? It is often misleading when pet foods are labeled as &quot;premium,&quot; &quot;super premium,&quot; &quot;ultra premium&quot; or &quot;gourmet.&quot; What does all this really mean and is it worth the extra money? Well, mostly … the labeling is just hype. Products labeled as premium or gourmet are not required to contain any different or higher quality ingredients than any other complete and balanced product.  Pet foods labeled as &quot;natural&quot; do fall under the jurisdiction of the Association of American Feed Control Officials (AAFCO), the regulating body for pet food manufacturers. AAFCO defines &quot;natural&quot; pet food as having ingredients from ONLY plant, animal or mined sources. These foods cannot be highly processed or contain chemically synthetic ingredients, such as artificial flavors, preservatives, or colorings.  &quot;Organic&quot; pet foods are those made without the use of conventional pesticides and artificial fertilizers, free from human or industrial waste contamination and processed without ionizing radiation or food additives. If food animals are involved, they must be raised without the routine use of antibiotics and growth hormones and fed a healthy diet. Producers must have special certification and follow specific production standards in order to market the food as organic. There are different levels of organic: &quot;100% organic&quot; is just that, &quot;Organic&quot; contains at least 95% organic ingredients and &quot;made with organic ingredients&quot; indicates a product contains 70% certified organic ingredients.    What is in a name?   When it comes to pet food, sometimes not a lot. The food name is the first part of the label noticed by a consumer and for that reason, fancy names are used to emphasize certain features of a food. AAFCO has established four rules about ingredients: 95% rule: at least 95% of the food must be the named ingredient. For example, &quot;Chicken for Dogs&quot; or &quot;Beef Cat Food&quot; must be 95% chicken or beef, respectively. If the food is &quot;Chicken and Rice Dog Food&quot;, the chicken is the component that must be 95%. If there is a combination of ingredients such as &quot;Chicken and Liver for Cats&quot;, the two together must make up 95% of the total weight and the first ingredient must be the one in higher percent in the food. 25% or &quot;Dinner&quot; rule: when the named product contains at least 25% but less than 95% of the total weight, the name must include a descriptive term such as &quot;dinner&quot;. For example, &quot;dinner&quot;, &quot;entrée&quot;, &quot;grill&quot;, &quot;platter&quot;, &quot;formula&quot; are all terms that are used to describe this type of product. For example, &quot;Chicken Dinner Dog Food&quot; must contain at least 25% chicken. This food could contain beef and possibly even more beef than chicken. It is important to read the label and check what other meat sources the product contains.3% or &quot;With&quot; rule: this one is tricky. Many times the &quot;with&quot; label identifies extra or special ingredients, such as &quot;Beef Dinner for Dogs with Cheese&quot; is a food containing at least 25% beef and at least 3% cheese. But beware of this type of &quot;with&quot; label: &quot;Dog Food with Chicken&quot;. This dog food need only contain 3% chicken! Don&#039;t confuse that with &quot;Chicken Dog Food&quot; which must contain 95% chicken. Confusing, right?&quot;Flavor&quot; rule:  in this situation, a specific percentage of meat is not required, but it must contain an amount of flavor sufficient to be detected. For example, &quot;Chicken Flavor Dog Food&quot; may contain a digest or enough chicken fat to flavor the food, but there will be no actual chicken meat added to the food.What are ingredients to avoid? In addition to shunning food with &quot;by-products&quot; and &quot;meals&quot;, there are many other food additives that should be avoided. Corn syrup, propylene glycol, and MSG are artificial flavors frequently used in pet food manufacturing to disguise inferior food quality and some of these additives give dampness and flexibility to semi-moist foods and treats. Many preservatives are known to be carcinogens in humans. When used in the production of pet food, they limit the growth of bacteria or inhibit oxidation of food. Examples of preservatives that should be avoided include BHA, BHT, sodium nitrite, and nitrate. Pets are smaller than humans and many of their foods have the same amount of preservatives as ours -- studies are inadequate to understand the consequences of chronic intake of these preservatives -- but they are best avoided. Artificial colorings are used in many pet products to entice owners into a purchase; however, they have no nutritional value and may be responsible for adverse or allergic reactions. Besides, your pet doesn’t care what food looks like -- just how it tastes. What pet food ingredients sound healthful -- but aren&#039;t? I think everyone would agree that &quot;chicken meal&quot; sounds like something wholesome and tasty that could be served in any USA household. In my house a chicken meal would include juicy grilled chicken breast served on a bed of steamed spinach and maybe a little quinoa. But, don&#039;t be fooled, in the pet food industry, &quot;chicken meal&quot; takes us back to the disgusting rendering plant.     Corn and rice. Although these foods are often thought of as staples of an American diet, they are considered &quot;fillers&quot; and are not healthful for your pet. Unfortunately, many pet food companies (even premium ones) use corn and rice as the main ingredients in their foods because they are a cheap way to fill up a bag and still meet basic nutritional requirements. This has led to industry-wide creation of pet foods which are high in carbohydrates, relatively low in meat protein and are a major factor in the pet obesity epidemic. Corn and rice contribute to obesity because they are carbohydrates with high glycemic index. This means they raise blood sugar levels rapidly and create hormonal signals that have negative long term effects on metabolism and weight gain. These corn and rice based diets are often responsible for chronic symptoms of maldigestion, such as gas, bloating, and diarrhea.  Benefits of Natural Ingredients Natural diets do not contain preservatives or other potential carcinogens -- so they reduce the risk of adverse reactions. Choosing natural foods will eliminate &quot;empty&quot; calories that come from additives and flavorings and contribute to pet obesity. It has been well documented that dogs maintaining an ideal body weight live 15% longer, and with less disease (especially arthritis) than overweight dogs. Natural diets contain higher levels of quality protein sources (since there are no fillers, inferior by-products or meals) which better address nutritional requirements and may help prevent disease. Many natural diets also avoid the use of high glycemic index carbohydrates (those that raise blood sugar rapidly), such as corn and rice, due to the negative effects they have on the metabolism and weight gain.  It seems every day, all of us are becoming increasingly aware that harmful dietary preservatives and synthetic chemicals pose significant health hazards and can negatively affect our overall well-being. The same holds true for our pets.  We have all heard anecdotes about the elimination of disease and improvement in energy by the adoption of a healthful diet and holistic lifestyle. The good news is there are more pet food options to help ensure the same principles of human nutrition are upheld for the four legged members of our families.  Originally published on www.halopets.com Donna Spector, DVM, DACVIM, is a renowned, board-certified Veterinary Internal Medicine Specialist who has practiced at the Animal Medical Center in New York City and other leading institutions. She is an active member of the American Veterinary Medical Association (AVMA) and the American Holistic Veterinary Medical Association. Dr. Spector has written and lectured extensively on topics including nutrition, diabetes, gastrointestinal disorders, kidney failure and respiratory disease. She is widely recognized for her role as consulting veterinarian to HALO, Purely for Pets, her TV appearances with Ellen DeGeneres and her widely-quoted pet health advice in print and on radio.  She currently works in Chicago, performing independent internal medicine consultations for dogs and cats. Image : laffy4k / via Flickr Resources:  U.S. Food and Drug Administration, Center for Veterinary Medicine (www.fda.gov/cvm), Interpreting Pet Food Labels by David A. Dzanis, DVM, Ph.D., DACVN Association of American Feed Control Officials (www.aafco.org), Pet Food Regulations"}]