[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/qx3u9u1vxe", "@type": "VideoObject", "duration": "PT1M18S", "name": "5436288775001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/0be162b64b2dbb37220afe5155ec854097b79d91.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/qx3u9u1vxe", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/b3e600394e11467fddeba7815dec76d87c92b246.m3u8", "transcript": "Sweet potatoes are starchy root vegetables that provide plenty of nutritional benefits for our canine Companions. They are one of the best dietary sources of vitamin A, which promotes healthy skin coat eyes nerves and muscles in dogs vegetables with orange flesh contain beta carotene a precursor of vitamin and a powerful antioxidant that helps prevent disease and infection. Sweet potatoes are also a rich source of fiber, vitamin C, and B6 potassium, calcium, and iron among many other essential vitamins and minerals. You can add a small amount of steamed or boiled sweet potatoes to your dog's diet or use dehydrated sweet potatoes as a sweet treat.\n\nIn addition sweet potatoes are often added to pet foods and treats because they're gentle on a dog's digestive system and are naturally gluten free. They're a common ingredient in grain freed canine diets because they provide an alternative source of carbohydrates. Pet owners should consult a veterinarian before feeding sweet potatoes to dogs as too much vitamin A can cause bone problems and muscle weakness. And while they are lower on the glycemic index than white potatoes.\n\nYou should still speak with your veterinarian first if your dog has a health condition such as diabetes.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/can-dogs-eat-sweet-potatoes?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Sweet Potatoes?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/can-dogs-eat-sweet-potatoes.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/can-dogs-eat-sweet-potatoes.jpg"}, "author": {"@type": "Person", "name": "April Saylor", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-sweet-potatoes"}, "datePublished": "March 2, 2023", "dateModified": "June 29, 2023", "description": "Sweet potatoes are a fiber-rich healthy treat for dogs, as long as they&#039;re prepared correctly and fed in moderation. Learn more about feeding your dog sweet potatoes safely.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be OK for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Sweet potatoes are a nutrient-packed staple for us humans. But what about our canine companions? If your dog is giving puppy dog eyes for your favorite Thanksgiving side, you may wonder if dogs can eat sweet potatoes.   Good news: vets give the OK when it comes to dogs and sweet potatoes! In fact, sweet potatoes are considered a healthy treat for dogs and offer lots of nutritional value for your pooch. Just be careful how you go about introducing this fiber-rich starchy root to your pooch. Even though dogs can eat sweet potatoes, don’t just toss them any old yam to gnaw on! Keep the following tips top of mind in order to safely feed your dog sweet potato.  Are Sweet Potatoes Good for Dogs?  Sweet potatoes can be a nutritional treat for our canine companions when fed in small amounts. This vitamin-rich carbohydrate is even becoming a common ingredient in commercial dog food and treats. As long as you watch out for extra ingredients that can sneak into human recipes (like butter, sugar, and molasses) and don’t offer too much, these starchy root veggies are considered a safe dog treat. Here are a few reasons sweet potatoes are considered a healthy snack for dogs: High in fiber: Sweet potatoes are a good source of dietary fiber, which helps dogs with digestion. These special spuds are also considered a “complex carbohydrate,” meaning they provide a steady source of energy. Good source of beta-carotene: Like other orange veggies (such as carrots), sweet potatoes contain high amounts of beta-carotene, which the body turns into vitamin A. Vitamin A helps dogs’ eye health, immune function, and cell growth. Vitamins and minerals: Sweet potatoes are also a good source of other vitamins and minerals, including vitamin C, manganese, potassium, and iron. Low glycemic index: As a source of carbohydrates, sweet potatoes have a relatively low glycemic index, which means they’re less likely to cause a spike in your dog’s blood sugar. This can be beneficial for dogs with diabetes. Antioxidants: Sweet potatoes contain antioxidants that may help protect cells from damage caused by free radicals.  Can Dogs Eat Cooked Sweet Potatoes? Cooked sweet potatoes are fine for your dog to enjoy as an occasional treat. Just be sure to avoid other ingredients that us humans like to add to our sweet potatoes, such as butter, cream, or salt, which can be dangerous for dogs to eat (and even cause pancreatitis in dogs). Sweet potatoes that have been prepared with salt, sugar, garlic, or other seasonings that are not safe for dogs to consume should also be avoided. As with any new food that finds its way into your dog’s bowl, moderation is key.  Can Dogs Eat Raw Sweet Potatoes? While cooked, unseasoned sweet potatoes are fine in moderation, don’t feed your pooch raw sweet potatoes. Uncooked sweet potatoes are difficult for them to chew and can be a choking hazard. They can also cause an upset stomach.  Can Dogs Eat Sweet Potato Skins? Potato skins are not considered safe for dogs to eat because their chewy exterior can cause dogs to choke and even lead to intestinal blockages. Be sure that any sweet potato offered to Fido is cooked and that the skins (along with any stems or leaves) are removed before they find their way into your pet’s food bowl. How to Safely Feed Sweet Potatoes to Your Dog Whether they’re mashed, baked, or boiled, sweet potatoes are fine for dogs to eat as long as they’re cooked, peeled, and plain. Again, avoid any seasonings or extra ingredients that may be included in “human food” recipes, such as butter, sugar, or salt. For a little extra flavor (and fiber), try topping your dog’s regular food with a little sweet potato pureé at mealtime. Or add a spoonful to their Kong or other food puzzle to keep their brains busy as they snack. Sweet potato is easy to mix in with other dog-friendly ingredients, and most dogs enjoy the taste.  Just be sure not to overdo it! Treats (including veggies like sweet potatoes) should only make up 10% of your dog’s overall calories. The other 90% should be from a diet of well-balanced dog food.  How Much Sweet Potato Can a Dog Eat?  When feeding your dog cooked, plain sweet potato, start slow—the high fiber content in sweet potatoes may cause gastrointestinal upset. See how your pup reacts to a small amount before giving them a full serving size. Here are some general guidelines for how much sweet potato is safe for dogs to eat in a day, based on their weight: Extra-small dog (2–20 pounds): 1 teaspoon Examples: Yorkies, Chihuahuas, Pomeranians, Pugs Small dog (21–30 pounds):1–2 teaspoons Examples: Basenjis, Beagles, Scottish Terriers Medium dogs (31–50 pounds): 2–3 teaspoons Examples: Basset Hounds, Border Collies, Australian Cattle Dogs Large dogs (51–90 pounds): 1–2 tablespoons Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds Extra-large dogs (over 90 pounds): 3–4 tablespoons Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees Note that these are just general guidelines. It’s always best to check with your veterinarian before making major changes to your dog’s diet. What Other Vegetables Can Your Dog Eat? Some other veggies that are considered safe for dogs include: Carrots Cauliflower Bell peppers Lettuce Zucchini Spinach Green beans Tomatoes (though, fun fact, these are technically a fruit) Featured Image: iStock/SolStock"}]