[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Common Dog Illnesses that are Impacted by Nutrition", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-veterinarian-shutterstock_226239319.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-veterinarian-shutterstock_226239319.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/centers/nutrition/dog-diarrhea-and-other-diseases-impacted-by-nutrition"}, "datePublished": "December 19, 2014", "dateModified": "April 19, 2015", "description": "A high quality diet is fundamental to your dog&#039;s health, but do you know why? Learn about some common dog illnesses that are directly affected by diet.", "articleBody": "A high quality, well-balanced diet is fundamental to your dog&#039;s health, but do you know why? Here are just a few canine health problems seen in dogs that are directly affected by their diet. 1. Obesity Obesity is a nationwide epidemic for our dogs, affecting over 50% of American dogs1. Even worse, dogs affected by obesity are more prone to arthritis, diabetes, high blood pressure, and cancer. According to the Association for Pet Obesity Prevention (APOP), decreased life expectancy is also linked to obesity in pets, and unfortunately, among all pets that veterinarians ultimately classified as obese, over 90% of dog owners initially thought their pet was in the normal weight range Pay special attention to the calorie and fat levels of your dog&#039;s food. While they are both important to the diet, an overabundance of either can cause or exacerbate obesity in dogs. Likewise, finding a proper dog diet that limits calories and fats can help trim down an overweight or obese dog and, ultimately, help your dog live a more healthy lifestyle. Determine your pet&#039;s ideal weight by consulting your veterinarian or by using petMD&#039;s Healthy Weight Calculator. 2. Pancreatitis Pancreatitis develops when the pancreas becomes inflamed, causing the flow of digestive enzymes to be released into the abdominal area. If this occurs, the digestive enzymes will begin to break down fat and proteins in the other organs, as well as in the pancreas. &quot;In dogs, dietary fat is known to be associated with the development of pancreatitis and can stimulate the secretion of a hormone that induces the pancreas to secrete its digestive hormones,&quot; says Jennifer Coates, DVM. Consult your veterinarian to see if your dog&#039;s current dietary fat intake may be increasing his or her risk of pancreatitis. If your dog is already suffering from pancreatitis, Dr. Coates recommends a bland dog diet that is low in fat and easily digestible. 3. Bladder Stones All bladder stones are not created equal. They can be composed of different types of minerals and other substances. For example, calcium oxalate bladder stones are primarily composed of calcium while struvites are primarily composed of magnesium and phosphates (phosphorus). Bladder stones may start out small, but over time can grow in number and/or size, causing issues such as urinary accidents, discolored urine, and urination straining. Speak with a veterinarian if you believe your dog is suffering from bladder stones. They can identify the type of bladder stone and recommend a food to dissolve the stone, or surgery to remove it if it is a type that cannot be dissolved with food, like calcium oxalates. They can also recommend a special diet that can help deter the formation of bladder stones. Even if your dog isn&#039;t currently suffering from bladder stones, he or she may benefit from a diet that is lower in calcium and phosphorus. Your veterinarian will know what&#039;s best for your dog&#039;s situation. 4. Heart Disease Dogs often have issues with heart disease like we do, especially if their diet isn&#039;t properly balanced. One key factor to heart disease in dogs is their sodium (salt) intake. &quot;Increased sodium in the diet causes increased levels of sodium circulating in the blood,&quot; says Ken Tudor, DVM. &quot;These elevated levels of sodium cause water retention in the blood vessels and elevated blood pressure. As blood pressure increases the diseased heart must continue to enlarge to overcome the increased pressure in order to pump blood from the ventricles.&quot; Are you feeding your dog table scraps? Is your dog&#039;s current food too high in sodium? Talk to your veterinarian about these things and how your dog may benefit from a healthy diet that is lower in sodium. 5. Diarrhea Dogs frequently suffer from bouts of diarrhea, but there are two main types of diarrhea: small bowel and large bowel diarrhea. &quot;Dogs with small bowel diarrhea typically produce large amounts of soft stool but do so just a few times a day,&quot; says Dr. Coates. &quot;When abnormalities are centered in the colon, affected dogs will usually strain to produce small amounts of watery stool frequently throughout the day. This is large bowel diarrhea.&quot; &quot;For large bowel diarrhea,&quot; says Dr. Coates &quot;a high fiber diet has been shown to be beneficial. Ideally, both soluble fiber (the type colonic bacteria use for food) and insoluble (indigestible) fiber should be included.&quot; For small bowel diarrhea, Dr. Coates recommends a bland, low fat, easily digested diet. Discuss with your veterinarian how fat, fiber, calcium, phosphorus, and other dietary nutrients play an important role in your dog&#039;s health. He or she may even have important new dietary recommendations to consider for your dog&#039;s specific life stage and lifestyle. 1Association for Pet Obesity Prevention"}]