[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Do I Do If My Dog Ate a Chicken Bone?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-begging-for-food-picture-id496261385.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-begging-for-food-picture-id496261385.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/what-do-i-do-if-my-dog-ate-chicken-bone"}, "datePublished": "August 23, 2019", "dateModified": "August 16, 2022", "description": "Dogs love to eat bones, but are chicken bones safe for them? Find out if it’s dangerous and what to do if your dog has eaten a chicken bone.", "articleBody": "You only left the kitchen for a minute, but when you return, it’s already too late. The roasted chicken you just pulled out of the oven is gone. The only potential culprit is sitting on the floor, panting, wagging his tail and looking quite pleased with himself—as if the cat is clearly to blame. You panic when you realize that your dog has eaten the chicken bones, too. Do you rush him to the vet immediately? Here’s what you need to do and watch out for if your dog ate chicken bones. Is It Bad for Dogs to Eat Chicken Bones?  Dogs have been eating bones for thousands of years, and most of the time, they process them just fine. Typically, chicken bones will dissolve once they hit the stomach—before they have a chance to become dangerous. Most times, dogs are able to pass chicken bones uneventfully. Other bones, such as beef and pork bones, can cause significantly more distress and disease. However, there are some potential hazards for dogs that are tempted to eat chicken bones. Potential Obstruction  Cooked bones tend to be slightly softer than raw bones, but some (such as the thigh bone) can be quite large relative to the size of the dog.  If a dog swallows—or tries to swallow—a chicken bone, and it does not go all the way down, it can become lodged in the esophagus. This can cause a lot of gagging, drooling and retching. In other dogs, the bone can become stuck in the upper part of the airway—either the back of the throat (the pharynx) or the start of the airway itself. This is an immediate emergency in which the dog will show significant signs of distress and might cough heavily or have trouble breathing. Risk of Tearing the GI Tract  Chicken bones splinter easily, and when they are swallowed, they can cause perforation of the esophagus or the intestinal tract. Contamination From Bacteria Particularly if the chicken is uncooked, your dog is at risk of exposure to bacteria like salmonella. What to Do If Your Dog Chokes on a Chicken Bone If you are concerned that the bone is stuck in the upper airway or the upper intestinal tract, this is an emergency and should be addressed immediately. If you are able to see or grasp the bone to get it out, you should do so as long as you are able to without distressing your dog further or getting hurt or bitten.  However, if it is not immediately visible, take your pet to the vet as quickly as possible. If you suspect that your dog has eaten a chicken bone and they display any of the following symptoms, take them to your veterinarian immediately: Poor appetiteVomitingDiarrheaLethargyGagging or retchingDroolingCoughingHaving trouble breathingIf your dog is active, is eating well and seems completely normal, it’s generally safe to simply monitor the situation. As a rule, avoid feeding your dog bones altogether. If your dog does get ahold of a chicken bone and he appears distressed, act quickly and call an emergency vet. If your dog seems to be acting completely normal, it will all probably come out fine in the end (pun fully intended!). By: Dr. Sandra Mitchell, DVM Featured Image: iStock.com/fotyma"}]