[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/1nr29jgxpm", "@type": "VideoObject", "duration": "PT1M20S", "name": "5413927586001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/c233a230e88379aac58b75ed7cf167754611b815.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/1nr29jgxpm", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/48d71bb020bd869bac2ce044ca6ee6042413a8aa.m3u8", "transcript": "When today's pet parents browse through the aisles of pet food stores. They have a wide variety of options to choose from when it comes to protein sources for their dogs. The main protein options for pets used to be chicken or beef. And while those two meats are still popular.\n\nThere are other novel proteins out there that pet parents can try. One such less common meat option for dogs is duck. Duck is rich in iron and it provides dogs the lean easy to digest protein source. Duck is also a great source of amino acids, which helps to support strong muscles.\n\nFoods formulated with Duck are sometimes recommended for dogs suffering from food sensitivities or food allergies. Some dogs are allergic to chicken or beef and dog food. So switching to a food with a more novel protein like duck may help alleviate gastrointestinal upset or skin irritation. Pet parents that are looking to feed cooked or raw duck to dogs may find the practice too cost prohibitive.\n\nSince duck often has a higher price tag than many other lean meats duck meat may also be difficult to find in some grocery stores before feeding your dog any duck meat or any pet foods formulated with Duck. Make sure to consult your veterinarian to ensure that it's the best option for your pet.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/healthy-foods-checklist-duck-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Healthy Foods Checklist: Duck for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/benefits-duck-for-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/benefits-duck-for-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/healthy-foods-checklist-duck-dogs"}, "datePublished": "April 28, 2017", "dateModified": "August 16, 2022", "description": "Duck is rich in iron and it provides dogs with a lean, easy-to-digest protein source. Learn all about the benefits of duck meat for dogs.", "articleBody": "When today’s pet parents browse through the aisles of pet food stores, they have a wide variety of options to choose from when it comes to protein sources for their dogs. The main protein options for pets used to be chicken or beef, and while those two meats are still popular, there are other novel proteins that pet parents can try. One such less common meat option for dogs is duck. Duck is rich in iron and it provides dogs with a lean, easy-to-digest protein source. Duck is also a great source of amino acids, which helps to support strong muscles. Foods formulated with duck are sometimes recommended for dogs suffering from food sensitivities or food allergies. Some dogs are allergic to chicken or beef in dog foods, so switching to a food with a more novel protein like duck may help alleviate gastrointestinal upset or skin irritation. Pet parents that are looking to feed cooked or raw duck to dogs may find the practice too cost prohibitive, since duck often has a higher price tag than other lean meats. Duck meat may also be difficult to find in some grocery stores. Before feeding your dog any duck meat or any pet foods formulated with duck, make sure to consult your veterinarian to ensure it’s the best option for your pet."}]