[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/2mcztolgiw", "@type": "VideoObject", "duration": "PT1M10S", "name": "5324820000001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/0aa23fcc4ba212f02ade96153e45a4b5c8eb8718.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/2mcztolgiw", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/0de6a0c43564cd5dffc4bde3e760ff06dd8a60a5.m3u8", "transcript": "Thomas", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/which-fruits-can-dogs-eat?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Which Fruits Can Dogs Eat?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-peering-over-table-at-fruit.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-peering-over-table-at-fruit.jpg"}, "author": {"@type": "Person", "name": "Ellen Malmanger, DVM", "url": "https://www.petmd.com/author/dr-ellen-malmanger"}, "keywords": "Dog, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/which-fruits-can-dogs-eat"}, "datePublished": "June 30, 2020", "dateModified": "July 11, 2023", "description": "A veterinarian explains whether dogs can eat fruits like watermelon, strawberries, blueberries, bananas and others.", "articleBody": "Dogs are omnivorous, which means that they can digest both animal and plant materials. They can eat some fruits, but other fruits are toxic to dogs, such as grapes and raisins. Due to the balanced nature of high-quality, nutritionally complete commercial diets, it’s not necessary to supplement your dog’s diet with fruits, but it can be fun to use them as treats. Check out this list to see which fruits are safe, and be sure to ask your veterinarian before supplementing your pet’s diet. Dogs dealing with obesity, diabetes, bladder stones, and other conditions should not be fed fruit without consulting your veterinarian first. Here are some dog-friendly fruits and what to watch for, plus some fruits you should never feed your dog. Apples Most dogs love apples! They are safe and healthy for dogs to eat and contain many nutritional benefits like vitamins A and C, fiber, potassium, and antioxidants. Apples are also low in calories, and the crunchiness of an apple can help promote dental health. Be sure to always remove the stem, leaves, core, and seeds, and to cut the apple into small pieces to avoid potential choking or intestinal blockages. Apple seeds contain cyanide, which is poisonous to dogs, but it would take a huge number of seeds to cause cyanide poisoning—about 100 apples’ worth for a small dog, 200 for a medium-sized dog, and 300 for a large dog. If your dog eats a small amount of apple seeds, it shouldn’t be an issue. Bananas Although dogs can eat bananas, they should not be given banana peels, as these are difficult to digest and could cause intestinal blockage. Bananas are high in fiber, potassium, and vitamins B6 and C. However, they are also higher in sugar than many other fruits, so they should be given sparingly. They should be cut into small, bite-size pieces. Blackberries and Raspberries Yes, dogs can eat raspberries and blackberries in moderation. Berries are packed with antioxidants and phytochemicals, which are chemical compounds in plants that have been found to help fight cancer in humans. They are also low in sugar and calories. Blackberries and raspberries, however, also contain small amounts of naturally occurring xylitol. This is a sweetener that is used in a lot of low-sugar foods. It’s very toxic to dogs in large amounts, but your dog would have to eat a lot of berries to cause hypoglycemia, and a huge amount for it to be lethal. A small handful a day should be the limit. Blueberries Blueberries are low in calories and high in vitamin C, fiber, antioxidants, and phytochemicals. Blueberries have been shown to improve night vision, help prevent cell damage, and help with mental function in aging animals. Cantaloupe Cantaloupe is healthy and nutritious for dogs to eat. It’s high in fiber and low in calories. It also contains numerous vitamins and minerals, including vitamins A and C, folate, fiber, and potassium. Cantaloupe is also 90% water, so it’s great for hydration. Just watch out for the high sugar content—especially if your dog struggles with diabetes or obesity. And always remove the rind and seeds before feeding cantaloupe to your dog. Cranberries Cranberries are a great snack for dogs. They are not only safe, but they are considered a superfood for both humans and dogs. Cranberries are high in fiber and antioxidants, and they contain vitamins C, E, K, B1, and B2, plus manganese and copper. If you’re wondering whether cranberries can help prevent urinary tract infections, we don’t have the research yet to back up this claim. In reality, your dog probably won’t consume enough cranberries to see this benefit even if it is proven to be true. Dried cranberries are a safe treat for pups, too. Just be aware that the amount of sugar per ounce is more concentrated when a fruit is dehydrated. Store-bought dried cranberries often have added sugars, preservatives, or even xylitol—which is toxic to dogs. So it’s best to dry them with a dehydrator at home. Honeydew Honeydew is safe and healthy for dogs to eat. It contains vitamin C, potassium, and fiber, and it’s low in calories. And much like cantaloupe and watermelon, honeydew contains a high percentage of water—making it great for hydration. Always remove the rind and seeds before feeding honeydew to your dog to avoid any potential choking hazards or intestinal blockages. Mango Mangoes are also high in sugar and should only be fed to dogs in moderation. However, they are high in many nutritional benefits like fiber, potassium, and vitamins A, B6, C, and E. Be sure to remove the mango seed, and cut it into small pieces when feeding it to your dog. Oranges Oranges are a safe and healthy treat for dogs to eat. They are a great source of vitamin C, potassium, and fiber. And while most dogs love the sweet taste, some dogs don’t like the acidity of citrus fruits. Oranges are not a good choice for dogs who struggle with obesity or diabetes because of the high sugar content. And eating too many oranges can give any dog an upset stomach from the high acidity and sugar levels. So be sure to feed them as a treat in small portions. Peaches Yes, peaches are a great snack for dogs—in moderation. They are filled with great health benefits like high fiber, low calories, and low fat. Plus, peaches contain antioxidants and plenty of vitamins and minerals. However, peaches also have high sugar content, and you need to remove the stem, leaves, and pit before feeding peach pieces to your dog. The peach pit—or stone—can be a dangerous choking hazard, or even cause an intestinal blockage. Pears Dogs can safely eat pears. They contain health benefits like fiber, copper, vitamin C, and vitamin K. But before you feed any pears to your pup, remove the stem, leaves, pit, and seeds. Any of these could become choking hazards, and the seeds in pears contain traces of cyanide—just like apple seeds. It’s best to stick with fresh pears and avoid canned pears because they contain so much more sugar. Pineapple Pineapples are good for hydration, antioxidants, and numerous vitamins and minerals like vitamin C, manganese, copper, and vitamin B6. This fruit is great for supporting your dog’s immune and digestive systems. Some dogs may not like pineapples because of the strong acidity. Keep in mind that the high sugar content and acidity in large amounts can upset your dog’s stomach. Plus, large amounts of sugar over time can lead to health issues like obesity or diabetes in dogs.  Strawberries Strawberries are a good source of vitamin C, potassium, fiber, and antioxidants. Strawberries can also help strengthen the immune system. They should be cut into small pieces to avoid choking, and they can be mashed or pureed for smaller dogs. Watermelon Yes, dogs can eat watermelon, but the watermelon rinds and seeds (even the pale seeds in seedless watermelons) should be removed before giving the fruit to your dog, as they can cause choking or intestinal blockage. Watermelon is 92% water, so it’s a great treat for hot days. It can help keep your dog hydrated and is refreshing when frozen. Watermelon is also a good source of vitamins A, B6, and C, as well as potassium. Fruits That You Should Be Careful About Feeding to Dogs These fruits fall into a gray area, and it might be best to avoid giving them to your dog. Avocado: Although the actual pulp is not toxic to dogs, the pit can cause intestinal blockage, and the high fat content can cause some dogs to have pancreatitis or stomach upset, even from just a small amount. Tomatoes: The ripe fruit is not toxic to dogs, but eating too much can cause stomach upset. Eating parts of a tomato plant itself can also cause gastrointestinal (GI) upset. Fruits That Are Toxic to Dogs These fruits are toxic to dogs and should never be offered to them as a snack. Grapes/raisins: Never feed grapes or raisins to your dog, just to be on the safe side. They may be toxic to some dogs, even in small amounts. But there is no way of knowing how your dog will react. If your dog has eaten any grapes or raisins, contact your veterinarian immediately and take them to the vet’s office or an emergency vet. Time is of the essence when it comes to treatment for grape toxicity. Wild berries: Never feed your dog wild berries, as they can be easily misidentified, and many are toxic to dogs. Can Dogs Eat Fruit Snacks? No, dogs should not eat fruit snacks. While fruit snacks are not considered toxic to dogs, they are very high in sugar, so they should be avoided. How to Add Fruit to Your Dog’s Diet Here are some tips for adding a little dog-safe fruit to your dog’s diet. How Much Fruit Can a Dog Have? Treats should take up no more than 10% of your dog’s diet. This also applies to fruit. If you are giving your dog fruit in addition to other dog treats, make sure that you adjust the amount of treats given so that you do not exceed this 10% recommendation. Even if a fruit isn’t toxic to dogs, too much of anything can give them an upset stomach. Keep an eye out for the typical symptoms of an upset stomach: Vomiting Diarrhea Decreased appetite or loss of appetite Fatigue Acting depressed Looking uncomfortable Gulping or licking their lips, the air, or objects How to Safely Prepare Fruit for Your Dog Fruit should be washed thoroughly before being fed to your dog. Remove any leaves, stems, seeds, pits, or rinds. Cut the fruit into small pieces and give them a small amount. Canned fruit in syrup should never be given due to the high sugar content. Pieces of fruit can be given as individual treats or mashed up and added to your dog’s meals. Fruit can cause a choking hazard for small dogs, so always monitor your dog while they are eating. Watch for Gas, Vomiting, or Diarrhea Some dogs are more sensitive than others and may have flatulence (gas), vomiting, and/or diarrhea if given fruit. Even dogs with strong stomachs can end up with GI upset like vomiting and diarrhea if given too much fruit, due to its high fiber content. If you want to safely give your dog fruit as a snack, start slowly and watch for any signs of GI upset before making it a regular treat. If you do notice any of the signs of GI upset, stop feeding your dog any fruit and call your veterinarian. Which Other Foods Are Safe for Dogs? Your dog can also safely enjoy these foods: Asparagus Bell peppers Broccoli Brussels sprouts Carrots Celery Green beans Peanut butter (give sparingly and avoid peanut butter with xylitol, which is toxic to dogs; usually found in “no sugar” or “low sugar” peanut butter) Peas Pumpkin (canned plain pumpkin, NOT pumpkin pie mix) Plain rice Sweet potatoes Zucchini Which Foods Are Not Safe for Dogs? Do not give your dog these foods: Alcohol Bread dough Butter Caffeine Chocolate Coffee Citrus peels/oil Garlic Macadamia nuts Milk/dairy Mushrooms Onions Raw/undercooked meat, eggs, and bones Salty food Sugar Xylitol (artificial sweetener) Featured Image: iStock.com/Bratislav Stefanovic"}]