[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Pineapple?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/rescue-dog-attempting-to-eat-and-steal-a-pineapple-by-a-pool-in-bali-picture-id1098148832.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/rescue-dog-attempting-to-eat-and-steal-a-pineapple-by-a-pool-in-bali-picture-id1098148832.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-pineapple"}, "datePublished": "July 27, 2022", "dateModified": "June 29, 2023", "description": "Learn whether pineapple is good for dogs and how much you can let your dog eat.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be okay for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Pineapple is a tasty treat for us, but is it okay for dogs to eat? When given correctly, and in the appropriate portion size, this tropical fruit can also be a safe and healthy treat for puppies and adult dogs alike.  Is Pineapple Good for Dogs? Pineapples contain multiple vitamins and minerals that help support your dog’s immune system and digestive system. Your dog could also benefit from the antioxidants found in pineapple such as flavonoids, phenolic acids, and bromelain. And just like watermelons, pineapples contain a high percentage of water, which promotes hydration.  Although your dog won’t experience major benefits from small pineapple pieces as occasional treats, they are definitely a healthy snack choice. Feeding dog-safe fruits to your pup is a much more nutritious option than table scraps that may be harmful to pets. Check out some of the vitamins and minerals found in pineapples:  Vitamin C Vitamin B6 Vitamin A Vitamin K Thiamin Riboflavin Niacin Folate Manganese Copper Potassium Magnesium Iron Calcium Phosphorus Zinc Can Too Much Pineapple Be Bad for Dogs? Yes, like most things, too much pineapple can be a bad thing for dogs. Pineapples have a high fiber content, which is great for the digestive tract, but too much fiber can actually cause your dog to have an upset stomach.  Pineapples also have a high sugar content, which can also lead to an upset stomach. If your dog eats too much sugar on a regular basis, they can develop health problems over time like dental issues, obesity, and diabetes. For proper portion sizes, check out our guidelines below.  Can Pineapple Stop a Dog From Eating Poop? There’s a tale that many dog owners believe about pineapple stopping a dog from eating poop. The idea is that the antioxidant bromelain, which is found in pineapple, will make your dog’s poop taste bad to them, therefore stopping them from eating their own feces.  However, there’s no hard evidence proving this theory. If your dog does persist with this unfortunate habit, talk with your veterinarian.  Sometimes eating poop is just a bad habit that your dog has formed over time. But there could also be underlying health issues causing their desire to eat animal poop. Contact your veterinarian to find out if this applies to your dog and what the best next steps would be. Can Dogs Eat Canned Pineapple? Although canned pineapple is not toxic for dogs, it shouldn’t be used as a snack for your pup. Canned pineapple usually comes in a syrup that has very high sugar content. And that much sugar will most certainly upset your dog’s stomach. It’s best to stick with raw pineapple.  Can Dogs Eat a Pineapple Core? When feeding your dog pineapple, it’s crucial to always remove the core, stem, leaves, and skin. All of these can become choking hazards for your dog, and even cause an intestinal blockage.  If your dog has eaten the core of a pineapple, contact your veterinarian immediately. It’s too difficult for your dog to digest and could cause serious problems.  Can Dogs Eat Dried Pineapple? If you are going to dehydrate the pineapple yourself, dried pineapple can be a safe and easy treat for your dog. Just make sure it’s not so hardened that it becomes a choking hazard. The process of drying the fruit also concentrates the sugars. Store-bought dried fruits typically contain a large amount of added sugar, which is not good for your dog’s overall health. This could cause an upset stomach, diarrhea, or vomiting. They also often contain preservatives that could be dangerous for your dog. If your dog has already eaten some, check the ingredients list for any hazardous ingredients for dogs, such as xylitol. Contact your veterinarian, just to be safe. Can Dogs Eat Cooked Pineapple? As long as there are no ingredients added to the cooked pineapple, your dog should be fine to eat it in small amounts. Just be sure it’s not so hot that it will burn their mouth.  However, if you’re cooking the pineapple with other things like garlic and onion, do not feed it to your dog. Garlic and onion are both toxic to dogs. If your dog has eaten just a little bit, they will probably only suffer some stomach upset. But if they have eaten a large amount, this could be hazardous. Take them to your veterinarian immediately. Can Dogs Eat Pineapple Cake? You shouldn’t share pineapple cake with your dog. Although pineapple itself is healthy, pineapple cake has too much sugar for your dog and could make them sick. There’s also the risk of additional ingredients that are toxic to dogs, like nutmeg or xylitol. If your dog ate pineapple cake, especially if it has either of these ingredients, contact your veterinarian right away. How Much Pineapple Can a Dog Eat? Any kind of treat should only make up 10% of your dog’s overall diet—even the healthy ones. The other 90% of your dog’s diet should come from well-balanced dog food.  Below are some general guidelines for safely feeding raw pineapple to your dog based on their weight. Always make sure to remove the core before feeding pineapple to your dog. Each “piece” should only be about 1 inch x 1 inch x ¼-inch thick.  For pineapple that you’ve dehydrated, rehydrate the pieces or give your dog a little less than the following recommended amounts, since dehydrating concentrates the sugars. Extra-small dog (2-20 lbs.) = 1-2 pieces of pineapple          Examples: Yorkies, Chihuahuas, Pomeranians, Pugs Small dog (21-30 lbs.) = 2-3 pieces of pineapple          Examples: Basenjis, Beagles, Miniature Australian Shepherds Medium-size dog (31-50 lbs.) = 5-6 pieces of pineapple          Examples: Basset Hounds, Border Collies, Australian Cattle Dogs Large dog (51-90 lbs.) = handful of pineapple pieces          Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds Extra-large dog (91+ lbs.) = large handful of pineapple pieces          Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees If your dog accidentally ate too much pineapple, watch for the following symptoms: Vomiting Diarrhea Lethargy Constipation Decreased appetite or loss of appetite Flatulence If you do notice any of the above symptoms, contact your veterinarian.  How to Safely Feed Your Dog Pineapple Pineapple can be a fun and healthy treat for dogs. Here are some easy ways to safely feed it to them.  Raw pineapple: Cut the pineapple into ¼-inch thick pieces and feed it to your dog as little treats.  Dried pineapple: Cut raw pineapple into ¼-inch thick pieces and dry it with a dehydrator at home.  Frozen pineapple: Cut raw pineapple into ¼-inch thick pieces, then freeze it to feed to your dog later as a cold, crunchy treat.  Fruit smoothie: Blend up a little pineapple with other dog-safe fruits like strawberries, bananas, or blueberries. You can even mix the fruit with a sugar-free, xylitol-free, plain yogurt. Then put this mixture into your dog’s KONG toy to freeze for later. They will love licking up this delicious combination!  Pina colada mocktail: Try this recipe for a dog-safe pina colada with pineapple, banana, mango, and Rescue Remedy. Featured image: iStock.com/Lindsay Lou"}]