[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Mango?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/mangifera-indica-mango-tommy-fruit-in-the-traditional-colombian-picture-id1329695521.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/mangifera-indica-mango-tommy-fruit-in-the-traditional-colombian-picture-id1329695521.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-mango"}, "datePublished": "July 27, 2022", "dateModified": "June 29, 2023", "description": "Is mango good for dogs? Find out whether dogs can safely eat this fruit and whether it provides any benefits for your pup.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be okay for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Yes, dogs and puppies can eat mango. These sweet, delicious fruits are packed full of great nutrients. However, they do have a high sugar content, so you should only give mango to your dog in small portions.  Is Mango Good for Dogs? Mangoes are safe and healthy for most dogs, as long as they don’t have diabetes. Just like many other dog-safe fruits, they have many nutrients. They are high in fiber and contain both alpha-carotene and beta-carotene as well as these vitamins and minerals: Vitamin A Vitamin B6 Vitamin C Vitamin E Potassium Although your dog can benefit from these nutrients, they should only eat mango in moderation. Can Mango Be Bad for Dogs? Mangoes are not toxic to dogs, but they do contain a higher carb content as well as a high sugar content. And feeding your dog lots of sugar over a long period of time can cause them to have problems with obesity, diabetes, oral health, and stomach upset.  If your dog already struggles with obesity or diabetes, then mangoes aren’t the right choice for them. Always consult your veterinarian about the proper food choices for your dog’s dietary needs.  Although some people have been known to be allergic to mangoes, there are no documented cases of a mango allergy in dogs. The allergen that causes the reaction in some people is a compound in the mango skin called urushiol. The same compound can be found in plants like poison ivy or poison oak.  Can Dogs Eat Dried Mango? If you dehydrate fruit at home, then dried mango can be safe for dogs. Just remember to feed them smaller portions than normal, because now the sugar content has become more condensed.  Avoid feeding store-bought dried mango to your dog. There are usually other preservatives and ingredients, including more sugar. Can Dogs Eat Mango Seeds? Mangoes contain one long, flat seed in the center that looks like a pit. Remove this seed before feeding any mango to your dog. It can be a choking hazard or cause an intestinal blockage. How Much Mango Can a Dog Eat? When it comes to feeding mango to your pup as a special treat, keep the portions small and offer the fruit in moderation. Even healthy treats like mango should only make up 10% of your dog’s diet. The other 90% should come from a well-balanced dog food diet.  Here are some general guidelines for safe portion sizes to feed your dog mango pieces, based on your dog’s weight and breed size:   Extra-small dog (2-20 lbs.) = 1-2 pieces of mango (½-inch wide by ¼-inch thick)           Examples: Yorkies, Chihuahuas, Pomeranians, Pugs Small dog (21-30 lbs.) = 2-3 pieces of mango (1-inch wide by ¼-inch thick)           Examples: Basenjis, Beagles, Miniature Australian Shepherds Medium dog (31-50 lbs.) = 5-6 pieces of mango (1-inch wide by ¼-inch thick)           Examples: Basset Hounds, Border Collies, Australian Cattle Dogs, Siberian Huskies Large dog (51-90 lbs.) = handful of mango pieces (1-inch wide by ¼-inch thick)           Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds Extra-large dog (91+ lbs.) = large handful of mango pieces (1-inch wide by ¼-inch thick)           Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees If your dog ate some mango when you weren’t watching, or you accidentally fed them too much, keep an eye out for the following symptoms of an upset stomach. Contact your vet right away if you see: Decreased appetite or loss of appetite Fatigue Acting depressed Looking uncomfortable Gulping or licking their lips, the air, or objects If you notice any of these more serious symptoms, take your dog to the vet immediately: VomitingExcessive diarrheaBlood in their vomit or stoolWeaknessCollapseHow to Feed Your Dog Mango When feeding mango to your dog, thoroughly wash it first, peel off the skin, and remove the seed. Then cut the fruit into small, 1-inch cubes.  Raw You can easily feed small cubes of raw mango straight to your pup.  Mashed Once you’ve cut up some mango, you can mash it up to add to your dog’s food bowl, or to put in their KONG toy. Frozen For a frozen treat later, simply place the stuffed KONG in the freezer, or freeze some cubed mango pieces. Smoothie To make an extra-special treat, blend some mango with other dog-safe fruits like blueberries, watermelon, and bananas. Then add a little bit of completely plain, sugar-free, xylitol-free yogurt. You can pour this mixture on top of your dog’s food or freeze it in your dog’s KONG toy for later.  You can also try this recipe for a dog-safe green smoothie with banana, mango, and pineapple. Featured image: iStock.com/Luis Echeverri Urrea"}]