[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Food Ingredient and Label Guide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/pet-food-ingredient-bowl.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/pet-food-ingredient-bowl.jpg"}, "author": {"@type": "Person", "name": "Amanda Ardente, DVM, PhD", "url": "https://www.petmd.com/author/dr-amanda-ardente"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/pet-food-ingredient-and-label-guide"}, "datePublished": "September 16, 2020", "dateModified": "August 16, 2022", "description": "Nutrition consultant and veterinarian Amanda Ardente provides the ultimate guide to ingredients in dog food and cat food.", "articleBody": "Choosing the right food for your pet can be a big decision, and one that weighs heavy on the minds of many pet owners. There are so many options out there—dry, canned, freeze-dried, raw, “all-natural,” grain-free, etc.—and even more information and opinions to support or refute these various options. And then you need to decipher the list of cat food or dog food ingredients in each potential formula to know what you are actually feeding your pet. So where does one start? How do you make an informed decision about which diet is best for your dog or cat? This guide will break down pet food labels and some common ingredients in dog food and cat food so that you can find the best food for your pet. Jump to a section here: Nutritional Needs and Requirements Understanding Pet Food Package Terms Understanding Ingredient Labels Glossary of Cat Food and Dog Food Ingredients Nutritional Needs and Requirements The single-most important consideration in selecting a pet food is ensuring that the diet meets your pet’s nutritional needs of more than 30 essential nutrients, including: Protein Amino acids Fatty acids Vitamins Minerals The right pet food should provide all nutrients in sufficient quantity and with appropriate ratios for your pet’s given life stage. That means that your pet’s food should provide enough calories to maintain their body weight at their particular life stage (e.g., adult maintenance, puppy/growth, geriatric, etc.). AAFCO Approval and Label Requirements A diet that meets these basic nutritional needs is referred to as “complete and balanced,” which should be indicated on the label as the Nutritional Adequacy Statement by the Association of American of Feed Control Officials (AAFCO).1 Additional label information required by the Food and Drug Administration (FDA) includes the following: Product identification (what it is) Net quantity Manufacturer or distributor name and address Ingredient list AAFCO recommends also including: Feeding directions Guaranteed analysis Caloric content Understanding Pet Food Package Terms Pet foods are often labeled with eye-catching phrases, like “all-natural,” “organic,” or “wholesome.” These terms sound similar but can mean quite different things about the product. Some of these terms are regulated by AAFCO and the FDA, while others are not. It’s important to know the difference and what these words actually mean.   Here is an abbreviated version of the AAFCO definition that can help guide you, but if you want more information, visit AAFCO Talks Pet Food. Regulated Terms: USDA, FDA, and/or AAFCO  Organic This term is regulated and is signified with a USDA Organic Seal.  The United States Department of Agriculture (USDA) Organic seal means that the pet food production and handling adhere to the requirements established by the USDA’s National Organic Program for human food regulation. Certified organic pet foods must be made of at least 95% organic ingredients, and the use of synthetic fertilizers, sewage sludge, irradiation, and genetic engineering is not permitted.1 Human-Grade There is no true definition for this in animal feed regulations, but according to AAFCO, for a pet food to be considered “human-grade,” every ingredient must be “human edible” and “manufactured, packaged, and held in accordance with federal regulations.” Very few pet foods can meet this standard, so if you see “human-grade” on the label, you might want to call the company to ask about their manufacturing procedures .1 Terms That Are Not Regulated Natural, All-Natural, or 100% Natural The label claim of “natural” has a loose definition. Natural dog or cat food ingredients must be of plant, animal, or mined sources, which most ingredients are, and can undergo any manufacturing process except a chemically synthetic process. Chemically synthesized ingredients include many vitamins and minerals, preservatives, and flavor and/or color additives. “All-natural” or “100% natural” means that every ingredient used complies with this, or the label can specify certain ingredients as “natural” (e.g., “natural chicken flavor”). If a product is “all-natural” or “100% natural,” it is not likely to be complete and balanced, because most vitamins and minerals that are added to pet foods are synthetic. Therefore, supplementation would likely be necessary to meet your pet’s specific nutrient requirements.1 Holistic or Wholesome The terms “holistic” and “wholesome” are used to imply “whole-body health,” but they do not tell you anything about what ingredients are included, how or where the ingredients were sourced, or how the product was manufactured or handled. Raw Most manufactured retail pet foods are not truly raw, as heat processes are often used to prevent bacterial growth. If a food is labeled as raw and is not misbranded, it’s important to follow sanitary handling practices for raw meat to minimize bacterial cross-contamination. Understanding the Ingredient Label Of the regulated information on a pet food label, most pet owners perceive the ingredient list to be the most important. The FDA requires that every ingredient included is named following the established AAFCO definitions and that ingredients are listed in descending order of predominance by weight. This means that the heaviest ingredients are listed first. Quality and Quantity of Cat and Dog Food Ingredients The list does not provide any information on the quality of the cat or dog food ingredients included or whether they are used in amounts that provide any sort of nutritional benefit to your pet. For example, ingredients that appeal to pet owners, like blueberries and kale, probably provide little nutritional benefit to your pet because of the relatively small quantities added, whereas poultry by-product sounds less appealing but is included as a primary ingredient because it provides your pet with essential nutrients.   Contacting the Pet Food Manufacturer If you ever have a question about the ingredients in cat food or dog food, do not hesitate to do a little homework. Some pet food manufacturers have very descriptive websites with lists of commonly used ingredients and descriptions, but if you cannot find the information there, contact the manufacturer. A responsible pet food manufacturer should provide you with the ingredient information, including the source and why it is included in their formulation. Glossary of Cat and Dog Food Ingredients The list of ingredients in cat food and dog food can be exceptionally long with confusing terminology. However, it’s important to understand the established definitions for those terms so that you can make a well-educated decision on which food to feed your pet, rather than a decision led by perception. Here’s a breakdown of some of the most common cat food and dog food ingredients and what they mean. Jump to a specific term here: Amino Acids  Arginine | Histidine | Isoleucine | Leucine | Lysine | Methionine | Phenylalanine | Taurine | Threonine | Tryptophan | Valine | L-carnitine | L-lysine monohydrochloride | L-cysteine | DL-methionine Animal Products  Animal By-Product Meal | Animal Digest | Dried Egg Product | Meat | Meat and Bone Meal | Meat By-Products | Meat Meal | Poultry | Poultry By-Products | Poultry By-Product Meal | Poultry Meal Fats/Oils  Animal Fats | Coconut Oil | Fish Oils | Glycerin | Palm Kernel Oil | Vegetable Oils Gums Carrageenan | Cassia Gum | Guar Gum | Xanthan Gum Hydrolyzed Protein Plant Products  Cellulose Grains | Bran | Gluten | Hull | Meal and Flour | Middlings (“Midds”) | Starch Corn | Whole Corn, Ground Corn, Cornmeal, and Corn Flour | Corn Starch | Corn Gluten  Legumes (Beans, Lentils, Peas, Soybean) | Peas | Pea Fiber | Pea Protein | Pea Starch | Soybean Flour  Root Vegetables | Beet Pulp | Cassava Root Flour | Potato Protein | Potato Starch | Potatoes Minerals Boron | Calcium | Chloride | Chromium | Cobalt | Copper | Fluorine | Iodine | Iron | Magnesium | Manganese | Molybdenum | Phosphorous | Potassium | Salt/Sodium Chloride | Selenium | Sodium | Sulfur | Zinc Natural Flavors Preservatives  Artificial Preservatives | Butylated Hydroxyanisole (BHA) | Butylated Hydroxytoluene (BHT) | Ethoxyquin | Natural Preservatives | Ascorbic Acid (Vitamin C) | Calcium Propionate | Mixed Tocopherols Probiotics Bifidobacteria | Enterococcus | Lactobacillus Vitamins L-Ascorbyl-2-Polyphosphate | Menadione Sodium Bisulfate Complex | Vitamin B7 (Biotin) Amino Acids Essential amino acids are those that must be provided by a pet’s diet. They can be contained within animal or plant protein sources, meaning you won’t see them listed, or they can be added on their own, in which case you will see them listed. There are 10 essential amino acids for both cats and dogs, and one that is essential for cats2: Arginine Histidine Isoleucine Leucine Lysine Methionine Phenylalanine Taurine (essential for cats) Threonine Tryptophan Valine Depending on the ingredients of the pet food, other nonessential amino acids may still be added to ensure that the food is nutritionally complete and promotes certain health aspects. Other commonly added amino acids include: L-carnitine (for maintaining a healthy body weight) L-lysine monohydrochloride L-cysteine  DL-methionine Taurine (can be added to dog food) Animal Products (Meat) All animal products added to pet foods are defined and described by AAFCO.1 Each can provide a valuable source of protein and amino acids, and in sufficient quantity, meet the protein requirement of dogs and cats. The pet food industry utilizes many parts of animals that are not consumed by people but are still highly nutritious and commonly consumed by our canine and feline friends’ wild counterparts. This helps the overall production of meat to be a more sustainable practice. Animal By-Product Meal: Rendered (or processed) product from animal tissues, excluding hair, hooves, horn, hide, manure, or gastrointestinal (GI) contents. Animal Digest: Materials resulting from chemical or enzymatic degradation of clean animal tissue, excluding hair, horns, teeth, hooves, and feathers. Dried Egg Product: Eggs that have been separated from the shell and dried provide an excellent complete source of protein and fat, containing all essential amino acids and fatty acids. Meat: Clean muscle (skeletal, tongue, diaphragm, heart, esophagus) from mammals, with or without the accompanying fat, skin, nerves, and blood vessels. Meat and Bone Meal: Rendered (or processed) product from mammal tissues and bones, excluding hair, hooves, horn, hide, manure, or GI contents. Meat By-Products: Clean, non-rendered (not processed) parts of mammals other than muscle, usually consisting of organs, blood, and bone and not including hair, horns, teeth, and hooves. Meat Meal: Rendered (or processed) product from mammal tissues, excluding hair, hooves, horn, hide, manure, or GI contents. Poultry: Clean muscle (skeletal, tongue, diaphragm, heart, esophagus) from chickens, with or without the accompanying fat, skin, nerves, and blood vessels. Poultry By-Product: Clean parts of poultry carcass, including head, feet, organs, and whole carcass. Poultry By-Product Meal: Rendered (or processed) product from poultry tissues; can include necks, feet, undeveloped eggs, organs, and whole body, but excludes feathers. Poultry Meal: Rendered (or processed) product from poultry tissues, excluding head, feet, organs, and feathers. Fats/Oils Fats might not have a good reputation, but they are necessary and pose many benefits in pet food: Serve as a good source of energy Provide 2.25 times more calories than protein or carbohydrates Help with the absorption of fat-soluble vitamins A, E, D, and K Supply essential omega-3 and omega-6 fatty acids Add palatability to the food Omega-3 and Omega-6 The ratio of essential omega-3 and omega-6 fatty contents of various oils is important because the balance helps combat inflammation. Omega-3s are antioxidants, and a diet higher in omega-3s can have benefits for the skin, haircoat, joints, etc.4 Animal Fats: These can show up on labels with a specified source (e.g., chicken, beef, pork, etc.) or as unspecified (e.g., “animal fat” or “poultry fat”). Mammals and poultry sources tend to be higher in omega-6 fatty acids, whereas a fish source is higher in omega-3s. Coconut Oil or Palm Kernel Oil: Recent research has revealed the benefit of these “medium-chain triglycerides” in diets for aging dogs, particularly those with canine cognitive dysfunction, as they promote memory and the ability to focus.5 Fish Oils: Can have a specified source, like salmon oil, or show up as “fish oil.” Fish oils provide more omega-3 fatty acids. These consist of docosahexaenoic acid and eicosapentaenoic acid, and the quantities may be specified in the Guaranteed Analysis on a pet food label. Glycerin: A carbohydrate derived from fats and oils that is added to help retain moisture in soft (semi-moist or canned) diets. Vegetable Oils: Can have a specified source, like canola, sunflower, or safflower oils, or show up as “vegetable oil.&quot; Vegetable oils generally provide more omega-6 fatty acids. Gums Common gums in pet food are: Carrageenan Cassia gum Guar gum Xanthan gum These are sources of soluble fiber that increase the bulk and water content of the feces and increase production of short-chain fatty acids (SCFAs). SCFAs are important sources of energy for the cells of the colon, and they help promote water and electrolyte absorption in the large intestine.6 Hydrolyzed Protein A rich-source protein derived from either vegetable sources (soy, corn, wheat) or poultry feathers. The source ingredient is heated and chemically processed to generate a low-molecular-weight protein source that is: Highly digestible Easily absorbed Readily bioavailable Hydrolyzed proteins are found in hypoallergenic pet foods. The use of hydrolyzed poultry feathers has an added benefit of providing a sustainable protein option.2 Plant Products Plant products can provide a source of protein and/or carbohydrates/fiber, depending on the type and how it is processed. Cellulose Often referred to as “powdered cellulose,” it’s derived from the pulp of fibrous plants and provides a good source of insoluble fiber. This adds bulk to the diet, which offers satiation (the feeling of being full after a meal). Cellulose is also added to cat foods to minimize hairball formation. It draws water into the GI tract and helps hair, consumed while grooming, to move along and be excreted in the feces. Grains Common grains in pet foods include: Barley Corn Oats Rice Rye Wheat Whole Grain vs. Refined Grain Grains are categorized as either “whole grain,” meaning all parts of the grain are present (germ, bran, and endosperm), or “refined,” meaning they are processed with the germ and bran removed. The grain endosperm contains gluten and starch. These various parts of the grain can be used as ingredients in cat food and dog food, and each provides a different purpose and set of nutrients. These are important when considering certain pet health issues. For example, in diabetes, minimizing starch (found in endosperm) to reduce blood sugar spikes is the goal. And when managing obesity, it is important to optimize dietary fiber sources to help the pet feel full without providing additional calories. Grain By-Products Bran: This is the outer layer of the grain, just under the hull. Present in long-grain or brown rice and removed in processing to make white rice. Good source of fiber, omega-3 fatty acids, vitamins, and minerals. Gluten: A type of protein found in the endosperm of grains, after the starch has been removed, that provides an available and low-cost source of protein in pet food. For example, 1 gram of corn gluten meal contains approximately 50% more protein than 1 gram of chicken. Hulls: Hard outer covering of the grain that provides a source of insoluble fiber/roughage. Insoluble fibers increase the bulk and firmness of the feces but absorb water. Meal and Flour: Ground grains (whole or refined), where meal is a coarser grind than flour. If it comes from refined grains, meaning the bran and germ are removed, the meal/flour will have a high starch content. Middlings (“midds”): Small particles created during the grain milling process that are low in starch and good sources of protein, fiber, phosphorous, and other nutrients. Starch: The other component of grain endosperm, aside from gluten. Starch is a readily available carbohydrate that provides a source of energy.   Corn Corn can be included in pet foods in these forms: Whole Ground Meal Flour Starch Gluten Whole Corn, Ground Corn, Cornmeal, and Corn Flour: When properly milled, these provide a source of easily digestible carbohydrates that are used by dogs for energy. The finer the product is ground, (flour &gt; meal &gt; ground), the more easily digested it is. All of these forms also provide protein and amino acids, linoleic acid (omega-6 essential fatty acid), and antioxidants (beta-carotene, vitamin E). Corn Starch: Made from the starchy part of the corn kernel, it can be used as a thickening agent for dog foods and is reported to be the least allergenic form.3 Corn Gluten: A low-cost and viable protein source. Legumes Common legumes in pet foods include peas, lentils, soy, and beans, and they are often used as substitutes for grains in grain-free pet food diets. Legume By-Products Pea Fiber: Derived from ground pea hulls and provides a good source of both insoluble and soluble fiber. Pea Protein: A protein concentrate extracted from peas that provides iron and many of the essential amino acids, including lysine. Iron and lysine are both important for healthy muscles and a healthy immune system. Pea Starch: This is the starch component of the pea, separated from the protein component and hull. Provides a readily available source of energy and iron. Soybean Flour: The portion of the soybean leftover after the oil has been removed and the soybeans are ground into a fine powder. Soybean flour is a good source of protein, containing many essential amino acids, fiber, fatty acids, some B vitamins, and minerals like potassium. Root Vegetables Beet Pulp: Beet pulp is the fibrous by-product left over from sugar beet processing. It is a good source of both insoluble and soluble fiber, providing good fecal consistency and beneficial volatile fatty acids. Cassava Root Flour: Cassava root is cooked, dried, and ground to produce a fine powder flour. This provides a carbohydrate source for energy and a source of minerals, including iron, manganese, and zinc. Often used in grain-free diets. Potato Protein: A protein concentrate extracted from white potatoes. Good source of protein for limited-ingredient prescription pet foods. Potato Starch: Potato starch is added to grain-free diets as an alternative to grain. It is considered a “resistant starch,” meaning it is resistant to digestion in the small intestine, which may be beneficial for intestinal cell health and promote a healthy population of intestinal bacteria (“prebiotic”). However, these health benefits have not been proven yet in dogs and cats. Potatoes: White or sweet potatoes commonly provide a source of carbohydrate or starch, often used in grain-free pet food diets. Minerals The mineral requirements of dogs and cats may not be completely met by cat or dog food ingredients, so individual minerals are often added to supplement the diet. There are seven macro-minerals: Calcium Phosphorous Magnesium Sodium Potassium Chloride Sulfur There are 11 trace minerals: Iron Zinc Copper Manganese Molybdenum Selenium Iodine Cobalt Fluorine Chromium Boron Many mineral supplements are provided as a chemical compound (e.g., calcium carbonate) or as chelated (attached) to a carrier compound like an amino acid (e.g., zinc methionine, ferrous sulfate). Salt (Sodium Chloride): It is added in some veterinary prescription diets to promote thirst and water consumption. This helps to generate a less concentrated, or more “watered-down,” urine, which is beneficial in diseases of the urinary tract, like kidney disease or to help treat bladder stones.2 Natural Flavors Natural flavors are added to pet foods to enhance palatability and can include spices, broths, and yeast. Preservatives Preservatives are added to pet foods to maintain quality, palatability, and shelf-life longevity. Available as artificial additives or natural, but natural tend to be less effective, meaning that the product will have a shorter shelf life if no artificial preservatives are used.7 Artificial Preservatives include: Ethoxyquin BHA BHT Natural Preservatives include:   Calcium propionate Ascorbic acid (vitamin C) Mixed tocopherols (also a good source of vitamin E) Probiotics The goal of adding beneficial bacteria to pet food is to promote a healthy GI tract by preventing and treating gastroenteritis and inflammatory bowel disease, and mitigating food allergies. Common bacteria in probiotic formulations for dogs include species8 of: Lactobacillus Bifidobacteria Enterococcus Vitamins  Depending on the ingredients of the pet food, vitamins may be added to ensure that the dog’s and/or cat’s nutrient requirements are met and/or to promote certain health aspects. Most of the names of added vitamins are straightforward on the pet food label, like vitamin B7 (biotin). However, a few vitamin names can be more obscure: L-ascorbyl-2-polyphosphate provides a source of vitamin C. Mixed tocopherols provide a source of vitamin E. Menadione sodium bisulfate complex provides a source of vitamin K. References 1. AAFCO 2020 Official Publication. Champaign, IL. Association of American Feed Control Officials, Inc. 2020; 759. 2. Hand MS, Thatcher CD, Remillard RL, et al. (Eds.) Small Animal Clinical Nutrition. 5th edition. Topeka, KS: Mark Morris Institute.   3. Olivry T, Bexley J. Cornstarch is less allergenic than corn flour in dogs and cats previously sensitized to corn. BMC Vet Res. 2018. 14(207). https://doi.org/10.1186/s12917-018-1538-5. 4. Bauer JE. Timely topics in nutrition: The essential nature of dietary omega-3 fatty acids in dogs. JAVMA. 2016. 249(11): 1267-1272. 5. May KA, Laflamme DP. Nutrition and the aging brain of dogs and cats. JAVMA. 2019. 255(11): 1245-1254. 6. Donadelli RA, Titgemeyer EC, Aldrich CG. Organic matter disappearance and production of short- and branched-chain fatty acids from selected fiber sources used in pet foods by a canine in vitro fermentation model. J Anim Sci. 2019. 97(11): 4532-4539. 7. Gross KL, Bollinger R, Thawnghmung P, et al. Effect of three different preservative systems on the stability of extruded dog food subjected to ambient and high temperature storage. J Nutr. 1994. 124(S12): 2638A-2642S. 8. Grzeskowiak L, Endo A, Beasley S, et al. Microbiota and probiotics in canine and feline welfare. Anaerobe. 2015. 34: 14-23. doi: 10.1016/j.anaerobe.2015.04.002. Featured Image: iStock.com/ FotografiaBasica"}]