[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Watermelon?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/lovable-pretty-puppy-of-chocolate-color-closeup-picture-id1334455654.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/lovable-pretty-puppy-of-chocolate-color-closeup-picture-id1334455654.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-watermelon"}, "datePublished": "July 25, 2022", "dateModified": "June 29, 2023", "description": "Learn whether watermelon is a safe and healthy snack for dogs or if it poses any risks.", "articleBody": "NOTE: Always check with your veterinarian before giving your dog any new foods, especially “people foods.” What might be okay for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Watermelon is a healthy and refreshing treat for humans, but can dogs eat it, too? If you’ve shared a piece of watermelon or your pup has snuck a piece, there’s no need to worry. As long as your dog does not have diabetes and is not sensitive to sugar, they should be completely fine. Is Watermelon Good for Dogs? Both red and yellow watermelon are safe and healthy fruits for most puppies and adult dogs to eat. However, dogs that have diabetes or sugar sensitivities as well as dogs that are obese should not be given the fruit. Watermelon is low in calories and contains no fat or cholesterol. And since 92% of a watermelon is actually water, it’s helpful for hydration—especially on hot summer days.  Keep in mind though, that due to the small amount of watermelon your dog should eat as a snack, they cannot depend on watermelon alone for hydration.  There are also several great vitamins and minerals in watermelons: Vitamin A Vitamin B-6 Vitamin C Potassium Can Dogs Eat Watermelon Rinds? Be sure that your dog does not eat watermelon rind. It’s not safe for them to consume, as it can become a serious choking hazard or create an intestinal blockage. If your dog has swallowed a watermelon rind, visit your veterinarian immediately. Can Dogs Eat Watermelon Seeds? Before feeding any watermelon to your dog, remove the rind and seeds. These black seeds contain cyanide, although it’s unlikely that a dog would be able to eat enough of them to be poisoned. The seeds can also be a potential choking hazard.  Despite the name, seedless watermelons will sometimes still have thin, white seeds. And although those probably won’t pose choking hazards, they could upset your dog’s stomach. So it’s safest to remove those as well.  If your dog has eaten some of the seeds, contact your veterinarian.  How Much Watermelon Can a Dog Eat? Even healthy treats should only make up 10% of your dog’s overall diet. And the other 90% should come from a well-balanced dog food diet.  To help make the portions a little easier, below are some general guidelines for safe watermelon treat sizes based on your dog’s weight. Each “slice” should only be about 1 inch x 1 inch x ¼-inch thick: Extra-small dog (2-20 lbs.) = 1-2 slices of watermelon           Examples: Yorkies, Chihuahuas, Pomeranians, Pugs Small dog (21-30 lbs.) = 2-3 slices of watermelon           Examples: Basenjis, Beagles, Miniature Australian Shepherds Medium dog (31-50 lbs.) = 5-6 slices of watermelon           Examples: Basset Hounds, Border Collies, Australian Cattle Dogs Large dog (51-90 lbs.) = handful of watermelon slices           Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds Extra-large dog (91+ lbs.) = large handful of watermelon slices           Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees If your dog ate some extra watermelon when you weren’t looking and you’re worried that they ate too much, keep an eye out for the following symptoms of an upset stomach: Decreased appetite or loss of appetite Fatigue Acting depressed Looking uncomfortable Gulping or licking their lips, the air, or objects If you notice any of these symptoms, contact your veterinarian right away.  Worsening symptoms include:  Vomiting Excessive diarrhea Blood in their vomit or stool Weakness Collapse If you notice any of these more serious symptoms, call your vet and take your dog to the vet immediately.  How to Safely Feed Your Dog Watermelon When feeding watermelon to your pup, make sure to wash off the watermelon, remove the rind, and remove the seeds. Once you’ve prepared the watermelon, there are multiple fun ways to safely feed it to your dog. Cut it into small pieces that are about 1 inch x 1 inch x ¼-inch thick to give to your dog as treats. Remove the seeds, mash or blend a little watermelon, then pour it over your dog’s food, or put it in a KONG toy to freeze and serve later.  Make your pup a fruit smoothie by blending up watermelon with some other dog-safe fruits like bananas, strawberries, and blueberries. Then combine that fruit mixture with plain, sugar-free, xylitol-free yogurt. Refrigerate the mixture so you can put a little on top of your dog’s food later. Or you can put it in their KONG toy to freeze for a very refreshing treat.  Try these recipes for a dog-safe watermelon sorbet or a watermelon mocktail for dogs Featured image: iStock.com/Sviatlana Barchan"}]