[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Can You Tell If Your Pet Is Overweight?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/young-frenchie-at-vet-office.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/young-frenchie-at-vet-office.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/evr_multi_is_my_pet_fat_overweight"}, "datePublished": "September 25, 2012", "dateModified": "August 16, 2022", "description": "Obesity in dogs is on the rise, so it’s important that pet parents know how to tell if their dog is overweight. Here are some helpful tips and tools for figuring out if your dog is overweight or obese.", "articleBody": "Reviewed for accuracy and updated on November 5, 2019, by Dr. Katie Grzyb, DVM  According to the Association for Pet Obesity Prevention’s (APOP) 2018 Pet Obesity Survey, 55.8% of dogs are classified as overweight or obese. That means that most pets these days are overweight, even if many of their owners don’t realize it. But dog owners should be paying more attention to their dog’s weight, since being overweight puts your dog at risk for many diseases, including diabetes, cardiovascular disease and arthritis. And while your vet can diagnose an overweight or obese dog, it’s easy for you to determine, too, if you know how. Here are some tips for how to tell if your dog is overweight so that you can start a conversation with your veterinarian and help get your dog back to a healthy weight. How to Determine If Your Dog Is Overweight Here are three of the most reliable tools for determining if your dog is overweight. Body Condition Score Charts The best way to determine whether a pet is obese is by using a measurement system such as the body condition score, says Dr. Jim Dobies, a veterinarian with South Point Pet Hospital in Charlotte, North Carolina, and a member of the North Carolina Veterinary Medical Association (NCVMA). Body condition score charts help you figure out where your pet falls on the healthy weight scale. Most body condition score charts work on a scale of 1-5 or 1-9—1 being emaciated, and the highest number being morbidly obese. The World Small Animal Veterinary Association (WSAVA) has a great example of a body condition score chart that depicts the side view and top view of dogs that are emaciated, underweight, average, overweight and obese. Visually Assess Your Dog’s Body But you can also assess your dog without using a dog body condition chart, Dr. Dobies says. The best way to visually assess your dog’s weight is to stand above them and look down on them. “You should be able to feel their ribs but not see them. If you can see them, they are too skinny,” Dr. Dobies explains. If you can’t see your dog’s ribs, and you can’t feel them by placing your hands on the sides of their chest, your dog is overweight, says Dr. Dobies. Dogs should also have a nice taper at their waist (between the abdomen and where the hips go into the socket), he says. “If there is very little or none at all, they are too heavy and they’ll be oval-shaped.” And a very obese dog, he says, “will have a pendulous abdomen, hip fat and neck fat, all of which are very noticeable.” But pets don’t usually reach this point of obesity until they’re at least 7 years old, he adds. Healthy Weight Protocol for Dogs Veterinarians can also use tools like the science-based Healthy Weight Protocol, which was created by Hill’s Pet Nutrition in conjunction with veterinary nutritionists at the University of Tennessee.    A vet takes measurements—four for a dog—then inputs them into the Healthy Weight Protocol system to determine your dog’s body fat index. By comparing this with a chart, your veterinarian can tell you exactly how much weight your pet needs to lose if they are overweight. This system allows vets to take a more scientific approach to a dog’s weight loss needs. It helps them to determine exactly how many pounds a dog would need to lose and how many calories a day they need to do that healthily.    Talk With Your Veterinarian Your veterinarian is your greatest ally for maximizing your dog’s overall health. They can help you determine whether your dog is currently overweight and help you devise the best plan for helping your dog shed the extra weight in a safe way. By: Amanda Baltazar Featured Image: iStock.com/Firn"}]