[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/rm74eb6zxf", "@type": "VideoObject", "duration": "PT1M25S", "name": "5413851979001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/6f38a151e882e8edf41e27b21df0da0b2edb518c.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/rm74eb6zxf", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/e7faddb3f1da3725e464c3c14e06dd090fe6ce33.m3u8", "transcript": "Black seeds derived from the flax plant are small nutty flavored seeds that offer a lot of health benefits for dogs flaxseed oil, which is made from Brown and pressed flax seeds share similar health properties both come loaded with omega 3 and omega 6 fatty acids or good fats flax seeds sometimes called land seeds pack a whole lot of fiber and protein into a small serving fiber is important to a dog's digestive health. While protein provides energy and keeps the immune system strong flax seeds also contain lignin which can improve cardiovascular health and may help fight cancer.\n\nAnti-inflammatory properties of flaxseed can help ease symptoms of rough rightists lower blood pressure, improve kidney function and maintain healthy skin and coats and dogs. You can incorporate chopped or grounds seeds or a small amount of free oil into your dog's regular food to promote optimal health. Keep in mind that flaxseed oil can turn rancid quickly once it's opened and exposed to air it can also be consumed in capsule form as a supplement to your dog's diet. In addition, many pet food labels contain naturally rich sources of omega 3 and omega 6 fatty acids such as whole flaxseed because of the many health benefits.\n\nThey boast pet owners should seek advice from their veterinarian on whether flaxseed makes sense for their dog's diet.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/healthy-foods-checklist-flaxseed-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Healthy Foods Checklist: Flaxseed for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/benefits-flaxseed-.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/benefits-flaxseed-.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/healthy-foods-checklist-flaxseed-dogs"}, "datePublished": "April 28, 2017", "dateModified": "August 16, 2022", "description": "Flaxseeds, sometimes called linseeds, pack a whole lot of fiber and protein into a small serving. Fiber is important to a dog’s digestive health, while protein provides energy and keeps the immune system strong. Learn more about how flaxseeds can benefit your dog.", "articleBody": "Flaxseeds, derived from the flax plant, are small, nutty-flavored seeds that offer a lot of health benefits for dogs. Flaxseed oil, which is made from ground and pressed flaxseeds, shares similar health properties. Both come loaded with omega-3 and omega-6 fatty acids, or good fats. Flaxseeds, sometimes called linseeds, pack a whole lot of fiber and protein into a small serving. Fiber is important to a dog’s digestive health, while protein provides energy and keeps the immune system strong. Flaxseeds also contain lignans, which can improve cardiovascular health and may help fight cancer. Anti-inflammatory properties of flaxseed can help ease symptoms of arthritis, lower blood pressure, improve kidney function, and maintain healthy skin and coat in dogs. You can incorporate chopped or ground seeds or a small amount of free oil into your dog’s regular food to promote optimal health. Keep in mind that flaxseed oil can turn rancid quickly, once it’s opened and exposed to air. It can also be consumed in capsule form as a supplement to your dog’s diet.   In addition, many pet food labels contain naturally rich sources of omega-3 and omega-6 fatty acids such as whole flaxseed because of the many health benefits they boast.   Pet owners should seek advice from their veterinarian on whether flaxseed make sense for their dog’s diet. "}]