[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Caring for an Emaciated Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/emaciated-art-img.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/emaciated-art-img.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, Nutrition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/evr_dg_care_of_the_emaciated_dog"}, "datePublished": "March 7, 2011", "dateModified": "August 16, 2022", "description": "At times, animal shelters or rescue groups are presented with a markedly thin and undernourished homeless dog. The following presentation relates to the care and recovery assistance provided to dogs that have been homeless for days to weeks.", "articleBody": "By T. J. Dunn, Jr., DVM At times, animal shelters or rescue groups are presented with a markedly thin and undernourished homeless dog. (The significant loss of body fat and muscle mass is termed emaciation.) The following presentation relates to the care and recovery assistance provided to dogs that have been homeless for days to weeks. Ideally, the dog should be thoroughly checked by a veterinarian and veterinary advice should be given regarding the dog’s nursing care. However, if veterinary assistance is not available, shelter personnel should, upon initial admission to the shelter, do the following: 1. Create an individual animal chart for the dog so that daily records and notes can be recorded. 2. Conduct a thorough inspection for any identification markers such as ear or inner thigh tattoos and/or microchips. These subcutaneous tiny microchip implants can migrate, so scan the entire dog for a microchip implant. 3. Record the dog’s temperature, weight and also note an estimated normal weight on the chart. 4. Conduct a thorough physical exam. Don’t neglect to inspect the oral cavity for fractured teeth, bone fragments lodged between teeth, and lacerations to or under the tongue. Check for eye and ear infections; check under the tail for evidence of anal sores, tapeworm segments, or maggot infested moist infections. Check the paws for abraded pads or interdigital infections or foreign matter. 5. Gently probe with your fingertips all areas of the abdomen. This is most easily done having an assistant restrain the dog’s head while the dog is in a standing position. Stand/kneel at the dog’s hip and facing forward places the left hand fingers along the left side of the dog’s abdomen and passing the right hand under the belly and placing the right hand fingers opposite to the left. Gently bringing the hands together, and probing and pushing various areas along the abdomen will reveal important information. Does the dog display pain? Does the dog &quot;cramp up&quot; and grunt when abdominal pressure is applied? If so, the dog may need veterinary care. If no pain is noted and the dog tolerates the abdominal palpation, the odds are good that there are no significant or life abdominal threatening problems. 6. Check the gums and tongue for color. A pale or grayish color may indicate anemia from blood loss or rodent poison ingestion. Likewise, if there are areas on the gums or whites of the eyes where blotches of hemorrhage are noted, veterinary care is needed right away. The gums and tongue should be pink to reddish. 7. Offer the dog a small amount of water and observe the dog’s interest and ability to drink. 8. Determine if the dog is dehydrated. The best way to do this is to gently grasp a fold of skin at the base of the neck and pull the skin upward, away from the dog. In a normal state of hydration when you let go of the stretched fold of skin, it readily snaps back into place. If, however, the skin fold does not snap back, but seems to dissipate in slow motion, that display of poor elasticity will only occur if the dog is dehydrated. *** Non-veterinary care can be successful as long as the rescued dog does not have a serious medical disorder such as kidney failure, anemia, pancreatitis or bowel obstruction due to garbage or foreign body ingestion. Since many dogs admitted to an animal shelter have been injured while homeless, they need careful evaluation for broken bones, burns or gunshot injuries. Garbage ingestion can cause bacterial enteritis and bloody diarrhea, severe pancreatitis, and intestinal blockage due to the consumption of bones. What Happens During Starvation? Researchers have studied how a dog’s body organs and biochemistry are disrupted by various lengths of time of starvation. If the dog is healthy to begin with, and no medical problems exist that, of course, would compound the starving dog’s medical status, a predictable sequence of adaptations take place. The dog’s biochemical functions shift into survival mode within twenty-four hours with no nutritional intake. The highest priority of the dog’s metabolic processes becomes the necessity to keep the blood glucose concentration at a normal level. If the blood glucose (&quot;blood sugar&quot;) level drops too low for any reason, the brain, heart, muscles and kidney function shuts down rapidly and death comes quickly. So, when the dog has no opportunity to eat, the survival mode’s first concern is to mobilize stored glucose from liver and muscle reserves by changing the biochemical processes to different chemical pathways that make glucose readily available. After about two days without food the liver reserves of glycogen (glucose) are depleted. So in order to keep the blood level of glucose in the normal range, new chemical pathways open, called gluconeogenesis, where the liver and kidneys create molecules from complicated biochemical reactions so that fats and proteins are extracted from adipose tissue and muscle. As the glucose reserves are tapped and diminished, chemical reactions kick in to create glucose internally from those protein and fat reserves. Energy to run the body’s machinery (muscle, brain, kidney, heart and other organ functions require energy to fuel their activities) is now fueled less by glucose and more by fatty acid extracted from fat reserves.   On the third day of food deprivation the dog’s metabolism slows down. This lower, or slowed, metabolic rate continues as long as no food is consumed. The lowered metabolism is a survival mechanism to decrease the utilization of body fat and muscle for energy. Lowered blood sugar levels changes insulin secretion by the pancreas, which in turn lowers thyroid hormone levels; and it’s the thyroid gland function that ultimately dictates the metabolic rate. During starvation the liver releases chemicals called ketones into the blood stream; ketones are then used as a source of energy for the dog’s body cells. By creating ketones and fatty acids to be used as energy sources, the dog’s body conserves what little glucose is circulating so that glucose-dependent red blood cells and important kidney tissues can continue to access glucose. Interestingly, red blood cells and kidney tubule cells cannot utilize anything other than glucose for cell energy needs. After five days of starvation fat becomes the main source of energy. Feeding the Starved Dog Animal caretakers must exert strict self-control when attempting to nurse a starved dog back to good health. The natural and common tendency is to overfeed the dog &quot;because he’s ravenous.&quot; If an emaciated and starved dog is suddenly overfed serious consequences, such as refeeding syndrome, await. This is because a sudden load of carbohydrates in a large meal can create serious shifts in potassium and phosphorus concentrations in all body cells. Signs of Refeeding Syndrome are described as muscle weakness, muscle cramps, heart muscle damage and rhythm irregularities, seizures, red blood cell rupture and respiratory failure. In addition, a prolonged lack of food does not &quot;shrink the stomach,&quot; but it does make the stomach much more sensitive to stretch receptor nerve impulses. The dog may feel as if full when the stomach has only a small quantity of food in the stomach. The increased sensitivity to gastric expansion will dissipate over 3 to 7 days. The food being fed to the starved dog should have adequate mineral composition, especially phosphorous, potassium and magnesium. (Therefore, do not be tempted to feed, for example, just hamburger, which does not have a wide or balanced mineral content.) The amount of food, or total calories, should not exceed over 24 hours what the dog would normally eat at its normal weight. An emaciated dog is best served consuming a small meal every six hours (4 times a day) rather than consuming one or two larger meals. A broad-spectrum vitamin and mineral supplement is important to include at each meal. Some evidence supports the addition of the amino acid glutamine to the recovery diet. Omega 3 and 6 fatty acid supplements are also beneficial to a dog recovering from malnourishment; the same holds true for the amino acid arginine. Dietary nucleotides are important contributors to the formation of DNA and RNA and assist in a number of metabolic activities of healthy cells. Diets rich in meat provide adequate nucleotides. By feeding a highly digestible, meat-based &quot;Puppy&quot; or &quot;Growth&quot; food, along with certain supplements, recovery and weight gain should be evident in a short period of time -- that is, as long as the dog has a normal appetite. Also, until a normal appetite should return, it is recommended to divide the daily suggested amount of food (based on the dog&#039;s estimated health weight) into four smaller portions. At each meal, closely monitor the dog&#039;s intake and note it on a chart. For example, the record could state, 8:00 a.m. meal - ate 100% or ate 50% or ate 10%. If, after two days, the dog does not consume an amount over a 24-hour period approximately equal to the amount expected to be eaten by a healthy dog of the patient’s ideal weight, assisted (forced) feeding may become necessary. Consult your veterinarian regarding how best to force feed the patient. Keep in mind that some dogs raised on a single type of dog food may reject a different type no matter how hungry the dog may be. There are dogs that simply refuse to eat canned food, dry food or table scraps, so be prepared to be creative. Slightly warming the food or moistening with chicken broth, and presenting the food in tidbit amounts can tempt a reluctant appetite. If you estimate the dog has been deprived of food for 7 days or more, the diet should be composed predominately of fat rather than carbohydrates. Never allow the dog, especially early in the recovery feeding process, to consume a large meal all at once. Small amounts fed at intervals during the first few days is very important. Free access to water is proper. It is common to see occasional vomiting or loose stool in the early recovery time of a starved dog. By weighing the dog twice a day (a.m. and p.m.) and by noting the amount of food ingested versus the amount vomited and passed as feces, an assessment can be made regarding positive or negative weight gain. Veterinary care is needed if bloody stool or vomit is noted or if there is weight loss during the refeeding and recovery period.   Determining How Much to Feed Nutritionists employ a number of methods and formulas to determine the average total caloric intake for dogs based upon the dog’s ideal body weight. Any estimate of &quot;how much&quot; to feed is inherently subjective and lots of variables will apply to each individual dog. Some nutritionists rely on the (MER) Maintenance Energy Requirement to determine approximately how much food (actually how many calories) an average dog needs on a daily basis to maintain body weight. In spite of exceptions and variables, calculating the MER is sensible and useful. Below is an approximation for an average dog’s maintenance daily caloric requirements: Dog’s Weight in PoundsTotal Calories Needed Per Day1145622725441,151661,508881,8271322,394The stress of recovery from a starvation state might demand a slightly higher caloric intake than estimated. When feeding the emaciated dog, the number of calories the dog should ideally consume during recovery from starvation should be approximately the same as what the dog would consume at its normal weight. For example, if a rescued Mastiff is extremely thin and emaciated and upon examination she weighs 88 pounds and you estimate that when healthy she would weigh 130 pounds, try to feed the dog a daily caloric amount calculated for a 132 pound dog. Therefore, during a 24-hour day you would provide the dog not with 1,827 calories but rather 2,390 calories. Every pet food or supplement label must list the calories per unit weight of the product. Plus, the percent fat and protein are listed. For some mysterious reason carbohydrates (CHO) percentages are not often listed and, if needed, must be calculated by deduction from the percentages of everything else listed on the label. Fortunately, in the starving dog’s recovery diet our main focus is on fat and protein intake so calculating the calories supplied by carbohydrates isn’t a priority. It is suggested that dogs mildly to moderately underweight be provided with a diet moderately high in fat and protein. These diets should have adequate levels of carbohydrates but not predominantly carbohydrate. Try to feed products that show (for dry food) fat content of 18% and protein 28-30%. (Liquid supplements will list seemingly lower percentages for fat and protein because they typically are 60 to 70% moisture whereas dry pet foods have only 10% moisture.) For a markedly underweight dog that truly looks starved, an even higher fat content in the diet is recommended... but remember to start out slowly! Do not overfeed with too much at any single feeding. Also, check with your veterinarian before giving an emaciated dog a recovery diet."}]