[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Eat Cat Poop?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-08/top-down-view-of-a-dog-looking-at-a-litter-box-picture-id133869880.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-08/top-down-view-of-a-dog-looking-at-a-litter-box-picture-id133869880.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/why-do-dogs-eat-cat-poop"}, "datePublished": "August 31, 2021", "dateModified": "August 16, 2022", "description": "Dr. Sandra Mitchell explains the possible reasons why your dog is eating cat poop and what you can do to stop them.", "articleBody": "So your dog comes over, wagging their tail furiously, and eager for some kisses. But then you notice a few crumbles of cat litter stuck in the fur around your dog’s mouth, and you immediately know what has happened. Your dog has been raiding the litter box again. Gross, right? It might seem pretty weird to us, but the average dog will eat some cat poop at some point. If you’ve ever wondered why dogs eat feces (also known as coprophagy), here’s everything you need to know and what you should do if you see your dog eating cat poop. Is It Normal for Dogs to Eat Cat Poop? At some stages of their lives, dogs eating feces is quite normal, and in fact, it may be necessary. Mother dogs lick their puppies to keep them clean, and they ingest the fecal matter in the process. Young dogs are born without bacteria in their intestinal tract, but they need bacteria to properly digest food. The quickest way to obtain it is by eating stool from animals that already have those bacteria in their system. And in reality, a mother dog teaches their puppies to eat stool when she cleans them, so it is not as innately gross to dogs as it is to us. But how does this translate to an adult dog that’s caught raiding the litter box? Reasons Why Dogs Eat Cat Poop There are two major categories of reasons why dogs will eat feces. Most cases involve behavioral causes, but there are some medical reasons as well. Behavioral Reasons Unfortunately, in many dogs (and perhaps most), eating feces becomes a habit. In fact, some dogs actually seem to enjoy eating it. This can become a very difficult habit to break. Your dog is getting rewarded with something they like each time they are able to access the “prize” (a dirty litter box), so they are motivated to try again in the future. Much like us grabbing the bag of potato chips even though we know it isn’t a healthy snack, dogs will be drawn to the litter box even though they know they aren’t supposed to. Boredom is another common reason why pups will start eating feces. Since they explore the world with their mouths, the litter pan is no exception, and then they find a treat stashed there, which keeps them coming back. Dogs that have ample playtime and get lots of exercise and interactive time with their families are less likely to develop coprophagia. Another surprising reason some dogs start to eat feces is if they have an accident in the house. If you have punished your dog in some way (even by yelling or scolding), they know they will be punished for their accident, so some dogs will hide the evidence by eating it. This is just one reason why you should always use positive potty training techniques and never punish your dog for accidents. Once they discover they like the taste of fecal matter, the situation can spread to the litter box as well. Lastly, some dogs will begin to eat feces during periods of stress. Much like people with comfort foods, dogs will turn to the things they enjoyed as puppies to relieve their stress. For some dogs, this may include coprophagy. Medical Reasons Even though it’s less common, medical causes for dogs for dogs eating cat poop are diagnosed on a regular basis. The most likely reason tends to be malnutrition in cases where dogs are being fed a diet that does not meet all of their nutritional needs. Most commonly, we see this in dogs being fed a homemade diet, or one that has not been AAFCO-certified to meet all of the nutritional needs for that particular animal (this information is found on the label). Other causes may include intestinal parasites, poor intestinal absorption, and some types of hormonal or endocrine imbalances. Occasionally, senior dogs who suddenly develop the habit may be suffering from cognitive dysfunction. The good news is that if your vet identifies a medical cause for your dog’s coprophagy, you can deal with the underlying condition to prevent more significant problems. The treatment may also help eliminate the desire to eat stool. Can Dogs Get Sick From Eating Cat Feces and Cat Litter? Unfortunately, there are some concerns with dogs that eat another animal’s feces. First, if the other animal has any intestinal parasites or certain harmful bacteria, like E. coli or Salmonella, it is possible for your dog to contract these diseases. One seldom-considered facet is that if the cat is taking medication, the residues from that drug may still be in the cat&#039;s feces when the dog consumes it, which may affect the dog. And of course, whatever your dog eats can be spread to your family through their kisses and saliva. Always wash your hands well after interacting with your dog, and try to avoid kisses—especially if your dog is known to enjoy raiding the litter box. How to Prevent Your Dog From Eating Cat Feces This can be a very difficult habit to break, and it will likely take patience and the willingness to try many approaches. Switch to Positive Training Methods Most importantly, do not punish your dog for raiding the cat box. This can actually make the problem worse, particularly if your dog eats stool in part as a reaction to stress. There are other ways to break the habit without punishment. If you have done this in the past, talk to your vet about finding a dog trainer who can teach you positive training methods. Clean the Litter Box Often One technique that is very effective but labor intensive is to clean the litter pan very frequently—preferably, each time your cat uses the box. Although self-cleaning litter boxes are on the market, some cats are afraid of these, so be aware of this if you decide to get one. Follow all the advice from the company and keep both the old and new boxes available for a while to get your cat used to the idea. Keep Your Dog Active and Engaged Increasing your dog’s activity, exercise, and amount of household attention will also help, particularly if the habit was developed out of boredom. Tired dogs often have less interest in causing trouble, and lots of outdoor playtime will make it less likely for your dog to come inside and look for presents in the litter box. Check Your Dog’s Diet and Slow Down Their Eating Make sure you are feeding your dog a well-balanced diet. Talk to your vet about what you’re feeding your dog and ask for recommendations. Also try slowing down how fast your dog eats (such as using a treat ball to dispense food) to help improve digestion and reduce the instinct to eat feces. Try Medications, Supplements, and Food Additives There are supplements, medications, and food additives that can be used to change the flavor of the feces and hopefully deter your dog from eating it. Any medication options should be discussed with your veterinarian and used after other options have been exhausted. Keep in mind that food additives need to be given to the pet whose stool is being eaten (not the eater!). This means that treating your cat comes into play, which can be a difficult ask. Consider a Basket Muzzle as a Last Resort As a last resort, basket muzzles—which allow the dog to eat, drink, pant, but not pick up items such as fecal matter—can be extremely effective in some dogs. The good news is that with patience, most dogs can be stopped from regularly snacking on the cat’s stool. The unfortunate part of the equation is that, much like us, it’s hard to not give in to cravings and to change snacking habits. Dogs have long memories, so consistency and forgiveness are important to remember when retraining your dog. Featured Image: iStock.com/schulzie"}]