[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/91y9xqep67", "@type": "VideoObject", "duration": "PT58S", "name": "5413731650001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/cbefc111ee1d1c9526cfd86d8bd8ec9c4d62427c.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/91y9xqep67", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/19e51d7c0575b3196ab98934130507a503803d99.m3u8", "transcript": "Dogs need protein to build heal and maintain body tissues and to protect and regulate body processes. Lamb is a great protein option for canines and the ingredient is popping up in many pet food options. Lamb is packed with a central amino acids and is a good source of dietary fats, which helps sustain energy. The red meat also offers up plenty of vitamins and minerals that support muscle development and encourage optimum skin and coat health in dogs. Some pet food formulas will also use lamb meal a rendered version of the meat that contains less water. Lamb meal is often higher in protein than fresh lamb lamb may be a better option for dogs who suffer from food sensitivities or food allergies caused by other protein sources, such as beef or chicken. Check with your veterinarian to see if switching your dog to a land based diet is the right choice.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/evr_dg_contrasting_grain_based_and_meat_based_diets?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Contrasting Grain-based and Meat-based Diets for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/3853209119_9e400a5734.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/3853209119_9e400a5734.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/evr_dg_contrasting_grain_based_and_meat_based_diets"}, "datePublished": "March 8, 2011", "dateModified": "August 16, 2022", "description": "What is the difference between grain based and meat based foods for pet dogs and cats? Read on to find out ...", "articleBody": "By T. J. Dunn, Jr., DVM It is common knowledge and generally agreed upon by experts that dogs (and cats) are meat eaters and have evolved through the ages primarily as meat eaters. Although now &quot;domesticated,&quot; our pets have not evolved rumens along their digestive tracts in order to ferment cellulose and other plant material, nor have their pancreases evolved a way to secrete cellulase to split the cellulose into glucose molecules, nor have dogs and cats become efficient at digesting and assimilating and utilizing plant material as a source of high quality protein. Herbivores do those sorts of things. That’s how nature is set up at this time. On the other hand, some plant material such as rice, soybean meal and corn have some, although limited, usefulness in the meat eater&#039;s diet. Corn, wheat, soy, rice and barley are not bad or harmful to dogs and cats. These plant sources are simply not good choices (we do get to choose what we feed our pets, don&#039;t we?) for the foundation of a diet to optimally nourish animals what are, have been, and for the foreseeable future will be meat eaters. What is the difference between grain based and meat based foods for pet dogs and cats? If you don&#039;t believe that dogs and cats are primarily meat eaters, you might as well click away now because you certainly won&#039;t believe what follows. Most of what is presented next has been derived from two excellent references on small animal nutrition: Canine and Feline Nutrition by Case, Carey and Hirakawa and Small Animal Clinical Nutrition, III by Lewis, Morris, Jr., and Hand. There are 22 different alpha amino acids that mammals need for various metabolic and energy activities. Dogs and cats are able to synthesize twelve of these internally and, therefore, are required to ingest the other ten in their diets. Because these ten amino acids are necessarily acquired only through food acquisition, they are termed essential amino acids. (Refer to the list in Table 1.) However, the word &quot;essential&quot; is misleading because all of these are essential for good health. Somebody a long time ago started referring to the amino acids that are not formed internally, and need to be eaten, as the &quot;essential amino acids&quot;. Who says science is exact?! Amino Acids Utilized by Dogs and Cats &quot;Non essential&quot; (not required in the diet) Alanine Asparagine Aspartate Cysteine Glutamate Hydroxylysine Glycine Glutamine Proline Serine Hydroxyproline &quot;Essential&quot; (is only obtained via the diet)  Arginine Histidine Isoleucine Methionine Phenylalanine Tryptophan Threonine Valine Leucine Lysine Taurine (cats) Herbivores conveniently have amino acids produced to a great extent by billions of microorganisms along their multi-stomached and lengthy gastrointestinal tracts. Our furry friends, with their relatively short and simple gastrointestinal tracts, are unable to capitalize on microbe amino acid synthesis and require preformed (i.e., they can&#039;t make it themselves) amino acids (in the form of larger protein molecules) to be present in sufficient diversity in ingested food. Note that cats have a few special needs that dogs to not have, such as a dietary source of a beta amino acid called taurine (to read more about this see &quot;Cats Are Different&quot;). What&#039;s in a &#039;Balanced&#039; Diet Fats required are easy to acquire from both plant and animal origins and are easily mixed into the diet. Everyone agrees that linoleic and (for cats) arachidonic fatty acids are necessary. (Linolenic is synthesized from linoleic both by dogs and cats). High quality fats are readily available, can be stabilized with vitamin E and vitamin C, and are fairly consistent in cost. There, that takes care of the fat in the diet. Nothing complicated to this.   Vitamins and minerals are inexpensive, well documented as to types and amounts, and can be added conveniently to any food product. No problem here. Carbohydrates are useful to dogs and cats for readily burnable fuel for all kinds of muscular and metabolic activities. Cheap and easily produced sources of carbohydrates are such items as rice, corn, wheat, barley and soy. Hmmmmmmm ... sounds like what some pet food manufacturers are commonly using as their first choice for a diet’s foundation. Some even claim these plant products to be an excellent sources of protein! In their book on nutrition Case, Carey and Hirakawa list seventeen plant products including ground rice, corn, wheat, oats, barley, alfalfa and others as sources of carbohydrates. In fact, one of the benefits of carbohydrates, so say the experts, is that they are protein sparing. That is, the animal will utilize inexpensive carbohydrate sources for energy if available to the animal before the animal will utilize more expensive (a human concept!) protein. So, let&#039;s add some plant material to our ideal food for the carbohydrate benefits and not confuse anybody by implying (or worse, stating) that the corn, rice or wheat is primarily a protein product. (The same authors list nineteen pet food ingredients used as protein sources. . . and ground corn, wheat, rice, oats, barley and alfalfa are NOT on that list.) That takes care of the carbohydrates in our diet; we know we will use some inexpensive grains, however our diet will NOT use grain as the foundation or primary ingredient. And just so you know, dogs and cats do very well on diets with minimal carbohydrates and a preponderance of fats and high quality protein. Dogs and cats differ from humans in this respect. Remember, all aspects of human nutrition do not necessarily correspond to canine and feline nutrition. Having stated that proteins can readily be used as a source of energy for dogs and cats, that carbohydrates are of much less importance than in human diet andmetabolism, we should place a major responsibility on the protein content of our ideal diet. Since we know that ten amino acids are required from dietary sources, it only makes sense that we pick a protein source that has a full spectrum of amino acids. We know for sure we are not going to pick corn as a protein source since it contains only four of the ten essential amino acids and contains no taurine, plus nutrition experts didn&#039;t even include corn on the list of protein sources in pet foods. Corn was on the carbohydrate list! Canine and Feline Nutrition lists substances that provide protein, including beef, chicken, eggs, fish, lamb and meat by-products. (Just so you know… the meat by-products in pet foods as defined by the Association of American Feed Control Officials do NOT contain hair, hide, hooves or feathers, but actually refer to organ meats like liver, kidney, stomach, heart, blood, spleen, etc.) Meat by-products are a great source of protein for a meat eating animal. Therefore, for our diet to contain a wide spectrum of amino acids, we will choose to have it contain the best source of protein for mammals -- eggs, or more precisely the egg whites. This substance has a wide amino acid profile and is highly digestible. In fact, egg white is considered a standard against which other protein sources are measured. Other really good choices would be meat, poultry or fish. So for dogs (and cats) our custom diet will contain vitamins and minerals, some grain for readily available energy, a proper amount and ratio of fat sources, and as a foundation, a high quality MEAT source. Pet food manufacturers know very well how to make a great diet just like the one we put together. The problem is that it would be expensive to produce, especially if eggs and beef and fish were in it. And to be competitive with other pet food producers, the price of the food dictates what the foundation (primary ingredients) of the diet will be.   ENTER CORN ... it&#039;s cheap, takes up lots of room in the bag of food and in the pet&#039;s stomach so it will &quot;fill ‘em up&quot;, it&#039;s a good carbohydrate source so the pet will have some energy, it has a few amino acids in it so the corn will contribute to the protein totals on the guaranteed analysis list, and there&#039;s a cheap and steady supply of corn. So the pet food manufacturer makes a corn diet, adds some &quot;meat and bone meal&quot; (which has been cooked at least twice before it gets in the bag and may contain too much calcium) to &quot;complete the amino acid profile&quot; and adds a few other calculated substances so that COMPLETE AND BALANCED can be stamped prominently on the pet food label. The natural world was set up in such a way that, in reference to dog and cat food, cheap ingredients based on plant products and resulting in cheap pet foods always turn out to be a poor choice when attempting to nourish a meat eater. Conversely, expensive substances such as eggs, meat, poultry and fish are far better choices when designing a good diet for meat eaters. NOTE: &quot;Expensive&quot; and &quot;costs&quot; are human terms and have no relationship to what Nature set up regarding what constitutes an ideal diet for a meat eater. Throughout each of the nutrition texts referred to in this article, the authors repeatedly stress the importance of high quality, nutrient dense, and highly digestible pet food products. Yes, these products will cost the consumer more than the generic brands. We animal caretakers have an obligation to our animals to strongly favor good quality products and to stop choosing pet foods based upon price. Dogs (and cats) are livelier and healthier when meat, poultry, lamb and fish are the foundation of their diets. In other words, we should choose to feed our pets meat and denounce the senseless practice of feeding them as if they were herbivores simply because that would be cheaper to do. According to Canine and Feline Nutrition, page 174: &quot;In general, high-quality animal source proteins provide superior amino acid balances for companion animals, compared with the amino acid balances that are supplied by grain proteins. The protein in grains is not as balanced or available as the protein in high-quality animal sources…&quot; By &quot;high-quality&quot; they are referring to meat, poultry and fish products that are derived mainly from muscle and organ tissue rather than &quot;meat and bone meals&quot;. Some types of animal-derived meals are not considered to be high quality because of the processing they undergo. A few individuals express concern regarding feeding dogs and cats &quot;high protein&quot; diets. Blame is laid on &quot;high protein&quot; levels for a spectrum of disorders ranging from epilepsy to hyperactivity to kidney damage. Attempts to find a level of protein at which a diet becomes &quot;high&quot; in it are often met with a range of values; nutrition experts do not all agree what level constitutes a &quot;high&quot; level of protein in a dog (or cat’s) diet. The data showing that excess protein causes renal damage are imaginative extrapolations of results derived from test animals that have renal deficits pre-existing and who are then fed levels of protein that induce uremic poisoning. Early studies that pronounced protein as harmful to dog kidneys were based on studies done on RATS! They weren&#039;t even done on dogs, and that research drove the pet food industry for years. As it turns out, there are major differences in how the rat kidney (is a rat a meat eater, anyway?) metabolizes protein contrasted to how the canine kidney handles protein. I invite anyone to produce even one scientific experiment on dogs or cats that proves normal kidneys are harmed by feeding good quality, balanced rations that contain high levels of protein. The more one peers into this pet food universe, the more one is impressed as to how much we have yet to learn. And much of what one learns is self-taught. Nutrition and pets -- very interesting topics and worthy of our sincere investigation. See Also: Image: Melissa Gray / via Flickr"}]