[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Strawberries?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/can-dogs-eat-strawberries.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/can-dogs-eat-strawberries.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-strawberries"}, "datePublished": "July 25, 2022", "dateModified": "June 29, 2023", "description": "Wondering if you can share this fruit with your dog? Find out whether strawberries are good for dogs and what to watch for.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be okay for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Strawberries are a popular springtime fruit. They are sweet, healthy, and delicious. But are strawberries a safe fruit for dogs to eat? If your adult dog or puppy has eaten strawberries, don’t worry. They are safe and healthy for dogs. But make sure to read below for proper portion sizes and ways to feed strawberries to your dog safely. Are Strawberries Good for Dogs? Strawberries contain several health benefits for dogs. Although your pup may not see a huge impact just from eating a few, they are still a much healthier treat than many other foods.  Here are some of the vitamins and minerals found in strawberries: Vitamin C Vitamin B-1 Vitamin B-6 Vitamin K Magnesium Folic acid Fiber Iodine Potassium Omega-3 Can Strawberries Be Bad for Dogs? Strawberries, like many other fruits, have a high sugar content. Although strawberries are safe for most dogs, high-sugar fruits should not be given to dogs who have diabetes or those that have known sugar sensitivities. Over time, a high-sugar diet could also affect your dog’s health by making them prone to dental issues, obesity, diabetes, and more. It’s also important to keep the portions small when feeding them to your dog. If your dog eats too many, they could get an upset stomach.  Can Dogs Eat Strawberry Yogurt? Feeding your dog strawberry yogurt isn’t a good snack choice. There’s usually a high sugar content in flavored yogurt. Some yogurts may even contain xylitol, which is toxic for dogs. Instead, try using a plain, sugar-free—and xylitol-free—yogurt, and mix in some chopped-up pieces of strawberries. You could add this on top of your dog’s food or freeze it for a cool, refreshing treat.  Can Dogs Eat Strawberry Ice Cream? Strawberry ice cream is also not a good treat choice for your dog. Ice cream usually has even more sugar than yogurt, and it may also contain xylitol or other potentially hazardous ingredients for dogs.  Can Dogs Eat Strawberry Leaves? The leaves on a strawberry plant are not toxic for dogs, but they could cause your dog to have an upset stomach. Make sure to remove these as well as the stems, so they don’t become a choking hazard or cause intestinal blockages.  Can Dogs Eat Frozen Strawberries? Frozen strawberries are a fun, crunchy, refreshing treat for your pup. Cut them up into small pieces to avoid choking hazards or intestinal blockages. To be extra safe, cut them into ¼-inch slices or pieces.  How Many Strawberries Can Dogs Eat? Even if you’re feeding your pup a healthy snack, treats should only make up 10% of your dog’s diet, while the other 90% should come from a well-balanced dog food diet.  Below are some general guidelines for safe strawberry portion sizes based on your dog’s weight. Each “slice” should only be ¼-inch thick:  Extra-small dog (2-20 lbs.) = 1-2 slices of strawberries           Examples: Yorkies, Chihuahuas, Pomeranians, Pugs Small dog (21-30 lbs.) = 2-3 slices of strawberries           Examples: Basenjis, Beagles, Miniature Australian Shepherds Medium-size dog (31-50 lbs.) = 5-6 slices of strawberries           Examples: Basset Hounds, Border Collies, Australian Cattle Dogs Large dog (51-90 lbs.) = handful of strawberry slices           Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds Extra-large dog (91+ lbs.) = large handful of strawberry slices           Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees If you’re concerned that your dog may have eaten too many strawberries, watch for signs of an upset stomach. Contact your veterinarian if you notice any of these symptoms: Decreased appetite or loss of appetite Fatigue Acting depressed Looking uncomfortable Gulping or licking their lips, the air, or objects Take your dog to the vet immediately if you see worsening symptoms like vomiting, excessive diarrhea, blood in their vomit or stool, weakness, or collapse.  How to Safely Feed Your Dog Strawberries When feeding strawberries to your dog, thoroughly wash them and remove any leaves or stems. Here are several fun ways to feed strawberries to your dog:  Cut the strawberries into ¼-inch thick pieces and give them as small treats, or add them to your dog’s food. Frozen strawberries are a great cold treat on hot summer days. Just wash and cut them into small pieces before freezing them.  Make a fruit smoothie from frozen strawberry pieces blended with bananas and blueberries. Then stir in some sugar-free—and xylitol-free—plain yogurt. You can feed this to your dog as a cold treat or dog food topper, or put it in their KONG toy and freeze it for later. Try this recipe for carob-covered strawberry DIY dog treats Featured image: iStock.com/supersizer  "}]