[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/aie6e0b3go", "@type": "VideoObject", "duration": "PT2M17S", "name": "5327088415001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/43fc8fbb10fab40551f942c01bdc0996be6e1d46.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/aie6e0b3go", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/5e205384560200cf9387c189317a4963f341cb7a.m3u8", "transcript": "While snacking on grapes and raisins is a great way for humans to stay healthy and get a daily dose of nutrients grapes and raisins are toxic to dogs and can lead to severe health problems including acute kidney failure. All foods containing grapes and raisins including grape juice raisin filled cookies trail mix and even bagels should be avoided at all costs to prevent poisoning dogs who eat grapes or raisins may exhibit vomiting or diarrhea within just a few hours of consumption as the toxicity progresses. Dogs may become lethargic lose their appetites experience abdominal pain and show signs of dehydration.\n\nIf the toxicity levels are high a dog may eventually pass only a small amount of urine or stop producing urine altogether. If this happens the dog is in jeopardy of kidney failure. To date researchers have not been able to pinpoint the exact substance in raisins and grapes that causes this toxic reaction in dogs. But veterinarians know that even a small amount of grapes or raisins can be potentially fatal to dogs.\n\nIf you suspect your dog has eaten any amount of grapes or raisins it should be treated as a medical emergency. Pet owners may be directed to induce vomiting by their veterinarian but you should not induce vomiting. If your dog is not conscious is having trouble breathing, or is exhibiting signs of serious distress or shock. Even if you do get your dog to vomit shortly after consuming grapes or raisins you should still seek immediate veterinary treatment.\n\nEmergency veterinarians may use activated charcoal to stop absorption of the toxin and place your dog on intravenous fluids to help flush the toxins out of the system as quickly as possible. Veterinarians may perform a complete blood count a chemistry profile and a urinalysis to assess damage to the kidneys. Prognosis for the dog will depend on when medical intervention was started and how ill the dog was at the start of treatment to prevent grape and raisin poisoning. It's important to keep these food items off of counters and out of reach of dogs at all times.\n\nNever leave your dog unsupervised around grapes or raisins and make sure children and other houseguests know not to offer grapes or raisins to your pet as a snack.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/can-dogs-eat-grapes?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Grapes?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/basque-sheepherd-dog-smelling-some-grapes-picture-id508296163.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/basque-sheepherd-dog-smelling-some-grapes-picture-id508296163.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Poisoning, Can Dogs Eat, Symptom Checker, Grape Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-grapes"}, "datePublished": "July 27, 2022", "dateModified": "September 12, 2023", "description": "Are grapes toxic to dogs? Find out whether dogs can eat grapes safely and what to do if your dog already ate some grapes.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be okay for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Humans eat grapes all the time with no problem, but are they safe for dogs? You may be surprised to find out that grapes can be toxic to dogs—both puppies and adult dogs. This includes raisins as well. And yes, this does include all colors of grapes and raisins—purple, red, green, and white.  Why Are Grapes Bad for Dogs? Not only can grapes and raisins be a choking hazard, but they do contain a substance that can be poisonous to some dogs. Grapes and raisins have the potential to cause kidney failure and death in dogs that are affected by grapes. We don’t actually know what the toxic compound is that makes grapes a possible danger for dogs. The toxicity appears to be in the flesh—or the meat—of the grape. This means that peeled grapes are just as toxic as those with skin on them. Raisins are technically more toxic than grapes because the fruit is more concentrated in the dried version. It’s important to note that not all dogs that eat grapes will be affected. Each dog may react differently to the toxin. Typically, the smaller the dog, the smaller the amount of toxic food that is needed to cause harm.  It may be that some dogs are sensitive to the toxin while others are not, or it may be that some grapes have the toxin and some do not. Since there are so many uncertainties, there’s no way to tell if your dog will be affected, and to what degree. The bottom line is that you should avoid any potential threats to your dog’s well-being by not feeding them grapes at all. If you also have cats in the house, keep in mind that grapes and raisins are toxic to cats too.  Can Dogs Eat Grape Jelly? No, dogs cannot eat grape jelly or jam, as it will still contain the toxins found in grapes. In addition, jelly contains too much sugar for dogs and may also contain xylitol, which is toxic for dogs.   What Should I Do If My Dog Ate Grapes? Even if your dog has only eaten one grape or raisin, immediately contact your veterinarian or the pet poison helpline at 855-764-7661. Typically, they will advise you to take your dog to the vet right away to be examined and treated in person.  You may have seen advice online about inducing vomiting at home or using activated charcoal to help. And although these things can help, do not try to do these things at home before speaking with your veterinarian. They may recommend against it, and you’ll probably need to bring your dog into the vet’s office immediately anyway.  If you’re not certain whether your dog ate any grapes, it’s still important to contact your veterinarian and watch for signs of grape toxicity within the first 24-48 hours. Signs of Grape Toxicity in Dogs If you notice any of these symptoms of grape toxicity, take your dog to the vet immediately. Vomiting and/or diarrhea: This usually begins within the first few hours of ingesting the grapes or raisins. You may see pieces of them in your dog’s vomit or stool.  Increased urination: This happens during the initial stages of kidney failure. Drinking a lot: This also happens during the initial stages of kidney failure. Decreased urination or not urinating: This is a sign that their kidneys are shutting down. Loss of appetite Lethargy, weakness, or unusual quietness Dehydration: You can check this by gently pulling up the skin at the back of your dog’s neck. If it doesn’t spring back into place right away, your dog is dehydrated. Bad breath How Vets Treat Grape Toxicity in Dogs Your veterinarian may try to induce vomiting. After that, they may also use activated charcoal to help absorb the rest of the toxins and bind any remaining grapes or raisins in your dog’s stomach.  To treat kidney failure, vets will typically try to support kidney function and flush out the toxins by using IV fluid therapy. They will also use medication to treat your dog’s symptoms, like anti-nausea medications and gastric protectants to prevent or treat stomach ulcers.  Your dog will probably need to be hospitalized for at least 48 hours, so the vet can properly treat them and monitor their kidneys through bloodwork.  If your dog was only mildly or moderately affected, they may end up with reduced kidney function, but could still recover with the appropriate medical care.  Featured image: iStock.com/Irantzu_Arbaizagoitia"}]