[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Broccoli?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/big-black-dog-sniffing-a-fresh-broccoli-picture-id1214379640.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/big-black-dog-sniffing-a-fresh-broccoli-picture-id1214379640.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-broccoli"}, "datePublished": "July 27, 2022", "dateModified": "June 29, 2023", "description": "Is it safe to feed your dog broccoli? Find out whether it has any benefits for your pup.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be okay for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Yes, adult dogs can eat broccoli. It’s not toxic to dogs and contains health benefits, so it’s safe in small portions. Puppies have different dietary needs than adult dogs, and their digestive systems aren’t as developed. The high fiber content in broccoli could cause problems for puppies, so it’s best to avoid feeding them broccoli.  Whether you want to give broccoli to your adult dog as a snack, or if they ate some when your back was turned, here are some safe feeding portions, health benefits, and concerns about dogs eating too much broccoli.  Is Broccoli Good for Dogs? Broccoli is not just safe for dogs to eat; it contains many health benefits and nutrients for your dog, just like it does for you. In fact, some dog foods even contain broccoli. It is full of fiber, antioxidants, and digestible plant protein, and it provides vitamins and minerals like: Vitamin C Vitamin K Folic Acid Magnesium Sodium Potassium Chromium Although broccoli provides a lot of great health benefits, your dog cannot rely on broccoli alone for their vitamins and minerals. Additionally, you should be careful not to feed your dog too much broccoli because it can cause intestinal upset. Can Dogs Eat Raw Broccoli? Yes, dogs can eat raw broccoli florets. If you make sure to wash them first, then cut them into small, edible pieces, they are safe and nutritious. In fact, eating broccoli raw or steamed is the best way to keep the most nutrients in the broccoli.  Can Dogs Eat Cooked or Steamed Broccoli? Dogs can also safely eat cooked and steamed broccoli. If you steam broccoli for just a few minutes, it will retain more nutrients than if you cook it. But either way, it’s safe for your dog to eat.  Just make sure that it’s not too hot so they don’t burn their tongues. And be sure to only feed your pup plain broccoli. That means no butter, oils, or seasonings. Not only are these added ingredients unhealthy for your dog, but certain seasonings like garlic and onion are toxic to dogs.  Can Dogs Eat Broccoli Stems? Broccoli stems are not toxic for dogs, but they aren’t the best part of the broccoli to feed to your dog. The stems could become a choking hazard or cause an intestinal blockage. If you do feed stem pieces to your dog, make sure they are cut up into very small, easily edible pieces.  If your dog seems to be choking, contact your veterinarian immediately. Can Dogs Be Allergic to Broccoli? Dogs can develop allergies from repeated exposure to a food. Food allergies in dogs usually cause skin issues, rashes, and ear infections. If this is the first time you’re feeding your dog broccoli, you could see signs of food intolerance, which is different from an allergy. Signs of food intolerance include vomiting or diarrhea. Does Broccoli Make Dogs Fart? If you’ve wondered whether broccoli can make a dog fart, the answer is yes! Not only does broccoli contain a high amount of fiber—which can cause an upset stomach and intestinal gas—but the broccoli florets also contain isothiocyanate. This organic compound is thought to help prevent cancer. But it can also cause gastric irritation in dogs—which can also cause your pup to pass gas.  And although broccoli contains plant protein that dogs can digest, too much protein can also cause flatulence.  How Much Broccoli Can Dogs Eat? If you’re wondering how much broccoli is okay to feed your dog, check out our chart below. And remember—everything in moderation. That means that even healthy treats like broccoli should only make up 10% of your dog’s diet. The other 90% should come from a well-balanced dog food diet.  Below are some general guidelines for safe portion sizes to feed your dog broccoli, based on your dog’s weight and breed size: Extra-small dog (2–20 pounds) = one to two pieces (½-inch wide by ¼-inch thick)           Examples: Yorkies, Chihuahuas, Pomeranians, Pugs Small dog (21–30 pounds) = three to four pieces of broccoli (1-inch wide by ¼-inch thick)           Examples: Basenjis, Beagles, Miniature Australian Shepherds Medium dog (31–50 pounds) = five to six pieces of broccoli (1-inch wide by ¼-inch thick)           Examples: Basset Hounds, Border Collies, Australian Cattle Dogs Large dog (51–90 pounds) = handful of broccoli pieces (1-inch wide by ¼-inch thick)           Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds Extra-large dog (91+ pounds) = large handful of broccoli pieces (1-inch wide by ¼-inch thick)           Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees If your dog ate some broccoli when you weren’t watching, or you accidentally fed them too much, keep an eye out for the following symptoms of an upset stomach. If you do notice any of these symptoms, contact your veterinarian right away.  Decreased appetite or loss of appetite Fatigue Acting depressed Looking uncomfortable Gulping or licking their lips, the air, or objects Vomiting Excessive diarrhea Blood in their vomit or stool Weakness Collapse How to Feed Your Dog Broccoli Ready to feed your pup some broccoli as a treat? Wash the broccoli thoroughly, cut it into small, edible pieces, and remove the stems to avoid any choking hazards.  Raw Raw pieces of broccoli are the easiest and quickest way to share them with your dog while preserving the nutrients. Steamed Steamed broccoli takes just a few minutes, but this method also helps maintain the highest nutrient levels. Do not add other ingredients or seasonings.  Cooked Cooking broccoli takes a little longer and may take strip away some of the natural nutrients, but it’s still very healthy! Don’t add extra ingredients or seasonings to cooked broccoli either.  Smoothie If you’re feeling fancy, you could blend together a little bit of broccoli with some dog-safe fruits like blueberries and bananas, plus a scoop of completely plain, sugar-free, xylitol-free yogurt. You can add this on top of your dog’s food, or even freeze it in your dog’s KONG toy as a cold treat for later.  Featured image: iStock.com/petesphotography"}]