[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Subtle Signs of Cancer in Pets That Most Pet Parents Overlook", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cat-with-dog-picture-id1022808338.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cat-with-dog-picture-id1022808338.jpg"}, "author": {"@type": "Person", "name": "Sarah Wooten, DVM", "url": "https://www.petmd.com/author/dr-sarah-wooten"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/7-subtle-signs-cancer-pets-most-pet-parents-overlook"}, "datePublished": "May 1, 2019", "dateModified": "January 21, 2021", "description": "Find out from a veterinarian the subtle signs of cancer in pets that you should be looking for.", "articleBody": "With cancer in pets, early detection and treatment are critical. By detecting cancer in dogs and cats early, you can work with your veterinarian to increase the chance of cure or remission. Noticing the subtle signs of cancer in dogs and cats early enough can be difficult if you don’t know what you are looking for. Sometimes, the signs can be so subtle that pet parents may mistake them as a normal part of aging. Discuss the following subtle signs of cancer in pets with your veterinarian so that you can catch it early and start a treatment plan. 1. Weight Loss With over half of our nation’s pets being overweight or obese, weight loss is usually a thing that is celebrated by veterinarians and pet guardians alike. However, weight loss in pets—especially when a pet isn’t on a calorie-restricted diet—can be a subtle sign of cancer in dogs and cats. While some cancers can cause quick and dramatic weight loss that is hard to miss, it is more common that the weight loss is gradual over time. It can be so gradual that it goes unnoticed by the pet parent. Sometimes, weight loss isn’t even noticed until the pet is taken to the veterinarian, and the change in weight is only noted when compared to historical weight measurements. If a pet is losing weight even though he or she is eating a normal amount of pet food, then the top diseases to consider are diabetes mellitus and cancer. 2. Lumps and Bumps While lumps, bumps and other skin changes are easy to notice on short-haired dogs or cats, many times they go unnoticed on long-haired pets. Pet guardians will also often postpone a veterinary visit if a lump is small; however, you cannot determine if a skin lump is cancerous based on the size. Even the smallest skin lumps can be cancerous. Tumors of the mammary chain—also known as breast cancer—are often missed by pet owners. Female dogs and cats, whether they are spayed or not, can develop breast cancer. Dogs and cats are subject to cancers of the gastrointestinal system, vascular system, liver, kidneys, urinary bladder, endocrine glands and the reproductive system. These cancers may cause masses to form in the belly. If your pet is large or overweight, you may not notice abdominal masses until they get large or become life-threatening, such as in the case of ruptured tumors of the spleen. Another place where lumps and bumps can be hidden is in the mouth. Dogs and cats can get oral tumors on the gums, hard palate or tongue. Tumors under the tongue are very hard to find unless you are looking for them! 3. Changes in Coat A normal, healthy pet has a glossy, full coat. Changes in the coat, such as hair loss, brittle or dry hair, excessive dandruff or scaling, skin infections, or excessive shedding, could be signs of cancer. Cancers of the endocrine system, such as tumors on the pituitary, thyroid or adrenal glands, can all cause changes in your pet’s coat. Also, if a body part is painful due to cancer, a dog may excessively lick that area, which can cause brown lick stains. If a cat feels sick or is in pain due to cancer, they may not groom enough or at all, which can lead to a matted, unkempt coat. Alternatively, cats are also known to overgroom and pull out hair in response to stress or pain. Overgrooming, no grooming or excessive licking at a body part can be subtle signs of cancer in both dogs and cats. 4. Changes in Appetite Changes in appetite—either increased or decreased—can be subtle signs of cancer in dogs and cats. If a pet is feeling yucky or is in pain, then they may not want to eat. Conversely, other cancers can cause a pet to eat more than normal. Some cancers consume a lot of calories, which will increase a pet’s appetite. Certain types of aggressive, malignant cancers can cause a pet to eat normal or more than normal amounts of food and still lose weight. Tumors of the adrenal or pituitary glands can cause a condition called Cushing’s disease, which increases a dog’s appetite and causes weight gain. 5. Changes in Urination or Bowel Movements Changes in your pet’s bathroom schedule are worthy of note when it comes to early detection. Different types of cancer can cause changes in your pet’s potty habits, from an increased need for potty time to constipation. For example, cancer of the gastrointestinal system can cause diarrhea and/or constipation. Cancer of the adrenal gland, pituitary gland or thyroid gland, or cancer of the liver or kidneys can increase thirst in dogs and cats, which will lead to an increased need to urinate. Cancer of the urinary system can increase the urge to pee but obstruct the urethra, which makes it difficult to urinate. So, sometimes, pets with urinary cancer have to pee frequently, have accidents inside the house or seem to strain when urinating. 6. Changes in Behavior Changes in behavior—particularly a lack of energy or lack of interest in the things that used to bring your pet joy; accidents in the house; changes in sleep patterns; pacing; increased aggression or grouchiness; increased sleeping time; or any other abrupt changes in behavior—can all be subtle signs of brain cancer or cancer pain. Seizures or tremors can also be a sign of brain cancer, and unless you witness the them, seizures can often go missed by pet parents. Some signs that may indicate a pet may have experienced a seizure include loss of balance, twitching, excessive drooling and temporary blindness. 7. Coughing Cancer can cause dogs and cats to cough, so any dog or cat that develops a persistent cough needs to be seen by a veterinarian. A persistent cough can be a potential sign of a tumor pressing on an airway, fluid in the lungs or multiple lung tumors. Persistent coughing can also be a sign of other pet health issues, so if your pet has a cough they cannot seem to kick, it is always best to take them to their veterinarian. How You Can Help Detect Cancer in Pets Early Veterinarians are trained to noticed any abnormalities in your dog or cat, and a veterinary examination is your best weapon against cancer. However, most pets only see their veterinarian once or twice a year. So, it is helpful if you play an active role in monitoring your pet’s health as well. As a pet parent, you see your pet every day, which means you can keep a look out for these potential subtle signs of cancer. To do at-home checks, you can run your hands over your pet to feel for any lumps or bumps and visually inspect your pet. Don’t forget to inspect the nipples in female dogs for any changes, lumps or bumps. Feel your pet’s rib cage for any signs of weight gain or loss. Look in your pet’s mouth and check their teeth and gums. Hold a treat out, and let your pet lick the treat while you visually inspect the top and bottom of the tongue. Pet guardians know their pets best, and by conducting these monthly at-home “inspections,” you will be more likely to catch subtle signs of cancer early enough to make a difference. By: Dr. Sarah Wooten, DVM Featured Image: iStock.com/Neniia Lanti"}]