[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Thunderstorm Phobias in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Behavioral", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/fluffy-dog-hiding-under-sofa.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/fluffy-dog-hiding-under-sofa.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/behavioral/c_dg_thunderstorm_phobias"}, "datePublished": "July 19, 2019", "dateModified": "August 12, 2022", "description": "Does your dog go into a full-blown panic when a thunderstorm starts rolling in? Here is everything you need to know about dog thunderstorm anxiety and a few tips on how to help your dog cope.", "articleBody": "Reviewed for accuracy on March 2, 2022 by Dr. Lauren Jones, VMD Dog thunderstorm anxiety is a disorder characterized by a persistent and exaggerated fear of storms, or the stimuli that are associated with storms. This phobia is complicated and sometimes difficult to manage because it involves physiologic, emotional, and behavioral components. Thunderstorm phobia occurs in both dogs and cats, but dogs are more susceptible to this type of fear. Why Are Dogs Scared of Thunder? The exact cause of dog storm anxiety is unknown, but it may include a combination of the following factors: Lack of exposure to storms early in development Unintentional reinforcement of the fear response by owners A genetic predisposition for emotional reactivity (the condition appears to be more common in herding breeds) Dogs can react to a variety of stimuli associated with storms, including the sound of thunder, dropping barometric pressure, rain, flashes of lightening, and electrical charges within the air. What Are the Signs of Dog Storm Anxiety? Dogs can exhibit a variety of responses or behaviors in reaction to a thunderstorm. Some common signs of a thunderstorm phobia include: Pacing Panting Trembling Hiding or remaining near the owner Drooling Destructiveness Excessive vocalization Self-inflicted trauma Incontinence How Is a Thunderstorm Phobia in Dogs Diagnosed? Your veterinarian will need to rule out any conditions that can cause similar behavioral responses, such as separation anxiety, pain, and neurologic problems. Additional testing may be necessary to ensure that the dog is healthy enough to be given anti-anxiety medications, if that is deemed necessary. How Does Thunderstorm Anxiety Affect Your Dog Physically? Fear, anxiety, and stress can affect body systems in a variety of ways, including: Cardiovascular—high heart rate Endocrine/metabolic—increased cortisol levels, stress-induced hyperglycemia Gastrointestinal—inappetence, gastrointestinal upset Musculoskeletal—trauma resulting from escape attempts Respiratory—rapid breathing Skin—acral lick dermatitis (skin damage due to chronic licking that is thought to release endorphins and promote a sense of calm) If your dog’s thunderstorm phobia is severe, and storms occur with some regularity where you live, the chronic effects could lead to a decreased quality of life and potentially problems like immune dysfunction and an increased risk of infection. Talk with your veterinarian to decide the best way to approach and help manage your dog’s anxiety-induced behaviors. What Can You Do to Relieve Dog Storm Anxiety? Most dogs cannot be cured of their thunderstorm phobias, but management is possible. In a study published in 2003, 30 out of 32 dogs showed significant improvement in their symptoms with appropriate therapy. Comfort Your Dog It’s perfectly acceptable to offer comfort if your dog seeks it during a storm. It’s a common misconception that doing so might accidentally reinforce your dog’s fear, but fear is a visceral response that can’t be altered by a petting or kind words. Create a Calming Environment Playing some calming music to mask the sound of the storm and offering your dog a food puzzle or chew might help your dog refocus during a storm. Plan ahead and try to anticipate noxious events. Watch the news to anticipate weather events so you can begin calming your dog before it even begins. Create a safe, calm space where your pet cannot hurt themselves, such as a crate. You can even cover the crate with a blanket to decrease visual stimulus and mute sounds. You can also decrease auditory stimulus by conditioning your dog to wearing headphones or using cotton balls in their ears. Try a Dog Anxiety Vest Body wraps like the ThunderShirt ease anxiety in fearful dogs, but allow your dog enough time to acclimate to a ThunderShirt prior to using it during a storm. Introduce the garment slowly and use treats to help your dog make a positive association to it. The Thundercap is a great addition to the Thundershirt to allow your dog to comfortably move around while decreasing noxious stimulants like flashing lights. Surround Them With Dog-Appeasing Pheromones Calming pheromones like those included in Adaptil diffusers, collars, and sprays are another good option. Give Them Calming Supplements  Anxiety-relieving nutritional supplements like Nutramax Solliquin calming chews and VetriScience Composure behavioral health chews may also help dogs that are scared of thunder or other stimuli associated with storms. Ask Your Vet About Anti-Anxiety Medications and Behavioral Modification Prescription anti-anxiety medications for dogs are sometimes needed with more severe storm phobias or for dogs who do not respond to over-the-counter treatments. Your veterinarian can also recommend a behavioral modification plan to help your dog learn to remain calm when a thunderstorm approaches. While your veterinarian has many prescription options to help treat thunderstorm phobia, you may want to talk to them about the product Sileo - it is the first and only FDA-approved noise aversion treatment for dogs.   Featured Image: iStock.com/Capuski"}]