[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Retained Afterbirth in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_retained_placenta_afterbirth"}, "datePublished": "December 19, 2012", "dateModified": "August 16, 2022", "description": "A retained placenta, aka retained afterbirth, may become serious for female dogs. Learn the cause and how it can be treated.", "articleBody": "Retained Placenta in Dogs A retained placenta, or retained afterbirth, occurs when the placenta (the sac surrounding an unborn puppy) is not passed out of the mother’s uterus along with the puppy. Symptoms and Types     Green discharge from      vulva that continues    Fever (in some cases)    Systemic disease (in      some cases)Causes The placenta is retained in the uterus rather than being expelled with or shortly after the birth of the puppy. Diagnosis History of a recent birth with a physical examination finding of a green discharge from the vulva is supportive of a diagnosis of retained placenta. Your veterinarian may recommend routine blood testing, though these results may be normal. Vaginal cytology may also be recommended. Your veterinarian may need to take X-rays and/or perform an ultrasound of the uterus. In some cases, exploratory surgery may be necessary.   Treatment Oxytocin may be administered in an attempt to pass the retained placenta and calcium gluconate may be administered prior to the injection of oxytocin. If medical treatment with oxytocin is unsuccessful, surgery to remove the retained placenta from the uterus may be necessary. Ovariohysterectomy (spay) may be recommended if your dog is not to be bred again. Acute metritis (inflammation of the uterus) may develop if the placenta is not passed/removed and may need to be treated as well."}]