[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can heartworms affect humans?", "acceptedAnswer": {"@type": "Answer", "text": "Heartworm disease has primarily been known to cause health-related issues in dogs, cats, and ferrets. Yet heartworm disease can affect multiple mammals, and according to the CDC, that includes humans. Fortunately, your dog is not contagious: the disease in humans is acquired from the mosquito itself and is not that common."}}, {"@type": "Question", "name": "Can heartworms in dogs be cured?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. If caught early and treated appropriately, your dog may go on to have a good quality life.  Unfortunately, some dogs may experience undesirable consequences either from treatment or from the disease itself and may end up with lifelong complications."}}, {"@type": "Question", "name": "What are the first signs of heartworms in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Some dogs may not show any signs, especially if they live a more sedentary lifestyle. Others, however, may show exercise intolerance and coughing."}}, {"@type": "Question", "name": "What is the survival rate for dogs with heartworms?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs presenting with Class I heartworm disease, and even Class II, have a much better prognosis and survivability than those in Class III and IV. Class IV dogs require surgery for lifesaving treatment and will die without it. Featured Image: iStock.com/valentinrussanov"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Heartworm Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/golden.retriever.front_.yard_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/golden.retriever.front_.yard_.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Heartworm, Symptom Checker, Heartworm", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_heartworm_disease"}, "datePublished": "March 10, 2022", "dateModified": "September 12, 2023", "description": "Dr. Michael Kearley discusses heartworm disease in dogs, including symptoms, diagnosis, and possible treatment options.", "articleBody": "What Is Heartworm Disease in Dogs? Dirofilaria immitis is the organism that causes heartworm disease not only in dogs, but also in cats, ferrets, and other mammals. It is a large worm, reaching up to a foot or more in length, and as it completes its life cycle, which takes about six to seven months, it ends up in the heart and pulmonary vessels, where it can live for several more years. As the heart becomes clogged with worms, there is less blood it can push out to the rest of the body, and heart failure can result. Symptoms of Heartworm Disease in Dogs The severity of the infection will be related to the symptoms present, and symptoms of heartworm disease are related to the organs affected: the heart and lungs. Symptoms often include:   Cough   Lethargy   Exercise intolerance   Collapse   Sudden death    Some dogs may show weight loss, difficulty breathing, and even excessive panting. Left untreated, dogs may go on to experience right-sided heart failure and ascites (buildup of fluid in the abdomen). Causes of Heartworm Disease in Dogs  Mosquitoes serve as the primary vector (carrier) for transmission of heartworm disease; transmission cannot occur from one dog to another. As mosquitoes bite and take a blood meal from an infected host, they ingest circulating microfilariae, or young immature heartworms. Inside the mosquito, the microfilariae undergo three stages of larval development (called L1, L2, and L3).   When the same mosquito bites a dog, the L3 is deposited onto the dog’s skin, and it then migrates into the dog’s body and develops into L4. Then as an L5, it migrates throughout the tissues and bloodstream, winding up in the heart, where it takes up residence as an adult. This entire process usually takes about four months to complete.  A few months later, around 7 months of age, the adult females become sexually mature, mate, and produce microfilariae. The commercially prepared tests to diagnose heartworm disease in the veterinary hospital detect antigens (proteins uniquely found on the surface of an organism that are used to detect the presence of that organism in the sample) produced by the female adult heartworm; that’s why testing usually starts around 7 months of age. How Veterinarians Diagnose Heartworm Disease in Dogs Dogs 7 months and older should be tested for heartworm disease at least annually. If the dog misses a dose of prevention, then she should be tested more frequently. Testing is often done in the hospital at the bedside and requires a small amount of blood.   The most widely used method for diagnosing heartworm disease is antigen-based testing. Antigens are proteins uniquely found on the surface of an organism that are used to detect the presence of that organism in the sample. In this case, the antigens being tested for are produced by the female adult heartworm, and if the test shows positive, then the dog is infected.   Other tests that can be performed include a blood smear or a modified Knott’s test (often a test that is sent out for diagnosis), which are done to check for the presence of circulating microfilariae.   Once diagnosis has been obtained, your veterinarian may recommend more testing, which is used to find out the severity of the infection as well as the amount of risk involved for treatment. Other testing often includes chest radiographs, EKG, blood pressure, cardiac enzyme evaluation (NT-proBNP), echocardiogram, blood work, and urine testing.   Class I dogs are those with the lowest amount of risk for treatment, and Class IV dogs are those often diagnosed with caval syndrome and are at highest risk. This means the worm burden is so great that the worms are blocking blood from exiting the heart. These dogs are dying and require surgical removal of the worms (often done by a specialist) to survive. Treatment of Heartworm Disease in Dogs Once your dog is diagnosed, your veterinarian will most likely explain to you next steps including treatment options, more diagnostics, and time frame for follow-up visits.   First, your dog should have his activities restricted as exercise can increase the potential for the heartworms to dislodge and cause clots elsewhere in the body. Additionally, if your dog has circulating microfilariae in his bloodstream, mosquitoes, after ingesting a blood meal from your dog, can then transmit the parasite to others, so limited exposure to the outside is recommended.   Certain medications may be prescribed, such as:  Steroids: to decrease inflammation created by the worm itself  Antibiotics: doxycycline is used to kill Wolbachia, a symbiote organism that lives within the heartworm. Without the symbiote, the host heartworm becomes easier to kill and secondary inflammation is minimized.  Specific kind of heartworm preventive: to prevent younger worms from developing into adults and to rid the bloodstream of any circulating microfilariae    An injection containing the arsenic-based compound melarsomine will be given to your dog 60 days, 90 days, and 91 days after diagnosis by the veterinarian. This is a medication designed to kill the adult heartworms and is usually administered in the lower back deep into the muscle. As it is painful, pain medications will most likely be sent home at those visits as well.      Prevention of Heartworm Disease in Dogs The best way to treat your dog is to do your best to prevent the disease in the first place with year-round heartworm prevention. The good news is that there are multiple types and forms of heartworm prevention on the market, and they are all affordable.   There are tablets, topicals, and even injectable versions that can provide anywhere from 1 month to 12 months of protection. There are even products that are combined with flea and tick control to give your dog a more comprehensive preventive profile.   All products are designed to kill the L3 and/or L4 heartworm larvae, and some will clear the blood system from circulating microfilariae.   If your dog tests positive for heartworm disease, it is important to discuss the specific type of preventative needed while treating it, as there are only a few that should be given to minimize secondary complications.   You should speak with your veterinarian to decide the best type of prevention for your dog’s lifestyle and your budget. Limiting your dog’s exposure to mosquitoes will also help, but in some places, limiting exposure is nearly impossible. It only takes one infected mosquito to cause heartworm disease.   Recovery and Management of Heartworm Disease in Dogs Treatment for heartworm disease is not risk free. Dogs that undergo heartworm treatment as discussed above can suffer from anaphylaxis (shock), emboli (clots), and sudden death, not to mention the possibility of abscess (pocket of pus) formation at the site of melarsomine injection and the emotional distress from months of exercise restriction.   Dogs can also suffer from long-term health risks from the damage caused by the worms to their heart and lungs. Scarring and inflammation (swelling) generated by the worms makes it difficult for blood to be pumped through the heart and lungs, and right-sided heart failure can develop, even with successful treatment.  The degree of severity will affect the prognosis, and the sooner the disease is caught and treated, the greater likelihood there is for a good outcome. Unfortunately, dogs that suffer from heartworm disease do not get immunity and are at risk for becoming infected again in the future. That is why year-round prevention is critical for your dog’s health."}]