[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skin and Toe Cancer (Melanocytic) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_melanocytic_tumors_skin_digit"}, "datePublished": "December 8, 2009", "dateModified": "August 16, 2022", "description": "Melanocytic tumors are benign or cancerous growths, arising from melanocytes (pigment-producing skin cells) and melanoblasts (melanin-producing cells that develop or mature into melanocytes).", "articleBody": "Melanocytic Tumors of the Skin and Digits in Dogs Melanocytic tumors are benign or cancerous growths, arising from melanocytes (pigment-producing skin cells) and melanoblasts (melanin-producing cells that develop or mature into melanocytes). These tumors do not seem to have a genetic basis; however, males, especially Scottish Terriers, Boston Terriers, Airedale Terriers, Cocker Spaniels, Boxers, English Springer Spaniels, Irish Setters, Irish Terriers, Chow Chows, Chihuahuas, Schnauzers, and Doberman Pinschers, seem to have a predilection to the condition. Dogs 10 years or older are also more prone to melanocytic tumors. In addition, melanocytic tumors can be found in both dogs and cats. If you would like to learn more about this condition affects cats, please visit this page in the PetMD health library. Symptoms and Types Melanocytic tumors may develop anywhere on a dog&#039;s body, though it is more common on the face, trunk, feet, and scrotum. Depending on the location of the lesion, they may be pigmented or non-pigmented. Additionally, lymph nodes near the affected area may become enlarged. These masses may develop slowly or rapidly, but in advance stages of the disease, the dog may have trouble breathing or make harsh lung sounds due to the spread of the cancer into the lungs. Furthermore, if the masses have spread to a limb, the dog may appear lame or have difficulty walking. Causes The cause of melanocytic tumors in dogs is currently unknown. Diagnosis Cell examination and special stains may distinguish amelanotic melanoma from poorly differentiated mast cell tumors, lymphoma, and carcinoma. Your veterinarian may also X-ray the affected area to determine if the underlying bone has been compromised, especially if the growth is one a toe (or digit).  Treatment Depending on the severity and location of the tumor, your veterinarian may need to surgically remove it. He or she may also recommend chemotherapy if surgical removal is incomplete or if the cancer has spread to other vital organs. Living and Management Because early detection of recurrence is crucial, your veterinarian will recommend regular followup exams subsequent to the surgery (every three months for 24 months). However, it is important that you bring the dog back to veterinarian immediately if you suspect the mass has returned."}]