[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Inflammation of the Abdomen Due to Bile Leakage in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_bile_peritonitis"}, "datePublished": "December 20, 2009", "dateModified": "August 16, 2022", "description": "Bile is a bitter fluid secreted by the liver and released into the gallbladder, to be stored until is is released into the duodenum – the small intestine – after a meal is taken. Under abnormal circumstances, however, bile can be released into the abdominal cavity, irritating the organ and causing inflammation.", "articleBody": "Bile Peritonitis in Dogs Bile is a bitter fluid secreted by the liver and released into the gallbladder, to be stored until is is released into the duodenum -- the small intestine -- after a meal is taken. Bile is an essential component in digestion, emulsifying the fats in food, thereby aiding in their absorption in the small intestine. Under abnormal circumstances, however, bile can be released into the abdominal cavity, irritating the organ and causing inflammation. This may occur after injury, infection of the gallbladder, swelling of the gallbladder, blockage of the gallbladder’s ducts, or bile leakage. Bile peritonitis is usually the result of a more serious underlying condition. In fact, when caused by an infection, bile peritonitis kills as many as 75 percent of those animals infected with the disease. Symptoms and Types Signs can be acute or chronic. However, symptoms for infectious bile peritonitis are generally acute, while those for non-infectious bile peritonitis are long-term. Such symptoms include:     Abdominal pain    Loss of energy    Loss of appetite    Vomiting    Diarrhea    Weight loss    Abdomen swollen,      larger than normal    Yellow skin      and/or yellow whites of eyes    Collapse (if      infectious)    Fever (if      infectious)Causes Bile peritonitis is generally caused by inflammation of the gallbladder or an injury that causes the dog&#039;s gallbladder to rupture or break. Moreover, inflammation of the gallbladder may be due to infection or a blockage of the gallbladder ducts, which can be caused by:     Cancer    Gallstones    Inflammation of        the pancreas (pancreatitis)    Narrowing        (stenosis) of the gallbladder’s ductsDiagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have precipitated this condition. A complete blood profile will be conducted as part of a standard exam, including a chemical blood profile, a complete blood count, and a urinalysis. If your dog is suffering from bile peritonitis, high liver enzymes will be present in the blood chemical profile and bile will be present in the urine. Abdominal x-rays and  ultrasound will enable your veterinarian to visualize the liver and gallbladder area in the course of determining the origin of the bile leakage. Using an ultrasound to guide the process, your veterinarian may take a sample of your dog&#039;s liver for biopsy, along with abdominal fluid that is present in the abdominal cavity. These samples will be sent to the laboratory for analysis.  Treatment Treatment will depend on what is causing the bile to escape from your dog&#039;s gallbladder into its abdomen. Fluid therapy is standard for preventing dehydration, and antibiotics will be prescribed to prevent infection. Other drugs and the need for surgery will be entirely dependent on the cause of the leakage. However, the cause for bile peritonitis is often of a serious nature, and can be life threatening if not treated early and effectively. Living and Management Recovery is slow and regular follow-up appointments to your veterinarian are essential for following the progress and adjusting the drugs or treatment techniques as necessary. Bloodwork and samples of abdominal fluid will be taken at each visit. This will allow your veterinarian to see if the infection and/or bile leakage are still occurring. X-rays and ultrasounds may also be repeated at each appointment."}]