[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/hqubsehn59", "@type": "VideoObject", "duration": "PT1M2S", "name": "5327109434001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/dd647a8aad0c8d75053bb48dd244d85a315cf4a2.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/hqubsehn59", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/9086141ed55d879cb8d4dc8b7486465cf9ea0d75.m3u8", "transcript": "Hi my name is Dr. Gerry Post. I'm a veterinary oncologist at the vet Mary Cancer Center in Norwalk, Connecticut. The question that we were asked today is should I feed my pet or play with my pet differently now that he is on therapy for cancer.\n\nAnd the answer is no. We want you to treat your dog or cat pretty much normally and let your dog or cat kind of guide whether they want to play or they want to do things. Let your pet be the judge of whether he or she can do a particular activity or how energetic they want to be. And as far as food goes a good balanced diet is always your best friend and that's what we recommend for any pet that's on any type of therapy for us, whether it be radiation therapy or chemotherapy.\n\nThank you for watching. For more information, please visit M.D.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/cancer/c_dg_adenocarcinoma_stomach_intestine_rectal?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Intestinal Cancer (Adenocarcinoma) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/intestinal-cancer-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/intestinal-cancer-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_adenocarcinoma_stomach_intestine_rectal"}, "datePublished": "June 8, 2009", "dateModified": "August 16, 2022", "description": "Adenocarcinoma is a malignant tumor originating in the glandular and epithelial tissue (the lining of the internal organs). This type of malignant tumor growth can take place in many parts of the body, including the gastrointestinal system of dogs.", "articleBody": "Adenocarcinoma of the Stomach, Intestine, or Rectum in Dogs Adenocarcinoma is a malignant tumor originating in the glandular and epithelial tissue (the lining of the internal organs). This type of malignant tumor growth can take place in many parts of the body, including the gastrointestinal system of dogs. It may invade any part of the gastrointestinal system, including the stomach, the small and large intestine, and rectum. It commonly affects older dogs, usually more than six years of age. No particular breed is known to be predisposed and it is more common in male dogs than females. This type of cancer usually has a poor prognosis. Symptoms and Types Symptoms are most commonly related to the gastrointestinal system and include: VomitingWeight lossPoor appetiteAbdominal painHematemesis (vomiting of blood)Melena (black colored feces due to hemorrhage in gastrointestinal system)Bright red blood in fecesTenesmus (urgent but ineffective defecation)Causes The exact cause is still unknownGenetic cause is suspected in Belgian shepherdsDiagnosis You will need to provide a thorough history of your dog’s health leading up to the onset of symptoms. Your veterinarian will perform a complete physical examination on your dog, with blood tests, fecal tests and a biochemistry profile. The blood tests usually show mild to severe anemia, which is mainly due to gradual blood loss through the feces. Feces samples will also be observed under microscope to examine for the presence of hidden blood that is not visible grossly. Contrast radiography (using an injected contrast chemical agent to view the internal organs) may reveal the presence, location, and size of the neoplasm. Ultrasound is also a valuable tool in the diagnosis of adenocarcinoma of the gastrointestinal tract. Using ultrasound, your veterinarian may take a sample from the intestines or stomach, using a needle, to look for the presence of neoplastic cells in the sample fluid. An endoscope, a tubular diagnostic viewing tool that is inserted into the body, may also be used to collect a sample biopsy. If none of the above-mentioned procedures works well in confirming a diagnosis, your veterinarian may decide to perform surgery, which will ultimately establish the diagnosis.  Treatment Surgery is the treatment of choice in adenocarcinoma of the gastrointestinal system, but a permanent cure is seldom achieved because metastasis (i.e., spreading) is common in affected patients. In cases of adenocarcinoma of the stomach, it is often difficult to remove all of the neoplastic tissue. In cases of neoplasm of intestines, the affected portion of the intestine is removed and the healthy portions of the intestine are sutured back together. Chemotherapy may be advised but it is usually unsuccessful. Painkillers are advised for lessening the pain associated with this neoplasm. Living and Management If surgery is performed on your dog, you may need to revisit your attending veterinarian every three months after surgery for progress evaluations. At each visit, your veterinarian will perform a physical examination, including X-ray and ultrasound imaging to see if tumor is re-growing or not. These tumors typically grow rapidly, metastasizing to other parts and organs of the body. In cases of gastric adenocarcinoma, the survival time is usually two months, whereas in cases of intestinal neoplasm it is about ten months. But survival time is variable and can only be predicted by your veterinarian after complete evaluation of your dog."}]