[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Mouth Cancer: Symptoms, Treatment and Life Expectancy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/chocolate-lab-panting-in-a-field.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/chocolate-lab-panting-in-a-field.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_oral_cavity_tumors"}, "datePublished": "August 19, 2019", "dateModified": "August 12, 2022", "description": "Are you worried that your dog might have mouth cancer? Here’s everything you need to know about oral cancer in dogs, from the symptoms and treatment to life expectancy and management.", "articleBody": "Reviewed for accuracy on August 19, 2019, by Dr. Jennifer Coates, DVM Dog mouth cancer usually affects older dogs but is diagnosed in younger dogs on rare occasions. Oral tumors in dogs are typically found on the roof of the mouth or around the gums, but they can be located anywhere in the mouth. They tend to grow very quickly—often involving the underlying bone—and some varieties readily spread to other areas of the body. Here are some symptoms you can look for, options for treatment and the life expectancy for dogs with mouth cancer. Symptoms and Types of Oral Cancer in Dogs The most common types of oral cancers in dogs are melanoma, squamous cell carcinoma and fibrosarcoma. They all produce similar symptoms, which generally include some combination of the following: Excessive drooling Bad breath (halitosis) Difficulty chewing (dysphagia) or drinking Blood coming from the mouth Oral pain Weight loss Loose teeth Visible mass in the mouth Enlarged lymph nodes in the neck (occasionally) Swollen or deformed areas on the face Causes In most cases, there is no identifiable cause for cancer of the mouth in dogs. Diagnosis As part of a thorough physical examination, your veterinarian will look inside your dog&#039;s mouth for tumors or other abnormalities. This may require sedation. Bloodwork and a urinalysis will provide insight about your dog’s overall health status and are essential to planning appropriate treatment. X-ray images of your dog&#039;s chest may show whether a growth in the mouth has spread to the chest, and a CT scan or MRI of your dog&#039;s mouth may be recommended to determine how invasive the tumor. A tissue biopsy will be taken to determine which kind of cancer is present. In some cases, the entire visible mass can be removed and sent off for identification, but at other times, it’s best to remove just a small piece of the tumor to better plan for future surgery and other necessary treatments. The veterinarian may also want to take a small sample from the lymph nodes to determine whether there are cancerous cells there. Treatment for Dog Mouth Cancer Surgery is often the treatment of choice for dog mouth cancer, but it may not lead to a cure because the tumor often has already spread to other parts of the body. A large amount of bone and tissue surrounding the tumor may also have to be removed to eliminate the majority of cancerous cells at the site. Sometimes this means that part of the jaw must be removed, but most dogs do well even after such a radical surgery. Your veterinarian may recommend radiation therapy to treat tumors that can’t be completely removed with surgery alone. Oral cancers in dogs tend not to respond well to chemotherapy, but a form of immunotherapy is available for oral melanomas in dogs. Living and Management Soft foods, hand-feeding or a feeding tube may be necessary for dogs with oral tumors and after oral surgery or radiation therapy. If part of the jaw has been removed, there may be some difficulty with eating and drinking afterward until your dog has learned to compensate for the loss of teeth and bone. Your veterinarian will also recommend pain relievers, antibiotics and/or any other forms of treatment necessary to maintain your dog’s quality of life for as long as possible. Dog Mouth Cancer Life Expectancy The life expectancy of dogs with mouth cancer varies based on the type of tumor involved, how advanced it is at the time of diagnosis and other health factors. If a tumor is caught early when it can be completely removed, surgery may be curative. However, oral tumors in dogs are often not diagnosed until after they have already metastasized. With appropriate treatment, many of these dogs live for around 6-12 months after diagnosis, at which point euthanizing a pet becomes the most humane option available. Featured Image: iStock.com/eurobanks"}]