[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hereditary Muscle Disease (Non-inflammatory Myopathy) in Labrador Retrievers", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_dg_hereditary_noninflammatory_myopathy_in_labrador_retriever"}, "datePublished": "April 26, 2010", "dateModified": "August 16, 2022", "description": "A myopathy is a muscular disease in which the muscle fibers do not function due to any of the common reasons, ultimately resulting in overall muscular weakness.", "articleBody": "Hereditary, Non-inflammatory Myopathy in Labrador Retrievers A myopathy is a muscular disease in which the muscle fibers do not function due to any of the common reasons, ultimately resulting in overall muscular weakness. The form of myopathy described in this article is specifically seen in Labrador retrievers, especially yellow Labs. Symptoms and Types Symptoms typically develop between the ages of three to four months, many of which worsen with cold weather, excitement, and exercise. In addition, improvements may be seen once the dog is allowed to rest. Some of the more common symptoms include: Muscle weaknessArched backDownward flexion of head and neckAbnormal joint postureExcessive laying down (in some dogs)Abnormal gaitSudden collapseCauses Inherited in Labrador retrievers. Diagnosis You will need to give a thorough history of your dog’s health to your veterinarian, including the onset and nature of the symptoms. He or she will then perform a complete physical examination as well as a complete blood count, biochemistry profile, and urinalysis -- the results of which may indicate a mild increase of the creatine kinase enzyme (normally present in muscle, brain, and other tissues). Your veterinarian may also take a muscle biopsy and send it to veterinary pathologist for further evaluation. The results may show abnormalities related to muscle cells.  Treatment Treating this type of myopathy is non-specific and directed towards alleviating the symptoms. To improve muscle strength, for example, L-carnitine supplements are given to the dog.  Living and Management Prognosis for Labradors with this form of myopathy is variable; however, most clinical signs stabilize once the dog reaches about one year of age. Do not place your Labrador in cold areas, as it may exacerbate the symptoms. In addition, due to the genetic nature of this disease, your veterinarian may recommend against breeding the dog, its parents, or littermates."}]