[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Retained Baby Teeth in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/retained-baby-teeth-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/retained-baby-teeth-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_dg_retained_baby_teeth"}, "datePublished": "February 15, 2010", "dateModified": "August 16, 2022", "description": "A retained or persistent deciduous (baby) tooth is one that is still present despite the eruption of the permanent tooth (between three to seven months of age).", "articleBody": "Retained Deciduous Teeth in Dogs A retained or persistent deciduous (baby) tooth is one that is still present despite the eruption of the permanent tooth (between three to seven months of age). This can cause the permanent teeth to erupt in abnormal positions, resulting in an incorrect bite pattern (or how the upper and lower teeth fit together when biting or chewing). Retained deciduous teeth may also cause overcrowding of teeth, accidental bites into the palate, or an abnormal jaw position. As with most oral issues, early recognition and immediate dental care is essential to prevent permanent damage. Unfortunately, it often goes undiagnosed until later in life. Retained deciduous teeth are more common in dogs, though it does occur in cats. It often affects smaller breeds of dog, including the Maltese, Poodles, Yorkshire Terriers, and Pomeranian. Symptoms and Types In addition to observing the deciduous (baby) teeth once the permanent teeth begin to erupt, the following signs may occur: Bad breath (halitosis)Abnormally-positioned permanent teethSwollen, red, bleeding gums around baby teethLocal gingivitis and periodontal disease due to teeth overcrowdingA permanent abnormal passageway between the mouth and nasal cavity (oronasal fistula)Causes None identified. Diagnosis Your veterinarian will perform a complete physical exam and inspect your dog&#039;s mouth.  He or she will chart the teeth present in the mouth to and record the presence of deciduous teeth. X-rays of the inside of the mouth will also be taken to verify which teeth are permanent and which are deciduous, and whether baby teeth have permanent successors ready to replace them.  Treatment The deciduous (baby) tooth should be surgically removed as soon as the permanent tooth has begun pushing through your dog’s gums. In addition, fractured or retained root(s) may need to be removed with a gingival flap -- a procedure in which the gums are separated from the teeth and folded back to allow a veterinarian to reach the root of the tooth and the bone. Living and Management After surgery, restrict your dog’s activity for the rest of the day. Feed him or her a soft diet—canned or moistened dry kibble—as well as restrict its access to chew toys for 24 hours after surgery. Your veterinarian will provide you with oral pain medication to give to your pet for one to three days after surgery. You may also be asked to administer an oral rinse or gel in your pet&#039;s mouth for three to five days after surgery. Daily brushing, meanwhile, should commence 24 hours after brushing."}]