[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Neuropathic Pain in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/neuropathic-pain-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/neuropathic-pain-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Brain health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_dg_neuropathic_pain"}, "datePublished": "March 18, 2010", "dateModified": "August 16, 2022", "description": "Neuropathic pain commonly results from an injury or disease relating to the body’s nerves and how they function, or within the spinal cord itself.", "articleBody": "Pain from the Nervous System in Dogs Neuropathic pain commonly results from an injury or disease relating to the body’s nerves and how they function, or within the spinal cord itself. This particular kind of pain is difficult to pinpoint, especially in patients that are unable to respond to specific inducements. Symptoms and Types Damage to the tissues of the body, and the nerves running through them, creates a constant (chronic) pain that is brought on by a light touch to the affected area and/or a heightened perception of pain. Pain originating within the spinal cord causes problems with mobility and various functions of the body. Some of the symptoms of neuropathic pain may include: Limping or dragging a limbShaking or twitching of the skinChewing on the affected areaMuscle wasting (atrophy)Crying out (vocalizing)Decreased appetiteUrinating and defecating inappropriately (incontinence)Causes Neuropathic pain may result from an injury to body tissues or a growth (tumor) in the spinal cord. Diseases that affect the spinal cord, such as intervertebral disc disease (IVDD), may cause pain in different areas of the body, depending on which part of the cord is affected. Another potential cause of neuropathic pain is amputation of a limb. Phantom limb pain results in the impression of pain coming from a leg that has been surgically removed. Diagnosis In general, neuropathic pain is diagnosed by ruling out other causes of pain and performing reflex tests to evaluate the nervous system. Basic blood tests can help rule out infectious and disease-related causes. X-rays and special imaging may be necessary to search for tumors in the bone or spinal cord. Finally, a good discussion of your dog&#039;s medical history and previous symptoms will help lead to the proper diagnosis.  Treatment Analgesic medications (those that relieve pain) are used as the initial treatment for neuropathic pain. The amount given may need to be changed until the best effect is achieved. Other types of pain relievers may be tried until the one that works best for your dog is found. Some veterinarians may choose to use several pain medications at one time and then taper off until only one is being given. One medication that has been used with success for long-term pain is gabapentin. This anti-seizure drug has analgesic properties that are particularly effective for reducing neuropathic pain in dogs. Gabapentin is given once daily for pain control and can be given with or without food. The particular side effects of this drug include sedation, weight gain and stumbling (ataxia). Diarrhea may also be seen in some animals. Living and Management Dogs with chronic pain may gain considerable relief from analgesic medications. The quality of life for these animals can be much improved, as long as the underlying condition causing the pain is under control. In dogs with kidney problems, the dosage of gabapentin may be reduced, as the drug is processed through the kidneys and they must be functioning properly for the drug to be removed from the body. Animals that are pregnant should not be treated with gabapentin. When discontinuing the medication, gabapentin should be slowly tapered off to prevent seizures from occurring after long-term use."}]