[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Atopic Dermatitis in Dogs: Causes, Symptoms, and Treatments", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/puppy-scratching-at-ear.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/puppy-scratching-at-ear.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_atopic_dermatitis"}, "datePublished": "February 13, 2020", "dateModified": "August 12, 2022", "description": "Learn about what atopic dermatitis is and how it can affect your dog’s quality of life.", "articleBody": "Reviewed and updated for accuracy on February 13, 2020 by Dr. Hanie Elfenbein, DVM, PhD Dog allergies are often caused by the allergens found in pollen, animal dander, plants, and insects, but dogs can also be allergic to food and medication as well. These allergies can cause symptoms such as excessive itching, scratching, and grooming; rashes; sneezing; watery eyes; paw chewing; and skin inflammation. When allergies cause skin disease, the condition is called atopic dermatitis (meaning itchy skin and inflammation). Here’s everything you need to know about atopic dermatitis in dogs. What Is Atopic Dermatitis in Dogs? Atopic dermatitis is an inflammatory, chronic skin disease associated with allergies. In fact, this is the second most common allergic skin disease in dogs, after flea allergy dermatitis. Causes of Dog Dermatitis These allergic reactions can be brought on by normally harmless substances like grass, mold spores, house dust mites, and other environmental allergens. At What Age Can Dogs Get Dermatitis? Dogs normally show signs of the disease between 1-6 years of age, though atopic dermatitis can be so mild the first year that it doesn’t become noticeable or consistent for several years. Symptoms of Atopic Dermatitis in Dogs Symptoms associated with atopic dermatitis often get worse with time, though they may also be seasonal. These are the most commonly affected areas in dogs: Ears Feet Underbelly Muzzle Armpits Groin Base of the tail Around the eyes In between the toes The symptoms associated with atopic dermatitis include: Itching Scratching Rubbing Licking A yeasty smell Greasy skin Redness or tough skin What Causes Atopic Dermatitis in Dogs? Some breeds are more likely to develop allergies, including Golden Retrievers, Poodles (and hybrids), Shih Tzus, Cocker Spaniels, and Bulldogs. However, any dog can develop allergies. While there’s no way to prevent your dog from developing allergies, there are several excellent treatment options available. Can Dogs Get Tested for Allergies? Prior to any treatment, your veterinarian will need a complete medical history to determine the pattern of your dog&#039;s allergies. Some allergies are seasonal, such as mold, while others are year-round. A complete physical examination is important in determining the best types of treatment. Your veterinarian will want to perform tests on skin samples from the affected areas. Serologic allergy testing may be performed, which looks for antibodies in the blood, but the results are not always reliable. The quality of this kind of testing often depends on the laboratory that analyzes the results. Intradermal testing may also be used to identify the cause of your pet&#039;s allergic reaction. This is where small amounts of test allergens are injected into the skin and wheal (a red bump) response is measured. Since these types of tests are very expensive, your veterinarian may recommend treatment instead of advanced allergy testing. Treatment for Atopic Dermatitis in Dogs The treatment will depend on what is causing your pet’s allergic reaction. If the reaction is due to atopy, a genetic disposition to an allergic reaction, for example, hyposensitization therapy can be performed. Your veterinarian will give your pet injections of the allergens to which they are sensitive. This decreases itchiness in 60-80% of dogs, but may approximately take 6 months to a year to see an improvement. Your veterinarian might recommend immunomodulatory medications. These are available either as a daily pill (Apoquel) or an injection given every 4-10 weeks (Cytopoint). Along with these, antibiotics or antifungal medicines are often required to treat the skin infections that result from allergies. Additionally, regular bathing with medicated or prescription-strength shampoo can greatly improve your pet&#039;s comfort and help skin infections resolve faster. Shampoo and other topical treatments can also be used as maintenance therapy to reduce the risk or severity of future skin infections. Does Atopic Dermatitis Go Away? Unfortunately, atopic dermatitis only rarely goes into remission or spontaneously resolves. Once treatment has begun, your veterinarian must see your dog every 2-8 weeks to ascertain the effectiveness of the treatment and to check for drug interactions. Then, as your pet&#039;s itching becomes more controlled, they will need to be brought into the veterinarian&#039;s office every 3-12 months for checkups.  It’s very important to stay vigilant and make sure your dog gets treatment at the first sign of an itch. If left untreated, allergies can change a dog’s personality—the constant itch and frustration can lead dogs to shy away from people or be aggressive when touched. This is especially true for dogs with ear infections as part of their allergy symptoms. Chronic ear infections can also lead to deafness. If your veterinarian should find the trigger for your pet&#039;s allergies, he or she will advise you as to how to best avoid those type of allergens.  Featured Image: iStock.com/MRBIG_PHOTOGRAPHY"}]