[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Estrus Symptoms after Spaying in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/estrus-symptoms-spaying-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/estrus-symptoms-spaying-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_ovarian_remnant_syndrome"}, "datePublished": "September 30, 2009", "dateModified": "August 16, 2022", "description": "Surgical removal of the uterus and ovaries in a female dog is called an ovariohysterectomy. This type of surgery results in the cessation of subsequent estrus (heat) symptoms in the female.", "articleBody": "Ovarian Remnant Syndrome in Dogs Surgical removal of the uterus and ovaries in a female dog is called an ovariohysterectomy. This type of surgery results in the cessation of subsequent estrus (heat) symptoms in the female. However, sometimes after an ovariohysterectomy, some female dogs continue to exhibit the behavioral and/or physical signs pertaining to estrus. This is typically found to be the result of ovary tissue being left behind. If such tissue remains functional and continues to secrete hormones, behavioral and/or physical signs of estrus in the female dog are seen. Such symptoms are usually seen within a few days after surgery and are not uncommon after an ovariohysterectomy. Symptoms and Types Swelling of the vulvaVaginal dischargeAttraction of male dogsPassive interaction with male dogsMay allow sexual intercourse to take placeCauses Failure to remove both ovaries completely during surgeryPresence of abnormal ovarian tissueSupernumerary ovary (excessive number of ovaries - rare)Diagnosis You will need to give a thorough medical history of your dog&#039;s health, onset of symptoms, and when your dog had the ovariohysterectomy. The history will usually include behavioral changes and signs of estrus that have occurred even after a successful surgical removal of the ovaries and uterus had been done. After taking a complete history, your veterinarian will conduct a complete physical examination. Standard laboratory tests will include a complete blood count (CBC), biochemistry profile, and urinalysis. It is not unusual for the results of these tests to return within normal ranges. More specific tests for measuring your dog&#039;s hormones may show estrogen and progesterone levels that are higher than should be expected in a post-surgery dog. A cytological examination of samples taken from the vagina will also help in determining the status of estrus in your dog. In addition, ultrasound can be used to determine whether any ovarian tissue residues are present. However, in some cases abdominal surgery may be required to confirm the presence of ovarian tissue. If this is found to be the case, removal of these residual tissues can take place at that time.  Treatment After reaching a confirmatory diagnosis, your veterinarian will consult with you about a second round of surgery to remove any left-over functioning ovarian tissue. Living and Management Prognosis is very good after the removal of ovarian tissue residues has been performed. All abnormal symptoms should resolve soon after surgery. Patients undergoing an ovariohysterectomy or follow-up surgery to remove remaining tissue will need painkillers for a few days after surgery. Preventive antibiotics are also used for some patients to prevent infection. Give medications as prescribed and follow the guidelines for proper nutrition and medication. Do not give any additional medications or supplements to your dog without first consulting your veterinarian."}]