[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cholangiohepatitis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1445008380.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1445008380.jpg"}, "author": {"@type": "Person", "name": "Heidi Kos-Barber, DVM", "url": "https://www.petmd.com/author/dr-heidi-kos-barber"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_cholangitis_cholangiohepatitis_syndrome"}, "datePublished": "January 6, 2023", "dateModified": "January 6, 2023", "description": "Dr. Heidi Kos-Barber explains cholangiohepatitis in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Cholangiohepatitis in Dogs? The biliary system in dogs is made of ducts that collect and direct bile from the liver and the gall bladder which stores bile. Just like any other tissue in the body, the ducts, gall bladder, and the liver can become inflamed. Inflammation of the ducts and gall bladder is called cholangitis. Inflammation of the liver is called hepatitis. These conditions can occur independently or together in what is termed cholangiohepatitis. Symptoms of Cholangiohepatitis in Dogs The following clinical signs may be present during cholangiohepatitis in dogs: Lethargy (decreased energy level) Decreased to absent appetite Dehydration Weight loss Vomiting Diarrhea Jaundice (yellow pigmentation in the skin, whites of the eyes) Fever Distended, painful abdomen Causes of Cholangiohepatitis in Dogs Cholangiohepatitis is more common in cats than dogs. Conditions that interrupt normal flow of bile through the liver and from the gall bladder, such as gall bladder stones (choleliths) and thickened bile material in the gall bladder (gall bladder mucocele), can predispose dogs to the development of cholangiohepatitis. Infection from intestinal bacteria into the biliary system or spread of bacteria to the biliary system via the bloodstream, can also result in cholangiohepatitis. How Veterinarians Diagnose Cholangiohepatitis in Dogs Initially, your veterinarian will recommend performing a general lab panel (blood and urine tests). This panel will provide an overall check of the organ systems and, in the case of cholangiohepatitis, changes in the values associated with the liver. Abnormalities in the liver values on lab work are not specific for cholangiohepatitis, as other liver conditions can cause similar changes in the values. Therefore, your veterinarian will recommend imaging the liver using ultrasound. Liver size and the appearance of the liver tissue, gall bladder, and biliary ducts will be assessed. Fluid in the abdomen (ascites) can also be detected with ultrasound.  Combining lab work and ultrasound findings may result in a suspicion for cholangiohepatitis, but liver and gall bladder biopsy and culture to check for bacterial involvement are needed for a confirmed diagnosis of this condition. Liver biopsies and gall bladder bile collection can be obtained via ultrasound, guided needle aspiration, laparoscopy, or surgery. Ultrasound-guided needle biopsies/bile collection presents the greatest risk for leakage of bile into the abdomen, when compared to the other two biopsy methods.  Liver biopsies will be evaluated for the type of inflammation present and will determine if the inflammation involves only the biliary system or if the liver tissue adjacent to the biliary ducts is also affected. Liver tissue and bile samples will be collected and checked for bacteria, via culture. If bacteria are present, the type of bacteria will be identified and a determination will be made regarding the best antibiotic(s) to use for treatment.    Treatment of Cholangiohepatitis in Dogs If a dog has cholangiohepatitis due to impaired flow of bile, secondary to gall stones (choleliths) or a gall bladder mucocele, surgery is typically recommended to address the underlying problem. If a dog has a severely diseased gall bladder wall and bile leaks into the abdomen causing inflammation (bile peritonitis), surgical treatment is needed. A dog that is not responding to medications for cholangiohepatitis is also a surgical candidate.    Medical management will include antioxidant medication, such as S-Adenosylmethionine (SAMe) and possibly Vitamin E, to help the liver. Ursodiol, may be prescribed to help improve bile flow. Antibiotics will be chosen based on culture/sensitivity results and treatment can extend from six to eight weeks—sometimes longer. Pain medication will be provided if a patient pet shows signs of abdominal discomfort. Sometimes anti-inflammatory medication, such as prednisolone/prednisone may be used depending on the case. Supportive care largely depends on the degree of illness. If a pet patient is vomiting, lethargic, develops jaundice, or runs a fever, hospitalization and IV fluid support is needed. Medications to help control nausea and pain will also be required. A severely ill pet may need special fluids or a plasma transfusion(s) if liver function is severely compromised.  Cholangiohepatitis can be cured with medical and/or surgical treatment.  However, the condition can be fatal if a patient is more severely affected (has a ruptured gall bladder or bile peritonitis). Recovery and Management of Cholangiohepatitis in Dogs Treatment for cholangiohepatitis can extend up to eight weeks or longer. Depending on the degree to which the liver and gall bladder are affected, a patient may need to be on long-term medications such as SAMe, Vitamin E, or Ursodiol. Your veterinarian will want to monitor liver values, and possibly other parameters routinely, (possibly every two-to-four weeks—or more frequently for several months. At least yearly, if not more frequently, lab work checks will be recommended for life.  Recovery from cholangiohepatitis can take several weeks. If there is extensive damage to the biliary tract and liver, scar tissue may form, and a complete recovery will not be achieved.  Overall, the prognosis depends on the type of cholangiohepatitis present (based on biopsy) and the severity of illness. A dog that is treated sooner in the course of this illness will have a better prognosis than a dog with a more advanced progression of cholangiohepatitis. A dog with a ruptured gall bladder and bile peritonitis has a guarded-to-poor prognosis.  An annual examination, with yearly blood/urine testing, is potentially helpful in diagnosing this condition in its early stages. Even if a canine patient is not showing signs of illness, your veterinarian would note changes in liver values and recommend an abdominal ultrasound."}]