[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does an epulis in dogs look like?", "acceptedAnswer": {"@type": "Answer", "text": "An epulis in a dog can look smooth or have a cobblestone appearance. It can grow in a mound or as a stalk, and is often the same color as the gums."}}, {"@type": "Question", "name": "Is an epulis painful for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "An epulis is not painful unless there is difficulty with chewing, grooming, or playing with toys. If an epulis gets very large, that may also be painful."}}, {"@type": "Question", "name": "Does epulis in dogs turn malignant?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, some types of epulides (plural of epulis) are considered cancerous. They usually don’t spread to other parts of the body but can weaken the jawbone or cause loose teeth. If an epulis is allowed to get very large, it can make eating difficult and cause disfigurement. Some cancerous masses such as amelanotic melanoma may look like an epulis, so never ignore a growth in your dog’s mouth."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Epulis in Dogs (Benign Gum Growth)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/border-collie-picture.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/border-collie-picture.jpg"}, "author": {"@type": "Person", "name": "Hanie Elfenbein, DVM", "url": "https://www.petmd.com/author/dr-hanie-elfenbein"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_dg_epulis"}, "datePublished": "October 20, 2021", "dateModified": "August 12, 2022", "description": "Dr. Hanie Elfenbein explains epulis in dogs, including common symptoms and treatment for this abnormal growth that appears in dogs’ mouths.", "articleBody": "What Is an Epulis in Dogs? An epulis refers to a benign (noncancerous) mass-like growth in the mouth that typically grows over or around a tooth. Epulides (plural of epulis) arise from the periodontal ligament, a small piece of tissue that connects the tooth and the surrounding bone. An epulis in dogs may be smooth or cobblestone in appearance and can grow in a mound or on a stalk. Epulides are usually the same color as a dog’s gums. Types of Epulides in Dogs These are the main types of epulides in dogs, which look and feel the same: Peripheral odontogenic fibroma (fibromatous and ossifying epulides) Acanthomatous ameloblastoma (acanthomatous epulides) Acanthomatous ameloblastomas may grow into the bone and cause movement or loosening of a dog’s teeth, or they can weaken the bone, which leads to a fracture. Are All Growths in a Dog’s Mouth an Epulis? Not necessarily—there are several types of oral tumors in dogs and other possible illnesses that can create a growth in your dog’s mouth: Gingival hyperplasia is a condition where a dog’s gums grow in excess throughout their mouth, as opposed to discrete masses. Melanoma may form masses in the mouth that can be malignant (cancerous). Squamous cell carcinoma can also form tumors in the mouth and is an aggressive form of cancer. Symptoms of Epulis in Dogs You may notice a growth in your dog’s mouth before they show any other symptoms. However, common symptoms of an epulis in dogs include: Decreased appetite Drooling Bad breath Bleeding from the mouth Chewing on one side of the mouth Reluctance to catch toys or play tug An epulis may cause movement or even loosening of a  dog’s teeth. This can result in mouth pain and having difficulty closing the mouth or chewing. Causes of Epulis in Dogs The specific cause of this overgrowth of tissue is not known. Some breeds are predisposed to epulides, including Shetland Sheepdogs, Old English Sheepdogs, and brachycephalic (short-nosed) breeds such as American Bulldogs, English Bulldogs, and Boxers. How Vets Diagnose Epulis in Dogs Your veterinarian will examine your dog’s mouth as part of their complete physical exam. Once the epulis is identified, the next step is to surgically remove the growth using anesthesia. Most veterinarians require recent bloodwork before performing an anesthetized procedure for the safety of your dog. Often, removal of the epulis will be combined with a thorough cleaning of the teeth and gums as well as dental x-rays. These help the veterinarian determine how deep the mass goes, whether there are any other structures involved, and whether anything else needs to be addressed to keep your dog’s mouth healthy. Having this information about the mass helps the vet plan your dog’s oral surgery. Large masses or masses that could be cancerous may be biopsied before being removed. This is to gather more information about the growth to inform the best treatment approach. If your veterinarian is concerned that the mass may be cancer, she will recommend chest x-rays prior to anesthesia to make sure there are no detectable metastases (malignant growths in the lungs). Treatment for Epulis in Dogs The treatment for epulis in dogs is surgical removal, which is usually locally curative. This means that even though the entire growth is removed, other masses are not prevented from growing in the future. It is easier and safer to remove an epulis when it is small. In fact, the larger the tumor, the more likely it is to regrow after removal. Once the mass is removed, it will be sent to the veterinary pathologist for examination at the cellular level. The pathologist can determine which type of epulis your dog had and whether any follow-up treatment is required. Radiation therapy may reduce the likelihood of regrowth, especially in cases where complete removal was not possible. If an epulis has become very large, your regular veterinarian may not be able to remove it. She may refer you to a veterinary dentist, who is a board-certified specialist, for advanced options. Recovery and Management of Epulis in Dogs Recovery from epulis removal typically only takes a few days. Your veterinarian will likely recommend feeding your dog soft or canned food during the recovery period, and they will send home pain medication to keep your dog comfortable. Antibiotics are not required after all procedures, but if your veterinarian recommends them, make sure to use them as directed and to give your dog all of the medication. Your dog may or may not have stitches in their mouth. If stitches are present, they will usually fall out on their own after 10-14 days. New epulides may form over time, either in the same or different locations in the mouth. Your veterinarian will monitor your dog’s oral health at every visit. See our Dog Surgery Aftercare FAQs for general info on caring for your dog after surgery."}]