[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "IBD in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1008984788.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1008984788.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Condition, Digestive health, Symptom Checker, Inflammatory Bowel Disease", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_inflammatory_bowel_disease"}, "datePublished": "October 7, 2022", "dateModified": "September 12, 2023", "description": "Dr. Michael Kearley discusses the syndrome of IBD (irritable bowel disease in dogs), including symptoms, possible long-term treatment options, and common causes.", "articleBody": "What Is IBD in Dogs? Despite its name, inflammatory bowel disease, or IBD, is not a disease but a syndrome that is caused by chronic irritation of the intestinal tract. It stems from multiple factors, which are usually a group of symptoms that occur because of a single disease or combination of diseases. Whatever the cause, the result is inflammation within the gastrointestinal (GI) tract. Often coupled with a defective immune system, this inflammation leads to a greater allergic response triggering more inflammation, pain, and thickening of the GI tract. Over time, this results in an inability to digest and absorb nutrients properly. Regardless of its cause or causes, IBD significantly impacts your dog’s quality of life and should not be ignored.  IBD can affect any part of the GI tract, including the stomach, small intestine, large intestine, or any combination. IBD should not be confused with IBS (irritable bowel syndrome); IBS is a disease that affects the intestinal muscles, specifically those of the large intestine, and causes constipation and diarrhea in dogs. Fortunately, IBS in dogs is extremely rare. Symptoms of IBD in Dogs Most often, your dog may experience the following symptoms associated with the GI tract, which may have been intermittent and occurred over the course of several weeks: Vomiting Diarrhea Poor appetite Excess gas Melena (black tarry stools) If left untreated, these symptoms will lead to poor absorption of nutrients, weight loss, abdominal distension, swelling of the extremities, and, in extreme cases, blood clots, which are often fatal. Causes of IBD in Dogs As a syndrome, IBD often stems from different causes and, unfortunately, in most cases, the underlying cause is never known. Conditions often associated with IBD, all of which cause inflammation of the GI tract and trigger an immune response, include: Parasitism, often seen with Giardia Bacterial infections and other infectious agents Dysbiosis, the alteration of normal bacterial populations within the GI tract Food allergy or sensitivity Overactive or exaggerated immune response (often termed “autoimmune”) Additionally, genetic factors may be a consideration, as some breeds such as Yorkshire Terriers, German Shepherds, and Boxers, are predisposed to the condition. How Veterinarians Diagnose IBD in Dogs A physical exam by your veterinarian may offer IBD as a possible diagnosis, but in and of itself the physical exam is not diagnostic. Laboratory testing such as bloodwork, urinalysis, and even imaging such as x-rays and an ultrasound may be recommended. The results of these tests would be supportive of IBD, but ultimately, biopsies of the intestinal tract are needed for a true diagnosis. As the gold standard, biopsy can be performed via endoscopy, colonoscopy, or exploratory surgery. However, because biopsy can be cost-prohibitive and is invasive, in many cases IBD is presumed. Supportive information gathered from the above tests may show signs of: Anemia (low red blood cell count), due to chronic blood loss or inflammation Low proteins (albumin, cholesterol) Increased liver enzymes (ALT, ALP) Gas and fluid distended intestinal segments Increased thickness of the intestinal walls Additional tests your veterinarian may recommend include a stool exam for cases of parasitism, blood tests to help determine absorption ability, and an ACTH stimulation test to rule out Addison’s disease (adrenal insufficiency). Treatment of IBD in Dogs Unfortunately, there is no cure for IBD; however, it can be controlled and managed. It’s important to follow your veterinarian’s guidelines throughout treatment, since a combination of medications is typically required to ensure your dog’s well-being. Anti-inflammatories and immunosuppressives are the mainstay of treatment, with prednisone, budesonide, and azathioprine being the most commonly prescribed. These medications are not without risks. It’s important to discuss the side effects with your veterinarian and to not discontinue their use without your veterinarian’s recommendation.  Additionally, as food sensitivity is an important factor in IBD, your veterinarian will most likely prescribe a change of diet. This may entail a novel protein diet (consisting of less commonly used sources of protein, such as fish, duck, rabbit, venison, or kangaroo) or a hydrolyzed diet, where the protein is chemically broken into pieces so small that the immune system is less likely to react. In some cases, this may be effective as the sole therapy.  Given the limitations of stool exams, deworming and an antibiotic trial may also be recommended. Recent studies have shown that probiotics and prebiotics are beneficial in restoring and maintaining GI health and help promote the growth of good bacteria. What If a Dog with IBD Isn&#039;t Getting Better? Even with the right combination and dose of medications, it is not uncommon for IBD  treatment to take a while. Be patient; it often takes several weeks to see improvement in your dog’s symptoms but working with your veterinarian and adhering to the re-check guidelines and lab tests will be key to tracking your dog’s response to treatment. Recovery and Management of IBD in Dogs IBD is a lifelong condition with no cure. Do not stop treatment without first consulting your veterinarian. Most likely, the drugs originally prescribed will be slowly tapered over the course of several weeks to months, to ensure that the lowest effective dose that controls symptoms and minimizes reactions is used. Your dog’s prognosis will depend on the extent of the syndrome, with a lower chance of long-term recovery for pets with low protein levels.  Because the immune system is affected, caution should be taken with any medications or injections (such as vaccines) that could cause its stimulation, so be sure to discuss the inherent risks and benefits with your veterinarian prior to administration. Featured Image: iStock.com/ollykim"}]