[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/3v426taal4", "@type": "VideoObject", "duration": "PT1M49S", "name": "5349437805001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/08fb0ed1289b2e5ccc515ddc6d5458c929de1e1b.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/3v426taal4", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/e5728fc3c79537566ee7eb83ff77ab9319da7d72.m3u8", "transcript": "Atopic dermatitis is an inflammatory chronic disease in dogs that's often associated with allergies. It's the second most common allergic skin disease that affects our canine Companions environmental allergens such as animal dangers airborne pollens mold spores and even dust mites can trigger allergic reactions in dogs. A family history of skin allergies may also make dogs more susceptible to these allergens atopic dermatitis can cause excessive itching scratching rubbing and licking especially around dog's face paws or the underarm area. Other commonly affected areas in dogs include the ears lower legs the muzzle energy.\n\nThe groin around the eyes and in between the toes. These symptoms often progressively worse and over time and a dog's skin may become red, inflamed and raw. Dogs normally show signs of the disease between three months and six years of age. But it might not become clinically apparent before the third year.\n\nYour veterinarian will conduct a comprehensive physical exam to determine the underlying cause of your dog's skin allergies blood or skin patch. Testing may be performed. A dermatologist referral may even be recommended once the cause is identified and appropriate treatment method can be chosen. Options to decrease itchiness may include hypo sensitization therapy in which dogs will receive injections that contain small amounts of the allergens that they're sensitive to medications such as corticosteroids and in a histamine can be given to reduce itching and immunosuppressant medication may also be prescribed to help control itching associated with long term skin allergies or your veterinary and may suggest topical treatments for relief like a.h. sprays therapeutic shampoos and even leave on conditioners to help alleviate his symptoms.\n\nO", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/skin/c_dg_sebaceous_adenitis?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Inflammatory Skin Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/inflammatory-skin-disease-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/inflammatory-skin-disease-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_sebaceous_adenitis"}, "datePublished": "January 9, 2009", "dateModified": "August 16, 2022", "description": "Sebaceous adenitis is a rare type of inflammatory skin disease that affects the skin glands of young and middle age dogs.", "articleBody": "Sebaceous Adenitis in Dogs Sebaceous adenitis is a rare type of inflammatory skin disease that affects the skin glands of young and middle age dogs. This condition most commonly affects Poodles, Akitas, and Samoyeds, although other breeds -- and some cats (rarely) -- can also be infected. Symptoms and Types There are two primary types of sebaceous adenitis. One type occurs in long-coated animals, and the other type occurs in short-coated breeds. The signs and symptoms of sebaceous adenitis in long-coated breeds include the following symptoms: AlopeciaOdor along the hairlineSmall clumps of matted hairCasts forming around the hair shaftHair that becomes dull and brittle or coarseIntense itching along the hairline and scratchingBacterial infections along the hair follicleSilver-white scales on the skinClusters of skin lesions that form in certain areas of the headAmong short-coated breeds the following signs and symptoms are most commonly reported: Alopecia -- often occurring in a circular pattern, or diffuse and spread out along the hairlineMild scaling of skin along the head, trunk and ears of the dog’s bodySecondary bacterial infection along the hairline, although this is less common among short-hair breedsCauses The exact cause for sebaceous adenitisis is unknown; researchers are currently studying the causes. Diagnosis Your veterinarian will rule out other conditions before confirming a diagnosis of sebaceous adenitis. Some other causes for similar symptoms include the following conditions: Primary seborrhea -- a skin disorder known as a keratinization disorder, a process whereby the dog’s body produces a substance known as keratin. This disorder can also cause flaking and itching of the skin.Demodicosis -- an overgrowth of skin mites that can cause itching, hair loss, and inflammationDermatophytosis -- a fungal infection that causes itching and flakingEndocrine skin diseaseDiagnostic procedures used to test for sebaceous adenitis include skin scrapings and endocrine function tests, which usually return as normal. Skin biopsies may also be taken for lab testing. Pathologic testing may reveal inflammatory reactions of the sebaceous glands -- the fatty glands found in the hair follicles, which provide oil to the hair and skin. With long-coated breeds, there may be raw and blistered skin, and even complete loss of the sebaceous or oil producing glands during advanced stages of the disease. Some animals may show evidence of advanced sebaceous adenitis, with excessive fibrous tissue or destroyed hair follicles, although this is very rare.  Treatment Treatment will depend on the stage of the disease and whether the animal is a long or short-haired breed. Clinical signs of the disease may come and go with time, and the results of the treatment will also often vary, depending on the stage of the disease once your pet has received a proper diagnosis. Some dogs are more responsive to treatment than others. Historically, Akitas are less responsive to treatment than other breeds. A caretaker may need to try multiple treatments before finding a successful one. Your veterinarian may recommend one, or more, or the following home treatments: Brushing lightly to remove flakingInternal medications to relieve advanced stages of the diseaseA mixture of oils, water based solutions, and other skin rubs and shampoos to help remove scales and moisturize the skinUse of antibacterial products and antibiotic-based shampoos to help with symptomatic reliefSoaking in oil and massaging oil throughout the skin to encourage sloughing of flaking skin and scales.  Living and Management Many researchers and veterinarians advise dogs owners to register their pets so that they can be tracked. In this way, researchers may be able to discover a mode of inheritance for the disease. See Also"}]