[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cardiac Arrest in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cardiac-arrest-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cardiac-arrest-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_cardiac_arrest"}, "datePublished": "April 15, 2010", "dateModified": "August 16, 2022", "description": "Cardiac arrest occurs when normal blood circulation ceases due to the heart&#039;s inability to contract (heart failure). Learn more about Dog Cardiac Arrest at PetMd.com.", "articleBody": "Cardiopulmonary Arrest in Dogs Cardiac arrest (also known as cardiopulmonary arrest or circulatory arrest) occurs when normal blood circulation ceases due to the heart&#039;s inability to contract (heart failure). Like many other body systems, the respiratory and cardiovascular systems work in a coordinated fashion. Therefore, if a dog fails to breathe for more than six minutes, it can lead to heart failure and cardiac arrest -- both of which can be fatal. Cardiac arrest can occur in dogs of any age, sex, or breed. Symptoms and Types Blood circulation may remain intact if the animal resumes breathing within four minutes of the initial problem. However, if it lasts longer than six minutes it can lead to cardiac arrest. Common symptoms associated with this emergency include: Dilated pupilsSpontaneous loss of consciousness (syncope)Bluish discoloration of the skin and mucous membranes (cyanosis); a sign that oxygen in the blood is dangerously diminishedHeavy breathing (dyspnea) and gaspingHypothermiaLack of response to stimulationCauses Abnormally low levels of oxygen in arterial blood (hypoxemia)Low oxygen supply; possible due to anemiaHeart disease (e.g., infections, inflammation, trauma, neoplasia of heart)Metabolic diseasesElectrolyte imbalances (e.g., hyperkalemia, hypocalcemia, hypomagnesemia)Abnormally low bodily fluid levelsShockUse of anesthetic drugsBlood poisoning caused by bacterial toxic substances in the blood (toxemia)Brain traumaElectrical shockDiagnosis Cardiac arrest is an emergency that will require immediate veterinary assistance to assess the animal&#039;s condition and the form of treatment. You will need to give a thorough history of your dog’s health to your veterinarian, including the onset and nature of the symptoms and possible incidents that might have precipitated the complications. He or she will then perform a complete physical examination, focusing on the dog&#039;s airways, breathing ability, and circulation. Your veterinarian will also constantly monitor your dog&#039;s blood pressure and pulse rate. Routine diagnostic exams used to determine the underlying cause of the cardiac arrest include chest X-rays, complete blood count, biochemistry profile, and urinalysis. Blood samples are collected to determine the level of gases, including oxygen, in the blood. Dogs suspected of having an underlying heart disease may undergo echocardiography to evaluate the extent of the problem.  Treatment This is a life-threatening emergency that will require immediate hospitalization and intensive nursing support and treatment. The primary goal is to restart the dog&#039;s heart rhythm and respiration rate, which may require cardiopulmonary resuscitation (CPR). Once the trachea is cleared and CPR is performed, a tube may be passed into the trachea to facilitate breathing. Oxygen may also be supplied to normalize the blood oxygen levels. Dogs with heart failure may require external cardiac massage to stimulate heart to beat normally. Those unresponsive to cardiac massage may receive rapid chest compressions. Typically medications are administered to assist in normalizing cardiac functions. Otherwise, the chest is incised to provide the open chest resuscitation to the animal or medications are administered directly into the heart -- both of which are considered a last resort. Living and Management The overall prognosis will depend on the underlying cause of the cardiac arrest and the course of treatment. Unfortunately, less than 10 percent of dogs recover, even after successful emergency treatment. If your dog&#039;s condition does stabilize, it will need to stay in the hospital for a few days. There, the veterinarian may monitor cardiac functions and blood pressure and and treat any further complications."}]