[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Masculinizing Sex Hormone Deficiency in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Endocrine health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_hypoangrogenism"}, "datePublished": "April 10, 2010", "dateModified": "August 16, 2022", "description": "Hypoandrogenism refers to the relative or absolute deficiency of masculinizing sex hormones, such as testosterone and its by-products.", "articleBody": "Hypoandrogenism in Dogs   Hypoandrogenism refers to the relative or absolute deficiency of masculinizing sex hormones, such as testosterone and its by-products. Also known as androgens, these hormones are produced by the adrenal cortex -- part of the adrenal glands, which are located above each kidney -- and the testes in the male, and by the ovaries in the female. There are two subtypes of the condition: primary and secondary. Primary hypoandrogenism in the male is a rare condition associated with bilaterally symmetric hair loss in older castrated male dogs, especially the Afghan hound. It may be seen in association with testicular destruction in association with inflammatory testicular disease; however, the latter is not usually associated with clinical signs other than a lack of libido and spermatogenesis. Primary hypoandrogenism is also documented in females, but is rare. Conversely, secondary hypoandrogenism is due to such conditions as hyperadrenocorticism (an endocrine disorder) and hypothyroidism, and is far more common. Although congenital forms exist as well, it is more common in older animals. In some cases, symptoms may begin to appear around puberty in the form of behavioral or anatomic abnormalities.   Symptoms and Types   Failure to cycleLow libidoDry, dull hair coatCoat color changeSmall, underdeveloped testesPoor semen qualityInfertilityIncontinenceLack of body growth, dog is smaller than expected for its breed typeMale dog does not raise its leg to urinate  Causes Administration of steroid compoundsTesticular degenerationCastrationPituitary tumorFailure of testes to descend (cryptorchidism)In addition, Boston terriers are predisposed to hypoandrogenism. The low fetal androgen production is thought to be associated with the occurrence of hypospadias, a birth defect of the urethra in the male. Diagnosis   A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis as well as a number of other tests to identify the underlying cause such as hypothyroidism.  For example, your doctor will want to know how the thyroid is functioning. The physical exam and the history you provide will also be helpful. You will need to give a thorough history of your dog&#039;s health, onset of symptoms, and possible incidents that might have led to this condition. If there has been hair loss your doctor may also perform a skin biopsy, and a testicular biopsy can be useful for determining whether there is an inflammatory testicular disease.    Treatment   Treatment will depend on the underlying cause, but your veterinarian may attempt hormone replacement therapy to see if it raises the androgen levels.   Prevention   If your dog is to be used for breeding, avoid drugs that are known to cause hypoandrogenism (e.g., steroid compounds).   Living and Management   Your veterinarian will ask you to keep track of any responses you see to the prescribed therapy, and will schedule follow up visits in order to conduct periodic tests to look for clinical signs that the treatment plan is working."}]