[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/8p5lf7fk24", "@type": "VideoObject", "duration": "PT1M20S", "name": "5327109450001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/131a37e09fa0f788ac0c2eb0f2124d0a46f84e32.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/8p5lf7fk24", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/d8451f7a63b61342cc8a6406e061a83ddb76a658.m3u8", "transcript": "Hi, my name is Dr. Gerry Post. I'm a veterinary oncologist at the vet Mary Cancer Center in Norwalk, Connecticut. The question for today is, can we cure your pets cancer.\n\nAnd if not, how long will it take before cancer comes back. And the answer to that question has really changed over time. We are now able to cure more and more cancers whether it be with surgery, chemotherapy, radiation therapy or a combination of all three. Unfortunately, we can't cure all cancers.\n\nBut we are getting better. And if the cancer's come back. Sometimes they come back really quickly and within a month to three months. But I would say the average is somewhere between 1 and three years for many cancers.\n\nIf we don't cure them for them to come back and now we have not only one type of therapy. But multiple types of therapies. So that if one therapy fails there are other therapies that we can use for most cancers. Thank you for watching.\n\nFor more information, please visit paramedic's.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/cancer/c_dg_squamous_cell_carcinoma_digit?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Foot/Toe Cancer in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/foot-toe-cancer-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/foot-toe-cancer-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_squamous_cell_carcinoma_digit"}, "datePublished": "August 3, 2009", "dateModified": "August 16, 2022", "description": "Dogs can be afflicted with several types of skin tumors, even on their feet and toes. The most common type of type of tumor to affect the toes is a squamous cell carcinoma.", "articleBody": "Digital Squamous Cell Carcinoma in Dogs Dogs can be afflicted with several types of skin tumors, even on their feet and toes. The most common type of type of tumor to affect the toes is a squamous cell carcinoma. A squamous cell carcinoma (SCC) can be described as a malignant and particularly invasive tumor that takes hold in the scale like cells of the epithelium – the tissue that covers the body or lines the cavities of the body. These scale like tissue cells are called the squamous. Carcinoma is, by definition, an especially malignant and persistent form of cancer, often returning after is has been excised from the body and metastasizing to other organs and locations on the body. A squamous cell carcinoma usually comes from the skin around the nail. It commonly affects the bone and tissue around it, spreading slowly enough that it can be caught before it is able to spread to other areas of the body. In dogs, squamous cell carcinomas usually affect only one toe. The tumor may appear as a small nodule, a reddish colored skin plaque, or as a papule – small and blister like in appearance, but differentiated by its lack of fluid. The SCC does not retain its appearance as a solid mass. Over time it will grow, the tissue within the mass will die (necrotize), and the tumor will ulcerate. Large breed dogs and black colored dogs are more likely to be affected by these tumors. Labrador retrievers and standard poodles appear to be more vulnerable than other breeds. And, as with most types of carcinomas, squamous cell carcinoma is most likely to be seen in older dogs, around ten years old, though it has been also been diagnosed in younger dogs. Symptoms and Types Swollen toe or footLimping, reluctance to walkUlcer (sore) on toeBleeding ulcer on a toeBroken nail on a toe with a soreSolid, raised mass of skin on the toe (i.e., nodule, papule)Usually only one toe is affectedMay be without other symptomsCauses There is no known cause of squamous cell carcinomas of the toe in dogs. Diagnosis You will need to provide a thorough history of your dog&#039;s health leading up to the onset of symptoms. Be sure to describe any sores that have been apparent on other parts of the body, even if you suspect they were caused by injuries resulting from outdoor activity, or from scratching at the skin. During the examination, your veterinarian will look carefully for other sores or tumors on your dog&#039;s body. The lymph nodes will be carefully felt to determine if they are enlarged, an indication that the body is reacting to an infection or invasion. A sample of lymph fluid may be taken to test for cancerous cells. Your veterinarian will order complete blood count and biochemistry profile to make sure your dog&#039;s other organs are working normally and to determine whether the white blood cell count is higher than normal; again, an indication that the body is fighting an invasive disease or infection. X-rays images of your dog&#039;s chest will allow your veterinarian to visually inspect the lungs for signs of any abnormalities, especially tumors. X-rays of your dog&#039;s foot will also be ordered to determine how deep the tumor is in the tissue and whether the tumor on the toe has spread to the bones in the foot. A biopsy will be taken of the tumors so that your doctor can diagnose the specific type of growth it is, whether carcinoma or a benign mass of tissue. If your dog has sores or tumors in other areas, your veterinarian will also order biopsies of these for analysis.  Treatment Treatment will depend on how many tumors or sores your dog has and whether or not they have spread to other areas of the body. If your dog has only one tumor on one toe, it will most likely be treated with surgery. To be sure that all of the carcinoma is removed, the toe with the tumor will be removed entirely (amputated). Most dogs recover well from this type of surgery and are able to walk normally afterwards. If the tumor has spread to other areas, surgery alone may not be enough to treat your dog. Surgery, along with chemotherapy or other types of therapy may be recommended. If your veterinarian is not specialized in this area of animal medicine, he or she may recommend a veterinary cancer specialist so that you can determine if there are other viable treatment options for treating your dog. In the meantime, your veterinarian can prescribe a medication to help minimize your dog&#039;s pain. Living and Management If your dog has had surgery to remove a toe, it may limp a little and have some pain in its foot afterwards. Pain medication will help your dog to move through the transition, and its activity may need to be limited until it has completely recovered from the surgery. Otherwise, once it has recovered, your dog should not have any difficulty compensating quickly for the lost digit. If the tumor was limited to one spot and had not metastasized to other parts of the body, a full recovery can be expected. While this type of cancer has a good chance of not recurring, as with any cancer, it is recommended that you take your dog for regular progress checks with your veterinarian. Even if the entire tumor could not be removed, most dogs do well for at least one year after surgery."}]