[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Abortion in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/abortion-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/abortion-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_abortion_termination_of_pregnancy"}, "datePublished": "February 11, 2009", "dateModified": "August 16, 2022", "description": "There are numerous reasons for why pet owners would like to prevent pregnancy in their pets. Search Dog Abortion diagnosis and treatments at PetMd.com.", "articleBody": "There are numerous reasons for why pet owners would like to prevent pregnancy in their pets. There are numerous reasons for why pet owners would like to prevent pregnancy in their pets. It is a common concern, and there are ways to perform a safe pregnancy termination if your dog has become pregnant. If you are considering ending a pregnancy in your dog, it is recommended that you first seek the advice and assistance of a medical professional, so that a full risk and side effects evaluation can be done. On the other hand, it is also important to note that dogs can experience spontaneous abortions or miscarriages for a variety of medical reasons. Both situations will be covered here. Symptoms and Types If your dog has experienced a spontaneous abortion, the most common thing you may notice is abnormal vaginal bleeding; in some cases an expelled fetus may be found. The most common cause of a spontaneous abortion is fetal death due to a hormonal imbalance. In the case of a planned abortion, bleeding is the most common symptom following the procedure. It is advised that you closely monitor your dog so that any side effects or health related issues can be responded to quickly. Diagnosis An ultrasound machine can detect a pregnancy in a dog. In addition, the ultrasound of a fetus is usually necessary before many health care providers will agree to a medical abortion. Doppler-type instruments can also be used to hear a fetus&#039; heartbeat if the pregnancy is far enough along.  Treatment For owners who are looking for safe options to either prevent an unwanted pregnancy or terminate a possible pregnancy, there are several medical alternatives to consider. To permanently prevent pregnancy in dogs, spaying (ovariohysterectomy) is the best option. For pregnancy termination, these are the most common medical options: Injectable Estrogens- A medical professional can administer these to prevent a pregnancy. The estrogen must be injected shortly following copulation to be effective. However, there are several potential side effects to take into consideration, including bone marrow suppression and pyometra (i.e., infection of the uterus). Oral Estrogens - These are not recommended because they are ineffective and may cause pyometra in animals. Prostaglandin F2 alpha - This is a natural hormone that has shown to induce a safe abortion for pets when monitored by a health professional. Most side effects are often mild, if present at all. Some of the drug&#039;s known side effects include panting, trembling, nausea and diarrhea. Dexamethasone - This is also a viable option to induce an abortion for pets. The injection is usually followed by such side effects as panting, excessive drinking (polydispia) and urination (polyuria). Living and Management It is important to note that despite the myths surrounding the method, postcoital douches do not effectively terminate an unwanted pregnancy in pets. Following both a planned and spontaneous abortion, there can be a great deal of discomfort and/or some vaginal bleeding or abnormal discharge. Pet owners should carefully observe the behavior of their animals to ensure more serious problems do not develop as a result."}]