[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How does a dog get lungworms?", "acceptedAnswer": {"@type": "Answer", "text": "A dog becomes infected with lungworms by eating lungworm eggs and/or immature lungworm larvae.  Once in the GI tract, the larvae penetrate the intestinal wall and migrate to the dog’s airways/lung tissue, where they live and produce more eggs and larvae. The eggs and larvae in the airways are then coughed up and spit out, or they are swallowed by the dog, which results in reinfection."}}, {"@type": "Question", "name": "Can you see lungworms in dog poop? ", "acceptedAnswer": {"@type": "Answer", "text": "No. Lungworm eggs and larvae cannot be readily seen by looking at dog feces with the naked eye. Your veterinarian can see both by looking at your dog’s fecal sample under a microscope."}}, {"@type": "Question", "name": "Can humans get lungworms?", "acceptedAnswer": {"@type": "Answer", "text": "No, humans do not get lungworms.  However, it is important to keep your dog current on deworming (once or twice a year), as there are some worm parasites that can cause problems in humans. "}}, {"@type": "Question", "name": "References", "acceptedAnswer": {"@type": "Answer", "text": "Filaroides Lungworms. (n.d.). Veterinary Information Network (VIN):  Vincyclopedia of Diseases. https://www.vin.com/apputil/project/defaultadv1.aspx?pId=17256&amp;SAId=1&amp;catId=93497Nelson RW, C Guillermo Couto. Small Animal Internal Medicine. Elsevier/Mosby; 2013: 321-323."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lungworms in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/english-bulldog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/english-bulldog.jpg"}, "author": {"@type": "Person", "name": "Heidi Kos-Barber, DVM", "url": "https://www.petmd.com/author/dr-heidi-kos-barber"}, "keywords": "Dog, Condition, Respiratory health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/c_dg_lungworms"}, "datePublished": "October 20, 2021", "dateModified": "August 12, 2022", "description": "Dr. Heidi Kos-Barber breaks down lungworms in dogs, explaining this potentially dangerous parasitic infection that can cause your dog to have trouble breathing.", "articleBody": "What Are Lungworms in Dogs? Lungworms in dogs consist of multiple species of worm parasites that can infect the airways and lung tissue of domestic and wild dogs. Species of lungworms in dogs include roundworm (nematode) and fluke (trematode).  Roundworms are not specific to any geographical location, whereas the fluke lungworms are more common in some environments.  For example, the lung fluke Paragonimus kellicotti is found in the Great Lakes region, Midwest, and Southern United States. This is because the fluke lungworm relies on specific species of snail and crayfish found in these regions as intermediate hosts for part of their life cycle. Symptoms of Lungworms in Dogs Signs of lungworms in dogs can include: Non-productive cough (produces no mucus) Rapid respiratory rate Exercise intolerance (becoming out of breath more easily, not able to play as hard/long as usual) Difficulty breathing Dogs can also have a subclinical lungworm infection, which means they show no signs. Causes of Lungworms in Dogs A dog becomes infected with lungworms by eating lungworm larvae.  Larvae may also be passed from a mother to her puppies through grooming and nursing. The immature larvae enter the gastrointestinal (GI) tract, penetrate the intestinal wall, enter the circulation system (blood or lymphatic), and are transported to the heart and lungs.  Depending on the species of lungworm, the larvae can develop into adult worms in as little as 5 weeks after being ingested by a dog. However, in other lungworm species, maturation into adult worms can take up to 21 weeks.  Female adult lungworms start depositing eggs that then hatch into first-stage larvae within the airways. These eggs and first-stage larvae are then coughed up and spit out or vomited. Any dogs that have contact with the infected dog’s spit or vomit can contract lungworms. If the dog that coughed them up then swallows their own spit or vomit, the lungworm eggs and larvae travel through the dog’s GI tract. The dog sheds them in their feces, where they can infect other dogs that come into contact with the poop.  How Vets Diagnose Lungworms in Dogs Your veterinarian will likely recommend chest x-rays if your pet has a history of respiratory concerns. They will also take a fecal sample and may recommend an airway wash if they can’t confirm the diagnosis. X-Rays On x-rays of dogs with lungworms, the vet might see small spots of inflammation within the lung tissue, or larger areas of inflammation with possible pneumonia. If the lung is damaged severely enough, it can break open and cause air to leak into the dog’s chest. This is called a pneumothorax.  One species of lungworm can produce thickening of the large trachea wall (windpipe) and/or trachea nodules (abnormal trachea growths), which your vet may be able to see on the x-rays. X-rays alone cannot be used to diagnose lungworms in dogs, as other diseases can cause similar effects. However, your vet may have a suspicion of lungworm based on your geographical location and/or a history of recent travel with your dog. Fecal Tests Your vet will use fecal tests to look for lungworm eggs and larvae. They may have you bring multiple fecal samples from different days because the shedding of lungworm eggs and larvae in the feces comes and goes. Airway Wash If your vet can’t diagnose lungworms with x-rays and fecal testing, they may recommend an airway wash such as a transtracheal wash (TTW) or bronchoalveolar lavage (BAL), both of which are performed under anesthesia.  The fluid obtained from your dog’s airways and lungs during the wash procedure may contain the lungworm larvae, eggs, and inflammatory cells that will lead to a diagnosis.  Treatment for Lungworms in Dogs Treatment to get rid of lungworms in dogs involves a dewormer that’s usually administered orally for 14 days. Your dog’s immune system will generate inflammation as a reaction to the dead worms and larvae, so your veterinarian may also prescribe a corticosteroid anti-inflammatory medication.  It is common for a dog to seem to get worse when first starting treatment, since this is the period when there will be the largest number of dead and/or dying worms.  If you are concerned with how your dog is doing or have any questions, call your veterinarian in case additional treatment is needed.  In more complicated lungworm cases, cysts can form in the lung tissue. If the cysts rupture, your dog can accumulate air that’s in the chest and outside the lung (pneumothorax).  If enough air accumulates to cause your dog to have difficulty breathing, your vet might need to remove the air and place a chest tube until the air leak seals on its own. Rarely, surgery may be needed to close the sites where air is leaking from the lung tissue.  Untreated cases where there’s severe lung inflammation and/or lung damage can result in death.  Recovery and Management of Lungworms in Dogs Most cases of lungworm respond to medical management alone (no surgery). In order to monitor your dog’s response to treatment, your veterinarian will want to examine more fecal samples for the lungworm larvae/eggs. If your vet found abnormalities on the original x-rays, they might want to retake the images to see how the abnormal areas look after treatment. Scarring of the airway(s) is a possible complication of lungworm infestation. If the scarring results in coughing or other asthma-like signs, this may require long-term management. Dogs that need surgery will require more time for recovery and healing. Depending on how long the chest tubes are in place and how extensive the lung surgery is, recovery can take 4-6 weeks."}]