[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Capillariasis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/capillariasis-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/capillariasis-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_capillariasis"}, "datePublished": "September 21, 2012", "dateModified": "August 16, 2022", "description": "Capillariasis is a type of dog worm caused by a parasitic known as Capillaria plica. The worm infects the urinary bladder and other parts of the urinary tract.", "articleBody": "Infection with Capillaria plica in Dogs Capillariasis is a type of dog worm caused by a parasitic known as Capillaria plica. The worm infects the urinary bladder and sometimes other parts of the urinary tract. Symptoms and Types Often, there are no symptoms and diagnosis is incidental. However, especially in dogs with a heavy infection, symptoms include: Frequent urinationPainful urinationBloody urineStraining to urinateCauses Capillaria plica is the parasitic dog worm that causes capillariasis. Its lifecycle is not completely understood. However, we know that ova (worm eggs) pass out of the body through the urine of infected dogs. These ova embryonate and then may be ingested from the soil by earthworms. The Capillaria worm then continues to develop inside the earthworm to an infective stage. When another dog then ingests the earthworm, infection can occur. Diagnosis Diagnosis is through identification of Capillaria ova in the urine of the infected dog. The ova are characteristic in appearance: football-shaped with plugs at both ends of the ova.  Treatment Treatment is often not recommended if the dog is not ill. However, if symptoms of infection are present, the drugs fenbendazole or ivermectin can be used to treat the infection. Living and Management For dogs staying in a kennel that is housed on soil, replacing the soil with an alternative substrate or surface (such as sand, gravel, or concrete) may reduce infection rates of this type of dog worm."}]