[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Heart (Aortic) Valve Narrowing in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_aortic_stenosis"}, "datePublished": "March 26, 2010", "dateModified": "August 16, 2022", "description": "Aortic stenosis refers to the narrowing of the aortic valve, which controls the blood flow from the left ventricle (one of the dog&#039;s four heart chambers) to the aorta ventricular outflow tract.", "articleBody": "Aortic Stenosis in Dogs Aortic stenosis refers to the narrowing of the aortic valve, which controls the blood flow from the left ventricle (one of the dog&#039;s four heart chambers) to the aorta ventricular outflow tract. This obstruction puts undue pressure on the heart, causing heart muscle cells to increase in size to maintain forward blood flow and subsequent thickening of the heart wall. Aortic stenosis is congenital (present at birth) in nature, often found in large breeds such as the Newfoundland, German shepherd, golden retriever, rottweiler, and boxer. It is also the second most common congenital heart defect in dogs.  Symptoms and Types There are three types of three types of aortic stenosis: valvular (present at the valve), subvalvular (present below the valve), or supravalvular (present above the valve). The defect typically develops over the first few weeks to months of life; however, symptoms may appear at any age, depending on the severity of obstruction. Some of the more common symptoms include:     Congestive heart failure    Sudden loss of consciousness (syncope)    Difficulty breathing (dyspnea)    Rapid breathing (tachypnea)    Abnormal lung soundsCauses In most cases, dogs are born with the this heart defect. However, some develop the aortic obstruction due to bacterial endocarditis. Diagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to the veterinarian. He or she will then perform a complete physical examination, often revealing abnormal heart sounds (murmurs), an indication of irregular heart valve function. However, murmurs are are not always a sign of disease, especially in young animals, as they may occur due to pain, fever, or excitement. Your veterinarian will correlate the findings with other symptoms to determine if the murmur is abnormal.    The veterinarian may also conduct several laboratory tests, including complete blood count, biochemistry profile, and urinalysis, though the results are usually normal. Chest X-rays, meanwhile, may reveal an enlarged heart, especially on the left side of the organ. And in dogs with congestive heart failure, abnormalities may be detected in the lungs. For a more detailed evaluation of the heart and related structures, the veterinarian may use echocardiography, which may reveal thickening of the left ventricle wall and aortic valve. In some dogs, echocardiography may reveal a dilated aorta due to stenosis, resulting in abnormal blood flow. To determine the pressure of blood flow, more advanced tests like cardiac catheterization are used. This involves inserting a catheter into dog&#039;s heart chamber or vessel.  Treatment The treatment and management guidelines are controversial and vary among experts. However, most agree the aim of therapy is to treat the complications related to the defect. To truly “cure” the dog, open heart surgery is required to repair (valvuloplasty) or replace the valve. However, the prognosis of dogs that undergo surgery is not favorable, and therefore not usually attempted. Catherization may also be used to widen the narrowed vessels, but the procedure does not demonstrate survival advantages for dogs with severe forms of the disease. Typically, broad spectrum antibiotics are given to dogs with aortic stenosis due to the increased risk of developing bacterial infections in the heart. Living and Management The overall goal for you and the veterinarian is to minimize the dog&#039;s symptoms, prevent complications, and improve its quality of life. Activity should be immediately restricted to prevent complications (sometimes fatal) due to overexertion. Low sodium diets will also be recommended for dogs with congestive heart failure. Affected animals shouldn’t allow breeding or preferably neutered. You’ll need to closely watch your dog at home for abnormal signs and inform the veterinarian immediately if and when they occur. Dogs with mild forms of aortic stenosis may live a “normal” lifespan without any treatment. However, those with severe forms of the defect have a poor prognosis, even with treatment. Regardless of the severity, many veterinarians will recommend against breeding an animal with this heart defect."}]