[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Inflammatory Bowel Disease in Dogs: Causes, Symptoms, and Treatment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/chihuahua-sitting-in-grass.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/chihuahua-sitting-in-grass.jpg"}, "author": {"@type": "Person", "name": "Cathy Meeks, MS, DVM, DACVIM", "url": "https://www.petmd.com/author/dr-cathy-meeks"}, "keywords": "Dog, Condition, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_immunoproliferative_enteropathy_basenji"}, "datePublished": "July 27, 2020", "dateModified": "August 12, 2022", "description": "What is inflammatory bowel disease in dogs, and how is it treated? This guide to covers symptoms, causes, and treatment for IBD in dogs.", "articleBody": "Like people, dogs can experience occasional stomach and/or intestinal upset that can include vomiting and soft stool. These conditions may pass naturally; however, if they occur every day or more than once a week, your dog may have a condition called inflammatory bowel disease (IBD). Inflammatory bowel disease in dogs is a common cause of chronic vomiting and diarrhea and continues to be one of the most challenging conditions for veterinarians to treat. Here’s what you need to know about the causes and symptoms of IBD in dogs, which dogs are most at risk, and how dog IBD is treated. What Causes IBD in Dogs? Many people confuse IBD with irritable bowel syndrome (IBS), but these are very different diseases that require very different treatment. Dog IBD is a condition caused by a dysfunction of the gastrointestinal (GI) tract, aka the gut. IBD in dogs is usually caused by one of the following issues: A bacterial imbalance Food intolerance to a certain ingredient An abnormal immune response sparked by the dog’s own body These immune system “triggers” cause inflammation of the stomach lining, colon, large intestine, small intestine, or a combination of these areas. As the affected area becomes increasingly inflamed, your dog’s IBD symptoms will worsen. High-Risk Dog Breeds While dogs of any age or breed can develop IBD, certain breeds have a higher risk of developing this inflammatory disease. Breeds that have a greater risk of developing dog IBD include: Norwegian Lundehunds (this breed is especially vulnerable) Yorkshire Terriers Wheaten Terriers Basenjis Boxers English Bulldogs German Shepherds Rottweilers Shar-Peis Note: Even if your pup is on the “high-risk list,” this does not mean your dog will develop IBD. Symptoms of IBD in Dogs Identifying IBD in dogs is more about the culmination of symptoms as opposed to one. For example, while eating less or “picky” eating may not be an immediate cause for concern, a culmination of GI symptoms may indicate a more serious condition like IBD. Clinical signs of IBD can vary from weight loss and lethargy to vomiting and diarrhea—or a combination of those symptoms and more. The severity of signs and symptoms also depends on the types of inflammatory cells present and whether the disease is in the colon, small intestine, or large intestine. Since symptoms of dog IBD are also symptoms that can be present in other canine medical conditions, such as parasitic infections or liver disease, spotting and diagnosing IBD in dogs can be particularly tricky. Be sure to note the severity and frequency of symptoms, and share this information with your veterinarian when you bring your dog in to be evaluated. Symptoms of dog IBD involving the small intestine: Chronic or recurring vomiting Weight loss Diarrhea or loose stools Loss of appetite Symptoms of dog IBD involving the large intestine (chronic colitis): Diarrhea with or without blood and mucus Weight loss Straining to defecate Increased urgency to defecate Occasional vomiting How Do Vets Diagnose IBD in Dogs? In recent years, veterinarians have found better ways to diagnose and treat dog IBD. While IBD cannot be diagnosed through a physical exam, a historical overview, fecal checks, or laboratory work, they help rule out other possible causes of the symptoms, like parasites, intestinal foreign bodies, kidney disease, metabolic diseases, and cancers. Diagnostic Testing Detecting IBD in dogs may involve conducting a series of diagnostic tests, such as: Blood testing, including a complete blood cell count and serum chemistry screening Feces testing (for the potential presence of parasites or a harmful bacterial agent) Ultrasound and x-rays of the abdomen Biopsy of the intestinal tract and/or stomach Blood work is helpful in assessing how severely your dog may be affected and screening for other diseases. Since dogs with advanced IBD lose proteins through their intestines (protein-losing enteropathy), their blood work will show low protein levels. This screening will give you and your veterinarian a better idea of prognosis. Other possible causes of symptoms, such as pancreatitis, hormonal disease, and vitamin B deficiencies, can also be investigated through specialized blood testing. Persistence of Symptoms One steadfast part of diagnosing IBD is the persistence of the symptoms. Have the symptoms lasted more than a few weeks? Has your dog failed to respond to diet or medication trials? If your pet does not respond to diet or medication trials, your veterinarian may recommend an intestinal tract and/or stomach biopsy. Stomach Biopsy During a biopsy, your veterinarian will look for inflammation and obtain small tissue samples. These procedures do require anesthesia, but recovery from the procedure is typically quick and requires little downtime. A pathologist will then analyze the tissue samples to confirm the presence of IBD and determine the severity of the disease. Treatment for Inflammatory Bowel Disease in Dogs Dog IBD can be painful and debilitating for your dog (and frustrating for you). The goal in treating IBD is to improve your dog’s quality of life through: Reducing the inflammation of their intestinal tract Minimizing the clinical symptoms Returning their intestinal bacteria back to normal Adjusting Your Dog’s Diet Altering your dog’s diet is usually the first approach to treating IBD in dogs. For example, if your pet is eating a chicken-based diet, your veterinarian may work with you to introduce a new protein source that your dog has never consumed, such as bison or rabbit. During this transition, monitor your pet’s clinical signs to assess for the possibility of a food intolerance. Do not to give your dog foods that are not prescribed at this point, including treats and flavored medications. Using Antibiotics and Supplements Antibiotics are also often used in treating dogs with IBD. In addition to antibiotics, your veterinarian may prescribe probiotics and prebiotics to reduce the overall bacterial count and balance the gut’s bacterial population. It is important to realize that dogs have very different guts than humans, and therefore have very different needs. Be sure to obtain probiotics and prebiotics from your veterinarian. Giving Prescribed Immunosuppressive Drugs If your dog continues to show symptoms, your veterinarian may prescribe medication to reduce inflammation and their immune response. In some cases, a combination of these immunosuppressive drugs is necessary. It is not uncommon for it to take weeks to months to find the right combination of treatments for dogs with IBD. Dog IBD Recovery and Prognosis The goal is to reduce medications to the minimum effective dose or discontinue them altogether. This typically can be done over a course of a few weeks or months and should be done under the guidance of a veterinarian. IBD is a condition of the immune system, so it is rarely cured, but it can be well-managed with dietary and medical intervention. In most dogs with IBD, there is no effect on their expected life span, and they can enjoy a great quality of life. Featured Image: iStock.com/mpikula"}]