[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/7a4wwstun8", "@type": "VideoObject", "duration": "PT1M58S", "name": "5324820028001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/032d08b3a56a5d81830ff8ab9a8d72d90f822ec8.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/7a4wwstun8", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/edf21977dcdcd08f4030e86af8d74a1c90c08df6.m3u8", "transcript": "The canine parvovirus infection is a highly contagious viral illness that affects dogs. It manifests itself in two forms. The more common intestinal form, which affects the stomach and digestive system and the rare cardiac form, which affects the heart muscles the majority of parvovirus infections are seen in puppies between six weeks and six months of age. The virus is spread through direct contact with an infected dog because the virus is also heavily concentrated in the fecal matter of infected dogs canines that come into contact with an infected dog stool may contract the disease.\n\nCertain dog breeds such as rottweilers doberman pinchers pit bulls Labrador retrievers German shepherds and English Springer spaniels are particularly vulnerable to the disease. Symptoms of the intestinal form of the disease include severe bloody diarrhea lethargy anorexia fever, vomiting, and severe weight loss. The virus also affects the dog's ability to absorb nutrients. So infected dogs will quickly become dehydrated and weak.\n\nRapid heartbeat abdominal pain or discomfort and low body temperature are also symptoms of canine parvovirus infection. There is no cure for the virus. But veterinarians can treat symptoms of infection. Hospitalization is often required and treatments may include intravenous fluid and nutrition therapy medications to curb vomiting and antibiotics and antiviral medications.\n\nThe survival rate of dogs diagnosed with canine parvovirus is about 70% with veterinary intervention. Puppies are more susceptible to death due to their less developed immune systems. Vaccinations against parvovirus are readily available and puppies should be vaccinated at least 6, 9, and 12 weeks High risk breeds may require a longer initial vaccination period of up to 22 weeks. Dogs should not be socialised with unvaccinated or unfamiliar dogs until at least two weeks after their final vaccinations.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_canine_parvovirus_infection?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can a vaccinated dog get parvo?", "acceptedAnswer": {"@type": "Answer", "text": "While no vaccine can promise to be 100% effective, the canine parvovirus vaccine provides excellent protection from the virus. It is very unlikely that an appropriately vaccinated dog would become ill with canine parvovirus. It’s important to make sure that puppies get the appropriate number of boosters based on their age, that they are then boostered after they turn 1 year old, and that they get shots every 1-3 years or have their immunity checked with parvovirus antibody tests."}}, {"@type": "Question", "name": "Can a dog get parvo twice?", "acceptedAnswer": {"@type": "Answer", "text": "Immunity for parvovirus lasts for several years. While not impossible, it is very unlikely that a dog that has recovered from canine parvovirus would get it again. However, this does not mean that your dog does not need to be vaccinated against canine parvovirus if he or she has recovered from it in the past. Routine vaccinations should still be performed. Featured Image: iStock.com/Stanislav Hubkin"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Parvo in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/three-puppies-playing.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/three-puppies-playing.jpg"}, "author": {"@type": "Person", "name": "Ellen Malmanger, DVM", "url": "https://www.petmd.com/author/dr-ellen-malmanger"}, "keywords": "Dog, Viruses, Parasite, Condition, Symptom Checker, Parvovirus (Parvo)", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_canine_parvovirus_infection"}, "datePublished": "October 29, 2020", "dateModified": "October 24, 2023", "description": "How does parvovirus affect dogs? Dr. Ellen Malmanger explains what canine parvovirus is, symptoms, treatment, and how to protect your dog.", "articleBody": "Canine parvovirus (CPV or commonly referred to as “parvo”) is one of the most serious viruses that dogs can get. Thankfully, it is very preventable with proper vaccination. This virus was discovered in the 1970s and rapidly became a serious threat to canine health. This is primarily because the virus is hard to kill, can live for a long time in the environment, is shed in large quantities by infected dogs, is highly contagious, and is often fatal without appropriate treatment. This is why the parvo vaccine is considered a core vaccine for puppies and dogs. While the highly effective parvovirus vaccine has decreased the risk to properly vaccinated dogs, this disease is still widely prevalent, especially in puppies and poorly-vaccinated adolescent dogs. Here’s everything you need to know about parvo in dogs—how to protect your dog from it, the signs of parvo you should look for, and what to do if you your dog is showing symptoms.0:02 What Is Parvo in Dogs and Puppies? Parvo is an infectious DNA virus that commonly causes severe illness in young and unvaccinated dogs. It primarily affects the body’s rapidly dividing cells, meaning the intestinal tract and bone marrow are the most affected. Heart muscle cells of very young puppies can also be damaged by parvovirus. Although parvovirus is most common in puppies and adolescent dogs, it can also affect adult or senior dogs, especially if they are unvaccinated. Symptoms of Parvo in Dogs A dog infected with canine parvovirus will usually start to show parvo symptoms within three to seven days of infection. An infected puppy will often show lethargy as the first sign, and they may not want to eat. They will also often have a fever. As the virus progresses, your dog will begin to suffer from abdominal pain, vomiting, and diarrhea, which may be severe. Very sick puppies may collapse and have a high heart rate, difficulty breathing, and hypothermia due to the degree of dehydration and infection. Causes of Parvo in Dogs Parvovirus is an incredibly contagious disease that spreads quickly and efficiently. While canine parvovirus is not airborne, it can be found on many surfaces. Parvo is spread by contact with contaminated feces, but you don’t have to see feces for the virus to be present. It can live on the ground, in kennels, on peoples’ hands, on objects, or on the clothing of those who have been contaminated. Dogs can also carry it on their fur or paws if they’ve come in contact with contaminated material. Parvovirus can survive in a dog’s environment for months, if not years, and is resistant to many disinfectants. However, it is susceptible to diluted bleach and some specialized cleaners commonly used in veterinary hospitals. Can Humans Get Parvo? Parvovirus is species-specific, so humans have their own version of the virus. This means that humans cannot get parvovirus from dogs, and dogs cannot get parvovirus from people. However, it’s still important to use the utmost caution by wearing personal protective equipment if you come into contact with an infected dog. While you may not get parvo, the virus could be spread to another dog via your hands or the clothes you’re wearing. Can Cats Get Parvo From Dogs? Cats also have a type of parvovirus that causes severe disease, known as feline panleukopenia. While dogs cannot get feline parvovirus from cats, cats can become infected with canine parvovirus. They most often have much more mild clinical signs than dogs do, but there is a strain of canine parvovirus that can cause severe illness in cats. The feline parvovirus vaccine, which is part of the core FVRCP vaccine, may offer some cross-protection against canine parvovirus. How Is Parvovirus Diagnosed in Dogs? Are There Parvo Tests? Fecal ELISA tests (enzyme-linked immunosorbent assay) are the most common way of diagnosing a dog with parvovirus in a clinical setting. The test requires a fecal swab and takes about 10 minutes. While this test is accurate, a negative result does not necessarily rule out parvovirus in a symptomatic dog, as they may not be shedding the viral antigen at the time of testing. Further testing may be needed in these cases. Stages of Parvo The stages of canine parvovirus are the same as most viral infections. 1. Infection The puppy (or adult dog) is exposed to parvo via fecal material from an infected dog. These viral particles can come from a few places: The environment (on the ground or on a surface) The mother dog People/clothing/objects that came into contact with the feces of an infected dog Only a very small amount of fecal material is necessary to cause infection, which enters through the mouth of the puppy or dog. 2. Incubation There is an incubation period (usually three to seven days) in which the dog is infected with parvovirus but not yet showing symptoms. During this period, the virus specifically seeks out the most rapidly dividing cells in the body—typically, it starts attacking the tonsils or lymph nodes in the throat. By targeting these rapidly dividing cells, the virus is able to multiply effectively and efficiently to invade other parts of the dog’s system. Once it has multiplied and entered the bloodstream, the virus will seek out other sources of rapidly diving cells. The most hard-hit areas are: Bone marrow Cells that line the walls of the small intestines In very young puppies, parvovirus can also infect the heart, which causes inflammation of the heart muscle, poor heart function, and arrhythmias. 3. Illness When the virus infects the bone marrow, it attacks the young immune cells, which leads a drop in protective white blood cells. This weakens the body’s ability to protect itself and allows the virus to invade the gastrointestinal (GI) tract more easily. This is where the worst damage happens. The virus attacks the lining of the small intestine, which prevents the dog’s GI tract from being able to: Absorb nutrients Prevent fluid loss into the stool Stop bacteria from moving into the gut wall and then into the bloodstream This leads to serious health issues, such as: Diarrhea Vomiting Lethargy Severe dehydration Fever Sepsis While parvo in dogs is not always fatal, those that do not survive typically die from dehydration or shock—along with the damage caused by the septic toxins from the intestinal bacteria escaping into the bloodstream. What Is the Treatment for Parvo? There is no specific cure for parvovirus, so treatment revolves around supporting the puppy so their body can fight it off. Supportive care for parvovirus generally includes: Hospitalization with intravenous fluids Antiemetics to stop vomiting Focusing on nutrition, with a feeding tube, if necessary Correction of any electrolyte imbalances or low blood glucose Puppies exhibiting signs of sepsis—where the gut becomes so “leaky” from disease that bacteria from the intestines enter the bloodstream—require antibiotic therapy. Puppies with a high fever or low white blood cell count may also receive antibiotics. How Much Does Parvo Treatment Cost? The cost of treatment can vary greatly based on the severity of the illness, length of the hospital stay, and location of the veterinary clinic. Costs could start around several hundred dollars for outpatient treatment and go up to several thousand dollars for a severe case with hospitalization. On average, expect treatment to cost $1,000–$1,500 minimum. Needless to say, it&#039;s much more cost-effective to have your dog fully vaccinated than to have them contract parvovirus. Recovery and Management of Parvo in Dogs Recovery from parvovirus varies case by case. Full recovery may take quite a while depending on the severity of the disease and the damage it has done. Dogs that can recover from infection are often sick for five to 10 days after symptoms begin. It is very important that puppies with parvovirus receive adequate nutrition so that their intestines can heal. Dogs recovering from a parvo infection should be fed a bland, easily digestible diet. Hill’s Science Diet, Purina, and Royal Canin all make prescription veterinary diets that are carefully formulated to be nutritionally balanced and gentle on the GI tract: Hill’s Prescription Diet Digestive Care i/d dry dog food Hill’s Prescription Diet Digestive Care i/d wet dog food Purina Pro Plan Veterinary Diets EN Gastroenteric dry dog food Purina Pro Plan Veterinary Diets EN Gastroenteric wet dog food Royal Canin Veterinary Diet Gastrointestinal Low Fat dry dog food Royal Canin Veterinary Diet Gastrointestinal Low Fat wet dog food Hospital stays generally last around five to seven days, but this varies depending on the severity of symptoms. The highest risk of death occurs around 24–72 hours after you see the symptoms of parvo in dogs. If a puppy is hospitalized, given lots of supportive care, and monitored closely, the survival rate is usually around 75–80%. Survival is more difficult if the dog is not given veterinary attention quickly after showing clinical signs or if the dog is not hospitalized with sufficient supportive care. Are There Home Remedies for Parvo? There are no home remedies for parvo. In some cases, if a dog is not severely ill or if expensive treatment is prohibitive, then treatment on an outpatient basis may be attempted with help from the vet. Outpatient treatment for parvo in dogs includes: Subcutaneous fluids (fluids given under the skin as a source of hydration) A special highly digestible diet Antiemetics to stop vomiting Antidiarrheals Possibly antibiotics While some dogs can recover from this protocol, it is much safer—and more likely to have better outcomes—if the dog is hospitalized. How To Prevent Your Dog From Getting Parvo The canine parvovirus vaccine is most often given in a combination vaccine that goes by a variety of acronyms: DHPP, DAPP, DA2PP, DHLPP, etc. This vaccine is considered a core vaccine and should be given every three to four weeks from six to eight weeks to 16–20 weeks of age. The most important thing for preventing parvo is making sure you get your puppy in on time for their vaccines. Puppies should only socialize with fully vaccinated dogs until they are able to be fully vaccinated themselves. Areas where your puppy can come into contact with unvaccinated dogs, such as dog parks, should be avoided. A dog will need to receive a booster vaccine at 1 year of age to be considered fully vaccinated. Dogs should also continue to receive vaccines every one to three years for life or have their immunity monitored using parvovirus antibody tests."}]