[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cardiomyopathy in Boxer Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cardiomyopathy-boxer-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cardiomyopathy-boxer-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_cardiomyopathy_boxer"}, "datePublished": "April 22, 2009", "dateModified": "August 16, 2022", "description": "Cardiomyopathy is most commonly characterized by an irregular heartbeat. Fainting or even sudden heart failure can occur, and some patients can develop congestive heart failure.", "articleBody": "Ventricular Arrhythmia in Boxer Dogs Cardiomyopathy is most commonly characterized by an irregular heartbeat. Fainting or even sudden heart failure can occur, and some patients can develop congestive heart failure. Cardiomyopathy is specific to the boxer; however, similar symptoms have also been seen in English bulldogs. It tends to occur in dogs that are at least two years old, although symptoms in dogs as young as six months have been reported. At the same time, some patients don’t demonstrate symptoms until they are older than ten years. Symptoms and Types Veterinarian may notice an irregular heartbeat in a routine examFainting (syncope)CoughingRapid breathingAccumulation of fluid in the abdomenSudden deathCauses Believed to be inherited, but a genetic defect has not been identified. Diagnosis You will need to provide a thorough history of your pet&#039;s health leading up to the onset of symptoms, including any information you have on your dog&#039;s familial background. Your veterinarian will want to rule out the following possible causes of the symptoms before determining a congenital cause of this condition. An electrocardiogram ECG and an ultrasound of the heart and/or abdomen may be used in the screening process. Aortic stenosisOther cardiac diseaseBlockage of the aortaCardiac diseaseAbdominal diseaseBlood tests will be ordered, but not a urinalysis in this case because it would not reveal relevant information. A thoracic radiograph (chest x-ray) might help to determine whether there is enlargement of the heart, or any other evidence of heart failure. If your veterinarian suspects cardiac disease, a heart monitor may be placed on your dog to determine the severity and complexity of the arrhythmia. This will also give a baseline for comparison once treatment is started.    Treatment The first thing your doctor will try to achieve is normalization of the heartbeat and treatment of the symptoms. Avoiding the sudden death that often occurs with these cases will be the top concern. Treatment is complicated when there are no obvious symptoms, and the medication usually prescribed to treat the condition brings on cardiac arrhythmias instead of reducing them. It will be up to your veterinarian to determine whether antiarrhythmic drugs are indicated.   Living and Management Fainting and heart attack seem to be more frequent with stress and excitement. For that reason, it might be wise to avoid strenuous exercise with your dog. However, there may be no relationship between an unfavorable outcome and exercise. You will need to follow your veterinarian’s advice and use your own judgment. Your veterinarian may prescribe some medications for treating the arrhythmia. There appears to be some variability as to how dogs respond, so if one option does not seem to be working, it would be reasonable to switch to another. Your veterinarian may want to place a cardiac monitor on your dog again after starting therapy to evaluate the response to treatment. This will determine whether the medication is working or whether a switch to another one is in order. Wearing the monitor for a period of time once a year is recommended, as well as having an ECG to check the heart&#039;s activity. Dogs with this disease are always at risk of sudden death, but even so, many dogs can be maintained for years on an antiarrhythmic medication. Dogs that have systolic dysfunction – a condition where the heart contracts and blood is forced into areas where it can cause harm – do not do as well. But, even these dogs seem to show improvement on l-carnitine, a supplement that is used to bring carnitine levels up. Carnitine is essential for the fully functioning body, since it stimulates fatty-acid oxidation."}]