[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Inability to Urinate in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Urinary", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/inability-urinate-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/inability-urinate-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/urinary/c_dg_urinary_retention"}, "datePublished": "February 9, 2010", "dateModified": "August 16, 2022", "description": "Urinary retention is the medical term given to incomplete emptying (or voiding) of urine that is not associated with obstruction of the urinary tract.", "articleBody": "Functional Urinary Retention in Dogs Urinary retention is the medical term given to incomplete emptying (or voiding) of urine that is not associated with obstruction of the urinary tract, whereas &quot;functional&quot; is defined as being caused by a problem with the normal action of an organ. Complications resulting from functional urinary retention may come from a lower urinary tract infection that ascends into the bladder; rupture of the urinary bladder or urethra; and permanent injury and atony (weakness/loss of coordination) to the detrusor muscle, the muscular layer of the urinary bladder wall, which contracts, pushes down on the contents of the bladder, and causes the urine to leave the body through the urethra. This condition is more common in male than in female dogs. Symptoms and Types Palpably distended urinary bladderIneffective, frequent, attempts to urinate without successUrine stream may be weak, attenuated, or interruptedBladder may be so full that it frequently leaks urineAbdominal distension, abdominal pain, or signs of postrenal azotemia may predominate in rare cases or with urinary tract ruptureRecurrent urinary tract infections may have caused muscular problems associated with urinatingCauses Hypercontractility of the Urinary Bladder Detrusor Muscle (Detrusor Atony) Most commonly develops after sudden (acute) or long-term (chronic) urinary bladder overdistension; many dogs have a history of nervous system dysfunction or previous urinary blockage or obstructionElectrolyte disturbances such as hyperkalemia, hypokalemia, hypercalcemia, hypocalcemiaLesions of the pelvic nervesLesions of the sacral spinal cord (such as congenital malformations, cauda equina compression, lumbosacral disk disease, and vertebral fractures/dislocations) can result in a flaccid, overdistended urinary bladder with weak outlet resistance (outlet resistance is inhibition of the ability to pass urine through the urethra)Lesions of the suprasacral spinal cord (such as intervertebral disk protrusion, spinal fractures, and compressive tumors) can result in a distended, firm urinary bladder that is difficult to express or empty by gentle manual pressureDogs with neuropathy, sacral lesions, suprasacral spinal lesions, or midbrain disorders may also suffer from detrusor-urethral dyssynergia, where the contraction of the detrusor muscle and the relaxation of the urethra are not coordinatedDecreased contraction of the detrusor muscle (detrusor atony) with urine retention is a feature of a disorder characterized by abnormal function of the autonomic nervous system (known as dysautonomia); dysautonomia has been described in dogs in certain geographic regions of the United StatesSome dogs with excessive levels of steroids produced by the adrenal glands (known as Cushing&#039;s disease) have increased urination (polyuria), urinary bladder distention, and mild urine retentionFunctional Urinary Obstruction Previous pelvic or urethral surgeryAnticholinergic medications (which may affect normal nerve actions)Excessive urethral resistance, usually attributed to smooth or striated muscular components of the urethra (urethrospasm) may be seen after urethral obstruction or urethral or pelvic surgery, urethral inflammation, or prostatic diseaseDiagnosis You will need to give a thorough history of your dog&#039;s health, onset of symptoms, and possible incidents that might have led to this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. The urinalysis may reveal evidence of urinary tract infection or inflammation. A neurologic examination will include a brief assessment of the lower, caudal spine. Peripheral nerve function will be apparent from the examination of anal tone, tail tone, and perineal reflexes (the muscle between the anal and urethral openings). Urethral catheterization may be required to rule out urethral obstruction. If there is no obstruction the catheter should pass easily through the urethra. Myelography, epidurography, or computed tomography (CT scans) can be used to determine if lesions are present on the spine, indicating a neurological cause. Another imaging technique veterinarians use involves injecting a radiocontrasting agent into the dog&#039;s body to follow the course of the urine from the kidneys through the urethral tract by X-ray. Because there are several possible causes for this condition, your veterinarian will most likely use differential diagnosis to settle on the underlying cause. This process is guided by deeper inspection of the apparent outward symptoms, ruling out each of the more common causes until the correct disorder is settled upon and can be treated appropriately. Here are some of the possible causes that will be considered and either discounted or confirmed: Extramural urethral compression, such as smooth bladder neck mass, a large prostate gland, or a caudal abdominal massOliguria, anuria, and urinary tract rupturePhysical and mechanical obstruction; clinical signs of urinary obstruction include pollakiuria, stranguria, and hematuria; patients with mechanical obstruction may void a few drops of urine after long periods of strainingLesions above the spine or on the sacrum (the posterior base of the spine) that can affect signals from the brain and consequently the impulse to urinate; may also be indicated by partial or complete paralysis of limbs, hyperreflexia of limbs, and cervical, thoracolumbar, and lumbar pain; depressed tail tone;The urinary bladder is usually distended, firm, and difficult to express with lesions of the upper spine, and is typically distended, flaccid, and fairly easy to express with sacral lesions; in patients with chronic or partial lesions, reflexive voiding may returnLoss of muscle coordination in the detrusor muscleIn patients recovering from urinary obstruction, inability to void may result from re-obstruction, excessive urethral resistance (functional obstruction), or detrusor weakness (atony) caused by overdistension; if the urinary bladder can be expressed via gentle manual compression applied on the abdomen, detrusor atony is likely; if resistance to manual expression is encountered and urethral obstruction can be ruled out by examination or catheterization, functional obstruction is likely Treatment Unless there is a severe underlying condition that is causing this urinary disorder, your dog will likely be treated on an inpatients basis until adequate urinary function returns. Urinary tract infection, if present, will be identified specifically and treat appropriately. Your veterinarian will address primary disorders such as electrolyte disturbances and neurologic lesions and correct them if possible. Azotemia, electrolyte imbalances, and acid-base disturbances associated with acute urine retention will be managed appropriately. Your doctor will also manage excess levels of urea and other nitrogenous waste products in the blood (uremia or azotemia), electrolyte imbalances, and acid–base disturbances associated with sudden (acute) urine retention In some cases, complete voiding function does not return, in which case lifetime management of your dog&#039;s urinary health will be required on your part. Frequent manual compression will be needed for release of urine, and intermittent or indwelling urinary catheterization may be required to ensure urine flow and to keep the urinary bladder small. Your veterinarian will perform periodic urinalysis to detect urinary tract infection if your dog has been diagnosed with chronic urine retention. "}]