[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sarcocystis Infection in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_sarcocystosis"}, "datePublished": "October 17, 2012", "dateModified": "August 16, 2022", "description": "Learn more about this particular infection in dogs, including its symptoms, causes, and forms of treatment.", "articleBody": "Sarcocystosis in Dogs The causative agent of sarcocystosis (Sarcocystis) is the same organism that causes equine protozoal meningitis. It is believe dogs can become infected with Sarcocystis; however, symptoms of disease in infected dogs are rare. Sarcocystosis can occur in both dogs and cats. If you would like to learn how this type of infection affects cats, please visit this page in the petMD health library. Symptoms and Types Symptoms in dogs are rarely seen but may include:     Lack of appetite    Weight loss    Diarrhea, potentially      bloody diarrhea    Dehydration    Depression    Paralysis    Muscle pain    Myositis (inflammation      with the muscle)    Muscle atrophy (muscle      wasting)Causes A dog may be infected by eating raw meat contaminated with Sarcocystis organisms. Diagnosis Occasionally, Sarcocystis organisms can be seen in the feces on microscopic fecal examination. However, in most instances, diagnosis is accomplished by finding the organism on histopathology in tissues such as the lungs, liver, kidney, spleen, brain and/or muscle. More specialized testing such as immunohistochemistry and PCR may be available at some research facilities but are not widely available outside of a research setting.  Treatment No definitive treatment for sarcocystosis exists. Treatments such as clindamycin or sulfadiazine may be tried if sarcocystosis is suspected or diagnosed. Prevention Do not allow your dog to eat raw or uncooked meat."}]