[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dislocated Eye Lens in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dislocated-eye-lens-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dislocated-eye-lens-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_lens_luxation"}, "datePublished": "May 28, 2010", "dateModified": "August 16, 2022", "description": "Lens luxation occurs when the lens capsule separates 360° from the zonules (the fiber-like processes that extend from the ciliary body to the capsule of the lens of the eye) that hold the lens in place, resulting in the total dislocation of the lens from its normal location.", "articleBody": "Lens Luxation in Dogs Lens luxation occurs when the lens capsule separates 360° from the zonules (the fiber-like processes that extend from the ciliary body to the capsule of the lens of the eye) that hold the lens in place, resulting in the total dislocation of the lens from its normal location. If it occurs at the front of the eye, it comes forward through the pupil into the front chamber. If it goes to the back (posterior), it goes into the posterior segment/vitreous chamber. Lens luxation is primarily seen in adults dogs between the ages of four and nine. Some breeds appear to be more prone than others; the most commonly affected breeds are terrier mixed breeds, Tibetan terriers, border collies, German shepherds, and some spaniels. It can also occur in older predisposed breeds, presumably as a late-onset condition. Secondary luxation can occur in any age or breed of dog. Symptoms and Types There are four main types of lens luxation:   Subluxation — partial separation of the lens from its zonular attachments; the lens remains in a normal or near-normal position in the pupilPrimary luxation — due to a pathologic alteration in the ciliary zonules including abnormal development or degeneration; may be bilateral (both eyes)Congenital luxation — often associated with microphakia (abnormally small lens of the eye)Secondary luxation — due to rupture or degeneration of the ciliary zonules as a result of chronic inflammation, buphthalmia (increase of intraocular fluid and consequent enlargement of the eyeball), or a tumor within the eye  The following signs and symptoms may be observed if your pet is suffering from lens luxation:   Acute or chronically painful reddened eye with diffuse corneal swelling, especially if glaucoma is also present, or the luxation is in the front of the eyeIris trembling (iridodonesis)Lens trembling (phacodonesis)Abnormally shallow or deep anterior (front) chamberAbnormally positioned clear part of the lensAphakic crescent — an area of pupil devoid of the lensCauses There may be a variety of factors that lead to lens luxation in dogs. For example, a tumor in the eye may physically move the lens out of position or cause chronic inflammation, leading to zonular degeneration. The inheritence pattern of primary luxation is uncertain, but it may occur concurrently with primary glaucoma in some breeds. Trauma rarely causes a normal lens to luxate, though it can occur when there are signs of severe uveitis, especially chronic lens-induced uveitis, or hyphema.  Diagnosis Your veterinarian will perform a thorough physical and ophthalmological exam on your dog, taking into account the background history of symptoms and possible incidents that might have led to this condition. Because there are several possible causes for this condition, your veterinarian will most likely use differential diagnosis. This process is guided by deeper inspection of the apparent outward symptoms, ruling out each of the more common causes until the correct disorder is settled upon and can be treated appropriately. Uveitis, glaucoma, and nodular granulomatous episclerokeratitis (inflammatory masses) can also cause painful, red eyes with corneal swelling and may be concurrent with lens luxation. Buphthalmia, enlargement of the eyeball caused by excess fluid within the eyeball, may cause lens luxation; it is usually differentiated from primary lens luxation by history. Corneal endothelial dystrophy or degeneration (opacity of the cornea) may also cause corneal swelling, making it difficult to see the intraocular structures. Diagnosis is made by careful ophthalmic examination and a history of the symptoms. Visual diagnostic techniques may be used to diagnose the cause of the luxation. Thoracic X-rays and abdominal ultrasound may be indicated if the luxation is secondary to an intraocular (within the eye) tumor, and ocular ultrasonography is useful if corneal edema (swelling) or cloudy ocular media prevent a useful examination.  Treatment   If your dog still has the potential for at least partial vision, the eyes may be best treated by removing the lens using a procedure called intraocular lens prosthesis. Occasionally, topical miotic (constriction of the pupil of the eye) therapy can keep a posteriorly luxated lens behind the pupil and the need for surgery can be prolonged. Irreversibly blind eyes can be treated by evisceration (removal of the internal material from the eye), or by enucleation with intrascleral prosthesis — removal and subsequent replacement of the eye with an artificial eye. If the condition is secondary to cancer, enucleation is the best choice for therapeutic and diagnostic purposes. Living and Management After treatment, your dogshould be re-examined immediately after the first 24 hours and every three months thereafter. Your doctor may want to refer you to an opthalmological veterinarian for evaluation, as intracapsular lens extraction — removal of the entire lens and its capsule — is also indicated for posterior luxations in order to decrease the chance for retinal detachment and chronic uveitis. A specialist can also examine for secondary glaucoma and retinal detachment. Unfortunately, there is a possibility that the lens luxation may affect both eyes if it hasn&#039;t already."}]