[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skin Blisters (Vesiculopustular Dermatoses) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_dermatoses_vesiculopustular"}, "datePublished": "May 11, 2009", "dateModified": "August 16, 2022", "description": "A vesicle, or blister, is a small, defined elevation of the outer layer of the skin (known as the epidermis). It is filled with serum, the clear watery fluid that separates from the blood.  A pustule is also a small, defined elevation of the outer layer o", "articleBody": "Vesiculopustular Dermatoses in Dogs A vesicle, or blister, is a small, defined elevation of the outer layer of the skin (known as the epidermis). It is filled with serum, the clear watery fluid that separates from the blood.  A pustule is also a small, defined elevation of the outer layer of the skin (epidermis), but is filled with pus -- a mixture of serum, white blood cells, cellular debris and dead tissue. Vesiculo refers to vesicles; this prefixed form is attached to the diseased condition that is concurrent with the cause of the blister. Pustular refers to an organism that is covered in pustules. Dermatoses is the plural form of dermatosis, which is used to describe any abnormality or disorder of the skin. Symptoms and Types   One or more of the following signs may be present: Hair lossReddened skinVesicles or blisters: small elevations of the outer layer of the skin filled with clear fluidPustules: small elevations of the outer layer of the skin filled with pusLoss of pigment of the skin and/or hairCauses Vesicles Systemic lupus erythematosus - SLE; an autoimmune disease in which the body attacks its own skin and possibly other organsDiscoid lupus erythematosus - DLE; an autoimmune disease involving the skin only, usually the faceBullous pemphigoid - an autoimmune disease with ulceration of the skin and/or moist tissues of the bodyPemphigus vulgaris - severe autoimmune disease with ulceration of the mouth, and in the junction between the moist tissues and skinDermatomyositis - inflammatory disorder that affects the skin and muscles in collies and Shetland sheepdogsPustules Skin infection involving the surface or top of the skin (known as a superficial skin infection), characterized by the presence of pus (pyoderma)Bacterial skin infection involving the areas of the body with sparse hair coat (impetigo)Superficial spreading pyodermaSuperficial bacterial infection/inflammation of the hair follicles (bacterial folliculitis)AcnePemphigus complex - autoimmune skin diseasesPemphigus foliaceusPemphigus erythematosusPemphigus vegetansSubcorneal pustular dermatosis (skin disease of unknown cause characterized by the presence of pustules)Dermatophytosis (fungal skin infection)Sterile eosinophilic pustulosis – a skin disorder characterized by the presence of eosinophils in the pustules; eosinophils are a type of white-blood cell involved in allergic responses by the body and are active in fighting larvae of parasitesLinear immunoglobulin A (IgA) dermatosis - a skin disorder seen only in dachshunds in which sterile pustules are located just below the surface of the skin; immunoglobulin A [IgA] is present in the lowest layer of the epidermis (known as the basement membrane); immunoglobulins are proteins produced by the cells of the immune system, and they include the antibodies, which are categorized into classes, including immunoglobulin A [IgA])Diagnosis You will need to give a thorough history of your dog&#039;s health, including a background history of symptoms, and possible incidents that might have precipitated this condition. Your veterinarian will perform a thorough physical exam on your dog, with a blood chemical profile, a complete blood count, an electrolyte panel and a urinalysis. The physical exam will include a dermatologic exam during which skin biopsies for histopathology can be taken. Skin scrapings should also be examined microscopically and cultured for bacteria, mycobacteria and fungi.  Treatment Most dogs may be treated on an outpatient basis. However, patients with systemic lupus erythematosus (SLE), pemphigus vulgaris, and bullous pemphigoid may have advanced to the point of severe illness and will require inpatient intensive care. Living and Management Ask your veterinarian if your dog might benefit from periodic bathing with an antimicrobial shampoo to help remove surface debris and control secondary bacterial infections.  Your veterinarian will schedule follow-up appointments for your dog to check bloodwork.  Initially, these follow-up appointments might be as often as every 1-2 weeks.  Later, the visits may be tapered off to once every three to four months depending on how your dog responds to the medication."}]