[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Heart Block or Conduction Delay (Right Bundle) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_right_bundle_branch_block"}, "datePublished": "March 19, 2010", "dateModified": "August 16, 2022", "description": "Right Bundle Branch Block (RBBB) is a defect in the heart’s electrical conduction system in which the right ventricle", "articleBody": "Right Bundle Branch Block (RBBB) in Dogs Right Bundle Branch Block (RBBB) is a defect in the heart’s electrical conduction system in which the right ventricle (one of the dog&#039;s four heart chambers) is not directly activated by the electric impulses through the right bundle branch. RBBB may be complete or partial in nature. Symptoms and Types Often, no specific symptoms are seen that can be attributed to RBB, only those that are related to the underlying disease causing the defect. Causes Although it may be present in normal dogs, a right bundle branch block is more often associated with congenital (present at birth) heart disease(s). Other typical causes for the defect include:     Chronic valve disease with fibrosis    Heart surgery to correct cardiac defect    Injury involving heart    Tumor(s)    Parasitic infection (e.g., heartworms)    Cardiomyopathy    Formation of clot in blood vessel (thromboembolism)    Abnormally high levels of potassium (hyperkalemia)Diagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to the veterinarian. He or she will then perform a complete physical examination, as well a biochemistry profile, urinalysis, and complete blood count (CBC) -- the results of which are typically non-specific. However, biochemistry profile may show high levels of potassium. RBBB is often only found accidentally, perhaps while performing an echocardiogram. In the case of this defect, he or she may identify structural defects in the heart and right-side enlargement. Thoracic and abdominal radiography, meanwhile, may show masses and other abnormalities. If heartworms are the underlying cause, they also may be identified in diagnostic procedures.  Treatment Treatment is directed towards treating underlying cause. Living and Management This condition itself is not life-threatening and treating the underlying cause results in complete resolution of problem. However, if left untreated, RBBB can lead to more severe heart rhythm changes or even complete heart block. You may be required to take your pet for regular follow-ups exams to evaluate the status of disease and the dog&#039;s response to treatment. No diet modifications are necessary, unless required to manage underlying condition."}]