[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/3v426taal4", "@type": "VideoObject", "duration": "PT1M49S", "name": "5349437805001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/08fb0ed1289b2e5ccc515ddc6d5458c929de1e1b.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/3v426taal4", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/e5728fc3c79537566ee7eb83ff77ab9319da7d72.m3u8", "transcript": "Atopic dermatitis is an inflammatory chronic disease in dogs that's often associated with allergies. It's the second most common allergic skin disease that affects our canine Companions environmental allergens such as animal dangers airborne pollens mold spores and even dust mites can trigger allergic reactions in dogs. A family history of skin allergies may also make dogs more susceptible to these allergens atopic dermatitis can cause excessive itching scratching rubbing and licking especially around dog's face paws or the underarm area. Other commonly affected areas in dogs include the ears lower legs the muzzle energy.\n\nThe groin around the eyes and in between the toes. These symptoms often progressively worse and over time and a dog's skin may become red, inflamed and raw. Dogs normally show signs of the disease between three months and six years of age. But it might not become clinically apparent before the third year.\n\nYour veterinarian will conduct a comprehensive physical exam to determine the underlying cause of your dog's skin allergies blood or skin patch. Testing may be performed. A dermatologist referral may even be recommended once the cause is identified and appropriate treatment method can be chosen. Options to decrease itchiness may include hypo sensitization therapy in which dogs will receive injections that contain small amounts of the allergens that they're sensitive to medications such as corticosteroids and in a histamine can be given to reduce itching and immunosuppressant medication may also be prescribed to help control itching associated with long term skin allergies or your veterinary and may suggest topical treatments for relief like a.h. sprays therapeutic shampoos and even leave on conditioners to help alleviate his symptoms.\n\nO", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/skin/c_dg_malassezia_dermatitis?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fungal Infection (Malassezia pachydermatis) of the Skin in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/sick-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/sick-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_malassezia_dermatitis"}, "datePublished": "April 11, 2010", "dateModified": "August 16, 2022", "description": "Malassezia pachydermatis is a yeast found on the skin and ears of dogs. Though a normal inhabitant of these regions, an abnormal overgrowth of the yeast can cause dermatitis, or inflammation of the skin. The exact reasons behind this disease are not yet known, but it has been linked to allergy, seborrhea, and possibly congenital (born with) and hormonal factors.", "articleBody": "Malassezia Dermatitis in Dogs Malassezia pachydermatis is a yeast found on the skin and ears of dogs. Though a normal inhabitant of these regions, an abnormal overgrowth of the yeast can cause dermatitis, or inflammation of the skin. The exact reasons behind this disease are not yet known, but it has been linked to allergy, seborrhea, and possibly congenital (born with) and hormonal factors. Malassezia dermatitis can affect any breed of dog, but the following breeds are predisposed to this disease: poodles, basset hounds, West Highland white terriers, cocker spaniels, and dachshunds. Symptoms and Types Irritation of skinLoss of hair (alopecia)GreasinessScaly skinRedness of affected areasMalodorous discharge from lesionsPatches of skin becoming darker (hyperpigmentation) and epidermal thickening (seen in chronic cases)Causes High humidity and temperature may increase the frequency of the cases. Other factors that may be a predisposing factor to this hypersensitivity disease include concurrent infections and food and flea allergies. Genetic factors are also suspected for young onset in predisposed dog breeds. Diagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to your veterinarian. He or she will then perform a complete physical examination as well as a biochemistry profile, urinalysis, and complete blood count -- the results of which are typically normal unless the dog has a concurrent disease. More specific testing includes a culture of the causative organism as well as taking a small skin tissue sample for a skin cytology test. In this test your veterinarian will touch a sterilized cotton swab to the affected area and stain it with Diff-Quik stain on a glass slide. After staining, the glass slide is observed under a microscope to demonstrate the yeast in the sample. This will help him or her identify the causative organism.  Treatment There are various therapeutic agents used in treating this condition, but the ultimate goal is to reduce the number of yeast and bacteria. Your veterinarian will suggest medications for application on the skin and will also recommend medicated shampoos, which should help remove scales and resolve foul odors. Concurrent bacterial infections will be treated with antibiotics and antibacterial shampoos. Living and Management You will need to regularly visit your dog’s veterinarian for evaluation of disease and treatment progress. At each visit, your veterinarian will examine your dog and perform a skin cytology test to confirm that the number of causative organism is decreasing. Skin irritation and bad smell usually resolve within one week of treatment; however, recurrence of disease is common when underlying conditions are not resolved. Follow guidelines strictly and apply the topical medications as prescribed. Do not use any shampoo or medication or alter treatment on your dog without consulting your veterinarian. As recurrence is common, watch your dog for any untoward symptoms and call your veterinarian if you suspect a recurrence. See Also"}]