[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live after being diagnosed with kidney cancer?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with no evidence of metastasis (spreading of cancer) and successful removal of the affected kidney can survive for up to 4 years. However, the average survival time for dogs diagnosed with renal carcinoma is 8 to 16 months after diagnosis. This short average survival time is due to difficulties in removing the tumor, a high metastatic rate, and the advanced stage of the disease at the time of initial diagnosis. "}}, {"@type": "Question", "name": "How aggressive is kidney cancer in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Renal carcinoma is typically the most aggressive type of kidney cancer for dogs, because the area it grows within the kidney has a high metastatic rate. Metastatic disease is common, with 54% of dogs diagnosed with metastatic disease in their lungs or abdominal organs and 27% metastasized to lymph nodes. Other sites often affected by metastasis include the heart, brain, and bones. "}}, {"@type": "Question", "name": "Is kidney cancer curable in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with no evidence of metastasis and successful removal of the affected kidney typically have a good prognosis, however there is no known definitive cure for cancers of the kidney in dogs. "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Kidney Cancer in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog.vet_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog.vet_.jpg"}, "author": {"@type": "Person", "name": "Kasey Stopp, DVM, CVA", "url": "https://www.petmd.com/author/dr-kasey-stopp"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_adenocarcinoma_renalNA"}, "datePublished": "March 31, 2022", "dateModified": "August 12, 2022", "description": "Dr. Kasey Stopp explains kidney cancer in dogs, including symptoms, diagnosis, and possible treatment.", "articleBody": "What is Kidney Cancer in Dogs? Dogs have two kidneys located just above the bladder, near the spine and midway down the back. Similar to humans, dogs rely on these bean-shaped organs to help control blood pressure, filter waste from the blood, maintain the balance of nutrients in the blood, and increase production of red blood cells.   The kidneys and their surrounding tissues can develop cancers, including cancers that develop in the kidney (primary) or cancers that travel from other sites and develop in the kidney (metastatic). Primary tumors are rare, accounting for less than 2% of all dogs and usually limited to one kidney.   There are many types of benign (non-cancerous) tumors that can occur in the kidneys of dogs, including papillomas and fibromas. These are relatively rare.  The type of tumor depends on where it started in the body. Types of kidney tumors in dogs include:  Carcinomas—The most common type of primary kidney tumor. Carcinomas usually start in the epithelial tissue and skin.  Adenocarcinomas—A type of malignant cancer that starts in the glands.  Sarcomas—A type of cancer that starts in the bones or muscles.  Metastatic tumors can include:  Renal carcinoma: This is the most common type of cancerous kidney tumor, and typically only develop in one kidney. Renal carcinomas commonly spread to the lungs, abdominal organs, or local lymph nodes, but can also be seen in the skin, heart, brain, and skeleton.   Due to the proximity of the kidneys to the caudal vena cava (the major vein that transports blood from the lower body and abdominal organs back to the right side of the heart), renal carcinoma can invade the vessel and other nearby veins, causing potentially dangerous blood clots to form. Older, large to medium breed male dogs are most likely to be affected.  Other primary tumors found in the kidney: These tumors include transitional cell carcinoma, hemangiosarcoma, leiomyosarcoma, anaplastic sarcoma, lymphoma (very rare), and nephroblastoma. Nephroblastoma is an aggressive congenital tumor that is usually diagnosed in dogs less than 12 months of age. It destroys the functional structures of the kidney and has a 65% rate of metastasizing to other sites, with the liver and lungs as the most common site of spread.  Renal cystadenocarcinoma: This is an inherited condition seen in the German Shepherd breed that represents 6% of all kidney tumors seen in the breed. Renal cystadenocarcinoma affects both kidneys and slowly deteriorates the kidney’s ability to function normally.   Often called renal cystadenocarcinoma and nodular dermatofibrosis due to the prevalence of dogs also affected by skin and uterine masses (growths), most dogs affected by this disease begin showing symptoms, consisting of small firm bumps beneath the skin on the dog’s legs and head, at around 6 years of age.  Symptoms of Kidney Cancers in Dogs  Tumors of the kidney can cause general symptoms such as:  Abdominal pain  Abdominal distension (swollen belly)  Loss of appetite  Weight loss  Nausea  Vomiting  Lethargy  Depression  Blood in urine (rare)  Most veterinarians discover kidney tumors by physically feeling an enlarged or excessively firm kidney during a routine annual exam.  Causes of Kidney Cancer in Dogs  The cause of cancers of the kidney, or any cancer, is typically unknown. Most cancers seem to be caused by environmental or genetic factors, but there are no known environmental causes of cancers of the kidney in dogs at this time.  How Veterinarians Diagnose Kidney Cancer in Dogs  The blood work (including blood chemistry and complete blood count) of a dog with cancer of the kidney may reveal no abnormalities but should always be performed to provide information about the overall health of the dog.   A urinalysis (testing of the urine) may reveal high protein levels or the presence of red blood cells, which can help lead to a diagnosis. X-rays of the abdomen can also be an excellent screening test since they will often show an enlarged affected kidney. Radiographs of the thorax (chest), spine, and legs may be recommended to screen for metastatic disease, which can influence decisions about whether to pursue surgery as treatment.   A CT or MRI may be recommended to better identify any tumor invasion into surrounding tissues, outside of the kidney, for surgical planning. An ultrasound of the abdomen can be used to confirm kidney involvement and structural changes along with identifying potential metastasis (cancer spread) to other organs or lymph nodes.   A vet may also recommend a fine needle aspiration (FNA) biopsy. During this test, a thin needle is inserted into an organ to collect a sample of material for further diagnosis. An ultrasound can also be used to guide an FNA biopsy.  Treatment for Kidney Cancer in Dogs  The most common treatment for cancer of the kidney in dogs is surgery to remove the affected kidney and the associated ureter (the tube that carries urine from the kidney to the bladder). Surgical planning is based on the type of tumor, the presence or absence of metastasis, and whether the tumor has invaded nearby structures, such as the caudal vena cava.   Specifically, renal carcinoma has proven to be highly resistant to chemotherapy, radiation therapy, and hormone therapy. Results have been disappointing, with less than 10% of renal carcinoma patients showing any response to chemotherapy. Your vet will be able to determine a treatment plan that works best for your dog.   Recovery and Management of Kidney Cancer in Dogs  Recovery from surgery will consist of rest, medications (e.g., anti-inflammatories, pain medications, antibiotics), and follow-up visits to your vet’s office to monitor for recurrence of the disease in areas where metastasis might have spread.  "}]