[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rapid Heart Beat in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/rapid-heart-beat-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/rapid-heart-beat-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_supraventricular_tachycardia"}, "datePublished": "December 8, 2009", "dateModified": "August 16, 2022", "description": "Supraventricular refers to an abnormality in the rhythm of the heart that originates above the ventricles of the heart, and tachycardia is a general term for an abnormally rapid heart beat.", "articleBody": "Supraventricular Tachycardia in Dogs Supraventricular tachycardia (SVT) refers to an abnormally rapid heart rate originating above the heart&#039;s ventricles. This can occur during times of rest or low activity (i.e., at times other than exercise, illness, or stress). A heart rate that remains excessively high over the long-term (such as those seen with SVT) can lead to progressive myocardial (heart muscle) failure as well as congestive heart failure. SVT may go unnoticed when it is periodic, but when there are repetitive supraventricular premature electrical heart depolarizations (changes in the heart&#039;s electrical potential) that originate from a site other than the sinus node (the pacemaker of the heart), such as in the atrial muscle or atrioventricular nodal tissue, the condition can become a serious health problem. Symptoms and Types Slow SVT or infrequent attacks of SVTNo clinical signsFast SVT (heart rate above 300 beats per minute)WeaknessFaintingCongestive heart failure (CHF)CoughingBreathing abnormalitiesCauses There are several factors that may lead to SVT, including: Heart diseaseDigoxin toxicitySystemic disordersElectrolyte imbalancesAbnormal automaticity in an ectopic focus (when the heart beats prematurely or outside the normal parameters)Some dogs even develop SVT due to a genetic predisposition or because of an unknown reason. Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms that you provide. Standard laboratory tests include a biochemical profile, a complete blood count, a urinalysis and an electrolyte panel to rule out systemic disease, cancer, and electrolyte imbalances. An electrocardiogram (EKG) recording can be used to examine the electrical currents in the heart muscles, and may reveal any abnormalities in cardiac electrical conduction (which underlies the heart’s ability to contract/beat). An EKG (with Doppler studies) can also enable your veterinarian to characterize the type and severity of any underlying heart disease, as well as assess myocardial function for dogs suffering from primary SVT. Furthermore, long-term ambulatory (Holter) recording of the EKG may detect attacks of SVT in cases of unexplained fainting, while event (loop) recorders may detect paroxysmal (severe attacks) SVT in dogs with infrequent episodes of syncope (fainting).  Treatment Dogs with sustained SVT or signs of congestive heart failure should be hospitalized immediately. There they may undergo a variety of non-pharmacologic, emergency interventions, including vagal maneuvers, precorial thump, and/or electrical cadioversion. Delivering a precordial thump is successful in terminating an SVT more than 90 percent of the time, but may break the ryhtym for only a brief period. To perform a precordial thump, the dog is placed on its right side and then &quot;thumped&quot; in the affected region with a fist while recording the EKG. Living and Management Your veterinarian will schedule follow-up appointments for your dog as needed for treating the SVT and/or the underlying heart disease with prescription medication and/or dietary changes. He or she will recommend that you feed your dog a low sodium diet as well as restrict its activity until further notice. Short, low impact outdoor walks are ideal during this time."}]