[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Distemper in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/distemper-in-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/distemper-in-dogs.jpg"}, "author": {"@type": "Person", "name": "Tiffany Tupler, DVM, CBCC-KA", "url": "https://www.petmd.com/author/dr-tiffany-tupler"}, "keywords": "Dog, Condition, Respiratory health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/c_dg_canine_distemper"}, "datePublished": "October 29, 2020", "dateModified": "September 8, 2023", "description": "Dr. Tiffany Tupler discusses distemper in dogs, a highly contagious and often fatal viral disease. Learn what canine distemper is, along with the signs, treatment options, and if it can be prevented.", "articleBody": "You may have seen “DHPP” or “DAPP” on your paperwork from your pet’s routine vet visit and wondered what it means. The “D” in this combination vaccine stands for distemper, a disease that usually spreads from one dog to another through direct contact, coughing, and sneezing.  Distemper is one of the core vaccines for dogs, meaning that all dogs should remain current on this important vaccination. Distemper in dogs can turn fatal very quickly, which is why you never want your dog to have to face it. Here’s why protection from canine distemper virus is so important. What Is Distemper in Dogs and Puppies? Canine distemper is a highly contagious, often fatal viral disease that affects the respiratory, gastrointestinal (GI), nervous system, and other organs of dogs.  Unvaccinated or incompletely vaccinated dogs and especially puppies are at highest risk. Distemper doesn’t just affect dogs. Infected ferrets and wildlife—foxes, wolves, raccoons, skunks, coyotes, and other carnivores—can also become sick and transmit the virus to dogs. Distemper in dogs can be prevented through a core vaccination series that should be performed by a licensed veterinarian. Symptoms of Distemper in Dogs and Puppies Distemper in dogs often initially presents as yellow- to green-colored eye discharge, followed by: Nasal discharge Coughing Sneezing Depression Vomiting Eating less than usual Diarrhea Some dogs only appear to have a minor cold with eye and nasal discharge, while others may have no symptoms at all. As the disease progresses, dogs can develop: Tremors Chewing motions of the jaw Seizures Partial or complete paralysis Pneumonia Crusting of the nose and foot pads Severe vomiting and diarrhea Death, in many cases Causes of Distemper in Dogs Distemper is transmitted mainly through respiratory secretions (coughing and sneezing) but other bodily fluids like urine, vomit, and stool can also contain the virus. Contact with an infected animal is the most common way for distemper to spread, but shared food bowls and contaminated supplies, surfaces, and equipment can also pose a risk. Dogs, ferrets, and wildlife can appear healthy and still be a source of the distemper virus. Recovered dogs may remain contagious for four months or more. Are Puppies More Prone to Canine Distemper? Yes, puppies are at highest risk for canine distemper, but any dog who is not fully vaccinated against the virus can become sick regardless of age. Can Humans Get Distemper? At this time, there is no evidence that humans can get canine distemper. However, ferrets are also at risk for being infected with the canine distemper virus and should be vaccinated against it. Treating Distemper in Dogs and Puppies Distemper treatment for dogs consists of supportive care of clinical signs and can vary depending on a dog’s symptoms. The most common treatments are: Gastrointestinal support for severe diarrhea and vomiting, which can lead to dehydration. Many cases require intravenous fluid therapy (to treat and prevent dehydration), anti-vomiting medications, and antibiotics. Canine distemper virus can weaken the immune system, causing secondary bacterial infections, septicemia, disseminated intravascular coagulation (DIC), and in some cases, death. Respiratory support for severe pneumonia. Many dogs have trouble breathing and severe coughing. Some of these symptoms can be life-threatening and may require oxygen therapy, antibiotics, and hospitalization. Neurological support for seizures. These seizures can last several minutes, which can lead to irreversible brain damage and even death. Dogs with seizures caused by distemper may require hospitalization and monitoring along with anti-seizure medications. Can a Dog Recover From Distemper? Dogs can survive distemper, but they may develop lifelong debilitating nervous system issues. Adult dogs are more likely to survive infection than puppies. Distemper can cause chronic seizures and muscle twitches. Neurologic symptoms may develop weeks or months after a dog has been infected with distemper virus and remain for the rest of a dog’s life. Dogs with distemper typically remain contagious for at least two weeks, during which time they should be completely isolated from other animals. Dogs with neurological symptoms can remain infectious for four months or even longer. Preventing Distemper in Dogs Proper vaccination for distemper is crucial—it’s the best way to prevent this serious disease. Due to the fragile nature of the vaccine, it&#039;s important that a veterinarian perform these vaccinations to ensure quality control, safe handling (accounting for temperature-controlled shipping and storage), and proper administration. What Are the Side Effects of the Distemper Vaccine in Dogs? Vaccines stimulate the immune system in order to provide protection against the disease in question. Most dogs show no side effects from vaccination, but dogs can become sore at the injection site or develop a mild fever. In rare cases, allergic reactions (facial swelling, vomiting, diarrhea, and collapse) can occur. Speak to your veterinarian about the benefits and risks involved with vaccinations. Featured Image: iStock/Halfpoint"}]