[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lead Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/lead-poisoning-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/lead-poisoning-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_lead_poisoning"}, "datePublished": "February 14, 2010", "dateModified": "August 16, 2022", "description": "Lead poisoning (toxicity), a condition in which increased levels of the metal lead is found in blood, can afflict both humans and dogs through both sudden (acute) and long-term (chronic) exposure to the metal.", "articleBody": "Lead Toxicity in Dogs Lead poisoning (toxicity), a condition in which increases levels of the metal lead is found in blood, can afflict both humans and dogs through both sudden (acute) and long-term (chronic) exposure to the metal. Through the ability to substitute itself for calcium and zinc (both important minerals for normal cell functions), lead damages the cell and affects normal biological processes. Although a high number of lead poisoning cases are seen during the warmer months of the year, there is a wide variety of sources of lead -- many of which vary between different geographical and ecological locations. Older homes and buildings, for instance, are common sources of lead poisonings, as they can be riddled with lead dust or chips from lead paint. Lead poisoning is more common in young animals and in dogs living in poor areas. However, cats also succumb to lead poisoning. Symptoms and Types The symptoms for lead poisoning mostly relate with the gastrointestinal (GI) and central nervous system (CNS). GI systems, for example, are seen with chronic and low-level exposure, whereas CNS symptoms are more common in acute exposure in young animals. Some of the more common symptoms include: VomitingDiarrheaLethargyPoor appetiteAbdominal painRegurgitation (due to megaesophagus)WeaknessHysteria, extreme anxietySeizuresBlindnessCauses Ingestion of lead – sources can include paint chips, car batteries, solder, plumbing material, lubricating material, lead foil, golf balls, or any other material containing leadUse of improperly glazed ceramic food or water utensilLead-contaminated waterDiagnosis You will need to give a thorough history of your dog’s health leading up to the onset of symptoms, including a history of any contact with material containing lead, if possible. After recording your dog’s history, your veterinarian will perform a complete physical examination. Laboratory tests will include complete blood count, biochemistry profile, and urinalysis -- the results of which may reveal valuable information for initial diagnosis. Blood testing may reveal red blood cells of unequal size (anisocytosis), abnormally shaped red blood cells (poikilocytosis), variations in red blood cell coloring (polychromasia, hypochromasia), and increased number of neutrophils (type of white blood cells). Urinalysis results are often non-specific and in some patients, abnormal concentrations of glucose may be seen in urine. If your dog is showing all of the appearances of lead poisoning, your doctor will use more specific tests available which will help your veterinarian to determine the levels of lead in both blood and body tissues.   Treatment Lead poisoning should be considered an emergency that requires immediate care. Often, chelation therapy -- a detoxifying therapy whereby chelating agents are given through the mouth to bind the lead found in the gastrointestinal system and prevent further absorption -- is the first course of treatment. There are many types of chelating agent available for various types of poisonings, and selection of chelating agent will be made by the attending veterinarian. Your veterinarian may also perform a gastric lavage to remove and clean the stomach contents if the lead has been ingested within hours of medical care. This method uses water to wash, clean and empty the stomach cavity and digestive tract of poison. There are also some drugs available that can help in lowering the body load of lead, especially in cases where concentrations of lead in blood are very high. Other symptoms will be treated accordingly. Living and Management Most dogs recover within 24 to 48 hours after initial treatment. Prognosis in affected animals is positive if treated quickly; however, dogs with uncontrolled seizures have a more guarded prognosis. Because humans and other animals are at risk from the same source of lead, your veterinarian is required to report the incident to relevant authorities. You may need to identify the source of lead to prevent further human or animal exposure. If source of lead is not identified and eliminated, future episodes are not uncommon and may pose greater risks. Prevention Often the best way to prevent this type of poisoning is to remove materials and objects containing lead from your home. See Also"}]