[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Liver Inflammation (Granulomatous) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/liver-inflammation-granulomatous-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/liver-inflammation-granulomatous-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Liver health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_inflamed_liver_tumor"}, "datePublished": "January 25, 2010", "dateModified": "August 16, 2022", "description": "Hepatitis is a condition in which the liver is inflamed, creating a diseased state.", "articleBody": "Granulomatous Hepatitis in Dogs Hepatitis is a condition in which the liver is inflamed, creating a diseased state. Further complicating this condition is the growth of inflamed tissue on the liver, a condition that is then referred to as hepatitis granulomatous (where a granuloma is a small area of inflamed tissue). This condition is most commonly due to fungal infection, but it can also be brought about by bacteria, viruses, parasites, or cancer. Hepatitis granulomatous is relatively uncommon in dogs, but it is not limited by age or breed. Symptoms and Types Lack of appetiteVomitingDiarrheaWeight lossLethargyIncreased urination (polyuria)Increased thirst (polydipsia)Abdominal painYellowish discoloration of the skin and the whites of the eyes due to jaundiceDistended abdomenFeverCauses Fungal infections (blastomycosis,  coccidioidomycosis, histoplasmosis)Bacterial infections (brucellosis)Parasitism (liver flukes, visceral larval migrans)Neoplasia/cancer (lymphosarcoma)Immune-mediated disorders (involving the immune system of the body)Drug reactionsIdiopathic (cause unknown)   Diagnosis You will need to give a thorough history of your dog&#039;s health leading up to the onset of symptoms, including any illnesses your dog has had, even if they have apparently resolved. Your veterinarian will perform a complete physical exam, including a blood chemical profile, a complete blood count, a urinalysis and an electrolyte panel. The results of the blood tests may reveal abnormalities related to the underlying disease/condition. The biochemical tests usually reveal abnormally high liver enzymes and bilirubin levels, low glucose levels, and other such abnormalities. Similarly, the urinalysis may reveal protein, red blood cells, or white blood cells in the urine, indicative of infection. As the liver is important for blood clotting, abnormalities related to blood clotting are common in these patients. However, a coagulation check may return normal, unless your dog has reached the point of liver failure. Abdominal X-rays will often reveal an enlarged liver, an abdominal mass, and excess fluid inside the abdominal cavity. An abdominal ultrasound will give your veterinarian further details related to the liver size and also enable your veterinarian to take a guided biopsy of liver tissue for further microscopic evaluation. The liver tissue sample will confirm abnormalities in the liver tissue, providing the means for a definitive diagnosis. It is important to keep in mind that hepatitis granulomatous is frequently multisystemic, meaning that several systems of the body are being affected, making the diagnosis difficult to define.  Treatment Depending on the severity of the symptoms, your dog may needs to be hospitalized for initial treatment. Fluid therapy will be given to restore bodily fluid deficits, along with nutritional support if your dog is unable to eat. As the underlying cause of this disease is often difficult to diagnose, treatment can be highly variable and will depend on the underlying cause. Because of the liver&#039;s importance to the body whole, the prognosis for this disease is guarded to poor. Cirrhosis, liver failure, or a chronic condition may develop as the result of hepatitis granulomatous. Living and Management It is not always possible to diagnose the underlying cause of this disease, therefore, successful treatment is often difficult to achieve. Due to this fact, the condition often worsens and may lead to cirrhosis and liver failure. The prognosis is often poor because of involvement of multiple systems of the body, the difficulty in diagnosing the underlying cause, and the ability to provide proper treatment without a definite diagnosis."}]