[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Prostate Inflammation and Abscessation in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/prostate-inflammation-abscessation-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/prostate-inflammation-abscessation-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_prostatitis"}, "datePublished": "August 31, 2009", "dateModified": "August 16, 2022", "description": "An abscess of the prostate is evidenced by a pus filled sac that may lead to prostatitis, which is an inflammation of the prostate. This is often the result of a long-standing infection that has gone undetected. Prostatitis is divided into two phases: acute (early), and chronic (later, farther into the disease).", "articleBody": "Prostatitis and Prostatic Abscess in Dogs An abscess of the prostate is evidenced by a pus filled sac that may lead to prostatitis, which is an inflammation of the prostate. This is often the result of a long-standing infection that has gone undetected. Prostatitis is divided into two phases: acute (early), and chronic (later, farther into the disease). Acute prostatitis occurs with the sudden onset of a bacterial infection in the prostate. Occasionally, the abscess may rupture and its contents will spill into the abdominal cavity. Chronic prostatitis occurs when a long-standing infection has gone undetected. Acute prostatitis may also lead to chronic prostatitis, with the initial symptoms being missed.   Symptoms and Types Sudden (Acute) Prostatitis Lethargy/depressionLack of appetiteStraining to defecateDifficulty urinatingFeverPain in the abdomenBloody discharge from the urethraStiff walking patternLong-Term (Chronic) Prostatitis May have no detectable signsCauses All male dogs are at risk for sustaining prostatitis; there are no breeds that are exempt of more prone than others. However, dogs between the ages of 7 to 11 years are at higher risk. Some of the risk factors for this condition are: Bacteria moving up from the urinary passage to the prostateBacteria spreading to the prostate from other parts of the bodyBacteria spreading from a wound site to the prostatePresence of functional testicles (hormonal)Enlarged prostateMedical history of administration of male hormone or female hormoneFaulty immune systemDiagnosis You will need to give your veterinarian a thorough history of your dog&#039;s health and medical history, details of the onset of symptoms, and possible incidents that might have led to this condition. The history you provide may give your veterinarian clues as to the leading cause of the condition. Your veterinarian will perform a complete physical exam on your dog, including standard laboratory tests like a blood chemical profile, a complete blood count, an electrolyte panel, and a urinalysis. This is the only way to determine whether the organs are functioning properly, and to find factors such as bacterial infections, microscopic evidence of blood in the urine, or increased white blood cell counts, indicative of the body fighting an infection. There may be blood in the urine. In dogs with prostatitis, they may bleed even when not urinating. Sometimes an affected dog will not urinate at all, or will show pain while urinating. Feces may also appear flat and/or the dog may be constipated. During the physical exam, your veterinarian will insert a gloved finger into your dog&#039;s rectum to palpate the prostate gland. If your dog reacts painfully, and/or the prostate feels enlarged, biopsies will need to be taken for a histopathology, cytology and culture, and sensitivity testing.  Treatment If the cause of the prostatitis is bacterial, your dog will need to be hospitalized and given antibiotics intravenously. Your dog may be treated on an outpatient basis if it is only suffering from a mild case of chronic prostatitis. Castration can relieve prostatitis if it is hormonal in origin, as dogs that have not been neutered are more prone to this type of disease. Your veterinarian may also prescribe hormone-blocking medications to lessen the chance of a recurrence. If your dog is suffering from a ruptured, abscessed prostate, it might require surgery once the antibiotic therapy has stabilized its condition. Living and Management Unless your dog has a prostatic abscess which has ruptured into the abdominal cavity, its prognosis for recovery is still good to excellent. If your dog is able to remain whole (i.e., not neutered), you will need to prevent it from mating until it has recovered from the bacterial prostatitis and until no more bacteria are present in the prostatic fluid samples. These samples will be taken for laboratory examination during the follow-up visits with your veterinarian. If your veterinarian advises you to have your dog castrated in order to prevent a recurrence of prostatitis, its overall prognosis will greatly improve as a result. If your dog appears to have difficulty urinating again, is walking with a painful gait, or is exhibiting other symptoms it had during the bout with prostatitis, immediately contact your veterinarian, as the prostatitis may be recurring."}]