[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skin Cancer (Basal Cell Tumor) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/skin-cancer-basal-cell-tumor-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/skin-cancer-basal-cell-tumor-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_basal_cell_tumor"}, "datePublished": "May 19, 2010", "dateModified": "August 16, 2022", "description": "Originating in the skin&#039;s basal epithelium -- one of the deepest skin layers -- basal cell tumors tend to occur in older dogs, especially Cocker Spaniels and Poodles.", "articleBody": "Basal Cell Tumor in Dogs Basal cell tumor is the one of the most common skin cancers in animals. In fact, it accounts for 3 to 12 percent of all skin tumors in dogs. Originating in the skin&#039;s basal epithelium -- one of the deepest skin layers -- basal cell tumors tend to occur in older dogs, especially Cocker Spaniels and Poodles. Symptoms and Types As with other tumors, basal cell tumors can either be benign (e.g., basal cell epithelioma and basaloid tumor) or malignant (e.g., basal cell carcinoma). However, metastasis is rare and less than 10 percent of basal cell tumors are malignant. And though variable in size (0.2 to 10 centimeters in diameter), it most often appears as a solitary, well-circumscribed, formed, hairless, raised mass in the skin, typically located on the dog&#039;s head, neck, or shoulders. Causes The underlying cause for a basal cell tumor is currently unknown. Diagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to the veterinarian. He or she will then perform a complete physical examination as well as a biochemistry profile, urinalysis, complete blood count, and electrolyte panel. Fine needle aspiration cytology, whereby cells extracted from just under the skin for evaluation, may reveal round cells with dark blue cytoplasm. Occasionally, cells may even be dividing at an alarming rate, also known as high mitotic rate. For definitive diagnosis, however, a diagnostic procedure known as histopathologic examination is needed. This will involve examining thin slices of the tumor under a microscope.  Treatment While cryosurgery (freezing via liquid nitrogen) can be used for smaller lesions (smaller than one centimeter in diameter), surgical excision is the preferred method of treatment. Most dogs recover fully after surgery. Living and Management The overall prognosis for dogs with basal cell tumor is good. In fact, many are completely cured once the tumor is surgically excised."}]