[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Prostate Disease in the Breeding Male Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_prostate_disease"}, "datePublished": "December 7, 2009", "dateModified": "August 16, 2022", "description": "The prostate is the only accessory sex gland in the dog. In intact (non-neutered) dogs this gland increases in size and weight with advancing age. This is the most common disorder of the prostate in dogs older than six years and is a normal occurrence of aging.", "articleBody": "Benign Prostatic Hyperplasia (BPH) in Dogs The prostate is the only accessory sex gland in the dog. In intact (non-neutered) dogs this gland  increases in size and weight with advancing age. This is the most common disorder of the prostate in dogs older than six years and is a normal occurrence of aging. It is not necessarily a life-threatening condition by itself, but can result in a dog being more susceptible to other disorders, along with making the dog very uncomfortable. Benign prostatic hyperplasia (BPH) in dogs is a hormone mediated proliferation of cells that is commonly seen in dogs from middle age onward. This condition affects the glands and connective tissues of the prostate, causing swelling of the prostrate gland, which then presses against the rectum, making the canal smaller and defecation painful for the dog. BPH is due to an age-associated increase in estrogen in the prostate. The ratio between estrogen and androgen ratio is believed to contribute to BPH development in older dogs, as both estrogens and androgens are required for significant prostatic enlargement to occur. The clinical effects of BPH are minimal or absent in most dogs, but in chronic cases, BPH can render the prostate more susceptible to infection from the urinary tract and subsequent development of bacterial prostatitis. Types     Prostatitis/Prostatic abscess            The prostate gland and urinary tract of normal intact dogs are sterile environments; microbial growth within the prostate is inhibited by a prostatic antibacterial factor. Prostatitis, inflammation of the prostate, typically occurs in association with bacterial infection, and may be acute (sudden and severe) or chronic (long-term). Bacterial prostatitis may progress to abscess formation. It is associated with BPH due to alteration of the prostatic architecture. Concurrent bacterial urinary tract infection is not always noted with bacterial prostatitis.            Prostatic cysts             Prostatic cysts may be primary or secondary to hyperplasia, cancer, or inflammation. Multiple cysts may be associated with BPH and squamous metaplasia (the change of one cell type to another). Squamous metaplasia occurs with exposure to estrogen or with an alteration in the estrogen:androgen ratio. Estrogen converts prostatic epithelium to a stratified squamous type, and subsequent duct occlusion contributes to cyst formation.        Paraprostatic cysts (fluid-filled sacs found adjacent to the prostate) are attached to the prostate, lined by skin cells that give off a secretion, and are variable in size. Larger cysts  containing excess collagen and cauliflower-like bony extensions are not uncommon, but they’re almost always sterile.            Prostatic neoplasia (cancer)            Prostatic adenocarcinoma (a cancer that originates in the glandular tissue) is most the commonly reported form of BPH. Other tumor types include fibrosarcoma (a malignant tumor derived from fibrous connective tissue), leiomyosarcoma (a cancer of the smooth muscle cells), and squamous cell carcinoma (a malignant tumor of skin cells). Prostatic transitional cell carcinomas typically arise from the prostatic urethra rather than the prostate gland itself.        Incidence of prostatic neoplasia in intact versus castrated dogs is similar. Prostatic adenocarcinoma, a malignant form of abnormal cell growth, is not associated with benign hyperplasia. Bone metastasis occurs in more than one-third of prostatic adenocarcinoma cases, typically to the nearby pelvic bones and back bone.        BPH incidence is high in non-neutered dogs. By five years of age, 50 percent of intact dogs exhibit histologic evidence of BPH. The true incidence of prostatis is unknown, but it’s considered common in veterinary practice. However. The incidence of neoplasia is low; carcinomas are reported at 0.29–0.60 in the dog population. Prostatic cysts in intact dogs generally occurs before four years of age. Cancer of the prostate generally occurs before ten years of age. Symptoms     Prostatic disease – general            Asymptomatic        Tenesmus (constipation)        Bloody urethral discharge        Reduction in urination or defecation        Stranguria (straining to void)            Benign prostatic hyperplasia            Hematuria        Hematospermia            Prostatitis – acute            Systemic illness (vomiting, lethargy, inappetence, weight loss)        Purulent urethral discharge        Pyuria        Hematuria        Infertility        Stiff legged gait            Prostatitis – chronic            Recurrent/chronic urinary tract infection        Hematuria        Stiff gait        Infertility            Prostatic cyst            See type description for BPH (above)        If associated with infection see prostatitis            Prostatic neoplasia            Emaciation        Dyschezia (defective reflex for defecation-painful defecation)        Difficulty with moving rear limbs        Lumbosacral pain (back pain between the ribs and pelvis)        Causes     BPH            Intact breeding males        Over five years of age            Prostatitis            Infection of the prostrate        Over five years of age            Squamous metaplasia            Administration of estrogen        Cell tumor            Paraprostatic cyst            A cysts that occurs in the tissues surrounding the prostate        Over eight years of age            Prostatic neoplasia            No association between intact or non-intact status        Over ten years of age        Diagnosis You will need to provide a thorough history of your dog&#039;s&#039;s health leading up to the onset of symptoms. Initially, standard laboratory tests will include a complete blood profile, chemical blood profile, a complete blood count, and a urinalysis. Because there are so many possible causes for this condition, your veterinarian will use differential diagnosis. This process is guided by deeper inspection of the apparent outward symptoms, ruling out each of the more common causes until the correct disorder is settled upon and can be treated appropriately. The doctor will thoroughly examine your dog and make some preliminary estimations based on the physical exam. However, the preferred method for looking at the prostate is by ultrasound, so the results of these images will provide much of the information your veterinarian needs to make a diagnosis. In addition, x-ray imaging can be used to gather information that is not revealed by the ultrasound. Culture samples from the urinary tract will be taken for analysis, as well as semen, and if a mass of tissue, or tumor, is found, your doctor may also perform a biopsy in order to define the mass.  Treatment For benign prostatic hyperplasia, treatment is only indicated for symptomatic dogs. Castration is the treatment of choice for animals with no breeding value, and this should effectively resolve the problem. However, if the dog is valuable for breeding purposes, medications can be used to temporarily reduce the size of the prostate so that the dog can be functional. This treatment is typically only used to reduce clinical signs so that sufficient quantities of semen can be collected and frozen for future use. It is not meant as a long-term therapy, and without further treatment the prostate will return to pretreatment size eight weeks after discontinuation of therapy. Your veterinarian will likely recommend castration once the desired doses of semen are stored. If the cause is found to be a bacterial infection, antibiotics will be prescribed, based on the specific culture and sensitivity results. If the infection is chronic, the antibiotics of choice will be designed to treat the more intense form of infection. Castration is recommended if the course of antibiotics does not get resolve the infection. If the diagnosis is a cyst, treatment will be based on the location, type, and size of the cyst. Again, castration may be recommended. If the diagnosis is cancer, it has usually metastasized by the time of diagnosis. Chemotherapy may be advisable, depending on the nature of the cancer, but it is important to keep in mind that there is no cure or long-term remedy for cancer. Pain relief medication will be prescribed to help your dog to cope. Living and Management Your veterinarian will want to repeat the prostatic fluid cultures in follow-up visits. Semen evaluation should be performed in all dogs maintained for breeding, but not before 65 days after the resolution of bacterial prostatitis. The abdominal ultrasound will also need to be repeated in order to evaluate the prostate size after medical therapy. Dogs that test positive for Brucella (Gram-negative bacteria) should not be used for breeding, as this disease is highly infectious. It is also important to note that Brucellosis is a zoonotic infection that can be passed from dogs to humans, although is remains an uncommon disease in humans. In the event that your dog is diagnosed with Brucellosis,  you will need to take the necessary precautions when handling any secretions from your dog."}]