[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Collapse During Exercise in Labrador Retrievers", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/collapse-during-exercise-labrador-retrievers.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/collapse-during-exercise-labrador-retrievers.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Emergency", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_exercise_induced_collapse_labrador_retriever"}, "datePublished": "June 29, 2009", "dateModified": "August 16, 2022", "description": "Part of having a Lab in your family is to become accustomed to having a high energy dog that plays and exercises a lot. Most dogs will slow down or stop when they are tired and will have no problems, but some revel so much in activity that they will exercise until they become weak and collapse from exhaustion.", "articleBody": "Exercise Induced Weakness and Collapse in Labrador Retrievers Labrador retrievers are one of the more active dog breeds. Part of having a Lab in your family is to become accustomed to having a high energy dog that plays and exercises a lot. Most dogs will slow down or stop when they are tired and will have no problems, but some revel so much in activity that they will exercise until they become weak and collapse from exhaustion. This is called exercise induced collapse in Labrador retrievers. Problems usually occur during periods of intense activity or excitement. At other times, these dogs seem completely normal. Symptoms are first seen in young dogs between five months of age and three years of age. The disease does not seem to affect one gender more than the other. Labs bred to be field trial dogs may be more likely to have the problem, and Labs that are easily excited are more likely to have the problem. Collapse is most likely to occur when the temperature and humidity are high, and during activities like upland bird hunting, repetitive retrieving, long, hard running, and intense play, but any very intense activity can lead to collapse. Symptoms and Types Signs begin after five to twenty minutes of extreme exercise, excitement, or stress. They include: Not walking or running normally (rocking gait)Weak back legsDragging the back legs while runningStanding with the feet too far apart (wide-based stance)Picking the feet up too far while walking or running (hypermetria)Falling over while runningUnable to move the head and all four legs after exerciseStiff front legs while collapsedMost dogs are alertNo pain while collapsedHigh body temperatureOccasionally, confusionRarely, seizures and deathNo symptoms between times of collapseRecovery usually within five to twenty five minutesCauses An inherited problem in Labrador retrievers that is an autosomal recessive trait. Dogs that carry two copies of the gene (homozygotes) are at substantial risk of showing clinical signs. Dogs that carry one copy of the gene (heterozygotes) are carriers and can pass the gene to their puppies. However, they are not likely to show symptoms of exercise induced collapse. Diagnosis A genetic test is available to identify the gene that causes exercise induced collapse in Labrador retrievers. If your veterinarian suspects this disease, the genetic test may be recommended to confirm the diagnosis. Other testing your veterinarian may want to perform includes a complete blood count and biochemical profile. These will confirm that your dog&#039;s internal organs are working properly. Your dog&#039;s thyroid hormone level may also be checked to make sure it is normal. Other blood tests can be analyzed to see if other muscle diseases might be causing your dog to collapse. To make sure that your dog is not suffering from a heart problem that comes and goes, your veterinarian may want your dog to wear a special monitor for a day or two to track normal heart rhythm. These tests are typically normal in Labs with exercise induced collapse.   Treatment Most dogs with exercise induced collapse can be treated by avoiding the activities which cause it to collapse. Of course, exercise cannot be entirely avoided, so when your dog does exercise, all activity should be stopped at the first sign of weakness. Give your dog water to drink by mouth or spray it with cool water to help bring down the body temperature. If changing your dog’s activities is not possible or is not helping, there are other things which might help. Some dogs have fewer episodes of collapse when their diet is changed and they gain a small amount of weight. If the dog is not neutered, neutering may help. There are some medications that might helpful as well. Your veterinarian can help you to decide if one is right for your dog. Though medications will not help all dogs, in many dogs, medications may just decrease the number of episodes a dog has or minimize the severity of the episodes. Living and Management Being observant of your dog&#039;s condition is the most practical ongoing treatment and prevention. When your dog shows symptoms of exhaustion and imminent collapse, it is important to stop all activity and cool your dog down. If your dog can be treated simply by changing its activity level, you may need to do this for the rest of its life. If your dog has been prescribed medication to help with its symptoms, you will need to return to your veterinarian for regular follow-up visits to make sure that the medicine is not hurting any of your dog&#039;s internal organs. Make sure to follow all of the instructions you are given with the medication carefully, making changes only after consulting with your veterinarian. Usually, the number of episodes that your pet has will decrease with age. Prevention It is important to avoid activities that will cause your dog to become weak to the point of collapse. Dogs that have been diagnosed with exercise induced collapse should not be used for breeding, as this is a hereditary condition."}]