[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Diarrhea Due to Clostridium perfringens in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Diarrhea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_clostridial_enterotoxicosis"}, "datePublished": "December 30, 2009", "dateModified": "August 16, 2022", "description": "Clostridial enterotoxicosis is an intestinal syndrome brought on by the Clostridium perfringens bacterium.", "articleBody": "Clostridial Enterotoxicosis in Dogs Clostridial enterotoxicosis is an intestinal syndrome brought on by abnormally high levels of Clostridium perfringens bacterium, a bacteria found commonly inhabiting decaying vegetation and marine sediment. It can also be acquired from raw or improperly cooked meats and poultry, and meats that have been left out in the open. There is also evidence that dogs can acquire this infection from being with other dogs, such as when boarded at a kennel. Generally, the implications of the clostridial enterotoxicosis are limited to infections of the intestinal tract and do not progress to systemic disease conditions. Symptoms typically last a week in acute cases and include diarrhea, abdominal pain, and nausea. Long-term (chronic) cases of clostridial enterotoxicosis, meanwhile, involve recurrences of diarrhea, which may repeat every two to four weeks, and may continue for months to years. In fact, clostridial enterotoxicosis in dogs is suspected to occur in up to 20 percent of large bowel diarrhea cases. Although it is more common in dogs as opposed to cats -- perhaps because dog spend more time amongst vegetation, or eating found meat (such as in refuse) -- most animals have antibodies that will effectively fight the bacteria and clear it from the body. Symptoms and Types Diarrhea with shiny mucus on its surfaceSmall amounts of fresh blood in diarrheaSmall, meager stoolsMay have large volume of watery stoolsStraining to defecateIncreased frequency of defecationVomiting (on occasion)Abdominal discomfort – characterized by standing with lowered front and raised back end, or curling up to cover abdomen, resistant to being touched in abdominal areaAbnormal amount of flatulence (i.e, passing gas)Fever (uncommon)Causes Clostridial enterotoxicosis is caused by an overgrowth of the bacteria Clostridium perfringens in the intestine. Often, the bacteria is acquired from the environment (e.g., flora) or as the result of eating raw, undercooked, or old meat. Other risk factors include: Dietary changesAbnormally high pH level in the intestineDeficiency of antibodiesExposure to other dogs at a hospital or kennelStress to the digestive system due to concurrent disease (e.g., parvovirus, gastroenteritis, and inflammatory bowel disease)Diagnosis You will need to give a thorough history of your dog&#039;s health, onset of symptoms, and possible incidents that might have precipitated/preceded this condition, such as time spent outdoors, rummaging through garbage or getting hold of old or uncooked meat, or being boarded at a kennel. Your veterinarian will conduct a thorough physical exam on your dog as well as standard blood work, including a complete blood count, chemical blood profile, and urinalysis. Most of these tests will return normal. Because this infection has obvious intestinal symptoms, a fecal sample will need to be taken for microscopic analysis. This intestinal disease is sometimes difficult to identify because there is no one good test for it. Often, false positive results will return as the result of interfering substances in the feces. Your veterinarian may also want to use an endoscope to visualize the interior of your dog&#039;s intestines, and possibly take a tissue sample.   Treatment Treatment is generally simple, with outpatient care provided until your dog has recovered from the infection. In some cases, when diarrhea and/or vomiting has been severe and the animal has become dehydrated and low in electrolytes, fluid therapy will need to be administered. Your veterinarian may prescribe a week’s worth of oral antibiotics if the Clostridium perfringens toxin is found. Dogs that are being treated for long-term cases of diarrhea may need to be given antibiotics for a longer period of time. Dietary management is also helpful in the treatment of this condition. High-fiber diets and diets formulated with prebiotic and probiotic ingredients (like lactobacillus) can help to balance and maintain the intestinal flora of the gastrointestinal tract. Living and Management This disease is treated and managed in long-term cases by switching your pet to a high in fiber diet, which reduces Clostridium perfringens and enterotoxin production in the intestinal tract. Your veterinarian might also recommend that you supplement your dog&#039;s high-fiber diet with psyllium, a soluble source of fiber. Prebiotic and probiotic diets might also be recommended by your veterinarian in order to try to maintain the normal balance of good bacteria in your dog&#039;s intestine. Fortunately, dogs with good immune response will generally fight off the infection easily."}]