[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/whq1ui49ts", "@type": "VideoObject", "duration": "PT2M13S", "name": "5572157466001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/add5d98e1182a9dc858723368370fe2145253a52.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/whq1ui49ts", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/fe2cd702474c50a60e4e749dd40078076ad8b7e3.m3u8", "transcript": "Mass cells ourselves that reside in the connective tissue of the body, including the skin, lungs nose and mouth tumors can occur in these tissues and are graded on a scale of one to three based on where they're located, how inflamed they are and how different They are from normal healthy mast cells. Mast cell tumors are generally diagnosed in dogs over eight years old and are more common in boxers Bulldogs hugs and Boston terriers. Symptoms of massive tumors vary and can be dependent on the location and the grade of the tumor General symptoms include tumors on or under the skin that appear to fluctuate in size or grow rapidly and have been present for days up to months.\n\nSymptoms also include tumors that are located on the trunk of the body or the extremities such as a pot. A small percentage of muscle tumors are found on the head and neck of the body as well. These masses may be itchy or inflamed and they can cause vomiting loss of appetite or diarrhea, depending on the stage of the disease stage one of the disease is characterized by a single tumor without metastasis while later stages can be characterized by multiple tumors and a spread of the disease to the organs or blood to diagnose a massive tumor your veterinarian will perform a fine needle aspirin to examine the cells of the tumor and determine the amount of abnormal mast cells in the blood.\n\nIf any a surgical biopsy will also be needed to identify the grade of the tumor, as well as the stage. The disease is in your vet Neary and they also use X-ray and ultrasound images to determine the exact location of the tumor. Surgical removal of the mast cell tumor and surrounding tissue is generally the recommended treatment. If the lymph nodes have been impacted follow up chemotherapy after surgery may be required to prevent further disease spread.\n\nIf the tumor cannot be operated on or if the tumor cells spread to other parts of the body. Chemotherapy and radiation therapy may be recommended to reduce the size of the tumor. Your vet Noreen will recommend evaluation of any new masses and require regular checkups to make sure the tumors have not spread and to monitor your dog's blood count, especially if your dog is receiving chemotherapy.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/cancer/c_dg_mast_cell_tumor?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is the survival rate for dogs with mast cell tumors?", "acceptedAnswer": {"@type": "Answer", "text": "Survival rate depends on the grade of the mast cell tumor. There are multiple grading systems, but they can be broken into less aggressive tumors call “low grade” and more aggressive tumors called “high grade.”   For low-grade mast cell tumors, surgical removal may be curative. There is a small chance of recurrence, but most dogs will live out their natural lives after removal. For high-grade mast cell tumors the survival time with surgery alone is only about 4 months.   If additional treatment such as radiation therapy or chemotherapy is performed, the average survival time increases to 1 year or more. The survival rate for high-grade tumors can vary significantly due to the treatment option selected and the individual nature of the tumor.  "}}, {"@type": "Question", "name": "Are mast cell tumors in dogs always cancerous?", "acceptedAnswer": {"@type": "Answer", "text": "All mast cell tumors are considered cancerous so any identified mast cell tumor should be surgically removed if possible. This does not mean that all mast cell tumors will metastasize or that all mast cell tumors will require chemotherapy. These factors depend on the grade of tumor at the time of removal."}}, {"@type": "Question", "name": "How serious are mast cell tumors in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Mast cell tumors are quite serious when identified in dogs. If untreated they can cause anaphylactic shock or if they progress into a more aggressive form they can metastasize and ultimately lead to death.  "}}, {"@type": "Question", "name": "How much does it cost to remove a mast cell tumor from a dog?", "acceptedAnswer": {"@type": "Answer", "text": "The price varies significantly based on the location of both the mass and the veterinarian selected to perform the surgery, but a typical range is between $500-$1500 for removal and post-operative care. It is best to contact multiple veterinarians for quotes if cost is a major concern.  "}}, {"@type": "Question", "name": "Does a mast cell tumor cause my dog pain?", "acceptedAnswer": {"@type": "Answer", "text": "Mast cell tumors do not generally cause pain unless the pet is experiencing symptoms from a tumor-induced allergic reaction.  References American College of Veterinary Surgeons. Mast Cell Tumors.  Featured Image: iStock.com/Eudyptula"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mast Cell Tumor (Mastocytoma) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/boxer_dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/boxer_dog.jpg"}, "author": {"@type": "Person", "name": "Monica Tarantino, DVM", "url": "https://www.petmd.com/author/dr-monica-tarantino"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_mast_cell_tumor"}, "datePublished": "December 21, 2021", "dateModified": "August 29, 2022", "description": "Dr. Monica Tarantino explains what mast cell tumors are in dogs, including symptoms, diagnosis and treatment.", "articleBody": "What are Mast Cell Tumors? Mast cell tumors are the most common form of skin cancer found in dogs. Located in connective tissue throughout the body, mast cells are white blood cells that are part of the immune system. They are responsible for the allergic response.   Mast cells become cancerous when they begin dividing abnormally and grow into tumors. Mast cells tumors are easily mistaken for other skin lesions, like warts or benign lumps. They can appear in any shape, firmness, size, or location. In most cases, however, they are firm, solitary, slow-growing masses of the skin. In some cases, mast cell tumors can also cause severe allergic (anaphylactic) reactions in dogs.  Because they are so good at mimicking other skin conditions, it’s usually impossible to identify a mast cell tumor just by looking at it, even for your veterinarian. They are more common on middle-aged dogs, and certain breeds like Boxers and Boston Terriers are more susceptible, so it’s always a good idea to have your vet look at any unusual skin masses that appear on your dog.  Symptoms of Mast Cell Tumors Mast cell tumors may not cause any symptoms at all. To help prevent more serious disease, vets recommend checking your dog every few months to look for any masses on the skin. Make an appointment to see your vet if you find:   A new skin mass  A known mass that has changed in size or color  An unexplained allergic reaction or hive  Some masses may appear small and easily movable in (or just under) the skin with little swelling. More aggressive tumors can appear as larger, hairless sores.  In some cases, however, a mast cell tumor will result in symptoms, including strong allergic reactions triggered by the activated immune system. Also, if a tumor is bumped or agitated, it may go through a process called “degranulation.” This means the tumor releases all its inflammatory material at once. Degranulation can cause symptoms such as swelling and redness in the affected area or a more severe anaphylactic reaction that includes:  Weakness  Nausea  Vomiting  Diarrhea  Swelling of the face and limbs  Collapse and death (rarely)   Causes of Mast Cell Tumors in Dogs The underlying causes of mast cells tumors are not known. Like other types of cancer, it’s likely they are caused by a mix of genetic and environmental factors, but we do not have enough information to recommend any changes to your dog’s environment to prevent mast cells tumors.   Certain breeds, however, are more likely to get mast cell tumors. These include:   Boxers  Pugs  Pit Bull / Bull Terrier  Boston Terrier  Bulldogs  Retriever breeds (such as Golden Retriever)  Rhodesian Ridgeback  Weimaraner  Schnauzer  How Do Vets Diagnose Mast Cell Tumors? Your veterinarian will likely recommend creating a skin chart of all known masses and then taking a tissue sample using a fine needle aspiration (FNA) or performing a biopsy on the more concerning masses. Many veterinarians will be able to initially identify mast cell tumors by a fine needle aspirate.   Fine needle aspiration is a simple procedure and usually does not require sedation. It involves placing a needle in the mass to suction out some tissue. Once a few cells are collected, they can be looked at under a microscope and the initial diagnosis can be made by a specially trained veterinarian pathologist.   At the time of diagnosis, the mast cell tumor will be graded based on how aggressive it is. Low-grade tumors are less aggressive, while high-grade tumors are more aggressive. Tumors that are more aggressive are more likely to spread (metastasize) to other locations outside of the original tumor.   Treating Mast Cell Tumors Once diagnosed, mast cell tumors are usually surgically removed and sent to a pathologist for review to determine if the tumor is low grade (less aggressive cancer) or high grade (more aggressive cancer). This is important because treatment recommendations between low- and high-grade tumors are very different.   Roughly 80% of mast cells are low- to intermediate-grade and unlikely to reoccur after surgery. This means that for a majority of mast cell tumors surgical removal can be curative.   High-grade masses can spread aggressively to the lymph nodes and internal organs. For these cases, your veterinarian may recommend additional testing such as lymph node aspirates and chest x-rays. They may also recommend consulting with an oncologist about chemotherapy or radiation therapy.   In some situations when surgery is not an option, veterinarians can use a needle for radiation therapy, but not dogs are good candidates for non-surgical treatments.  Recovering from Mast Cell Tumors Recovering from surgical removal of a low-grade mast cell tumor usually requires 2 weeks of rest, pain medications, antihistamines like Benadryl, and wearing an e-collar (“cone of shame”). After 2 weeks, your veterinarian will remove the sutures and your dog can resume normal activity.   For several months after surgery, it’s important to watch the area where the mass was removed to see if it comes back, although recurrence is unlikely for most low-grade tumors. Surgery in most cases is curative, and a dog usually will be able to live their natural lifespan.  For high-grade tumors, recovery after surgery will be the same, but your veterinarian will likely suggest pursuing additional treatment such as radiation or chemotherapy to prevent any tumors or cancer cells that have spread from causing more problems.   Survival with radiation or chemotherapy usually ranges from 10 months to 2 years, depending on the tumor and the therapy. Without any treatment, survival averages about 4 months. "}]