[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Difficult Defecation and Blood in Stool in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/difficult-defecation-blood-stool-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/difficult-defecation-blood-stool-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_dyschezia_hematochezia"}, "datePublished": "August 3, 2009", "dateModified": "August 16, 2022", "description": "Dyschezia and Hematochezia are diseases of the digestive and intestinal system; both are visible presentations of an underlying disease that causes inflammation or irritation of the rectum or anus.", "articleBody": "Dyschezia and Hematochezia in Dogs Dyschezia and Hematochezia are diseases of the digestive and intestinal system; both are visible presentations of an underlying disease that causes inflammation or irritation of the rectum or anus. Dyschezia is a condition in which defecation is extremely difficult or painful, and hematochezia is symptomized by bright red blood in the stool. Hematochezia can also be concurrent with diseases of the colon. Symptoms and Types Crying and whimpering during defecationStraining to defecateInability to defecateMucosal, bloody diarrheaHard fecesDiarrheaLumps around the anusDraining pus tracts around the anusThe anus is blocked by mats of hair and/or fecesCauses Rectal/Anal Disease Stricture or spasmAnal sac abscess or inflammationDraining tracts around the anusRectal or anal foreign bodyThe anus is blocked by mats of hair and fecesThe rectum is hanging out of the anusTraumas – bite wounds, etc.CancerRectal polypsMucocutaneous lupus erythematosus (an immune disease)Colonic Disease CancerIdiopathic megacolon (disease of unknown causes, where the colon expands with feces instead of releasing the feces normally)InflammationInflammatory bowel diseaseInfectious parasitic agentsAllergic colitisConstipationExtra-intestinal Disease (outside of the intestinal tract) Fractured pelvis or hind limbDisease of the prostatePerineal hernia (a hernia around the anus)CancerDiagnosis You will need to give a thorough history of your dog&#039;s health and onset of symptoms. Your veterinarian will perform a complete physical exam on your dog, including a blood chemical profile, a complete blood count, an electrolyte panel and a urinalysis. If an underlying disease is causing inflammation or infection of any part of the intestinal tract, the complete blood count should show this. Your doctor may also use x-ray imaging to visually inspect the abdominal space. This diagnostic method can detect many of the disorders that affect the digestive tract, including foreign bodies in the stomach or intestinal tract, or internal fractures. An abdominal ultrasound can deliver even greater visualization than an x-ray, enabling your veterinarian to detect disease of the prostate, or masses in the lower abdomen. Your veterinarian may also employ another useful diagnostic procedure to visually inspect the internal space and to take a tissue sample for laboratory testing. A colonoscope or proctoscope, both of which are very slender instruments that are designed to be guided into and through the body&#039;s internal pathways – in this case the rectum. These instruments have micro cameras attached at the end so that your veterinarian can see the internal space, and that can also be equipped with a tool for taking a tissue samples for biopsy. These tools are especially useful for the diagnosis of inflammatory diseases or cancer.  Treatment Most patients with dyschezia and hematochezia may be treated on an outpatient basis unless the underlying condition is severe enough to require supportive care. For example, dehydration or internal bleeding will need to be brought under control before further treatment can be undertaken. Balloon dilation can be used to relieve strictures of the intestinal canal. This method widens the canal gently and gradually, using a balloon, so that blocked feces can be released. Rectoanal diseases, such as hernias of the perineum (the space between the genital and the anus), or rectoanal polyps may need surgical correction. Your veterinarian may also prescribe antibiotics, anti-inflammatory drugs, and/or laxatives, depending on the underlying cause of the disease. Laxatives can be used to ease defecation if rectoanal disease is present. Living and Management Your veterinarian will schedule follow-up appointments as necessary to continue treatment of your dog&#039;s underlying condition, to evaluate your dog&#039;s progress, and to modify the treatment as it becomes necessary."}]