[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Legg-Calvé-Perthes Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-relaxing-on-the-sofa-picture-id936419842.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-relaxing-on-the-sofa-picture-id936419842.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_dg_legg_calve_perthes_disease"}, "datePublished": "February 5, 2010", "dateModified": "August 16, 2022", "description": "Legg-Calvé-Perthes Disease involves spontaneous degeneration of the head on the femur bone, located in the dog&#039;s hind leg.", "articleBody": "Image via iStock.com/simone tognon Disintegration of Hip Joint in Dogs Legg-Calvé-Perthes Disease involves spontaneous degeneration of the head on the femur bone, located in the dog&#039;s hind leg. This results in disintegration of the hip joint (coxofemoral) and bone and joint inflammation (osteoarthritis). The exact cause of the condition is unknown, though blood supply issues to the femoral head are usually seen in dogs suffering from Legg-Calvé-Perthes Disease. It is commonly seen in miniature, toy, and small-breed dogs, and has a genetic basis in Manchester terriers. Moreover, most dogs affected with Legg-Calvé-Perthes Disease are five to eight months in age. Symptom and Types Lameness (gradual onset over two to three months)Carrying of affected limb(s)Pain when moving hip jointWasting of thigh muscles on affected limb(s)Causes The exact cause for Legg-Calvé-Perthes Disease is unknown, though some researchers suggest it is related to blood supply issues to the head of the femur bone. Diagnosis You will need to give a thorough medical history of your dog’s health, including duration and frequency of symptoms. The veterinarian will then perform a complete physical examination on your dog, particularly the affected limb and hip joint area. Laboratory testing is not usually required to diagnose the disease. Instead, X-rays of the affected area will be taken, which should identify any changes in the femoral bone and joint. In the early stages of the disease, for example, widening of joint space, decreased bone density, and thickening of femoral bone neck are seen. In advanced cases, extreme deformation of femoral head, new bone formation in the affected area, and femoral neck fracture may also be seen.  Treatment There are cases where rest as well as pain killers and cold packing help in treating the dog&#039;s lameness, though surgery -- to excise affected femur bone head and neck -- followed by vigorous exercise is often required. After surgery, your veterinarian will recommend physical therapy to rehabilitate the affected limb(s). Living and Management Regular exercise and physical therapy is important for the rehabilitation of the affected limb(s). Otherwise, it may result in delayed recovery and poor response to treatment. In some dogs, small lead weights are attached as ankle bracelets above hock joint to encourage early weight bearing. Follow-up checkups are generally recommended every two weeks to ensure physiotherapy and exercises are working as desired. Overall recovery may take three to six months, thus patience is required. Dogs that are obese may undergo certain diet restrictions. Those with Manchester terriers suffering from Legg-Calvé-Perthes Disease will be informed of the breed&#039;s genetic association with the disease, and are often recommended against breeding the dog in the future."}]