[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Degeneration of the Cerebellum of the Brain in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/degeneration-cerebellum-brain-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/degeneration-cerebellum-brain-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Brain health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_dg_cerebellar_degeneration_brain_disease_in_dogs"}, "datePublished": "September 21, 2012", "dateModified": "August 16, 2022", "description": "Cerebellar degeneration in dogs is a brain disease. In cerebellar degeneration, the cells within the cerebellum die, causing neurological symptoms in the dog", "articleBody": "Cerebellar Degeneration in Dogs Cerebellar degeneration in dogs is a brain disease. As its name suggests, it affects a specific area of the brain known as the cerebellum. In cerebellar degeneration, the cells within the cerebellum die, causing neurological symptoms in the dog. Symptoms and Types Symptoms of cerebellar degeneration in dogs include: An abnormal gait which often appears as a goose-step involving the front legsA broad-based stanceSwayingMuscle tremors, especially when trying to eat or perform another activityNormal vision with no menace reflexHead tiltLoss of coordination (vestibular ataxia)Normal mental activityAbnormal posturing with head back, front legs rigid and hind legs flexed (decerebellate posture)Progression of symptoms may or may not occurCauses Infection with canine herpesvirus either in utero or as a neonate may cause cerebellar degeneration in dogs. A genetic predisposition for the condition is possible in some dog breeds, including Irish setters, wire-haired fox terriers, Samoyeds, chow chows, rough-coated collies, border collies, bullmastiffs, Labrador retrievers, beagles, Kerry blue terriers, Finnish harriers, Bern running dogs, English pointers, Gordon setters, Brittany spaniels, American Staffordshire terriers and English bulldogs. Diagnosis MRI (magnetic resonance imaging) may reveal a smaller than normal cerebellum. Cerebrospinal fluid analysis may be normal or abnormal depending on the individual cause. Biopsy of the cerebellum is the definitive means of diagnosis. Routine blood and urine testing may be necessary to rule out other disease conditions which may appear similar. Treatment There is no curative treatment, though medications such as amantidine, buspirone, co-enzyme Q10, and acetyl-l-carnitine have shown some promise. Living and Management This type of brain disease in dogs can lead to poor coordination and decision making by the dog. Restrict the dog’s activity to safe areas of the household where it cannot be injured. Avoid stairs, sharp objects, swimming pools, and other dangers that could harm the dog. Because of the loss of coordination, dogs with cerebellar degeneration may require physical aid in eating, though they can continue to eat a normal diet. Nursing care to keep the pet free of urine and feces may also be necessary."}]