[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Excess Iron in the Blood in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_iron_toxicity"}, "datePublished": "April 27, 2010", "dateModified": "August 16, 2022", "description": "While iron is an essential nutrient for the regular functioning of a dog&#039;s body, when it is present in large quantities in the bloodstream, it can become lethal.", "articleBody": "Iron Toxicity in Dogs In the event that there is a high volume of iron present in the blood, damage can occur within the cells. While iron is an essential nutrient for the regular functioning of a dog&#039;s body, when it is present in large quantities in the bloodstream, it can become lethal. Dogs may be ingesting unhealthy amounts of iron when they are being given multivitamins that are not appropriate for their age, size or health status, or when they are ingesting dietary supplements or pregnancy supplements that have been left within their reach but that are not intended for them.  Symptoms and Types Iron toxicity occurs in dogs in four separate stages. Stage I (0–6 hours)     Vomiting    Diarrhea    Depression    Gastrointestinal hemorrhage    Abdominal painStage II (6–24 hours)     Apparent recoveryStage III (12–96 hours)     Vomiting    Diarrhea    Depression    Gastrointestinal hemorrhage    Shock    Tremors    Abdominal painStage IV (2–6 weeks)     Gastrointestinal obstruction from stricture formationCauses The most common cause of iron toxicity is the ingestion of pills within the home environment. A toxic dose is considered to be in excess of 20 mg/kg. Diagnosis Your veterinarian will need a thorough history of your dog&#039;s health, onset of symptoms, and possible incidents that might have precipitated/preceded this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. If there is an abnormally high level of iron in the bloodstream, this will show up on the results of the blood tests. If it is suspected that your dog ingested iron pills, diagnostic imaging may be used to help locate them and to determine whether they can be removed from your dog&#039;s digestive system before they can be fully absorbed into the body.  Treatment Fluids will be given to the dog in high doses to help correct the shock and to correct the acidosis that is occurring in the dog&#039;s blood stream. If possible, the additional unabsorbed iron pills will be removed from your dog&#039;s stomach, either by using antiemetic drugs to induce vomiting, or by performing a gastric lavage. This latter method is done with a saline solution that is slowly pumped into the stomach cavity to wash the contents of the stomach out. The contents are removed in small amounts using another tube. Living and Management It is important to monitor the dog&#039;s blood enzymes and liver enzymes following the treatment. Your veterinarian will schedule a follow-up exam to test your dog&#039;s blood to make sure that the iron levels have been controlled. It is also important for you to observe your dog for any signs of gastrointestinal obstruction following the iron toxicity, as the digestive system may react to the toxicity or the medical procedures that were used to resolve the toxicity."}]