[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Blind Quiet Eye in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_blind_quiet_eye"}, "datePublished": "May 28, 2010", "dateModified": "August 16, 2022", "description": "Blind quiet eye is the loss of vision in one or both eyes without ocular vascular injection or other apparent signs of eye inflammation.", "articleBody": "Blind quiet eye is the loss of vision in one or both eyes without ocular vascular injection or other apparent signs of eye inflammation. This may occur due to abnormalities in retinal image detection, retinal focusing, optic nerve transmission, or simply the central nervous system&#039;s inability to interpret images correctly. Symptoms and Types   Because Blind Quiet Eye directly affects the dog&#039;s vision, it may display several signs, including:     Clumsy behavior (e.g., bumping into objects, tripping, falling)    Decreased or absent menace response (i.e., does not blink when a hand is waved toward the eyes)    Impaired visual placing responses (e.g., extends the paws incorrectly when trying to approach a nearby surface)In addition, these problems may become more exaggerated when the dog is outside at night. Causes There are several causes for Blind Quiet Eye, such as cataracts, central nervous system lesions, and the lens&#039; inability to focus correctly. Other common causes include:     Retinal disorders:            Sudden acquired retinal degeneration syndrome (SARDS)        Shrinking of the retina (progressive retinal atrophy)        Separation of the eye&#039;s inner lining (retinal detachment)        Ivermectin toxicity            Optic nerve issues due to:            Inflammation        Cancer        Trauma        Underdevelopment        Lead Toxicity        Diagnosis You will need to give a thorough history of your dog’s health and the onset and nature of the symptoms to the veterinarian. He or she will then perform a complete physical examination (including an opthalmoscopic exam) as well as a biochemistry profile, urinalysis, complete blood count (CBC) to rule out potential systemic causes of the disease. During the ophthalmic exam a penlight will be used to rule out potential systemic causes of the disease, such as cataracts or retinal detachment. (In cases of retinal detachment, the systemic blood pressure is often elevated.) Ophthalmoscopy, meanwhile, may reveal progressive retinal atrophy or optic nerve disease. If the ophthalmic exam reveals nothing irregular, it may suggest sudden acquired retinal degeneration syndrome (SARDS), retrobulbar optic neuritis (inflammation of the optic nerve after it exits the eye toward the brain), or a central nervous system (CNS) lesion. If the diagnosis is still in doubt, electroretinography -- whic measures the electrical responses of photoreceptor cells in the retina -- makes it possible to differentiate retinal from optic nerve or CNS disease. Ocular ultrasounds and CT (computed tomography) and MRI (magnetic resonance imaging) scans are also very helpful to visualize and diagnose orbital or CNS lesions.     Treatment Your veterinarian will try to localize the disease and will often refer you to a veterinary ophthalmologist. Unfortunately, there is no effective treatment for Blind Quiet Eye brought on by SARDS, progressive retinal atrophy, optic nerve atrophy, or optic nerve hypoplasia. However, cataracts, luxated lenses, and some forms of retinal detachment may be treated surgically. In addition, dogs with retinal detachment should have their exercise severely restricted until the retina is firmly reattached. These patients should also be switched to a calorie-restricted diet to prevent obesity, which could occur due to reduced activity. Living and Management With assistance, blind pets can lead relatively normal and functional lives. However, dogs with progressive retinal atrophy or genetic cataracts should not be bred. Your veterinarian will recommend you with some basic safety concepts, such as examining for potential hazards in your home. He or she will also schedule regular follow-up exams to ensure that any ocular inflammation is controlled and to ensure, if possible, that your pet’s vision is maintained."}]