[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Abnormal Heart Rhythm in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/abnormal-heart-rhythm-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/abnormal-heart-rhythm-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_abnormal_heart_rhythm"}, "datePublished": "February 12, 2010", "dateModified": "August 16, 2022", "description": "Search Abnormal Hearth Rhythm in dogs. Search Abnormal Heart Rhythm treatments, symptoms, and diagnosis at PetMd.com.", "articleBody": "Sinus Bradycardia in Dogs   Sinus bradycardia (SB) is indicated by a slower-than-normal rate of impulses in the sinus node. Also called the sinoatrial node (SAN), the sinus node initiates the electrical impulses within the heart, triggering the heart to beat or contract. In most instances, slow sinus electrical impulses is benign and may even be beneficial; however, it can also cause loss of consciousness if it is brought about by an underlying disease that disrupts the cardiac autonomic nerves, which act as the heart&#039;s control system. SB is fairly common in dogs, especially in cocker spaniels, dachshunds, pugs, West Highland white terriers, and female miniature schnauzers. In addition, this condition is more common in young dogs than old, with the incidence decreasing with age, unless it is being caused by an underlying disease.   Symptoms and Types Your dog may display no symptoms if it very active or engaging in athletic training. Typically, the sinus bradycardia (heartbeat slower than 60 beats per minute, although depends on the animal&#039;s environment and size) is most apparent when your dog is at rest. Some other common symptoms associated with sinus bradycardia include:   LethargySeizuresExercise intoleranceLoss of consciousnessEpisodic muscle incoordination (ataxia)Excessively slow breathing (hypoventilation), especially under anesthesia  Causes   Athletic conditioning (this is not uncommon in athletic dogs)HypothermiaIntubationOversedationSleepUnderlying disease(s); e.g., respiratory, neurologic, and gastronintestinal diseasesDiagnosis   Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms, your dog&#039;s overall condition, and possible incidents that might have led to this condition.    A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis -- the results of which may indicate the presence of substances that might be causing a slowed heart rate. These tests will also reveal deficiencies in the blood if that is the underlying cause. They also may offer clues to possible kidney failure. Your doctor can also use X-rays and ultrasound to visually examine your dog&#039;s internal organs for abnormalities in the heart, kidney and other organs. An electrocardiogram (EKG) recording can be used to examine the electrical currents in the heart muscles, and may reveal any abnormalities in cardiac electrical conduction, which underlies the heart’s ability to contract and beat. An initial 24-hour heart monitoring may be indicated to conclude a diagnosis.     Treatment   Treatment will be determined by any underlying disease that is found. Many dogs exhibit no clinical signs and require no treatment. In dogs without structural heart disease, heart rates as low as 40 to 50 bpm (beats per minute) are still generally able to provide normal cardiac output at rest. Therapeutic approaches vary markedly; they depend on what’s causing the SB, the ventricular rate, and the severity of clinical signs.   If your dog is in critical condition, it may be treated as an inpatient, where intravenous fluid therapy can be administered and the dog&#039;s health stabilized. Restrictions on activity will not be recommended unless your dog has symptomatic SB that is related to structural heart disease; then exercise restriction will be recommended until medical and/or surgical intervention can stabilize the problem. Living and Management   Your physician will order further monitoring depending on the final diagnosis. Signs, if present, should resolve with correction of the causative underlying condition. However, the overall long term prognosis varies with the nature of the structural heart disease, if there is one present. For example, treatment of symptomatic SB with a permanent pacemaker generally offers a good prognosis for rhythm control."}]