[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bleeding of the Retina in the Eye in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/bleeding-retina-eye-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/bleeding-retina-eye-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_retinal_hemorrhage"}, "datePublished": "September 3, 2009", "dateModified": "August 16, 2022", "description": "Retinal hemorrhage is a condition in which the innermost lining of the eye has a local or generalized area of bleeding into the innermost lining of the eye.", "articleBody": "Retinal Hemorrhage in Dogs The retina is the innermost lining of the eye, laying just beneath the middle choroid coat, which in turn lies between the retina and the sclera – the white lining of the outer eye. The choroid coat contains connective tissue and blood vessels, which deliver nutrients and oxygen to the outer layers of the retina. In some cases the retina may separate from this layer. This is termed retinal detachment. Retinal hemorrhage is a condition in which the innermost lining of the eye has a local or generalized area of bleeding into that lining. The causes of retinal hemorrhage are usually genetic and breed specific. Symptoms and Types Vision loss / blindness, demonstrated by bumping into objectsBleeding in other body parts – small bruises throughout the bodyBlood in urine, fecesWhitish-appearing pupilPupil may not contract when bright light is shone in the eyesSometimes, no signs may be observedCauses Genetic (present at birth): Faulty development of the retina or the lubricating fluids of the eyes (vitreous humor)Some breeds are more at risk than others: Shetland Sheep Dogs, Collies, Labrador Retrievers, Australian Shepherds, Sealyham Terriers, Bedlington Terriers, English Springer Spaniels and Miniature SchnauzersAcquired (condition that develops sometime later in life/after birth): Trauma/injuryGeneralized (systemic) high blood pressure (hypertension)Kidney disease, heart diseaseIncreased levels of thyroid hormonesIncreased levels of some steroidsExposure to some chemicals such as paracetemolSome fungal and bacterial infectionsSome forms of cancerBlood disorders – blood-clotting disorders, anemia, hyperviscosity of blood, etc.DiabetesInflammation off blood vesselsDiagnosis Your veterinarian will perform a complete physical exam on your dog. You will need to give your veterinarian a thorough history of your dog&#039;s health, onset of symptoms, and possible incidents that might have led to this condition. Standard laboratory tests include a blood chemical profile, a complete blood count, an electrolyte panel, a blood pressure test and a urinalysis, so as to rule out other causes of disease. The physical exam will entail a full ophthalmic exam using a slit lamp microscope. During this exam, the retina at the back of the eye will be closely observed for abnormalities. The electrical activity of the retina will also be measured. An ultrasound of the eye may also be done if the retina cannot be visualized due to hemorrhaging. Samples of vitreous humor (eye fluid) may be taken for laboratory analysis. Genetic testing may also be done if your dog belongs to a breed that is prone to familial retinal disease.  Treatment Patients with retinal hemorrhage are usually hospitalized and given close care by a veterinary ophthalmologist. Your veterinarian will prescribe medications depending on the underlying cause of disease. Surgery can sometimes be performed to reattach the retina to the choroid coat. Living and Management Your veterinarian will schedule frequent follow-up appointments for your dog to chart the deterioration or progress (post-surgically) of the retina and the underlying disease that caused it to detach. Repeat bloodwork and ophthalmic exams will be performed during these visits. If your dog does become blind as a result of the retinal detachment, remember that once the underlying cause of disease has been controlled, the eye will no longer be painful to your dog. Although the blindness may not be reversed, your dog can still lead a happy and fulfilling life indoors as it learns to compensate with its other senses and memorizes the layout of the home. As your dog will be more vulnerable without its sight, you will need to take extra care to protect your dog from harmful situations, such as with other pets and active children. Never allow your blind dog outside on its own, and keep a watchful eye on the dog at all times while outside."}]