[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Kidney Stones (Struvite) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Urinary", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/urinary/c_dg_urolithiasis_struvite"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Urolithiasis is the medical term referring to the presence of stones in the kidneys, bladder or anywhere in the urinary tract. Struvite -- the primary composition of these stones -- is a material that is comprised of magnesium, ammonium and phosphate.", "articleBody": "Urolithiasis, Struvite Urolithiasis, Struvite in Dogs Urolithiasis is the medical term referring to the presence of stones in the kidneys, bladder or anywhere in the urinary tract. Struvite -- the primary composition of these stones -- is a material that is comprised of magnesium, ammonium and phosphate. The stones are more common in female dogs than in male dogs, and typically in animals that are mid-range in years (six to seven years of age). Struvite stones account for more than one-third of all stones found in the urinary tracts of dogs. Symptoms and Types  While some dogs may not display any symptoms, others have urinary problems such as: Abnormal urine streamDifficulty urinating (dysuria)Frequent urinationBlood in the urine (hematuria)Cloudy urineIncreased thirstMoreover, increased thirst (polydipsia) is usually associated with stones present in the kidneys. If there is a substantial amount of inflammation, the bladder could be enlarged. Sometimes, you&#039;ll be able to feel the actual stones through the skin with your hand. Causes There are several known risk factors including high levels of steroids, an abnormal retention of urine, and extremely non-acidic (alkaline) urine. These type of stones are also more common after urinary tract infections or disorders. Some breeds of dogs are more prone to stuvite stones, including: Miniature SchnauzersShih Tzus, Bichon FrisesMiniature PoodlesCocker Spaniels and Lhasa ApsosDiagnosis X-rays and ultrasounds are usually used to determine the size, shape and location of the stones, and to properly assess treatment options.  Treatment Dietary management, in association with antibiotic treatment, has been effective at dissolving struvite stones. If dietary management is used, follow it explicitly and eliminate other foods and treats until the animal has fully recovered. The process of dissolving stones usually takes between two weeks and up to seven months. If the stones do not begin to dissolve after a few weeks, surgery may be necessary. Living and Management X-rays and ultrasounds are used to assess the progress of the stone dissolution. A dietary regimen can also be prescribed. Prevention In some cases, restricting the diets of the animal -- in terms of magnesium -- has proven effective for stone prevention."}]