[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Separation Anxiety in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Behavioral", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/pug-mix-dog-scared-laying-on-the-floor.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/pug-mix-dog-scared-laying-on-the-floor.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/behavioral/c_dg_separation_anxiety"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Separation anxiety in dogs usually are destructive or otherwise inappropriate when an owner leaves the pet or is not in close proximity. Behaviors that may be seen include vocalization, destroying objects, digging or even depression.", "articleBody": "Reviewed and updated for accuracy on August 9, 2019 by Katie Grzyb, DVM Separation anxiety in dogs is a stress response that happens when a dog is bonded to person, and that person is away from home or not in close proximity to the pet. Dogs suffering from separation anxiety can exhibit a range of reactions to being left alone, from pacing and drooling to destructive behaviors. However, these reactions may also be caused by other conditions or environmental cues. Therefore, it is important for you to make an appointment with your vet to rule out health issues first. Then you will need to have a behaviorist or veterinarian review your dog&#039;s history before attributing separation anxiety as the primary or sole cause of the behavior. Symptoms of Separation Anxiety in Dogs Typically, behaviors related to separation anxiety occur during the first hour after you’ve left the house, but some dogs begin exhibiting stress behaviors as soon as you prepare to leave. Dog separation anxiety symptoms can include: Panting Drooling Shaking Barking Attempting to follow the owner Defecating or urinating in the house Some dogs will stop eating, act depressed, hide or whine, and in extreme cases, might injure themselves as they attempt to escape confinement. Diagnosing Separation Anxiety in Dogs Other behavioral conditions may mimic some of the symptoms of separation anxiety, so it is important to record the timing, frequency and intensity of the reactions. For example, a dog that eliminates in the home both when the owner is present as well as when the owner is away might not be fully house-trained. A visit to the veterinarian can also help to rule out any undiagnosed medical issues that resemble behaviors attributed to separation anxiety, like drooling and shaking. When you go to the veterinarian, bring your log of when the behaviors occur, as well as how often and how intense they are. This will give your vet valuable background info surrounding the problem. Treating Separation Anxiety in Dogs The goal in treating separation anxiety is to help your dog feel less reliant on you and to encourage her to relax when you are not home. Mild Separation Anxiety Dogs exhibiting mild separation distress might benefit from the following interventions: Exercise: Increasing your dog’s daily workout might help her to relax when alone. Taking longer walks to new places, playing together or working on training will help mentally exhaust your dog prior to your departure from the home.Interactive toys: Encouraging your dog to focus on a treat-stuffed toy when you aren’t present might help to calm a dog with basic separation intolerance.Severe Separation Anxiety Dogs with severe separation anxiety will likely need behavior modification to permanently change their perception of alone time. Addressing intense separation anxiety requires a gradual and systematic approach. This in-depth training process requires building your dog’s confidence a few seconds at a time to prevent stress reactions, and it must progress at your dog’s pace. It might include leaving your pet for a few minutes at a time and then increasing the duration slowly over time. You can start by going to the next room and then progress to going just outside the home, using tasty training treats and praise as positive reinforcement when your pet stays calm. Being consistent when addressing separation anxiety behaviors is critical. You will need to enlist the help of a trainer specializing in separation anxiety treatment or a veterinarian behaviorist to provide support. Antidepressants or anxiety medications can be given to dogs with separation anxiety, but for the best results, these drugs must be used in conjunction with a training plan to help your dog learn to cope with being left alone. Holistic supplements can also be helpful when used in conjunction with behavioral training, with or without prescribed medications. Treatment is a gradual process, and owners should be prepared to manage their dog’s daily life and environment as they work through separation anxiety training protocols. That might include rearranging schedules so that someone is always home with the dog, or if that’s not possible, finding a reputable day care or hiring an in-home pet sitter. Featured Image: iStock.com/GeorgePeters"}]