[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ear Hematomas in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Ears", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog-running.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog-running.jpg"}, "author": {"@type": "Person", "name": "Christina Fernandez, DVM, DACVECC", "url": "https://www.petmd.com/author/dr-christina-fernandez"}, "keywords": "Dog, Condition, Symptom Checker, Ear Hematoma", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/ears/c_dg_dog_ear_hematoma"}, "datePublished": "December 2, 2021", "dateModified": "September 12, 2023", "description": "Dr. Christina Fernandez explains ear hematomas in dogs, including signs to look for, causes, treatment, and surgery recovery.", "articleBody": "What Are Ear Hematomas in Dogs? Ear hematomas in dogs, also known as auricular hematomas or aural hematomas, occur when blood vessels rupture in the earflap, or pinna. As the blood accumulates, your dog’s ear will swell, forming an aural hematoma.  Symptoms of Ear Hematomas in Dogs If your dog has an ear hematoma, an ear infection is often its cause. One sign of an ear infection in dogs is excessive headshaking, caused by irritation in the ear. If your dog’s ear is infected, their earflap will swell and become red and warm to the touch. The swelling may involve the entire earflap, or it may cover only part of it. You may also notice a foul odor or discharge coming from your dog’s ear. In most cases, only one ear will be affected; however, both ears can have hematomas. Causes of Ear Hematomas in Dogs The most common cause of an ear hematoma in dogs is an ear infection or other irritation within the ear. Dog ear infections cause irritation that results in headshaking, which in turn, causes the ear hematoma. Other causes for headshaking, such as ear mites, having something stuck in their ear, and underlying issues such as allergies, can lead to an ear hematoma. Less commonly, allergic skin disease in dogs, immune disorders, trauma, or blood clotting deficits can cause ear hematomas in dogs. How Veterinarians Diagnose Ear Hematomas in Dogs Ear hematomas are diagnosed by physical examination. The veterinarian will recognize the characteristic signs: the earflap is warm and swollen, and often red and inflamed-looking on the inside. Most often, hematomas are noticed with an ear infection or other reasons for constant headshaking. Addressing the primary cause for your dog’s headshaking is also necessary. The vet will examine your dog’s ear with an otoscope and will often recommend taking a sample or ear swab for cytology. This means looking at the swab under a microscope to identify the presence of bacteria and/or yeast. Treatment of Ear Hematomas in Dogs Several different dog ear hematoma treatments exist to reduce the swelling. In some cases, when medical management is attempted, medications such as steroids, antibiotics, and/or pain relievers may be used. These may also be used in combination with surgical treatment, such as ear drainage or an incision. Underlying conditions such as ear mites or ear infections will also need to be treated. Surgical drainage of the ear hematoma may be recommended if the swelling is large enough to cause pain, discomfort, or blockage of the ear canal. Your vet might also suggest surgical drainage if they are concerned that scarring may lead to permanent deformity of the ear canal. In this procedure, the hematoma would be pierced and drained under anesthesia, but it is likely to recur and may need to be drained multiple times. In most cases, a drain is placed in your dog’s ear to keep additional fluid from building up within the earflap. Alternatively, a surgical incision with strategically placed sutures may be placed through the earflap to discourage the accumulation of fluid and encourage drainage. Curing an ear hematoma also means dealing with the initial disease that caused your dog to shake their head in the first place, whether it’s an ear infection, mites, or something else. Recovery and Prevention of Ear Hematomas in Dogs Dog Ear Hematoma Surgery Recovery After ear hematoma surgery, the veterinarian may place bandages over your dog’s ear and head and will recommend an Elizabethan collar. At home, you may be asked to administer medications by mouth or in the ear via a hole in the bandage. You will also need to monitor the bandage. A follow-up appointment will be needed so your vet can assess healing. The E-collar must be worn to prevent your dog from scratching at the wound, which could result in trauma to the area and removal of the bandage and/or stitches. In some cases, despite prompt and appropriate medical care, scarring can result in slight deformity of the earflap. Prevention of Dog Ear Hematomas Preventing ear infections and ear mites will also help prevent the formation of hematomas in your dog. When ear infections or mites do occur, they should be treated promptly to avoid the formation of a hematoma. If you see these common signs, take your dog to the vet so they can be properly diagnosed and treated for an ear infection or ear mites before a hematoma develops: Frequent head shaking Excessive ear scratching Pain, redness, or odor Crust in the ear or discharge Featured Image: iStock.com/Capuski"}]