[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live after being diagnosed with pancreatic adenocarcinoma?", "acceptedAnswer": {"@type": "Answer", "text": "The average survival time for dogs diagnosed with pancreatic adenocarcinoma is typically days, because of progressing clinical decline, presence of metastasis, or the diagnosis itself."}}, {"@type": "Question", "name": "How aggressive is pancreatic adenocarcinoma in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Pancreatic adenocarcinoma is a very aggressive cancer with a high metastatic rate, meaning it spreads easily from the pancreas rapidly through the rest of the body."}}, {"@type": "Question", "name": "Is pancreatic adenocarcinoma curable in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Currently, pancreatic adenocarcinoma in dogs has a very low possibility of being cured surgically."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pancreatic Cancer in Dogs (Pancreatic Adenocarcinoma)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/dog.on_.porch_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/dog.on_.porch_.jpg"}, "author": {"@type": "Person", "name": "Heather Newett, MPH, DVM", "url": "https://www.petmd.com/author/dr-heather-newett"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_adenocarcinoma_pancreas"}, "datePublished": "February 22, 2022", "dateModified": "August 12, 2022", "description": "Dr. Heather Newett describes pancreatic adenocarcinoma in dogs, including symptoms, diagnosis, and treatment.", "articleBody": "What Is Pancreatic Adenocarcinoma in Dogs? The pancreas is located on the right side of a dog’s abdomen close to the end of the stomach and the beginning of the small intestine. The pancreas is responsible for producing hormones as well as digestive enzymes that help to break down food during the digestion process.  The second most common type of pancreatic cancer in dogs, after insulinomas, is pancreatic adenocarcinoma. An adenocarcinoma is a type of cancer that originates in the glands that produce digestive enzymes. Pancreatic cancer in dogs is typically an aggressive form of cancer that progresses rapidly and easily spreads to other organs, including:   Liver  Lymph Nodes   Spleen   Intra-Abdominal Fat  Bone  Kidneys    Brain  Symptoms of Pancreatic Adenocarcinoma in Dogs Symptoms of pancreatic adenocarcinoma are generally vague and are most commonly associated with gastrointestinal upset and decreases in overall energy and appetite.   Tumors of the pancreas may grow large enough, or in the appropriate region, to obstruct the common bile duct of the liver. The common bile duct carries bile from the liver and gall bladder by way of the pancreas to the intestines. Interference of this anatomy can lead to a gall bladder obstruction and signs of liver disease.  Metastatic pancreatic adenocarcinoma will also cause symptoms that are associated with the body systems that it spreads to.  Other symptoms may include:  Gastrointestinal signs such as vomiting, diarrhea, abdominal pain, or development of an abdominal mass  Increased thirst and urination  Difficulty breathing  Jaundice (yellowing of the skin)  Bone pain  Hair loss  Changes in mentation  Causes of Pancreatic Adenocarcinoma in Dogs The general cause for this type of cancer is unknown. Labrador Retrievers, Airedale Terriers, Boxers, and Spaniel breeds typically have a genetic predisposition to pancreatic cancer. This disease is also found to occur more commonly in female dogs than male dogs. How Veterinarians Diagnose Pancreatic Adenocarcinoma in Dogs Veterinarians can use multiple diagnostic methods to diagnose pancreatic adenocarcinoma.   Blood work may show abnormalities in liver or kidney values, signs of anemia, dehydration, and elevated white blood cells. Imaging techniques including radiography, ultrasonography, or CT scanning can be used to visualize a pancreatic mass (tumor).  If a tumor is detected, it can be tested for cancer using cytology (analysis of cells collected with a needle) or histopathology (a tissue biopsy).  Treatment for Pancreatic Adenocarcinoma in Dogs Surgery is typically not recommended for pancreatic adenocarcinoma because, by the time of diagnosis, there is a very high probability of metastasis. Chemotherapy has also been unsuccessful in treating pancreatic adenocarcinoma. Recovery and Management of Pancreatic Adenocarcinoma in Dogs The prognosis for pancreatic adenocarcinomas is typically poor. Supportive care is recommended until the dog’s quality of life is adversely impacted. At that point, humane euthanasia may be recommended. Your vet will be able to determine a medical management plan that works best for your dog depending on their diagnosis."}]