[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does Rocky Mountain Spotted Fever look like in a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Unlike humans, who get a classic rash, dogs can have symptoms of fever, lethargy, anorexia, joint swelling/pain, and enlarged lymph nodes."}}, {"@type": "Question", "name": "Is Rocky Mountain Spotted Fever in dogs curable?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. With early antibiotic therapy, RMSF can be cured, and dogs will often have immunity after successful treatment."}}, {"@type": "Question", "name": "How long does Rocky Mountain Spotted Fever last in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs will begin to improve within 24 to 48 hours after starting antibiotic therapy. Severe cases may need to be hospitalized for supportive care including IV fluids, appetite stimulants, and pain medications in addition to the antibiotics."}}, {"@type": "Question", "name": "Is Rocky Mountain Spotted Fever fatal to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "RMSF can be fatal, if left untreated. However, prognosis is generally good with early antibiotic therapy.  "}}, {"@type": "Question", "name": "How common is Rocky Mountain Spotted Fever?", "acceptedAnswer": {"@type": "Answer", "text": "While RMSF is the most common rickettsial disease in dogs and humans in the United States, it is still considered relatively rare.   Featured Image: iStock.com/Nigel_Wallace"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rocky Mountain Spotted Fever in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/springer.spaniel.puppy__0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/springer.spaniel.puppy__0.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Parasite, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_rocky_mountain_spotted_fever"}, "datePublished": "May 9, 2022", "dateModified": "August 12, 2022", "description": "Dr. Veronica Higgs discusses Rocky Mountain Spotted Fever in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Rocky Mountain Spotted Fever in Dogs?  Rocky Mountain Spotted Fever (RMSF) is a tick-borne (spread by ticks and tick bites) disease caused by an infectious bacteria called Rickettsia rickettsii. Rickettsia is a specialized type of bacteria that can only live inside other cells. Once the bacterium enters the bloodstream, it quickly enters and infects the cells lining the blood vessels (endothelial cells), causing inflammation (swelling) of those vessels and the organs they supply. RMSF can affect many species, but it most commonly affects dogs and humans.   RMSF was first discovered in 1896 in Snake River Valley, Idaho. It reportedly got its name from the trademark rash in humans, which consists of small red spots and blotches that begin on the wrists and ankles and spread up the arms and legs. It is sometimes referred to in humans as “black measles” because in the late stages of the disease, the skin turns black around the rash.   Geographically, RMSF has been reported in North, South, and Central America. Within the United States, RMSF has been diagnosed in every state except Vermont and Alaska, but it is most common in North Carolina, Tennessee, Oklahoma, Arkansas, and Missouri. RMSF is the most common rickettsial disease in dogs in the United States. Correlating with tick season, RMSF is most often diagnosed from April to October.  Symptoms of Rocky Mountain Spotted Fever in Dogs  Clinical signs for RMSF are typically vague and non-specific and usually appear 2 to 14 days after the tick bite occurs. Some common symptoms include: Fever (up to 105 F)  Lethargy  Anorexia/weight loss Painful muscles or joints/swollen joints/lameness Enlarged lymph nodes Peripheral edema (swollen legs)  Red spots (petechiae) or bruising (ecchymosis) on the skin or mucous membranes Coughing  Vomiting/diarrhea  Causes of Rocky Mountain Spotted Fever in Dogs  RMSF is often spread through tick bites, most commonly the Rocky Mountain wood tick (Dermacentor andersoni), the American dog tick (Dermacentor variabilis), and the brown dog tick (Rhipicephalus sanguineus).    Dogs cannot transmit RMSF to each other or to humans. However, transmission can occur through a tick bite (typically requiring 5 to 20 hours of attachment), ingestion of (eating) an infected tick, or direct contamination of a wound by tick feces. Prompt removal of ticks is very important to prevent RMSF, and humans should wear gloves—not only sanitation—but also for protection if they have a cut on the hand. Failure to wear gloves can result in becoming infected by tick feces or blood/fluids during the removal process. How Veterinarians Diagnose Rocky Mountain Spotted Fever in Dogs  Your veterinarian will want to conduct a physical exam on your dog to determine if there is a fever, joint swelling, or enlarged lymph nodes. If you’ve recently traveled or had any recent tick exposure, it’s important to disclose that information. A complete blood count, serum blood chemistry, and urinalysis will all likely be recommended for a baseline evaluation.   If your vet is suspicious of RMSF, or other tick-borne illness, he or she may recommend specialized laboratory testing. This many include antibody titers, which tests for an immune response (antibodies) to the presence of the bacteria Rickettsia rickettsii. Another option is polymerase chain reaction (PCR) testing for the presence of the bacteria Rickettsia rickettsii, which may be performed as a part of a tick PCR panel for multiple tick-borne diseases. Treatment of Rocky Mountain Spotted Fever in Dogs  Early antibiotic treatment is crucial for successful RMSF management. Your veterinarian will likely start antibiotics immediately before confirmatory tests are available, as any delay in treatment can worsen the disease and prognosis. Depending on disease severity, your dog may need to be hospitalized for IV fluids to correct dehydration as well as to initiate supportive care such as appetite stimulants or pain medications. Antibiotics kill the bacteria that causes RMSF. The vet will determine the best antibiotic for your pet, but Doxycycline is frequently used.    Recovery and Management of Rocky Mountain Spotted Fever in Dogs  RMSF can be deadly in dogs if treatment is delayed, with an estimated 1-10% of infected dogs having a fatal infection. However, most dogs will recover and do well with early antibiotic therapy and supportive care. Some dogs may be managed on an outpatient basis, but many will require hospitalization that typically includes two to three days of IV fluids, supportive care, and antibiotics. They can usually be discharged once their fever breaks and they are consistently eating and drinking on their own. RMSF cannot be spread from dog to dog, but if multiple pets were exposed to the same area of ticks, please consult with your veterinarian about testing and/or treating all dogs in your household. Additionally, while RMSF is not zoonotic, meaning you cannot get it from your dog, humans can get RMSF from a tick bite or from tick feces/bodily fluids when removing a tick. If you think you have been exposed to RMSF, please seek medical attention immediately.   Prevention of Rocky Mountain Spotted Fever in Dogs Since the primary route of infection is from ticks, monthly flea and tick prevention is highly recommended. There are topical and oral flea/tick prevention options available, so discuss the best option for your pet with your veterinarian. It is also ideal to keep your pets out of thick brush or wooded areas where ticks commonly live. There is no vaccine for RMSF, so protection against ticks is the best prevention.   Remember to inspect your dog for ticks after any outdoor time—especially April through October— when ticks are more prevalent. Early removal of ticks helps decrease the likelihood of transmitting the disease. Wear latex gloves when removing ticks and be sure to get the entire head/mouthparts. You can use tick removal tools to aid in this process or ask your veterinarian or a technician for help to remove ticks."}]