[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can ehrlichiosis in dogs be cured?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. With prompt, appropriate antibiotic therapy, ehrlichiosis can be cured. However, antibodies may remain present in the blood for years after successful treatment."}}, {"@type": "Question", "name": "Can I get ehrlichiosis from my dog?", "acceptedAnswer": {"@type": "Answer", "text": "No. Transmission from dogs to humans has never been reported. However, people can get ehrlichiosis from ticks, and since dogs and people are often exposed to the same tick population, it is possible for people and dogs in the same household to test positive for ehrlichiosis. Featured Image: iStock.com/Anna-av"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ehrlichiosis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/australian.shepherd.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/australian.shepherd.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Parasite, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_ehrlichiosis"}, "datePublished": "May 9, 2022", "dateModified": "August 12, 2022", "description": "Dr. Veronica Higgs discusses ehrlichiosis in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Ehrlichiosis in Dogs?  Ehrlichiosis is a tick-borne (transmitted by tick bites) disease caused by infectious bacteria from the Ehrlichia genus. There are many species of Ehrlichia, but the two most common species responsible for ehrlichiosis in dogs in the United States are E. canis and E. ewingii. While all are transmitted by tick bites, the specific tick may vary depending on the specific species of Ehrlichia. Similarly, the Ehrlichia bacteria infect and live in white blood cells but the specific type of white blood cell will vary. E. canis was first identified during the Vietnam war and is sometimes called tracker dog disease or tropical canine pancytopenia. German Shepherds, Doberman Pinschers, Belgium Malinois, and Siberian Huskies appear to get a more severe form of this disease compared to other dogs. Often, when veterinarians refer to ehrlichiosis they are referring to an E. canis infection (scientifically called Canine Monocytic Ehrlichiosis). Once E. canis enters the host, it lives within white blood cells called monocytes.  E. ewingii is the most common form of ehrlichiosis in North America, and once it enters the host, it lives in a different white blood cell called the granulocyte. Less attention is paid to E. ewingii infection (scientifically called canine granulocytic ehrlichiosis) because it is generally not as serious as E. canis infections. Most dogs with E. ewingii are only mildly ill or may show no signs of illness.  Geographically, ehrlichiosis is most frequently reported in the southeastern and south-central United States with the highest prevalence in Arkansas, Louisiana, Oklahoma, Tennessee, and Texas.  Symptoms of Ehrlichiosis in Dogs  The clinical signs of E. canis can be divided into three phases: acute, subclinical, and chronic. The acute phase (early disease) occurs one to three weeks after the tick bite occurs. During this time, the E. canis bacteria is reproducing and attaching to white blood cells. The clinical signs typically seen in the acute phase are: Fever  Lethargy/depression  Anorexia/weight loss Enlarged lymph nodes  Lameness Vomiting/diarrhea Cough  Abnormal bruising and bleeding Neurologic signs, such as loss of balance or stumbling If treated in the acute phase, most dogs will clear the infection completely and return to normal. Dogs that do not receive treatment will likely progress to the subclinical phase in weeks one to four. In the subclinical phase, dogs will still be infected but show no signs of disease. The bacteria hide in the spleen where it can remain for months or years. The dog will have no clinical signs but may have some changes on bloodwork (a slightly low platelet count and possibly elevated blood protein called the globulin). Not all dogs will progress from the subclinical to the chronic phase as some dogs may clear the disease on their own. In the chronic phase (long-term disease), the dogs were unable to eliminate the bacteria and will become sick again. Chronic phase clinical signs include: Abnormal bleeding: Up to 60 percent of chronic phase dogs will have this symptom due to decreased platelet numbers which can lead to anemia. Inflammation in the eyes (uveitis), bleeding in the eye (hyphema), or blindness Neurologic signs, such as loss of balance or stumbling Increased urinating (polyuria) and increased drinking (polydipsia) from damage to kidneys Lameness/swollen limbs Dogs in the chronic phase have a worse prognosis, and this phase can become fatal. Clinical signs of E. ewingii are milder than E. canis and can include fever and swollen joints. Some dogs with E. ewingii do not show any clinical signs at all. Causes of Ehrlichiosis in Dogs E. canis is transmitted by the brown dog tick (Rhipicephalus sanguineus). E. ewingii is transmitted by the Lone Star tick (Amblyomma americanum). Disease transmission can occur in as little as three to six hours after the tick attaches, therefore prompt tick removal is crucial. Humans cannot get E. canis but they are susceptible to other types of ehrlichiosis, including E. ewingii. However, ehrlichiosis is not zoonotic, meaning humans cannot get the disease directly from dogs. They can, however, get the disease from tick bites. If you think you have been exposed to ehrlichiosis, please seek medical attention immediately.   How Veterinarians Diagnose Ehrlichiosis in Dogs Obtaining a detailed history of travel and recent tick exposure can be useful when evaluating for ehrlichiosis. Your veterinarian will also start with a thorough physical examination to assess for fever, joint swelling/pain, and enlarged lymph nodes. A complete blood count, serum blood chemistry, and urinalysis will all likely be recommended for a baseline evaluation. Your veterinarian will ask about any recent travel history where tick exposure may have occurred and will want to do a full examination of your dog. They may order various blood tests, including a urinalysis, and serum blood chemistry, to ensure they have a baseline for diagnosis. If you vet believes ehrlichiosis is the issue they may recommend additional specialized laboratory testing. Most veterinarians use a Snap 4Dx test to annually check your dog for heartworms. In addition to heartworms, the test also checks for Lyme disease, Anaplasma, and Ehrlichia. According to the manufacturer’s website, the test would detect antibodies for E. canis or E. ewingii. In a healthy pet with no clinical signs, a positive Snap test for ehrlichiosis can be confusing and require additional testing. Sometimes the test is a false positive (meaning it is actually negative), but in all likelihood, your pet was exposed to the bacteria from an infected tick bite. Your vet may choose one of three options based on if your pet has any symptoms: Monitor your dog with no additional therapy Treat for ehrlichiosis Recommend additional testing, such as the PCR Treatment of Ehrlichiosis in Dogs  Ehrlichiosis is typically treated with a 28- to 30-day course of antibiotics, most often prescribing Doxycycline. Most dogs in the acute or subclinical phases will not require hospitalization and can be managed as outpatients at home with minimal supportive care (pain medications and appetite stimulants). Dogs with chronic ehrlichiosis may require hospitalization for aggressive supportive care that includes blood transfusions, steroids, IV fluids, and nutritional support. In many cases dogs with ehrlichiosis will also be infected with other tick-borne diseases, which may complicate diagnosis and treatment. Your veterinarian will customize a treatment plan to your dog’s specific needs. Recovery and Management of Ehrlichiosis in Dogs  Dogs with acute or subclinical ehrlichiosis from E. canis tend to improve within one to two days of starting therapy and have an excellent prognosis for recovery. Dogs with E. ewingii infection tend to recover quickly after antibiotics have been initiated. Once recovered, dogs can still have antibodies in their blood for several years but are essentially cured of the infection. Unfortunately, the prognosis for dogs with chronic E. canis infection is guarded as this stage can be fatal. Dogs who survive ehrlichiosis can become re-infected later in life as immunity is not lifelong. Ehrlichiosis cannot be spread from dog to dog, but if multiple pets were exposed to the same area of ticks, please consult your veterinarian about testing and/or treating all dogs in your household. Although ehrlichiosis is not zoonotic (cannot be transmitted from dog to human), humans can still get the infection directly from a tick bite. If you believe you have been exposed to ehrlichiosis through a tick bite, seek medical care immediately.   Prevention of Ehrlichiosis in Dogs Fortunately, most tick bites can be prevented through monthly flea and tick preventative care. There are plenty of options available, including topical, tablet, and chewable medications. Your veterinarian will be able to help you find the best option for your pet. If you live near wooded areas where ticks are prone, it is best to keep your dog away from these areas, since there currently is no vaccine for ehrlichiosis. When your dog comes back from any outdoor adventure, it’s important to inspect them for any ticks or fleas and remove them safely. Early removal of ticks is the best defense against the spread of any infection."}]