[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can a dog recover from diabetic ketoacidosis?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, a dog can recover from diabetic ketoacidosis - if diagnosed early and treated aggressively."}}, {"@type": "Question", "name": "Is diabetic ketoacidosis treatable in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, diabetic ketoacidosis is a treatable condition in dogs, though the treatment can be lengthy and expensive."}}, {"@type": "Question", "name": "What are the warning signs of diabetic ketoacidosis in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Warning signs of diabetic ketoacidosis in dogs include lethargy, depression, weight loss, vomiting, diarrhea, increased thirst and urination, and flaky unkempt haircoat, especially when there has been a previous diabetes mellitus diagnosis."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Diabetic Ketoacidosis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/black-lab-at-vet-office-getting-blood-taken_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/black-lab-at-vet-office-getting-blood-taken_0.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Diabetes, Endocrine health, Symptom Checker, Diabetic Ketoacidosis", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_diabetes_with_ketoacidosis"}, "datePublished": "April 22, 2022", "dateModified": "September 12, 2023", "description": "Dr. Katie Grzyb discusses diabetic ketoacidosis in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Diabetic Ketoacidosis in Dogs? Diabetic ketoacidosis is a serious medical emergency that occurs when the blood-glucose (sugar) level in a dog’s body becomes dangerously high, either from lack of insulin production in the body or from the body’s inability to respond to the insulin produced.  Ketoacidosis is considered the most serious complication that can occur in a dog with diabetes mellitus. The average age of dogs with ketoacidosis is around 8 years, but it has been reported in dogs as young as 8 months, and as old as 16 years. There is no specific breed or sex predisposition in dogs, although diabetes mellitus is diagnosed more commonly in middle-aged to older female dogs. Diabetes mellitus is a medical condition in which the lack of insulin in the body (or the body’s lack of response to its insulin) causes a large amount of glucose to build up in the bloodstream. Insulin acts as a gatekeeper between the body’s cells and the bloodstream. The cells need glucose for energy and to function appropriately, and insulin ensures that the amount remains under control. In diabetic pets, shortage of insulin means that glucose cannot move into their cells, so the glucose level in the bloodstream increases and continues to circulate. As a result, the cells can’t perform their normal duties because they are starved for sugar which leads to diabetes mellitus. Eventually, the body begins to break down fat stores to access the carbohydrates needed to feed the cells. This process produces ketone bodies, which then begin to circulate through the bloodstream as well. Ketone bodies are considered an alternate source of fuel for the cells in times of low-blood glucose. In small amounts, they are safe for the body, but when larger amounts of ketones are used up, the blood becomes more acidic, causing a major electrolyte disturbance. Severe dehydration ensues and worsens the body’s electrolyte abnormalities. Eventually, this leads to secondary issues of ketoacidosis, such as poor muscle function, swelling of the cells in the brain, heart failure, kidney and liver malfunction, and heart arrhythmias. Without speedy, aggressive, and appropriate medical therapy, diabetic ketoacidosis is fatal.  Symptoms of Diabetic Ketoacidosis in Dogs Dogs experiencing diabetic ketoacidosis may exhibit one, or many, of the following symptoms: Excessive thirstExcessive urinationLethargy or depressionWeaknessVomitingWeight lossMuscle wastingDecreased appetite or anorexiaRough, unkempt haircoatDandruff/flaky skinDiarrheaSweet odor to the breath (acetone breath)CataractsIncreased respiratory rate/effortEnlarged liverJaundice (yellowing of the skin and the whites of the eyes)Dehydration (skin tenting and tacky gums) Causes of Diabetic Ketoacidosis in Dogs Any dog with diabetes mellitus who undergoes stress in the body is at risk for ketoacidosis. The body’s response to stress is to secrete hormones, such as norepinephrine and glucagon that hinder insulin activity in the body and increases glucose in the bloodstream. Examples of stressors on the body include any inflammation, infection or surgery. Certain concurrent diseases can lead to ketoacidosis, including pancreatitis, urinary tract infections, kidney infections, hyperadrenocorticism (Cushing’s disease), cancers, and heart disease.  How Veterinarians Diagnose Diabetic Ketoacidosis in Dogs Diagnosis of diabetic ketoacidosis includes a complete history, a physical examination and diagnostic testing conducted in a hospital. This includes:   Blood work to assess blood-sugar levels, red and white blood cell counts, kidney enzymes, liver enzymes, ketones, electrolytes, and acid/base status.Urine testing to assess for glucose and ketones in the urine as well as for an active urinary tract infection.Chest radiographs, abdominal ultrasound and blood pressure monitoring to investigate concurrent medical issues that may be exacerbating the ketoacidotic state.Treatment of Diabetic Ketoacidosis in Dogs Mild Cases of Diabetic Ketoacidosis in Dogs Not all dogs with high blood glucose and ketones in the bloodstream and/or urine require hospitalization. Sometimes, in the early stages, insulin therapy can be initiated at home under the direction of a veterinarian to help correct these mild changes.  Severe Cases of Diabetic Ketoacidosis in Dogs Symptoms of dehydration, electrolyte abnormalities, vomiting, weakness, very high blood glucose, and large amounts of ketones circulating through the body require more aggressive therapy.  Aggressive therapy includes a several-day stay in the hospital to correct dehydration and electrolyte abnormalities with appropriate fluid therapy and intravenous electrolyte supplementation. Electrolytes (most commonly potassium, phosphorus, and magnesium) are monitored frequently with blood work, as electrolytes can change very rapidly during treatment.  Insulin therapy is instituted either through several intramuscular injections (over 24 hours) or a continuous infusion drip. This insulin drives the blood glucose into the cells for nourishment and decreases the body’s need to break down its fat stores for ketones. Acid/base status is monitored closely during a hospitalization and if the acidic state of the blood is not corrected with fluid therapy, then sodium bicarbonate therapy is instituted. This helps bring the acidic state of the bloodstream to a more normal range.  Often, anti-emetic medications, anti-acid medications, pain medications, antibiotics, and appetite stimulants are considered during hospitalization, depending on clinical signs and concurrent medical issues. Recovery and Management of Diabetic Ketoacidosis in Dogs It is important to note that ketoacidosis is a life-threatening condition requiring several days of hospitalization, aggressive fluid, and electrolyte and insulin therapy, a lifelong treatment with insulin, and frequent veterinary visits after discharge. In a study of 127 dogs treated for ketoacidosis, 70 percent survived and were discharged from the hospital with an average hospital stay of six days.  Prevention of Diabetic Ketoacidosis in Dogs The most important steps in the prevention of ketoacidosis are appropriate insulin dosing and administration. Insulin therapy will be determined by your veterinarian, and dosing will be demonstrated to you prior to your dog’s discharge from the hospital.  Monitoring blood glucose and ketones at home is considered a mainstay of treatment for the prevention of ketoacidosis. Your veterinarian will instruct you how on how to perform this monitoring at home. It is important to follow the veterinarian’s instructions for insulin dosing, especially how to handle the insulin, the size/gauge insulin needle required and the timing of insulin administration to avoid recurrent ketoacidosis or hypoglycemia (a state where the blood glucose drops too low). "}]