[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/hhsiel3i6d", "@type": "VideoObject", "duration": "PT2M16S", "name": "5327099921001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/b3477fbb7759a735d7a3c5c0486005c3dbc069f5.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/hhsiel3i6d", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/d49407a59c0d6b7b8a805d2f99cf39373f8486e3.m3u8", "transcript": "Lyme disease is one of the most common tick borne diseases in the world but it only causes symptoms and about 5% to 10% of affected dogs. It's caused by a bacteria called Borelli Bergdorf right. The beryllium bacterium responsible for Lyme disease is transmitted by slow feeding hard shelled deer ticks. Infection typically occurs after the tick has been attached to the dog for about 24 to 48 hours.\n\nMany dogs who develop Lyme disease have recurrent lameness due to inflammation of the joints. Sometimes the lameness lasts for only three to four days. But recurs days to weeks later either in the same leg or in other legs one or more of the joints may also be swollen warm and painful. Some dogs with Lyme disease may also develop kidney problems.\n\nEventually kidney failure may occur as the dog begins to exhibit signs such as vomiting, diarrhea lack of appetite weight loss or increased thirst and urination other symptoms associated with Lyme disease include a stiff walk with an arched back sensitivity to touch difficulty breathing lethargy and swelling of superficial lymph nodes close to the sight of the infected tick bite. You'll need to give your veterinarian a thorough history of your dog's health vaccines. Use of flea and tick prevention and lifestyle. If you're a vet nearing may run a combination of blood chemistry tests a complete blood cell count urinalysis x-rays and other tests specific to diagnosing Lyme disease.\n\nIf the diagnosis is Lyme disease your dog will be treated as an outpatient unless kidney disease is present. Your vet Miriam will prescribe an antibiotic for at least four weeks as well as an anti-inflammatory drug. If your dog is painful if possible, avoid letting your dog roam and take infected environments where Lyme disease is common. Check your dog's coat and skin daily and remove ticks carefully with a pair of tweezers or a tick remover tool.\n\nYour veterinarian can also recommend a variety of sprays collars and spot on topical products that kill and repel ticks. Such products should be used year round on your veterinary supervision and according to the labels directions. Lyme vaccines are available but their use is dependent on your lifestyle. The age and health of your dog and some other factors.\n\nSo talk to your vet Mary and see if a Lyme vaccination is right for your dog.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_lyme_disease?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lyme Disease in Dogs: Symptoms and Treatment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/wire-haired-terrier-mix-breed-picture-id184351261.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/wire-haired-terrier-mix-breed-picture-id184351261.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasite, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_lyme_disease"}, "datePublished": "April 14, 2020", "dateModified": "October 16, 2023", "description": "Here’s everything you need to know about Lyme disease in dogs, straight from a veterinarian.", "articleBody": "Lyme disease in dogs is one of the most common tick-transmitted diseases in the world, but it only causes symptoms in 5-10% of affected dogs. So some dogs may have it, but never show symptoms. Transmission of Lyme disease has been reported in dogs throughout the United States and Europe, but it’s most prevalent in the upper Midwestern states, the Atlantic seaboard and the Pacific coastal states. However, the disease is spreading and becoming more common throughout the United States. Here’s some info about the causes and prevention of Lyme disease, as well as the symptoms you should look for and treatment options. Symptoms of Lyme Disease in Dogs Here are some common and less common symptoms and complications of Lyme disease in dogs. Most Common Symptoms When infection leads to Lyme disease in dogs, the dominant symptoms are: Recurrent lameness due to inflammation of the jointsFever1General feeling of malaiseMany dogs who develop Lyme disease have periodic lameness because their joints are inflamed. Sometimes the lameness lasts for only 3-4 days but recurs days to weeks later, either in the same leg or other legs. This is known as “shifting-leg lameness.” One or more joints may be swollen, warm, and painful. Other Symptoms In some cases, Lyme disease can also cause:   DepressionEnlarged lymph nodes1Lack of appetiteStiff walk with an arched backSensitivity to touchDifficulty breathingKidney Damage Caused by Lyme Disease More serious complications, although uncommon, include: Damage to the kidneysRarely, heart or nervous system disease (although this is not well documented)1,2Lyme disease sometimes leads to glomerulonephritis—the inflammation and accompanying dysfunction of the kidney&#039;s glomeruli (a blood filter). Eventually, kidney failure may set in as the dog begins to exhibit signs such as vomiting, diarrhea, lack of appetite, weight loss, increased urination and thirst, and abnormal fluid buildups that can appear as swollen limbs. How Lyme Disease Is Transmitted Lyme disease is caused by a spirochete (bacteria) of the Borrelia burgdorferi species.  Borrelia burgdorferi is transmitted by slow-feeding, hard-shelled deer ticks (Ixodes spp.). Infection typically occurs after the Borrelia-carrying tick has been attached to the dog for approximately 241 - 48 hours. Diagnosing Lyme Disease in Dogs You will need to provide a thorough history of your dog&#039;s health to give your veterinarian clues as to which organs are being affected. Clinical diagnosis of Lyme disease is usually confirmed with a positive blood test for Lyme along with the clinical signs associated with Lyme disease. It’s important to note that tests can take 4-6 weeks to show up as positive after exposure, which is why veterinarians will use a combination of diagnostics to diagnose your dog:  Blood chemistry testsComplete blood cell countUrinalysisFecal examinationX-rays and tests specific to diagnosing Lyme disease (e.g., serology)Fluid from the affected joints may also be drawn for analysis Arthritis Caused by Lyme Disease There are many causes for arthritis, and your veterinarian will focus on differentiating arthritis initiated by Lyme disease from other inflammatory arthritic disorders, such as trauma and degenerative joint disease. Immune-mediated diseases will also be considered as a possible cause of the symptoms. X-rays of the painful joints will allow your doctor to examine the bones for abnormalities. Treating Dog Lyme Disease If the diagnosis is Lyme disease, your dog will be treated as an outpatient unless their condition is unstable (e.g., severe kidney disease). Doxycycline is the most common antibiotic that is prescribed for Lyme disease, but other antibiotics are also effective.   Treatment usually takes at least 4 weeks, and longer courses may be necessary in some cases. Your veterinarian may also prescribe an anti-inflammatory if your dog is especially uncomfortable. Unfortunately, antibiotic treatment does not always completely eliminate the infection from Borrelia burgdorferi bacteria. Symptoms may resolve but then return at a later date, and the development of kidney disease in the future is always a concern. Administering the antibiotics properly to your dog reduces the likelihood of chronic consequences. Improvement in sudden (acute) inflammation of the joints caused by Borrelia should be seen after 3-5 days of antibiotic treatment. If there is no improvement within 3-5 days, your veterinarian will want to reevaluate your dog. Preventing Lyme Disease in Dogs If possible, keep your dog away from tick-infested environments where Lyme disease is common. Check your dog’s coat and skin daily to make sure you find any ticks hiding on your pet, and remove ticks by hand. The most effective way to prevent Lyme disease and protect pets from other tick-borne diseases is to use flea and tick prevention. Your veterinarian can prescribe a variety of prescription flea and tick options, including collars, topical solutions, and tablets and chews that kill and repel ticks. These products should be used under a veterinarian&#039;s supervision and according to the label&#039;s directions. If you live in an area where ticks are abundant, Lyme vaccines are available. However, not all dogs are a good candidate for the vaccine. Talk to your veterinarian to see if the Lyme vaccination is right for your dog. References: 1.        Lyme Disease. Companion Animal Parasite Council. https://capcvet.org/guidelines/lyme-disease/. 2.        Littman MP, Gerber B, Goldstein RE, Anna M, Michael L, George RL. ACVIM consensus update on Lyme borreliosis in dogs and cats. J Vet Intern Med. 2018;(January):887-903. doi:10.1111/jvim.15085"}]