[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is sarcoptic mange contagious to humans?", "acceptedAnswer": {"@type": "Answer", "text": "Sarcoptic mange is contagious to humans. This type of scabies is not the same as human scabies, however. Extremely itchy bumps may occur within 24 hours and may persist for up to 3 weeks after exposure. Sarcoptic mites are not able to complete their life cycle on human skin, so they will eventually die."}}, {"@type": "Question", "name": "How do I know if my dog has sarcoptic mange?", "acceptedAnswer": {"@type": "Answer", "text": "If your dog has sudden onset of severe itching, hair loss, or scaling/crusted lesions, it is very important to get them to a veterinarian for testing to find out if they have sarcoptic mange. It is also important to keep them away from other pets and humans as much as possible until they are appropriately treated, and the environment has been disinfected."}}, {"@type": "Question", "name": "How long is a dog contagious with sarcoptic mange?", "acceptedAnswer": {"@type": "Answer", "text": "A dog is contagious with sarcoptic mange until 36 hours after they have started appropriate therapy and the environment has been completely disinfected. Featured Image: iStock.com/Weerameth"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sarcoptic Mange in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/street.dog_.mange_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/street.dog_.mange_.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Mange, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_sarcoptic_mange"}, "datePublished": "March 8, 2022", "dateModified": "August 12, 2022", "description": "Dr. Katie Grzyb discusses sarcoptic mange in dogs, including symptoms, diagnosis, and treatment.", "articleBody": "What Is Sarcoptic Mange in Dogs? Sarcoptic mange is a contagious skin disease caused by mites located at the hair follicles and can be transmitted from animals to humans. Sarcoptic mange can be an extremely debilitating and sometimes even fatal disease.  Sarcoptic mange, which is also known as scabies, is caused by Sarcoptes scabiei. Under the microscope, this parasite appears as a small, circular, white mite. Adult mites have eight legs while juveniles have six legs. Terminal suckers are located on the legs of male and female mites, which help them feed on a host’s skin. They are usually 0.2-0.4 millimeters in size and cannot be seen by the naked eye.   This parasitic mite is easily transmitted between animals as well as to humans. These mites are found on foxes primarily and are an important reason for domestic dog infestation. Dogs develop an allergic reaction to these mites, so only a few are necessary to cause severe clinical signs.   Adult mites will mate on the skin surface, and then the females burrow into the deeper skin layers to lay their eggs. Once these eggs hatch, the larvae move toward the skin’s surface where they begin to feed on the skin. Larvae then mature to nymphs, which eventually mature to adults. The life cycle is complete within 3 weeks.   Scabies usually affects dogs suffering from starvation and neglect and those with compromised immune systems. It is seen less commonly in healthy dogs in loving homes.   Symptoms of Sarcoptic Mange in Dogs Clinical signs of sarcoptic mange include:  Severe itching  Alopecia (hair loss)   Excoriations (self-inflicted superficial or deep wounds) Raised bumps called papules are often found on the chest or over the body. Thick crusted skin is most noted on the margins of the ears, the ankles (hocks), armpits, and elbows as this mite prefers to invade hairless skin. But these mites can affect the entire body.   Often secondary skin infections are seen because of the skin lesions, which can present as crusted lesions (collarettes) or draining/weeping wounds.   Depression, decreased appetite, and lethargy can occur because of the severe itching and uncomfortable skin issues. Weight loss is a possible clinical sign because of the expended energy used with persistent and severe scratching. Enlarged lymph nodes can be seen with generalized infection. Occasionally, localized scabies infection is possible when the lesions, hair loss, and itching is confined to one region of the body.   It is important to note that with cases of sudden, severe itching in dogs, especially in younger dogs, scabies should always be investigated and treated to avoid progression of symptoms.  Causes of Sarcoptic Mange in Dogs Sarcoptic mange is spread through direct contact with an infected animal or human. These microscopic mites require a host to feed on and do not live in the environment for long periods of time. They can be infective in the environment for up to 36 hours.   Scabies is often transmitted through close contact between dogs. These mites are found most in areas where infected dogs and foxes frequent. Day cares, dog parks, shelters, and some breeding facilities are examples of where dogs can easily spread scabies.   Scabies is not caused by bad hygiene, but it can be worsened with neglect or a weaker immune system. Animals with depressed or forming immune systems or animals with other underlying medical issues are at a higher risk of mange infestation.   How Veterinarians Diagnose Sarcoptic Mange in Dogs Scabies is often suspected in any dog with sudden onset of severe itching, hair loss, or scaling lesions, especially puppies and older, ill dogs.  Sarcoptic mange is most commonly diagnosed with skin scraping and cytology. This is a non-invasive test that involves using a scalpel blade and scraping the skin deep enough for mild irritation. The sample is assessed under the microscope, where the presence of any mites is considered a positive result.   It can be difficult to find sarcoptic mites, and sometimes several areas need to be sampled for positive identification. In some cases, no mites are found and treatment is started because of the severity of clinical signs, age, and physical examination. Response to treatment is then monitored closely.  Some mites can sometimes be found through fecal flotation or fecal testing because the dog ingested them while licking/chewing the skin.  Polymerase chain reaction (PCR) tests can also be performed, but it can bring false negative results and is often not necessary when diagnosis is made through clinical signs and response to therapy.  Finally, skin biopsy may be necessary in cases where the dog is not responding to therapy or if a diagnosis is not made with other less invasive diagnostic tests. Biopsy is sometimes considered if draining wounds, skin swelling, or papules are noted to rule out other causes of these lesions as well as mites.  Treatment of Sarcoptic Mange in Dogs You should isolate your dog from other pets and as many humans as possible when treating scabies to avoid the spread of infection as well as re-infection. Isolation should continue until your pet is found to be free of scabies by your veterinarian.   It is necessary to address any systemic disease, weakened immune system issues, and secondary skin infections for dogs with scabies. Treatment failure is usually caused by failure to treat secondary infections/illnesses and stopping medical therapy too early.   All cases of sarcoptic mange require medical therapy. Numerous treatments are available including selamectin (Revolution), ivermectin, milbemycin (Interceptor), moxidectin, imidacloprid/moxidectin (Advantage Multi), lime-sulfur dips, doramectin, amitraz, fipronil (Frontline), fluralaner (Bravecto), afoxolaner (NexGard), and sarolaner (Simparica). If one product is not helping resolve the clinical signs, veterinarians will change to another product, which may help speed resolution.  It is important to note that ivermectin should never be used in collies, collie-crosses, Shetland Sheepdogs, Australian Shepherds, Old English Sheepdogs, and any other dogs that carry the MDR1 gene (multiple drug resistant 1 gene). These dogs can have severe and even fatal side effects when using ivermectin. Other safer options should be used in these breeds.  Antibiotics to treat skin infections as well as anti-itch medications are often given to help with relief of itching during treatment with miticidal therapy. An Elizabethan collar (pet cone) may be recommended by your veterinarian if your dog is causing injury to her skin.  Environmental disinfection is extremely important in cases of scabies. Though this mite can easily die in the environment, it can easily jump back onto a host and start to feed. Dogs diagnosed with or suspected of having scabies should have their collars, harnesses, bedding, crates, toys, and bowls washed in diluted bleach or replaced entirely. When disposing of infected items, discard them a sealed garbage bag away from animals and humans to avoid further infestation.  Recovery and Prevention of Sarcoptic Mange in Dogs Recovery from scabies depends on the severity of the infection. Dogs with minor infestations have a speedier resolution than dogs with severe infestations. In more severe cases, it can take weeks to months for full resolution of itching and for the skin to begin to heal itself.   Monthly or tri-monthly oral or topical flea/tick/mite preventatives are recommended to decrease the chance of re-infection with sarcoptic mange. Good house cleaning and a clean environment are pertinent in controlling scabies. Mange is less common in well cared for, bathed, nutritionally sound dogs who sleep in frequently cleaned bedding and crates."}]