[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Iris Cysts", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/iris-cysts-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/iris-cysts-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_iridociliary_cysts_dog_eye_problem"}, "datePublished": "October 9, 2012", "dateModified": "August 16, 2022", "description": "Although these eye cysts often require no treatment, they may occasionally be large enough to interfere with vision.", "articleBody": "Iridociliary Cysts in Dogs Sometimes referred to as iris cysts or uveal cysts, iridociliary cysts are often benign and require no treatment. However, occasionally they may be large enough to interfere with vision or with the function of the eye.   Symptoms and Types Iridiociliary cysts may be attached to various parts of the interior of the eye. They may be lightly or darkly pigmented and are semitransparent. They may be spherical to ovoid in shape. They can vary considerably in size and there may be more than one. They may be seen in one or both eyes. In most cases, these cysts are an incidental finding. Only when they are large enough to impair vision or interfere with the normal functioning of the eye are they problematic. Glaucoma can be a complication associated with iridociliary cysts.   Causes Cysts may be congenital or acquired. Congenital cysts are caused by a developmental abnormality in the eye and affected dogs are born with the cysts.Acquired cysts may be the result of trauma to the eye or of uveitis (inflammation of the dark layers of the eye.) In many cases, the cause is never known.There is a breed predilection in Boston terriers, golden retrievers and Labrador retrievers for iridociliary cysts. In golden retrievers, a syndrome of pigmentary uveitis and iridociliary cysts is seen. These cysts have also been associated with glaucoma in golden retrievers and in Great Danes.   Diagnosis Iridociliary cysts are diagnosed with an ocular examination.  Treatment In most cases, no treatment is necessary. If uveitis or glaucoma is present, these diseases will need to be treated appropriately. Laser coagulation can be used to remove particularly large cysts if necessary."}]