[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Low White Blood Cell Count in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/low-white-blood-cell-count-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/low-white-blood-cell-count-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Conditon", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_Neutropenia"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "This genetic disease is found in the stem cells of bone marrow. Sometimes it is called “gray collie disease” by some scientists because it is a stem cell disorder that occurs in collies.", "articleBody": "Neutropenia in Dogs The white blood cells known as neutrophils are vital for fighting infection; when they drop very low, your dog is suddenly susceptible to all kinds of infections and illnesses. There are many possible causes: genetic predisposition, cancer, and certain drugs, among others. This disease has had a lot of attention among researchers in recent years, and more is known about it now, especially about the genes that are responsible for many of the congenital neutropenia syndromes. However, less has been learned about the other kinds of neutropenia, especially those which are acquired rather than inherited. This genetic disease is found in the stem cells of bone marrow. Sometimes it is called “gray collie disease” by some scientists because it is a stem cell disorder that occurs in collies. All collies have black noses except those that have the gene that leads to the white-cell deficiency. The puppies who inherit the disease are usually smaller and weaker than the others in the litter, and they begin to develop fever, diarrhea, joint pain or other signs. The puppies will often go through cycles, having dramatically low white cell counts and then rebounding. Unfortunately, most of them die in the first few weeks. Belgian Tervurens also inherit this condition; however, it is typically more benign than with collies. Tervurens usually show normal on bone marrow tests and treatment is only necessary if the dog is unhealthy. There is also a genetic factor that leads to neutropenia in some giant schnauzers. In this case, the deficiency in neutrophils is the result of a failure to absorb vitamin B12. Symptoms and Types  Frequent infectionsUnexplained fever, diarrhea, joint pain, etc.Newborn puppies are small and sick—fever, diarrhea, joint pain, etc. In collies, the color of the coat is diluted and noses are gray rather than black like the other puppies  Causes Genetic predispositionInfectious agents—parvoviruses and tick-transmitted organismsDrugs, chemicals, and toxins—chemotherapy agents and cephalosporins; estrogen; Noxzema ingestion, et al.Lack of trophic factors—inherited malabsorption of vitamin B12 (giant schnauzers)  Diagnosis  The breed is usually the first indicator in diagnosing neutropenia. If it falls in any of the categories that typically exhibit the genetic predisposition, your veterinarian will examine for the disorder. You will need to provide a drug history for your dog, as well as any possible toxins (such as Noxzema) and exposure to radiation. Blood tests will be run to determine it&#039;s blood count. If your dog is a collie and the deficiency is cycling, tests will need to be run periodically. In addition, serological tests will be run to determine whether the dog might have been infected by ticks; X-rays and ultrasound will then be used to locate the sites of infection. Bone marrow may be biopsied to determine the level of neutrophil production and to exclude other diseases. In the case of giant schnauzers, vitamin B12 may be administered on a trial basis. If your dog has a fever, a culture of the infection site or a blood culture may be done to determine what the infecting agent is.  Treatment The first consideration for treatment is secondary infection. If there is no fever, antibiotics will be prescribed. If the dog has a fever, the treatment will be more aggressive. The dog will probably be hospitalized and antibiotics administered through an IV. If anemia is acute, a transfusion may also be necessary. Living and Management There will be frequent blood tests. Also, be aware of any signs of an infection, such as a fever."}]