[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Eye Injuries in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/eye-injuries-dogs.png", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/eye-injuries-dogs.png"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_corneal_scleral_lacerations"}, "datePublished": "August 11, 2008", "dateModified": "August 16, 2022", "description": "In medical terms, a penetrating injury is a wound, or foreign object that enters the eye but does not completely pass through the cornea or sclera. Learn more about Dog Eye Injuries at PetMd.com.", "articleBody": "Corneal and Scleral Lacerations in Dogs The cornea is the transparent outer layer at the front (anterior) of the eye. The sclera, the white of the eye, is composed of a tough covering that protects the eyeball. In medical terms, a penetrating injury is a wound, or foreign object that enters the eye but does not completely pass through the cornea or sclera. A perforating injury, on the other hand, is a wound or foreign body that completely passes through the cornea or the sclera. Needless to say, the latter is a greater risk to vision. In medical terms, a simple injury involves only the cornea or sclera and may be penetrating or perforating. Other eye structures are not injured in a simple injury. A complicated injury perforates the eye and involves other eye structures in addition to the cornea or sclera. In fact, it can affect one or all parts of the eye. The entire middle layer of the eyeball that contains the blood vessels, and which is composed of the iris, the area between the iris, and the choroid -- the layer between the sclera and the retina -- can be injured by a complicated perforating injury. There may also be trauma to the lens, which will lead to cataracts or lacerations to the eyelid. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types Symptoms of an injury to the eyeball may be represented by the suddenness of the symptoms (e.g., pawing at the eye, blinking rapidly, swollen, inflamed); blood in the eye, or a blood filled mass (subconjunctival hematoma), left from a sealed laceration; a foreign object in the eye that can be visually detected; the pupil is distorted, either reacting abnormally or shaped differently; the front clear covering of the eyeball, the cornea, is clouded (cataract); or, the eye is protruding. Any of these symptoms may be indicative of an injury to the eye. Causes The causes for an injury to the eye are all around, but some of the most common occurrences that lead to an injury follow: When your dog has been running through heavy vegetationGunshot, fireworks, or other rapid projectiles in the vicinity of your dogPre-existing visual impairment or deformity in the structure of the eyeYoung, naïve, or highly excitable dogs that have not learned cautionFights with other animals; most notably, cats will scratch at the faces of dogsDiagnosis If your veterinarian finds a foreign object in the eye, appropriate treatment will be determined. The nature, force, and the direction of the object&#039;s impact will help to identify which tissues may be involved. The visual response to a menace (i.e, blinking in response to an object being brought close to the eye), as well as aversion to bright light, will be assessed. The pupils will be examined for size, shape, symmetry, and light reflexes. If a foreign object is not found, your veterinarian will consider an ulcer of the cornea, or some other naturally occurring cause that is affecting the eye, before looking into trauma to the deeper parts of the eye.  Treatment The course of treatment will depend on the severity of the injury and the part of the eye that was injured. If the wound is nonperforating and has no wound edge or opening, an Elizabethan collar for preventing the dog from scratching at the eye is often prescribed, along with antibiotic or atropine eye solutions. Nonperforating wounds that have a mild break in the tissue, or a pinpoint wound perforation, may be treated with a soft contact lens, an Elizabethan collar, and antibiotic or atropine solutions. Injuries requiring surgical exploration or repair are as follows: Full-thickness corneal lacerationsFull-thickness wounds with iris involvementFull-thickness scleral or corneoscleral lacerationsRetained foreign object or a posterior scleral (white of the eye) ruptureSimple nonperforating wound with edges that are moderately or overtly broken, and that are long, or more than two-thirds the corneal thicknessYour veterinarian will prescribe medications that are suitable to the seriousness of the wound. Antibiotics are usually prescribed, as well as anti-inflammatory medications and analgesics for pain. Living and Management Deep or wide penetrating wounds that have not been sutured need to be rechecked every 24 to 48 hours for the first several days. If the penetrating wound is superficial, rechecking every three to five days until it is healed is advised. As to prevention, take care when introducing new puppies to households with cats. Discourage your dog from running through dense vegetation. Minimize a visually impaired or blind dog&#039;s exposure to dense vegetation. If you are in an area that carries the risk of having debris transmitted to the eyes, like wooded areas, beaches, etc., it would be a good idea to have a bottle of saline eyewash to irrigate foreign debris from the eye. Most eyes with corneal lacerations or a retained foreign object in the cornea are salvageable. The further back the injury, the poorer the prognosis for retention of vision. Cases that would warrant a poor prognoses, for example, would be an injury to the white, outer membrane of the eyeball, the sclera, or to the fluid part, the vascular layer of the eyeball; if there is no light perception; a perforated injury involving the lens; a significant hemorrhage in the vitreous, the clear gel that fills the space between the lens and the retina of the eyeball; or, retinal detachment. Penetrating injuries usually have a better prognosis then perforating injuries, and blunt traumas carry a poorer prognosis than sharp traumas."}]