[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pelger-Huët Anomaly in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_pelger_huet_anomaly"}, "datePublished": "April 28, 2010", "dateModified": "August 16, 2022", "description": "Pelger-Huët anomaly is an inherited disorder characterized by the hyposegmentation of neutrophils (a type of white blood cell), whereby the nucleus of the cells has only two lobes or no lobes at all.", "articleBody": "Pelger-Huët anomaly is an inherited disorder characterized by the hyposegmentation of neutrophils (a type of white blood cell), whereby the nucleus of the cells has only two lobes or no lobes at all. For the most part, this is a harmless disorder which affects several breeds of dogs, including the American foxhound, Australian shepherd, and basenji. Symptoms and Types There are two types of this benign defect: heterozygous and homozygous. The heterozygous version is more common and is recognized because the dog&#039;s mature neutrophils resemble bands (slightly immature neutrophils) and metamyelocytes (a predecessor of granular leukocytes). Heterozygous anomaly is not associated with immunodeficiency, with predisposition to infection, or with abnormalities of leukocyte (white blood cell) function. Conversely, the homozygous anomaly is usually lethal in utero. Dogs that survive may have leukocytes with round to oval nuclei on a stained blood smear. Heterozygous anomaly and skeletal anomalies, such as abnormal development of cartilage and shortened jaws, are reported in Samoyeds; however a direct link with Pelger-Huët anomaly has not been conclusively confirmed. Causes Limited breeding studies may suggest autosomal (non-sex linked) dominant transmission of the anomaly in dogs. However, autosomal dominant transmission with incomplete penetrance (lacks full genetic expression of the autosomal dominance) occurs in Australian shepherd dogs. Diagnosis In most cases, veterinarians discover the anomaly in your dog by accident while conducting routine blood tests. On a stained blood smear, nuclear hyposegmentation of neutrophils, eosinophils, basophils, and monocytes will be visible, whereby the nucleus of the cells has only two lobes or no lobes at all. The hereditary nature of disease is revealed by examination of blood smears from parents and siblings.  Treatment No treatment is required, as there is clinical disease associated with Pelger-Huët anomaly. Living and Management If breeding is a concern, genetic counseling can help with eliminating the trait from future generations."}]