[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can kissing bugs kill dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Not directly, but kissing bugs can carry and transmit a parasite that can cause Chagas disease. Not all dogs who are exposed will develop symptoms, but some dogs can develop fatal heart disease."}}, {"@type": "Question", "name": "Is kissing bug disease contagious?", "acceptedAnswer": {"@type": "Answer", "text": "Kissing bug disease is caused by a parasite that’s transmitted by the kissing bugs. Except for a mother dog passing it on to her puppies, an infected dog can’t directly give the disease to another dog or person; it has to be transmitted by the kissing bug."}}, {"@type": "Question", "name": "References", "acceptedAnswer": {"@type": "Answer", "text": "CDC - Chagas Disease - Epidemiology &amp; Risk Factors. Published 2019. https://www.cdc.gov/parasites/chagas/epi.html. Accessed March 24, 2021. Sciences TAV &amp; B. Kissing Bugs and Chagas Disease in the U.S. | Texas A&amp;M University. kissingbug.tamu.edu. https://kissingbug.tamu.edu/. Accessed March 24 2021. Hamer S, Curtis-Robles R. Chagas Disease at the Canine-Wildlife-Human-Vector Interface. ACVIM Conference 2017, June 8-10, National Harbor, MD."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chagas Disease in Dogs (Kissing Bug Disease)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "Aja Senestraro, DVM", "url": "https://www.petmd.com/author/dr-aja-senestraro"}, "keywords": "Dog, Parasite", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_chagas_disease"}, "datePublished": "October 20, 2021", "dateModified": "August 12, 2022", "description": "Dr. Aja Senestraro explains everything you need to know about Chagas disease (also known as kissing bug disease) and answers all your frequently asked questions.", "articleBody": "What Is Chagas Disease in Dogs? Chagas disease is also known as “Kissing Bug Disease” or “American Trypanosomiasis.” It’s caused by a blood parasite called Trypanosoma cruzi, which is transmitted by kissing bugs.  Image: iStock.com/shoemcfly  Image: iStock.com/nathanphoto   Chagas disease affects people as well as dogs and other animals. It is estimated that about 8 million people have Chagas disease.1 Chagas disease is only known to exist in the Americas. It’s common in Latin America and has been reported in the Southern United States, although it is an underrecognized, underdiagnosed, and underreported disease in both humans and dogs. The kissing bugs that can transmit the disease are currently found in 29 states from the west to east coast.2 Few studies have been done looking at the prevalence of the disease in the United States, but about 50% of kissing bugs appear to carry the parasite that causes the disease. Although most infected dogs don’t develop symptoms of the disease, testing has shown that about 8% of dogs in some areas may have been infected, and for dogs in high-risk situations, it can be up to 30-50% of dogs that have been infected.3 Symptoms of Chagas Disease in Dogs Most infected dogs never actually develop any symptoms. However, most dogs that do develop symptoms have issues related to heart disease. These symptoms can be pretty vague but can also be very severe. Some symptoms are just general symptoms of “not feeling good,” like: Lethargy Low energy Not wanting to or able to exercise and play like usual Depression Not wanting to eat Some more severe symptoms could include: Having difficulty breathing Swollen belly Pale or purple/blue gums In some cases, there can be sudden death due to the damage to the heart. If the parasites invade and damage the spine or brain, dogs could have symptoms like: Weakness Difficulty walking Stumbling Rarely, the nerves to the esophagus and colon can be affected, which causes constipation or regurgitation, which can look like vomiting. Causes of Chagas Disease in Dogs Chagas disease in dogs is caused by a blood parasite called Trypanosoma cruzi. This parasite lives in the blood of hosts like raccoons, skunks, armadillos, coyotes, squirrels, and other mammals. Humans and domestic animals like dogs, cats, cattle, and horses can also be hosts. A kissing bug bites and feeds on blood from a host that’s been infected with the parasite. The parasite infects the kissing bug, multiplies, and is pooped out. That infected poop can enter the body of a new animal after the kissing bug has bitten and fed on them, or the poop could be accidentally rubbed into the eyes or put in the mouth. Dogs may also eat infected kissing bugs and be infected this way. Infection can also occur if they eat an infected host animal like a raccoon or squirrel. Once the parasite is in the new animal, it goes to the heart and starts to multiply in the muscle of the heart. This damages the heart and can lead to heart failure. Rarely, the parasite can travel to other areas like the spine or brain and damage the cells there, causing problems with nerve function. How Vets Diagnose Chagas Disease in Dogs Unfortunately, Chagas disease can be somewhat difficult to diagnose in dogs. There’s nothing on a physical exam that indicates that it’s Chagas disease, so lab testing is needed. Antibody Testing The most accurate test is to look for antibodies to the parasite. This can be done with direct antibody tests or with titers that measure the amount of antibody indirectly. However, infected dogs don’t really produce a lot of antibodies until about 21 days after infection, and they typically start showing symptoms within about 14 days of infection. So, in the early stages, the antibody test will be negative, and titers will be low even when a dog has Chagas disease. PCR Tests Repeating testing in several weeks can demonstrate increased titers and the presence of antibodies. PCR tests can look for the parasite’s DNA in a dog’s blood, but these tests aren’t widely available. Rule Out Other Diseases Since Chagas disease can cause some vague symptoms, and many other diseases can have those same symptoms, it’s important to be sure there’s not something else going on that would be treated differently. Your vet will do a thorough physical exam and may recommend other testing to try to figure out what’s causing your dog’s symptoms. Other tests could include regular blood work and urine testing to look for signs of infection or blood loss and to check the health and function of the liver and kidneys, as well as things like electrolytes and thyroid function. They may also recommend x-rays or further testing of the heart like an EKG and echo ultrasound of the heart to look at its function. Treatment for Chagas Disease in Dogs Fortunately, most dogs with Chagas disease don’t have any symptoms, so they don’t need treatment. However, for those that do develop symptoms, there are currently limited treatment options available. An important part of treatment is managing the symptoms that the parasites are causing to the heart (and any other areas, like the spine or brain). Treatments for heart disease may include diuretics and blood pressure medication to help manage fluid buildup and blood pressure as well as medications to help the heart contract more normally. For Chagas disease that’s affecting a dog’s spine or brain, anti-inflammatories may be used to help reduce the damage and symptoms. Ideally, treatment would kill the parasites so they couldn’t do any more damage to the heart or other parts of the body. The problem is that the usual medications we use for other parasites do not appear to be effective against the parasite that causes Chagas disease. While there are a few medications that show some success at dealing with Chagas disease, they are not easy to get in the US. But there is ongoing research, and some promising new options may become available. Recovery and Management of Chagas Disease in Dogs For dogs that do develop symptoms, there are acute, latent, and chronic phases of the disease. Acute Stage of Chagas Disease In the acute phase, the parasites are causing lots of damage, which will result in your dog feeling generally ill and may also lead to the start of heart disease or heart failure. Latent Stage of Chagas Disease Dogs that survive the acute phase may have latent disease, where they don’t really have any symptoms of the disease, or they may develop chronic disease, where they have chronic changes to the heart. This will continue to affect the ability of a dog’s heart to function normally, and it will cause symptoms. Chronic Stage of Chagas Disease Unfortunately, in the chronic stage of disease, the changes are typically not reversible, so the heart disease is managed with supportive care, including medications to help with fluid buildup, blood pressure, and heart contraction. Sudden death due to their heart disease is most common in dogs less than 1 year old with the chronic form of Chagas disease. Preventing Chagas Disease in Dogs Chagas disease can be fatal for dogs, and diagnosis and treatment can be difficult, so prevention is important. Since infected kissing bugs are the usual source, avoiding contact with them is a big part of prevention. Luckily, some of the medications you may already be giving your dog to protect them from things like fleas and ticks can be effective against kissing bugs, too. Medications like Bravecto, Nexgard, and Trifexis have been shown to kill kissing bugs, but not all flea and tick medications work against kissing bugs. Some other commonly used flea and tick medications, like fipronil, do not seem to be effective, and the medication used to prevent heartworm (ivermectin) is not effective against kissing bugs. It’s good to get into the habit of checking your dog over after being outside to look for and remove any ticks and kissing bugs, since those can both transmit serious diseases to dogs and people. Other things that help include preventing dogs from eating any wild animals, since that can be a source of infection. You should also test pregnant dogs to be sure the mother isn’t going to transmit an infection to her puppies."}]