[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/w29qv2r19l", "@type": "VideoObject", "duration": "PT1M25S", "name": "5327099767001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/f27b118af7fdaed8ad0e335236e94c4528133ddf.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/w29qv2r19l", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/2a0524bd63c18fecf156cfae009f10cd96cb5a83.m3u8", "transcript": "When a dog's skin is cut or wounded there is an increased risk of infection. Pio derma refers to a bacterial infection of the skin. That's very common in dogs and characterized by lesions and pustules on the skin and in some cases partial hair loss. Treatment is typically given on an outpatient basis.\n\nAnd the prognosis is good. Symptoms of hypothermia include itchiness pustules crusted skin, hair loss and dry discharge in the affected area. While this bacterial infection can occur in any breed there are a few breeds that are predisposed to developing hypodermic including German shepherds with short coats and breeds with skin folds such as Bulldogs and pugs. Other dogs at a higher risk of developing prior drama are those with current fungal infections endocrine disease and flea or food allergies.\n\nIn most cases the condition will be diagnosed through a physical examination of a dog's skin and coat in the event that the drama appears to be deeper in the dog's skin skin scraping skin biopsies and an examination of bacterial cells may be performed to see if the condition is a result of a more serious underlying medical condition, such as an autoimmune disease Dermot typically responds favorably to medical therapy and treatment is generally done on an outpatient basis. And will involve topical medications as well as oral antibiotics.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/traumatic/c_dg_dog_hematoma_seroma?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hematoma on Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Traumatic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/hematoma-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/hematoma-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/traumatic/c_dg_dog_hematoma_seroma"}, "datePublished": "October 17, 2012", "dateModified": "August 16, 2022", "description": "Learn more about seromas/hematomas on dogs, such as aural hematomas. Also the symptoms and causes associated with seromas/hematomas and how to treat them.", "articleBody": "Canine Hematoma/Seroma A hematoma is defined as a localized collection of blood outside the blood vessels. A seroma is similar except that the fluid accumulation contains only serum without red blood cells being present. Hematomas and seromas can occur anywhere in the body. Subdermal hematomas/seromas form under the skin and are probably the most commonly type of hematoma or seroma. However, hematomas and seromas can also occur within the head or brain, within other organs of the body and even on the ear (i.e., aural hematoma). Hematomas/seromas can occur in both dogs and cats. If you would like to learn how they affect cats, please visit this page in the petMD health library. Symptoms and Types Symptoms will depend on the location of the hematoma or seroma. Subdermal hematomas and seromas will result in a fluctuant swelling under the skin.Hematomas or seromas in the head/brain can cause a variety of symptoms, including coma, seizures and other neurological abnormalities.Hematomas and seromas in other organs may be asymptomatic or may cause failure or dysfunction of the organ involved.Causes Trauma is the most common cause of hematomas and seromas. Other causes include blood clotting abnormalities which lead to excessive bleeding. Diagnosis Diagnosis of a hematoma or seroma depends on the location as well. Subdermal hematomas and seromas can generally be diagnosed by physical examination coupled with evaluation of fluid withdrawn from the lesion. Hematomas and seromas in internal organs or in the brain/head may require special imaging (X-ray, ultrasound, MRI or CT scan) for diagnosis.  Treatment If small, the hematoma or seroma may reabsorb and resolve without intervention. Larger hematomas and seromas may need to be drained by your veterinarian. In some cases, it may be necessary to place a temporary drain in the area to allow further accumulation of blood and/or serum to drain from the area. See Also"}]