[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Heart Beat Problems (Premature Complexes) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_atrial_premature_complexes"}, "datePublished": "December 17, 2009", "dateModified": "August 16, 2022", "description": "There are four chambers in the heart. The two top chambers are the atria (single: atrium), and two bottom chambers are the ventricles.", "articleBody": "Atrial Premature Complexes in Dogs There are four chambers in the heart. The two top chambers are the atria (single: atrium), and two bottom chambers are the ventricles. Under normal circumstances, the heart works with exceptional synchronization between the various atrial and ventricular structures, resulting in a consistent rhythmic pattern. Atrial premature complexes result in an abnormal rhythmic disturbance, where the heart beats prematurely, before the normal timing, or pacing. Excluding animals born with a congenital heart disease, atrial premature complexes often affect older dogs, especially small-breed dogs. Atrial premature complexes (APCs) can be seen on an electrocardiogram (EKG) as a premature wave called a P wave. This P wave may be biphasic, negative, positive or superimposed on the previous T wave on the EKG. The P wave on an EKG represents the electrical conduction from the sinoatrial node in the heart to and through the atria of the heart. The QRS complex -- a recording of a single heartbeat on the EKG -- following the P wave represents the passing of this impulse through the heart’s ventricles after it passes through the atrioventricular node. The last wave on an EKG reading is the T wave which measures ventricular recovery (from charging) before the next cardiac contraction. An increase in automaticity of atrial heart muscle fibers or a single reentrant circuit can cause a premature P wave to occur. These premature atrial beats begin outside of the sinoatrial node (ectopic) -- the pacemaker of the heart -- and disrupt the normal &quot;sinus&quot; heart beat rhythm for one or more beats. Symptoms and Types Although there may be no symptoms associated with atrial premature complexes, especially in older dogs or in dogs that are normally not very active, some common signs include:     Coughing and      trouble breathing    Exercise      intolerance    Fainting      (syncope)    Cardiac murmur    Irregular heart      rhythmCauses     Chronic heart      valve disease    Congenital heart      disease (defect from birth)    Disease of heart      muscle    Electrolyte      disorders    Neoplasia    Hyperthyroidsim    Toxemias (toxic      elements in blood)    Drug toxicity      (for example, overdose of digitalis, a heart medicine)    Normal variation      in many older dogsDiagnosis You will need to provide your veterinarian with a thorough history of your dog&#039;s health leading up to the onset of symptoms. The full physical exam will include a chemical blood profile, a complete blood count and an electrolyte panel. It is crucial to search for an underlying cause for the heart disease that is bringing about the APCs. An electrocardiogram (EKG) recording can be used to examine the electrical currents in the heart muscles, and may reveal any abnormalities in cardiac electrical conduction (which underlies the heart’s ability to contract/beat). Other diagnostic tools, like echocardiograph and Doppler ultrasound, can be used to visualize the heart and its performance (rhythms, velocity of contraction).  Treatment The treatment your veterinarian administers will depend on exactly what kind of heart disease is affecting your pet and how severe it is. There are several different types of medicines that can be used, depending on the type of heart disease present. For congestive heart failure, a diuretic may be prescribed, and a drug to dilate the blood vessels (vasodilator). Digitoxin may be prescribed to decrease the heart rate and increase cardiac contractility. Living and Management Underlying cardiac diseases must be treated and kept as controlled as possible by your veterinarian. This means that you will need to take your dog to the veterinarian for frequent follow-up appointments. Sometimes, despite drug therapy, some animals will have an increased frequency of APCs, or will deteriorate to more severe signs of heart disease as the underlying disease progresses. Depending on the underlying cardiac disease, you may need to change your dog&#039;s diet to a low sodium diet. You will also need to change your daily routine with your dog, with less physical exertion so that the heart does not need to work hard. Your veterinarian will advise you on the diet and amount of activity your dog will need to be of optimum health.  "}]