[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Excess Alkali in the Blood in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Systemic", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/systemic/c_dg_alkalosis_metabolic"}, "datePublished": "June 8, 2009", "dateModified": "August 16, 2022", "description": "A delicate balance of acid and alkali exists in the blood, and bicarbonate serves to maintain the delicate balance of acid and alkali in the blood, also known as the pH balance, which is chiefly maintained by the lungs and kidneys. Metabolic alkalosis in dogs can occur when bicarbonate (HCO3) levels increase to abnormally high levels in the blood.", "articleBody": "Metabolic Alkalosis in Dogs A delicate balance of acid and alkali exists in the blood, and bicarbonate serves to maintain the delicate balance of acid and alkali in the blood, also known as the pH balance, which is chiefly maintained by the lungs and kidneys. Metabolic alkalosis in dogs can occur when bicarbonate (HCO3) levels increase to abnormally high levels in the blood. Diseases affecting the kidney and gastrointestinal tract functions are usually involved in the disruption of the acid and alkali balance in the blood. Though it must be pointed out that metabolic alkalosis is a secondary phenomenon and some other underlying disease is usually responsible for this problem. Metabolic alkalosis can occur in dogs of any breed, size, age, or gender. Symptoms and Types Symptoms are generally related to the underlying cause of the metabolic alkalosis. The general symptoms related to metabolic alkalosis include:     Weakness    Irregular heartbeats    Ileus (complete arrest of intestinal movements)    Muscle twitching    Dehydration    Seizures (rare)Causes     Vomiting    Oral administration of alkali, like bicarbonate    Administration of drugs which increase urine outflow resulting in loss of more acid    Hypoalbuminemia (decreased level of albumin – a protein in blood))    Diseases that affect secretion of bicarbonate through the kidneys, resulting in retention of more alkali than normally requiredDiagnosis After taking a complete history of your dog’s health, including a time line of how and when the symptoms began, your veterinarian will perform a physical examination on your dog. The next step will be to perform laboratory testing to check the levels of acid and alkali in the different body fluids. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. Blood gas analysis is also very useful in the diagnosis of metabolic alkalosis. The laboratory testing usually provides sufficient information for your veterinarian to be able to confirm a diagnosis.    Treatment Metabolic alkalosis does not occur independently, but as a result of an underlying cause that is responsible for the increase of alkali in the blood. Therefore, treatment of the underlying cause is of primary importance in correcting and further preventing complications of the metabolic alkalosis. In cases of severe, life-threatening metabolic alkalosis, emergency treatment is usually required. Drugs which may aggravate already existing metabolic alkalosis will be stopped. If there is vomiting, this will need to be treated, as it is one of the major factors in the development of metabolic alkalosis. Laboratory testing may need to be repeated to ensure that a complete recovery has been achieved, or whether further treatment is still required. Living and Management After returning from hospital, keep a close eye on your dog for few days. If your dog begins to vomit again, or any other abnormality observed, call your veterinarian."}]