[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Metabolic Enzyme Deficiency in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Genetic", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/genetic/c_dg_lysosomal_storage_diseases"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Lysosomal storage diseases are primarily genetic and are caused by a lack of the enzymes that are needed to perform metabolic functions. It is a rare disease that most commonly occurs in puppies.", "articleBody": "Lysosomal Storage Diseases in Dogs Lysosomal storage diseases are primarily genetic and are caused by a lack of the enzymes that are needed to perform metabolic functions. It is a rare disease that most commonly occurs in puppies. The disease causes an accumulation of various substances that would otherwise be eliminated by the enzymes, and which become stored in the dog’s tissues in abnormal amounts (usually occurring in the nervous system). As a result, cells swell and can no longer function normally. Unfortunately, lysosomal storage diseases are always fatal. Humans also suffer from separate but similar lysosomal storage diseases, and for that reason this disease has been studied more than the commonly inherited dog disorders. The following breeds are most likely to have the disease:     German shepherd    German short-haired pointer    English setter    Beagle    Cairn terrier    Blue tick hound    West Highland terrier    Portuguese water dog  Symptoms and Types     Failure to thrive    Balance problems    Exercise intolerance    Inconsistent behavior    Compromised vision    Fainting    Seizures  Diagnosis If your dog has these symptoms and is one of the previously listed breeds, your veterinarian will want to know your dog’s history so that a diagnosis can be made. The following tests are likely to be performed:     Complete blood count    Biochemical profile    Urinalysis    X-rays of chest and abdominal area    Ultrasound of abdomen    Biopsy of tissue    Enzyme measure   Treatment If the dog is weak and dehydrated, an IV will be inserted and fluids and electrolytes will be administered. A dietary plan will be also be arranged to ward off hypoglycemia (low blood sugar). Activity must be limited.  Your dog should not climb stairs, for example. Careful monitoring is required because there is a high risk of developing secondary infections. Living and Management  Restrict activity and be alert to the dog&#039;s symptoms. In addition, maintain the prescribed nutritional plan. Blood sugar, growth, and hydration status must be monitored regularly. This disease is progressive, and unfortunately, it is ultimately fatal. Remember that the disease is genetic, and inbreeding should be carefully avoided when there is a defective gene in the family. Dogs that have the disease should also never be mated."}]