[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a bartonella infection fatal to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Bartonellosis is rarely fatal in dogs. The most severe cases are those that cause severe inflammation of the heart."}}, {"@type": "Question", "name": "Can bartonella infection in dogs be cured?", "acceptedAnswer": {"@type": "Answer", "text": "It cannot be completely cured, but it can be brought down to subclinical levels. It is recommended to treat infected dogs with antibiotics, especially if they live in households with immunocompromised humans. The likelihood of transmission of the bacteria from subclinical carriers of the bartonella bacteria is unknown, but a lower risk to humans is presumed if the dog is subclinical. "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bartonella Infection in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.looks_.out_.over_.water_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.looks_.out_.over_.water_.jpg"}, "author": {"@type": "Person", "name": "Stephanie Lantry, DVM", "url": "https://www.petmd.com/author/dr-stephanie-lantry"}, "keywords": "Dog, Parasite, Tick, Flea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_bartonellosis"}, "datePublished": "May 11, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Lantry discusses bartonella infection in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Bartonella Infection in Dogs? Bartonellosis, commonly known as cat scratch fever, is a bacterial infection that dogs and cats can get in their bloodstream. It is carried by fleas, ticks, lice, and sand flies. It can cause fever and inflammation of many organs in the body, including the heart. Bartonella spreads from these bugs and parasites. The infection has a higher prevalence in the South than in other areas of the United States. Worldwide, cats are found to be more commonly infected with the bacteria than dogs. However, dogs that are used for hunting and herding and live outside or in rural settings are more likely than indoor dogs to be exposed to parasites that carry bartonella. Symptoms of Bartonella Infection in Dogs Dogs that are infected with Bartonella may show signs of: Fever Swollen lymph nodes Sore muscles; difficulty getting up or reluctance to run or jump Nose irritation such as discharge and/or nosebleeds Digestive upset (vomiting or diarrhea) Inflammation of the heart (coughing, difficulty breathing, or fainting) Causes of Bartonella Infection in Dogs The bartonella infection is spread through bites from fleas, ticks, sand flies, and lice to their hosts. The host animal can then spread the infection to people if they scratch or bite a human, making it a zoonotic disease. This is known in humans as cat scratch fever (even though it is not always transmitted by a cat scratching a human’s skin). It is less common for a human to get infected with Bartonella from a dog, which could come from a bite. There are six species of Bartonella known to infect dogs (B. henselae, B. vinsonii, B. clarridgeiae, B. elizabethae, B. washoensis, and B. quintana), but the most common is B. henselae, the strain that is responsible for cat scratch fever. How Veterinarians Diagnose Bartonella Infection in Dogs Once a veterinarian performs a complete physical exam, they may recommend a complete blood count (CBC), chemistry profile, and urinalysis. They are checking for signs of infection and inflammation and the effects on the body’s organs. Blood testing is the best way to diagnose bartonellosis in a dog. These tests are sent to veterinary diagnostic labs. IFA (immunofluorescence antibodies) testing is useful for detecting exposure to Bartonella. Cultures can also be done on blood and affected tissues, like lymph nodes or even heart valves in the case of infections causing endocarditis, inflammation of the heart.   Endocarditis is best diagnosed via an echocardiogram, an ultrasound of the heart.  Preliminary tests such as blood testing for general infection, an EKG, and chest X-rays can be done with your general veterinarian prior to referral for the echocardiogram if needed. Treatment of Bartonella Infection in Dogs The good news is that bartonellosis can be treated with antibiotics. A 4- to 6-week regimen of doxycycline, amoxicillin, or enrofloxacin has been shown to be effective in treating the infection. Because of the long course of treatment with antibiotics and the desire to prevent antibiotic resistance, treatment is primarily recommended for symptomatic animals only. Recovery and Management of Bartonella Infection in Dogs Symptoms of bartonellosis in dogs usually resolve after 2-4 weeks of treatment. Mild swelling of the glands and generalized fatigue could continue for months, though this is uncommon. Prevention of Bartonella Infection in Dogs There are no vaccines to prevent bartonellosis. Good flea and tick prevention, which can be recommended by your veterinarian, is important in preventing this disease. It is also important to monitor your dog when they are in areas where these bugs are native or prevalent, and removing any visible fleas or ticks is always a good preventive measure. Humans who are immunocompromised should avoid rough play or being bit by dogs at risk for being infected with bartonella. Puppies, who have sharp teeth and can do more nipping and biting, can be a source of infection, especially to immunocompromised people. There is no documentation that humans can be infected directly via a tick or flea. "}]