[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fractures of Upper Jaw and Lower Jaw in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/fractures-upper-jaw-lower-jaw-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/fractures-upper-jaw-lower-jaw-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_dg_upper_lower_jaw_fracture"}, "datePublished": "April 11, 2010", "dateModified": "August 16, 2022", "description": "The maxilla forms the upper jaw (Maxilla) and holds the upper teeth in place; whereas, the mandible, also called the jawbone, forms the lower jaw and holds the lower teeth in place.", "articleBody": "Maxillary and Mandibular Fractures in Dogs The maxilla forms the upper jaw (maxilla) and holds the upper teeth in place, whereas, the mandible, also called the jawbone, forms the lower jaw and holds the lower teeth in place. Fractures of the upper jaw and lower jaw (mandible) are mostly seen in dogs due to injury or trauma. Symptoms and Types Symptoms vary greatly depending upon the type, location, extent, and cause of injury. Some of the more common ones include: Facial deformityOral or nasal bleedingInability to open or close the jawFractured teethFacial distortionCauses Although various types of injuries and trauma are typically responsible for fractures of the upper and lower jaw, certain risk factors may predispose a dog to the fractures, including oral infections (e.g., periodontal disease, osteomyelitis), certain metabolic diseases (e.g., hypoparathyroidism), and congenital or hereditary factors resulting in a weakened or deformed jaw. Diagnosis You will need first be asked for a thorough history of your dog’s health, including any injuries or traumas it may have sustained in the past. He or she will then perform a complete physical examination, closely examining the oral cavity, jaw bones, teeth, and other related structures. X-rays of the oral cavity are also used to determine the location and extent of the fracture.  Treatment Surgery is most often used to repair the fracture. However, there are several methods to accomplish the surgical repair. Your dog’s veterinarian will give his or her expert opinion based on the type of fracture, available equipment, supplies, and the pros and cons of performing each option. The ultimate goal of surgical intervention is to reduce the fracture, establish the natural occlusion of bones and teeth, and stabilize the fracture to enhance the healing process. Pain killers and antibiotics are also prescribed to control pain and infections, respectively. Living and Management Overall prognosis depends on type, extent, location of trauma, quality of home care, and selection of treatment modality. Healing typically takes 4 to 12 weeks, and thus, requires good owner compliance during the treatment period to aid in healing. Wax is often prescribed to be applied over irritating wires used during surgery. And oral irrigants are used for oral hygiene and to reduce the number of bacteria in the oral cavity. After surgery, your dog will feel very sore and will need painkillers for a few days. Good pain management will help in the healing process; this involves administering pain killers at the prescribed dosage and time. A postoperative evaluation, including X-rays, will be done after to weeks to see if the fracture has been stabilized and is healing well. There is always a chance of refracture after the support has been removed, so extra care will be needed to prevent such a recurrence. Provide good cage rest and minimize any risk of trauma. Don’t allow other pets to come in contact with your dog and keep it in noise-free environment. Also, due to the involvement of the oral cavity, ingestion and chewing of food is highly painful and difficult. You will need to maintain the recommended nutritional and fluid diet during the healing process, paying extra attention to your dog’s weight. Soft food is recommended for easy chewing and ingestion."}]