[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ameba Infection in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/amoeba.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/amoeba.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_canine_amebiasis"}, "datePublished": "October 10, 2012", "dateModified": "August 16, 2022", "description": "Amebiasis is a parasitic infection caused by a one celled organism known as an ameba. It is found most often in tropical areas.", "articleBody": "Canine Amebiasis Amebiasis is a parasitic infection caused by a one celled organism known as an ameba. Amebiasis can affect people as well as dogs and cats. It is found most often in tropical areas and can be seen in North America. Symptoms and Types There are two types of parasitic ameba that infect dogs: Entamoeba histolytica and Acanthamoeba. Entamoeba histolytica: Usually an asymptomatic diseaseSevere infections can cause colitis, resulting in bloody diarrheaHematogenous spread (spread through the body via the blood stream) causes damage to and failure of major organ systems. Symptoms are dependent on the organ system involved but death is the usual outcome.Acanthamoeba: Causes granulamatous amebic meningoencephalitis (inflammation of the brain) resulting in lack of appetite, fever, lethargy, discharges from the eyes and nose, difficulty breathing and neurological signs (incoordination, seizures, etc.)Causes Entamoeba histolyticus is most often spread through the ingestion of infected human feces. There are two species of Acanthamoeba that are free-living: A. castellani and A. culbertsoni. These species can be found in freshwater, saltwater, soil and sewage. Dogs can be infected by ingesting or inhaling contaminated water, soil or sewage.Colonization of the dog’s skin by Acanthamoeba can occur and can be a cause of infection.Colonization of the cornea of the eye by Acanthamoeba can occur and can be a cause of infection.The infection can be spread through the blood stream (hematogenous spread.)Infection of the nose can spread into the brain.Young dogs and those that are immunosuppressed are the most likely to become ill. Diagnosis Blood testing (complete blood cell count and blood chemistry profile) and urine testing (urinatlysis) are usually performed and are often normal although evidence of dehydration, if present, can be seen in these tests. Other laboratory tests your veterinarian may recommend include: Biopsies of the colon obtained by colonoscopy (examination of the colon with a long cylindrical scope with a light.) Biopsies may reveal damage to the intestinal lining as well as trophozoites (a stage in the life cycle of the infecting organism.)fecal examination looking for trophozoites. Trophozoites can be difficult to find in the feces. Special stains are often used to increase their visibility.central spinal fluid (CSF) taps. Infections involving the meningoencephalitis form of the disease may show abnormalities, including an elevated white blood cell count, abnormal protein levels and xanthochromia.MRI of the brain may reveal granulomas in the meningoencephalitis form.brain biopsies. Treatment Metronidazole is used to control the symptoms of colitis and is usually successful. However, the systemic forms of the disease (i.e. infections that are spread via the blood stream) are usually fatal despite treatment although symptomatic treatment can be attempted."}]