[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is dry eye in dogs curable?", "acceptedAnswer": {"@type": "Answer", "text": "Some types of dry eye syndrome are reversible. However, the most common causes are only manageable with medication."}}, {"@type": "Question", "name": "Are dogs with dry eye syndrome in pain?", "acceptedAnswer": {"@type": "Answer", "text": "Without proper tear production, eyes become irritated, inflamed, infected, and even ulcerated. All of these conditions are extremely uncomfortable and painful for your dog."}}, {"@type": "Question", "name": "Can I use over-the-counter eye drops for my dog?", "acceptedAnswer": {"@type": "Answer", "text": "Over-the-counter artificial tears and eye lubricants are critical to the overall comfort and stability of the eyes when your dog has dry eye syndrome, especially early on. It is important to use products approved for dogs, and to discuss any product option with your vet first."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dry Eye Syndrome in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-01/corgi.eyedrops.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-01/corgi.eyedrops.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Condition, Eye health, Symptom Checker, Dry Eye", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_keratoconjunctivitis_sicca"}, "datePublished": "January 27, 2022", "dateModified": "September 12, 2023", "description": "Dr. Lauren Jones discusses dry eye syndrome in dogs, including symptoms, diagnosis, and treatment.", "articleBody": "What Is Dry Eye Syndrome in Dogs? Dry eye syndrome in dogs, also known as Keratoconjunctivitis Sicca (KCS), involves decreased or inadequate tear production. Tears are important to the lubrication, comfort, and overall health of a dog’s eyes. Tears also contain antibacterial proteins, mucus, white blood cells to fight infection, and other enzymes to help keep the eyes clear and free of debris, infection, and irritations.  A dog’s tears have three parts:  Lipid (fat) layer   Aqueous (water)  Mucin layer   Two glands, the lacrimal and third eyelid, are responsible for producing the watery layer of tears. In dogs with dry eye syndrome, these glands contribute little or nothing to the tears, even though the glands responsible for the lipid and mucin layers still function. This typically results in dry but gooey, mucous-filled eyes.  Symptoms of Dry Eye Syndrome in Dogs Dogs with dry eye syndrome can exhibit one or many of the following symptoms:  Red, inflamed, irritated, and painful eyes  Redness and swelling of the conjunctiva, or the tissues around the eye  Frequent squinting and blinking  Dryness on the surface of the cornea—the outer clear dome-shaped part of the eye  Mucous-like discharge on the cornea (may be yellow or green if a secondary bacterial infection is present)  Obvious defects and irregularities of the cornea, including increased vascularization (abnormal growth of blood vessels to the injured area) and pigmentation as the eye attempts to heal and protect itself  Possible vision impairment and blindness  Causes of Dry Eye Syndrome in Dogs The cause of dry eye syndrome in a dog can be due to one or a few underlying conditions. Your veterinarian will be able to determine what may have caused your pet’s diagnosis based on the dog’s medical history and an exam. Some of the underlying causes may be due to:  Immune system dysfunction: Most cases of dry eye syndrome in dogs are caused by the immune system attacking and destroying the lacrimal and third eyelid gland. Unfortunately, veterinarians do not know why this happens.   Medications: Certain drugs can cause dry eye syndrome as a side effect, usually very shortly after a dog starts taking these medications. This type of dry eye syndrome can be temporary and may go away once the medication is discontinued. However, permanent damage can be done, and there is no way to predict which animals will have dry eye syndrome or how long it will last. Be sure to talk with your vet about possible side effects of all medications.   Genes: Congenital alacrimia is a genetic form of dry eye syndrome and occurs in some breeds, most notably Yorkshire terriers. This is typically noticed in only one eye.   Endocrine conditions: Some systemic disease (such as hypothyroidism, diabetes, and Cushing’s disease) frequently decrease tear production.  Infectious diseases: Canine distemper virus, leishmaniasis, and chronic blepharoconjunctivitis can all lead to dry eye syndrome.  Medical procedures: A common abnormality of dogs is a prolapsed third eyelid gland (more commonly known as cherry eye). While it is not recommended, some surgeons remove the gland entirely, leading to permanent decreased tear production. Local radiation for tumors can also cause permanent damage to the lacrimal and third eyelid glands.  Neurological problems: Loss of nerve function to the glands (commonly secondary to an inner ear infection) can decrease or stop production of tears.  Traumatic injury: Dry eye syndrome can occur with damage to the glands after severe inflammation or injury (such as from wounds or car accidents).  Transient causes: Anesthesia causes a temporary loss of tear production, as does the medication atropine. Once these are removed, tear production normally returns.   How Veterinarians Diagnose Dry Eye Syndrome in Dogs Vets use the Schirmer Tear Test (STT) to diagnose dry eye syndrome and measure aqueous tear production in dogs. This is a simple, painless test involving a strip of special paper placed in the lower eyelid. The moisture and tears from the eye wick onto the paper for 60 seconds. At the end of that time, the vet measures the tear production on the paper. For test results, more than 15 millimeters of tear production per minute is normal, while less than 10 millimeters indicates dry eye syndrome. Your vet may repeat the test to confirm the diagnosis.   After the STT, your vet may also perform a fluorescein stain test to look for corneal ulcers. The stain makes an ulcer glow bright green under a black light. The vet may also use a test of intraocular pressure to look for inflammation or glaucoma. These conditions are common with dry eye and important to diagnose and treat at the same time. Treatment of Dry Eye Syndrome in Dogs Your vet will determine the best treatment for your dog, depending on their diagnosis and their previous medical history. Treatment options may include:  Lacrimostimulants: Most commonly, vets prescribe ophthalmic cyclosporine (a class of medications) or tacrolimus to stimulate tear production. Cyclosporine, when applied in the eye, keeps the immune system from harming the lacrimal and third eyelid glands, thus allowing tear restoration. Tacrolimus is typically used only if cyclosporine fails.   Lacrimomimetics: Artificial tears moisten the surface of the eye, improve comfort, and help flush debris and allergens. These eye lubricants are essential to use with primary medications for dry eye syndrome, like cyclosporine, especially early in the treatment process when tear production hasn’t fully recovered. Only use artificial tears if your vet directs you.  Antibiotics: Bacterial infections and corneal ulcerations may also require broad-spectrum topical antibiotics. Dogs whose dry eye syndrome is related to the nervous system are treated with pilocarpine, which stimulates glandular secretion.   Surgery: Dogs who don’t respond to treatment may require a surgery called parotid duct transposition, which carefully redirects saliva glands in the dog’s mouth to the eye, so that saliva can be used as tears.  Recovery and Management of Dry Eye Syndrome in Dogs Your vet will do the STT every 3-4 weeks initially to confirm the medication and treatment plan is working for your dog. If there is still inadequate tear production, dosing frequency and medications can be adjusted. Most dogs with dry eye syndrome improve within 12 weeks, with many showing positive changes within the first 6 weeks. Once a dog has adequate tear production, periodic rechecks should be scheduled, usually every 3-4 months.   Most dogs respond to the treatments available and return to normal vision and a pain-free life. Monitoring and early veterinary intervention are important. In dogs with an STT of 2-14 millimeters per minute, there is more than an 80 percent chance of regaining normal tear production. In more severe cases—dogs with a response of 0-1 millimeters per minute—the full recovery rate falls to less than 50 percent."}]