[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Canine Coronavirus", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog.iv_.drip_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog.iv_.drip_.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_canine_coronavirus_infection"}, "datePublished": "March 2, 2022", "dateModified": "August 12, 2022", "description": "Dr. Lauren Jones discusses canine coronavirus, including symptoms, diagnosis, and treatment.", "articleBody": "What is Canine Coronavirus? Canine coronavirus is a highly infectious viral disease affecting dogs all around the world. Its name is based on the virus appearing to resemble a crown when viewed under a high-powered microscope.   Canine coronavirus is very different from the human novel coronavirus causing the pandemic of 2020 (COVID-19). Canine coronavirus is not transmissible to humans. Canine coronaviruses are, however, highly contagious between dogs.   Canine coronavirus often causes mild or hard-to-spot symptoms; however, it can be fatal under certain conditions. Because canine coronavirus is highly contagious, it is common in kenneled dogs but can also occur in healthy dogs who have no symptoms of the virus.   There are two main types of canine coronavirus in the United States: enteric and respiratory.   Enteric canine coronavirus spreads through feces and causes damage to the cells lining the gastrointestinal tract. Dogs typically display clinical signs related to gastrointestinal upset, such as vomiting, diarrhea, and lethargy.   Respiratory canine coronavirus spreads through the air and enters the lungs. It is part of a larger respiratory disease complex in dogs and causes coughing, sneezing, and difficulty breathing.   Symptoms of Canine Coronavirus Symptoms of canine coronavirus vary based on the strain.   When a dog has canine enteric coronavirus (CECoV), the virus travels to the intestinal cells and replicates quickly, destroying those cells in the process. Young, immunocompromised, or stressed dogs (such as those in dogs shows or shelters) may have more severe symptoms.   Those symptoms may include:   Diarrhea (sometimes bloody)   Vomiting  Decreased appetite  Painful abdomen  Lethargy  Dehydration  Fever  Seizures in severe cases  Canine respiratory coronavirus (CRCoV) is part of the complex disease called Canine Infectious Respiratory Disease, or CIRD. Healthy dogs can also carry this virus without obvious symptoms. Typically, dogs acquire CRCoV in addition to other bacteria and viruses, including:   Canine distemper virus  Canine parainfluenza virus  Canine adenovirus  Canine influenza virus  Canine herpesvirus  Canine reovirus  Canine pneumovirus  Bordetella bronchiseptica bacteria  Mycoplasma bacterial species  Streptococcus species  Zooepidemicus species  Canine respiratory coronavirus is a common cause of quick-onset upper respiratory disease in dogs, especially those in crowded or stressful settings. The virus attacks the cells lining the lungs, causing damage, and allowing other opportunistic bacteria to follow.   Symptoms can vary from mild to severe depending on the other bacteria involved. Common symptoms include:  Coughing  Sneezing  Difficulty breathing  Eye discharge  Nasal discharge  Gagging/regurgitation at the end of the cough  Fever  Lethargy  Decreased appetite  Causes of Canine Coronavirus Canine coronavirus is highly contagious and spreads quickly between dogs. Dogs develop canine enteric coronavirus through ingestion of infected feces. The incubation period after exposure is 1-3 days. Dogs, symptomatic or not, may then shed the virus in their feces for 2 weeks.   Canine respiratory coronavirus is transmitted through:  Respiratory secretions aerosolized and inhaled  Direct contact between dogs  Contaminated objects that may easily carry bacteria or viruses, such as blankets, bowls, toys, etc. How Veterinarians Diagnose Canine Coronavirus If your vet suspects your dog has canine coronavirus, they will perform an examination. This may include reviewing your dog’s health history and current symptoms. They will ask you about any concerns you have about your dog’s health including behavior and noticeable symptoms.  Blood Chemistry Test &amp; Complete Blood Count  Depending on the severity of your dog’s symptoms, your veterinarian may recommend performing a blood chemistry test and complete blood count to have a clear overall picture of your dog’s health. This can help determine if your dog requires antibiotics, or other treatments.  X-Ray  Your vet may take x-rays of your dog’s abdomen and chest to rule out other diseases that cause similar symptoms. Treatment of Canine Coronavirus Your veterinarian will treat your dog’s canine coronavirus based on health history and current symptoms. Because there is not a specific treatment for canine coronavirus, your veterinarian will prescribe treatment of your dog’s symptoms to lessen their severity.    Dogs with both CECoV and CRCoV may not require any treatment at all because many dogs recover on their own. Depending on the severity, some dogs may receive outpatient treatment such as:   Fluids for hydration  Oral anti-nausea medications   Oral anti-diarrheal medications   Gastrointestinal prescription foods   Probiotics to re-establish gastrointestinal flora   Anti-inflammatories and/or cough medicine for coughing in dogs with CRCoV   More severe cases may require hospitalization with:   IV fluids for hydration  IV antibiotics and/or anti-nausea medications   Nutritional support—feeding tubes or total parenteral nutrition  Appetite stimulants  Heat support  Oxygen or use of a nebulizer for dogs with CRCoV  Recovery and Management of Canine Coronavirus Most dogs will recover fully within two weeks from both the enteric and respiratory strains. However, dogs who have been hospitalized due to canine coronavirus may require one (or more) follow-up visits to the vet to assess their recovery progress.   Overall, the prognosis for both the enteric and respiratory forms of canine coronavirus is good, unless in severe cases or in young animals. Especially with early veterinary intervention and supportive care, most dogs quickly recover.  Cleaning the environment, especially in shelters or large pack environments, is important to prevent canine coronavirus. Common disinfectants like bleach kill canine coronavirus. It is also important to quarantine symptomatic dogs to prevent the spread of either strain of canine coronavirus to other dogs.   Prevention of Canine Coronavirus Although there is a vaccine for canine enteric coronavirus, most veterinarians do not recommend administering it, because it’s not been proven effective at preventing the virus. There are, however, vaccines for other types CIRD that are considered part of the standard recommended vaccines by the American Animal Hospital Association.  Featured Image: iStock.com/GoodLifeStudio"}]