[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Irregular Heart Rhythms in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_idioventricular_rhythm"}, "datePublished": "April 26, 2010", "dateModified": "August 16, 2022", "description": "When the sinus node&#039;s conduction impulses are blocked or inhibited from reaching the ventricles, the role of pacemaker is taken over by the lower heart, resulting in indioventricular rhythm, or ventricular escape complexes; that is, irregular heartbeats.", "articleBody": "Idioventricular Rhythm in Dogs When the sinus node&#039;s conduction impulses are blocked or inhibited from reaching the ventricles, the role of pacemaker is taken over by the lower heart, resulting in indioventricular rhythm, or ventricular escape complexes; that is, irregular heartbeats. Accelerated idioventricular rhythms occur mainly due to a fluctuation in the heartbeat. Sometimes the ECG reading will show a dog&#039;s heart beat rate at less than 65 beats per minute (bpm). The normal rate for dogs is 70-180 bpm – but varies according to age and breed. For puppies, the rate is 70-120 bpm, and for toy breeds, the rate is 70-220 bpm. This electrical conduction system generates electrical impulses (waves), which propagate throughout the musculature of the heart, stimulating the heart&#039;s muscles to contract and push blood through the interior arteries and out into the body. There are two nodes (masses of tissue) present in the heart that play an important role in this conduction system. The sinus node, or sinoatrial (SA) node, is a clustered collection of similar cells located in the right atrium, its purpose being to generate electrical impulses and to serve as the heart&#039;s pacemaker. The other node is called the atrioventricular (AV) node. The AV node receives impulses from the SA node, and after a small delay, directs the impulses to the ventricles. This delay allows for the atrium to eject blood into the ventricle before the ventricular muscles contract. Clinical examination will show an ECG reading a P wave that is absent or is hidden between the QRS complex (the recorded measurement for a single heartbeat). Rarely does it come after the QRRS complex; the P wave is generally found occurring in the wrong place (ectopic). There is no connection between the P waves and the QRS complex on the ECG graph. Arrangement of the complex QRS is disoriented. It is very wide and  aligns with the complex of the premature ventricular system. Only dogs that have a weak body mechanism or underlying disease will suffer from this disease, healthy dogs are not affected by this disorder. In addition, this disease does occur due to gene organization and does not appear to have any hereditary basis. However, a disposition has been found to occur in some breeds more than others. For example, Springer Spaniels are known to present with atrial standstill – an absence of electrical activity in the atria, which shuts down the heart mechanism and affects the blood flow. In addition, other breeds, like Pugs, Dalmatians, and the Schnauzers, are known to suffer conduction irregularities. The prevalence of this disease has not yet been determined. Symptoms and Types Although there are some cases where there are no visible symptoms whatsoever, some of the more typical ones include:     Weakness    Heart failure    Lethargy    Irregular fainting    Intolerance to exerciseCauses  Sinus bradycardia or sinus arrest     Increase in the vagal tone (the impulse that inhibits the heart from beating too frequently)    Kidney failure    Addison’s disease    Hypothermia    Hypoglycemia    Hypothyroidism    Drugs – anesthetics, digoxin, quinidine, or tranquilizersAV block     Neoplasia (abnormal tissue growth)    Fibrosis    Lyme disease (tick borne infection)    CongenitalDiagnosis You will need to give your veterinarian a thorough history of your dog&#039;s health and onset of symptoms. Any previous illnesses, especially those that required medication, will need to be covered fro your veterinarian to make a prompt and accurate diagnosis. Standard laboratory tests include a complete blood profile, a chemical blood profile, a complete blood count, and a urinalysis. The blood test will show any metabolic abnormalities that are present in your dog&#039;s body. Your veterinarian will also check for possible side effects due to medications, such as digoxin, tranquilizers, or anethetics that have been used to treat your dog. An electrocardiogram (ECG, or EKG) recording can be used to examine the electrical currents in the heart muscles, and may reveal any abnormalities in cardiac electrical conduction (which underlies the heart’s ability to contract/beat), or may show a structural heart problem. If a mass is suspected it can be visualized on X-Ray or ultrasound, and in the case that one is found, your veterinarian may need to take a sample of the mass for biopsy. Slow heart beat rate, and varying P and QRS waves can also help in diagnosing idioventricular rhythm.  Treatment Idioventricular rhythm does not have any standard treatment since it is a secondary disease. That is, it is secondary to another underlying condition, it does not exist as a solitary condition. The underlying condition will need to be treated, along with treatment that is done to alleviate the outward symptoms. The focus will be on increasing the heart rate and maintaining a stable rhythm. Medications may be prescribed for increasing the heart rate, or for blocking the vagal tone. If the medication therapy is not effective, a pacemaker implant may be used for maintaining the heartbeat and stabilizing the heart valves. Living and Management Your dog will need a lot of rest in order to recover properly. Cage rest is recommended in this case, since it can both give an animal a sense of security, and prevent the animal from overexerting itself. There is no need to alter your dog&#039;s diet plan, unless there is a specific health concern that would lead your veterinarian to make that recommendation. If the underlying cause cannot be diagnosed or treated, the prognosis for recovery is guarded to poor. One of the possible serious complications is congestive heart failure due to a prolonged state of bradycardia."}]