[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Miscarriage Due to Bacterial Infection (Brucellosis) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_brucellosis"}, "datePublished": "September 30, 2009", "dateModified": "August 16, 2022", "description": "Brucellosis is a contagious bacterial disease that affects several animal species. In dogs, this condition is caused by a bacterium known as Brucella canis.", "articleBody": "Brucellosis in Dogs Brucellosis is a contagious bacterial disease that affects several animal species. In dogs, this condition is caused by a bacterium known as Brucella canis. The bacteria are typically spread through breeding and through contact with tissue remains from miscarried pregnancies, but may also be spread through an infected mother’s milk. An infected bitch may spontaneously abort the pregnancy, or may have a marked decrease in her fertility levels. If she does carry the puppies to term, they often still die as a result of infection, since puppies have undeveloped immune systems that are not capable of fighting these aggressive bacteria. Brucellosis is highly contagious amongst dogs. It frequently affects kenneled dogs, but dogs that have never been kenneled may also become infected. This disease is responsible for a decrease in 75 percent of pups that are weaned in breeding kennels. The Brucella bacterium has zoonotic properties, meaning that it can affect humans, and possibly other animals as well. Though chances for human infection are found to be quite low, it is still best to take preventative precautions while treating an infected dog. An extra sanitary environment, along with personal protection (e.g., disposable gloves) should be standard until the infection has been eradicated entirely. While brucellosis can affect any breed of dog, it is commonly seen in beagles. The causative organism has a tendency to replicate successfully in the reproductive organs of both male and female dogs.  It causes abortion and infertility in female dogs, and testicular atrophy and infertility in male dogs. Symptoms and Types Female:     Typically appears healthy    Vaginal discharge    Decrease in fertility    Loss of sex desire    Abortion (usually 6-8 weeks after conception, though may abort at any stage of pregnancy)    Birth of weak pupsMale:     Swollen scrotal sacs in males due to infection of testicles    Shrinkage of testicles    InfertilityBoth genders:     Inflammation of the eyes/cloudy eyes    Back pain due to infection of spinal disks    Leg pain or weakness    Weakness    Lethargy    Swollen lymph nodes    Fever    Loss of control over movements in chronic casesDiagnosis You will need to provide a thorough history of your dog&#039;s health leading up to the onset of symptoms. Once your veterinarian has thoroughly examined your dog, standard fluid samples will be taken for laboratory testing. However, often it is the case with Brucella canis that it is not diagnosed with standard blood tests; laboratory test results are usually normal. A combination of various serological tests may be necessary in order to confirm the diagnosis, but usually, a titer test will verify that your dog is infected with the Brucella bacterium. This test measures your dog&#039;s antibody levels and will show whether there are specific antibodies to the Brucella organism in your dog&#039;s blood. To confirm the presence of Brucella, your veterinarian will take blood samples to grow the organism on culture media in the laboratory. Similarly, cultures of vaginal fluids or semen can also be used for isolation of the causative organism. As the lymph nodes are also affected by this infection, a lymph node biopsy can also be used in some cases for diagnostic purposes.  Treatment The major goal of therapy is to eradicate the causative organism from the dog, but this may be difficult to achieve in all animals. Antibiotic treatment is employed to treat these patients, but treatment is not always 100 percent effective. Breeding a dog that has or has had brucellosis is not recommended under any circumstance. For this reason, your veterinarian will be insistent on spaying or neutering your dog to prevent any chance of contamination. In kenneled situations, euthanasia is often recommended. Brucellosis has the potential for being spread zoonotically to humans. For this reason, people who have autoimmune disorders, or who are susceptible to infection should not keep a dog that is infected with brucellosis. Living and Management This disease can be difficult to treat, so you must adhere to the recommendations and guidelines given to you by your veterinarian. After the initial treatment, some tests may need to be conducted again every month for three months in order to evaluate progress. If your dog is not responding well to the treatment, depending on the severity of your dog&#039;s condition, your veterinarian will recommend re-treatment, neutering, or euthanasia. Regular monitoring of the disease status in kennels is important, and quarantine measures, along with testing, should be conducted before introduction of new animals to the kennel. If you dog is, or has been infected, do not sell it or give it to anyone else and do not breed your dog under any circumstance.  Animals that have been diagnosed with brucellosis are considered positive for this disease for the rest of their lives; periodic treatment with antibiotics to reduce the number of bacteria in the body is the only option for minimizing symptoms and for shedding of causative organisms. Prevention All intact male and female dogs should be tested for Brucella canis every three to six months, and all breeding dogs should be tested before breeding takes place."}]