[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Miscarriage in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/miscarriage-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/miscarriage-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_spontaneous_abortion_pregnancy_loss"}, "datePublished": "July 1, 2008", "dateModified": "August 16, 2022", "description": "", "articleBody": "Spontaneous Abortion and Pregnancy Loss in Dogs There are several methods for performing a safe abortion for a dog, as well as instances in which the pregnancy could spontaneously abort or miscarry. It is important to note that dogs can experience spontaneous abortions and lost pregnancies for a variety of medical reasons. If a dog owner is considering aborting an unwanted pregnancy, seeking professional medical advice and assistance is recommended, so that a full risk and side effect evaluation can be done. In the event that the pregnancy is lost or spontaneously aborted, your pet should be evaluated and monitored, as there are several possible medical conditions that could be the cause.The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the petMD health library. Symptoms and Types  If your dog has experienced a miscarriage, the most common thing you may notice is abnormal vaginal bleeding; in some cases an expelled fetus may be found. The most common cause of a spontaneous abortion is fetal death due to a hormonal imbalance. In the case of a planned abortion, bleeding is the most common symptom following the procedure. You will need to closely monitor your dog so that any side effects or health related issues can be responded to quickly. Causes Some types of the most common causes of spontaneous abortions in dogs are: B. Canis – This bacterium is extremely widespread among kenneled dogs, as it can be easily transmitted. This disease causes both stillbirths and conception failures. It is usually characterized by a prolonged vaginal discharge and can occasionally be accompanied by such complications as arthritis (spondylitis) and inflammation of the eye (uveitis). Also, it is common for dogs to have bacteria in the bloodstream (bacteremia) for up to 18 months after the spontaneous abortion. Mycotic Abortion – This fungus most commonly causes excessive bleeding in the uterus and can lead to an aborted fetus.Fetal Death – If the dog has a hormonal imbalance it can lead to the fetus&#039; death, either causing a stillbirth or a spontaneous abortion.Neospora Caninum – This is a parasite generally found in dogs. It can be transmitted if the dog ingests contaminated water, food, feces or infected animal flesh.Diagnosis Standard blood tests can be used to detect the presence of parasites or B. Canis. If the pregnancy loss is due to another reason, an abnormal amount of discharge will be noticeable. A veterinarian can use an ultrasound to detect a viable pregnancy, or to look for anything remaining in the dog&#039;s uterus following a miscarriage or termination. This is because the dog&#039;s uterus will occasionally be unable to expel all the pregnancy matter effectively on its own (e.g., placental tissue), leading to infection or internal hemorrhaging. [ pagebreak]  Treatment For dogs that have experienced a spontaneous abortion due to bacteria or a parasite, a veterinarian will diagnose the condition and offer a variety of options for medical treatment. In addition, the dog should be carefully monitored for signs of a more serious medical condition. Living and Management Following a miscarriage, there can be a great deal of discomfort and/or some vaginal bleeding or abnormal discharge. Many cases exist where some long-term bacterial issues arise. Pet owners should carefully observe the behavior of their dog to ensure no serious problems develop as a result."}]