[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Prostate Gland Enlargement in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/prostate-gland-enlargement-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/prostate-gland-enlargement-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_benign_prostatic_hyperplasia"}, "datePublished": "September 30, 2009", "dateModified": "August 16, 2022", "description": "Hyperplasia, as a medical condition, is the indicative term used to describe an abnormal growth in the number of cells in any organ. In this case, the prostate gland.", "articleBody": "Benign Prostatic Hyperplasia in Dogs The prostate gland is an essential part of the male reproductive system, secreting a liquid that contains simple sugars, citric acid, calcium, and a number of enzymes that work to balance out and protect the seminal fluid, aiding in its motility and survival so that it can fertilize a viable egg. Benign prostatic hyperplasia (BPH) is a common age-related problem in dogs. Hyperplasia, as a medical condition, is the indicative term used to describe an abnormal growth in the number of cells in any organ. In this case, the prostate gland. When the condition is of a benign nature, enlargement of the prostate gland does not cause pain in the dog. This condition is commonly seen in intact dogs around 1-2 years of age. Incidence typically increases with age, affecting an estimated 95 percent of dogs by the time they reach nine years of age. Symptoms and Types Most dogs do not show any symptoms at all. Following are few of the possible symptoms related to this condition: Bloody discharge from urethraBlood in urineBlood in ejaculateDifficulty in urinationDifficulty with defecationRibbon like stoolsOther symptoms may be present if a prostatic infection or carcinoma (malignant tumor) developsCauses Age related; usually affects older dogsHormonal imbalancesDiagnosis You will need to give a thorough history of your dog&#039;s health and onset of symptoms. Your veterinarian will perform a thorough physical exam on your pet, with standard fluid samples taken for laboratory analysis, including a chemical blood profile, a complete blood count, and a urinalysis. Laboratory tests will commonly return positive results of blood in the urine. Pus or bacteria may be also present if an infection is present. Your veterinarian will take a sample of prostatic fluid through ejaculation or by prostatic massage which may show the presence of blood. Further diagnostic testing will include X-ray and ultrasonography imaging, which will help your veterinarian to determine the size of the prostate gland, and to estimate how the size of the prostate is affecting your dog. Using the ultrasound as a guide, samples can also be collected directly from prostate gland for analysis.  Treatment In most cases no treatment is required. Castration is the best method for treat this condition – both to avoid recurrence and to prevent conditions which might encourage a carcinoma to develop. In those cases in which castration is not feasible, there may be some medicines that your veterinarian can use to shrink the enlarged prostate gland. However, recurrence may still occur after medical therapy. Living and Management Benign Prostate Enlargement (BPH) is an age-related problem and castration is the best method for avoiding or treating this problem in dogs."}]