[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "High Level of Plasma Proteins in the Blood of Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_hyperviscosity_syndrome"}, "datePublished": "April 11, 2010", "dateModified": "August 16, 2022", "description": "High blood viscosity, a thickening of the blood, typically results from markedly high concentration of blood plasma proteins, although it can also result (rarely) from an extremely high red blood cell count.", "articleBody": "Hyperviscosity Syndrome in Dogs High blood viscosity, a thickening of the blood, typically results from markedly high concentration of blood plasma proteins, although it can also result (rarely) from an extremely high red blood cell count. It is most frequently seen as a paraneoplastic syndrome (the consequence of the presence of cancer in the body), and is often associated with multiple myeloma (a cancer of the plasma cell) and other lymphoid tumors or leukemias. The clinical signs that are associated with hyperviscosity are caused by reduced blood flow through smaller vessels, high plasma volume, and associated coagulopathy (a defect in the body&#039;s mechanism for blood clotting). There are no gender or breed predilections, and it is more common in older dogs. Symptoms and Types     No      consistent signs    Loss of      appetite (anorexia)    Lethargy    Depression    Excessive      urination and excessive thirst    Blindness,      unsteadiness    Bleeding      tendencies    Seizures      and disorientation    Rapid      heartbeat and rapid breathing if congestive heart failure present owing to      volume overload    Nosebleed      or other bleeding in the mucus membranes    Visual      deficits associated with engorged retinal vessels, retinal hemorrhage or      detachment, and optic swellingCauses     Multiple      myeloma and plasma cell tumors    Lymphocytic      leukemia or lymphoma    Marked      polycythemia (a net increase in      the total number of blood cells)    Chronic      atypical inflammation with monoclonal gammopathy (in which an abnormal      protein has been detected in the blood [tick fever can cause this in      dogs])    Chronic      autoimmune disease (e.g., systemic lupus rheumatoid arthritis)Diagnosis Hyperviscosity is a syndrome, not a final diagnosis; however, your veterinarian will want to know what accounts for the symptoms. Your veterinarian will perform a thorough physical exam on your pet, taking into account the background history of symptoms and possible incidents that might have led to this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. Your doctor will be specifically looking at total plasma protein count and evidence of blood disorders. Once a diagnosis has been confirmed, your veterinarian will work out a treatment plan.  Treatment Generally, dogs that present with this disease are treated as inpatients. It will be the underlying disease that will be the focus of the treatment. The total treatment plan will be based upon whether the symptoms are being caused by cancer or by an inflammatory condition. Living and Management Even after you take your dog home, your veterinarian will want to monitor your dog&#039;s serum or plasma proteins frequently to mark the effectiveness of the treatment. Follow-up blood tests will also be conducted, along with urinalyses from time to time, to determine how well your dog is dealing with its disease."}]