[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Prostatic Cysts in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Endocrine health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_prostatic_cysts"}, "datePublished": "November 17, 2008", "dateModified": "August 16, 2022", "description": "Prostatic cysts in the dog have several associations: changes in the cells brought on by hormonal changes; retention cysts within the prostate that are cavitating (capable of forming a cavity in the tissue or organ); fluid-filled lesions with a distinct capsule (sac-like enclosure); and paraprostatic (close to the prostate) cysts that are cavitating, fluid-filled lesions with a distinct capsule.", "articleBody": "Cysts in the Prostate Prostatic cysts in the dog have several associations: changes in the cells brought on by hormonal changes; retention cysts within the prostate that are cavitating (capable of forming a cavity in the tissue or organ); fluid-filled lesions with a distinct capsule (sac-like enclosure); and paraprostatic (close to the prostate) cysts that are cavitating, fluid-filled lesions with a distinct capsule. Prostatic cysts range in diameter from a few millimeters to more than 20 centimeters. Paraprostatic cysts usually arise on top and alongside the prostate, displacing the bladder, or at the back of the prostate in the pelvis. These cysts affect intact male dogs between the ages of two and twelve years, with large dogs more commonly affected than small dogs. Symptoms and Types     Asymptomatic (without symptoms)    Lethargy and loss of appetite (anorexia)    Abdominal distention (swelling)    Constipation, if the cyst compresses the rectum    Difficulty urinating, if the cyst compresses the urethra    Urethral dischargeCauses     Benign prostatic enlargement    Androgenic hormones    Estrogenic hormonesDiagnosis Your veterinarian will perform a thorough physical exam on your pet, taking into account the background history of symptoms and possible incidents that might have precipitated this condition. Several ailments could account for these symptoms, and several diagnostic procedures will be used to determine exactly what is causing them in your dog. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. Fluid from the prostate will be gathered, either by ejaculation, or by prostatic massage, in order to test the fluid for infection. Ultrasound will be used as a visual aid for guiding a fine-needle to the prostrate in order to draw fluid from any cysts. This process is referred to as fine needle aspiration.  Treatment Cysts within the prostate may be treated with medications; however, your veterinarian may recommend castration as a way of resolving the condition and preventing future occurrences. Large cysts may need to be drained with ultrasound guidance prior to medication, while some cysts may need to be removed surgically. Living and Management Following treatment, your veterinarian will want to check on the progress of the cysts by examining the prostrate, using ultrasound or x-ray imaging. After the initial treatment, your doctor will evaluate the size of the cysts at four week intervals."}]