[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Corneal Disease (Inherited) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/corneal-disease-inherited-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/corneal-disease-inherited-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_corneal_dystrophies"}, "datePublished": "April 8, 2009", "dateModified": "August 16, 2022", "description": "Corneal dystrophy is an inherited progressive condition which affects both eyes, often in the same way. The cornea, the clear outer layer of the front of the eye, is most affected.", "articleBody": "Corneal Dystrophies in Dogs Corneal dystrophy is an inherited progressive condition which affects both eyes, often in the same way. The cornea, the clear outer layer of the front of the eye, is most affected. This disease is not associated with other diseases, and is relatively common in dogs. There are three types of corneal dystrophy, categorized by location: epithelial corneal dystrophy, where cell formation is affected; stromal corneal dystrophy, where the cornea will become cloudy; and endothelial corneal dystrophy, where the cells of the lining of the cornea are affected. Symptoms and Types Epithelial corneal dystrophy:  Possible corneal spasmsVision is normalWhite or gray circular or irregular opacities or rings on corneaAge of onset six months to six yearsSlow progressionShetland sheepdogs are predisposedStromal corneal dystrophy: Vision usually normal, although it may be reduced with advanced diffuse opacityThere may be oval or circular opacities: white, gray or silverDiffuse opacityAnnular (doughnut-shaped) opacityStrikes young adult dogsDog breeds that are predisposed to epithelial and stromal dystrophies: Afghan houndAiredale terrierAlaskan malamuteAmerican cocker spanielBeagleBearded collieBichon friseCavalier King Charles spanielGerman shepherdLhasa apsoMastiffMiniature pinscherRough collieSiberian huskySamoyedWeimaranerWhippetEndothelial corneal dystrophy: There is a swelling of the cornea with fluid blisters developing on the corneaVision may be impaired with advanced diseaseDogs are typically middle-aged or older at the onset of clinical signs; a female predilection is also suggestedAffects young animalsDogs breeds that are predisposed to corneal dystrophy: Boston terriersChihuahuasDachshundsMay affect other breedsCauses Epithelial Degenerative or innate abnormalities of the corneaStromal An innate abnormality of the corneaEndothelial Degeneration of lining of the corneaDiagnosis Your veterinarian will perform a thorough physical exam on your dog, including an ophthalmic exam. Your veterinarian will order a blood chemical profile, a complete blood count, an electrolyte panel and a urinalysis. will need to provide a thorough history of your dog&#039;s health leading up to the onset of symptoms. Slit lamp microscopy will aid significantly in differentiating the type of corneal dystrophy present, and a fluorescein stain, a non-invasive dye that shows details of the eye under blue light, will be used to examine the eye for abrasions, and to define the shape of the cornea so that your veterinarian can diagnose the corneal dystrophy. Fluorescein dye enables visualization of any corneal ulcers that may be present; these types of ulcers occur with endothelial and epithelial corneal dystrophy. Fluorescein dye is inconsistent in its ability to aid in diagnosis of endothelial corneal dystrophy, and is not of much use in the diagnosis of stromal corneal dystrophy, but it can be helpful in the diagnosis of epithelial corneal dystrophy. A tonometer will be used to measure the interior pressure in your dog’s eyes so as to rule out glaucoma as a possible cause of corneal swelling.  Treatment If your dog has corneal ulcers, they will treated with antibiotic eye medications. Stromal corneal dystrophy usually does not require treatment. Endothelial corneal dystrophy may be treated by using contact lenses over your dog&#039;s eyes. Epithelial corneal tags may be removed, if present. Another possible treatment for endothelial corneal dystrophy is flap surgery of the conjunctiva (the lining of the eyeball and the back surface of the lids). While a corneal transplant may be beneficial, results are inconsistent. Living and Management Your dog will probably always have some cloudiness to its eyes, even when treatment has been successful. However, if you notice that your dog’s seems to be in pain because of its eyes (e.g., blinking, watering of the eyes) contact your veterinarian, as ulcers may be developing on the cornea. This is prevalent with endothelial and epithelial corneal dystrophy. It is possible that your dog’s vision will remain normal despite corneal dystrophy."}]