[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does a dog&#039;s false pregnancy last?", "acceptedAnswer": {"@type": "Answer", "text": "Typically 2-3 weeks, sometimes longer."}}, {"@type": "Question", "name": "Is false pregnancy in dogs dangerous?", "acceptedAnswer": {"@type": "Answer", "text": "No. These hormonal changes are natural and will not harm your dog."}}, {"@type": "Question", "name": "How can I help my dog through a false pregnancy?", "acceptedAnswer": {"@type": "Answer", "text": "You can help your dog by taking her to the vet to rule out any other conditions, then keeping her comfortable. Use a T-shirt, a cone, or an inflatable collar to prevent her from licking or stimulating her nipples and mammary glands, which could cause irritation and milk production."}}, {"@type": "Question", "name": "How common is false pregnancy in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "It only occurs in unspayed female dogs, and occasionally in female dogs who have recently been spayed. False pregnancy is part of a normal hormonal cycle, so some degree of symptoms is fairly common in unspayed female dogs."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "False Pregnancy in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/dalmatian-picture.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/dalmatian-picture.jpg"}, "author": {"@type": "Person", "name": "Aja Senestraro, DVM", "url": "https://www.petmd.com/author/dr-aja-senestraro"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_false_pregnancy"}, "datePublished": "October 20, 2021", "dateModified": "August 12, 2022", "description": "Dr. Aja Senestraro explains false pregnancy in dogs: which dogs get it, what to watch out for, and when to take your dog to the vet.", "articleBody": "What Is False Pregnancy in Dogs? False pregnancy in dogs is also called pseudopregnancy or pseudocyesis. This condition can occur in unspayed female dogs because of normal changes in hormone levels. These hormone changes trick the body into thinking it is pregnant and about to give birth. Symptoms of False Pregnancy in Dogs False pregnancy in dogs causes the same behavioral and physical changes as a dog that is actually pregnant. Behavioral Changes The most common symptoms of phantom pregnancy in dogs are restlessness and nesting. Your dog might bring blankets or other objects to their bed to create a nest, and may be reluctant to leave this area. They may also “mother” objects like toys, carrying them around, putting them in their nest, and protecting them. False pregnancy in dogs can cause them to be anxious—and even reactive or defensive—if their nest or their “puppies” are disturbed or moved. Some dogs become so intense in these behaviors that they may not eat much. Physical Changes Physically, dogs that are experiencing a false pregnancy go through changes to prepare for puppies to be born. Their mammary glands (breasts) and nipples enlarge evenly, and they may even produce some milk. This swelling can be uncomfortable, so your dog might lick at the glands, causing irritation. Their bellies could even contract. Rarely, dogs with false pregnancy can also develop increased thirst, which means they need to pee more often. Sometimes dogs with this condition can become hungrier than usual. Causes of False Pregnancy in Dogs False pregnancy in a dog is the result of a rapid decrease in the hormone progesterone and an increase in the hormone prolactin. These hormonal changes occur normally in an unspayed female dog about 6-8 weeks after she’s been in heat. The same hormonal changes can also occur in a female dog who was spayed during a part of the heat cycle when she had high progesterone. The spay causes the same rapid progesterone decrease as the normal heat cycle, and this can result in a false pregnancy within 3-14 days of being spayed. How Vets Diagnose False Pregnancy in Dogs If your dog is showing signs of a false pregnancy, bring her to the vet. If her symptoms, history, and physical exam findings all fit this condition and there’s no chance that your dog is actually pregnant, then a false pregnancy can be diagnosed by your vet without additional testing. If there is a possibility your dog could be pregnant, then the vet will test her blood for levels of a hormone called relaxin to help determine if it’s a true pregnancy. An ultrasound or x-ray can also be used to see if she is carrying puppies. There are other issues, some of them serious, that can cause similar symptoms. If there could be other causes for your dog’s symptoms besides a false pregnancy, your vet will do a complete physical exam. Additional testing could include bloodwork, urine tests, x-rays, ultrasound, or a biopsy of the swollen mammary glands. Treatment for False Pregnancy in Dogs Usually, false pregnancy in dogs resolves in 2-3 weeks without any treatment. For dogs that are irritating their nipples by licking them, a T-shirt, cone, or inflatable collar may be needed. Avoid milking or touching your dog’s nipples and mammary glands, as this will encourage more milk production. In severe cases, medication can be given that blocks the prolactin hormone that causes the symptoms. Recovery and Management of False Pregnancy in Dogs Since false pregnancy in dogs is due to a hormonal change, your dog should be back to normal within a few weeks as her hormones cycle again. Female dogs who aren’t spayed and experience false pregnancies often have them during every heat cycle. Spaying stops the heat cycle and hormonal changes, so it will prevent future false pregnancies. However, if a dog is spayed during an episode of false pregnancy, that won’t stop the symptoms."}]