[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Salmon Poisoning Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/salmon-poisoning-disease-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/salmon-poisoning-disease-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_salmon_poisoning_disease"}, "datePublished": "January 9, 2009", "dateModified": "August 16, 2022", "description": "Salmon poisoning disease (SPD) is an often fatal condition, occurring when a dog eats raw salmon that is infected with the Neorickettsia helminthoeca parasite. This disease typically begins in the tissues of the small intestine, where it causes hemorrhaging. It gradually becomes systemic, invading the entire body.", "articleBody": "Salmon poisoning disease (SPD) is an often fatal condition, occurring when a dog eats raw salmon that is infected with the Neorickettsia helminthoeca parasite. This disease typically begins in the tissues of the small intestine, where it causes hemorrhaging. It gradually becomes systemic, invading the entire body. Symptoms and Types The signs and symptoms of SPD include the following: FeverDiarrheaVomitingSwollen lymph nodes (lymphadenopathy)Discharge from the nose and eyesCauses Dogs contract the Neorickettsia helminthoeca parasite when they consume raw fish, including raw salmon, trout, and other fish that contain the N. helminthoeca organisms, like the trematode vector. Diagnosis To diagnose SPD, your veterinarian will need to rule out other conditions that are known to cause similar symptoms, including: Poisoning from food products or toxinsCanine parvovirus type 2 (a contagious virus which is common in puppies)Ehrlichiosis (sometimes known as canine typhus fever, or rickettsiosis)Canine distemper (a virus known to cause stomach upset)Once these alternate conditions have been ruled out, your doctor will collect fluid from a swollen lymph node to test for Rickettsial bodies. This can be done using the Giemsa stain technique, which stains the DNA of parasites, making them visible under microscope. Your doctor will also perform an examination of the feces to discover whether the organism Nanophyetus salmincola has laid eggs in the feces, which will also confirm a diagnosis of SPD. Other findings may include changes in the lymph tissue, which may show yellowish tissue in the lymph node, and blood within the intestinal contents.  Treatment Very ill patients will need inpatient treatment. Treatment will involve intravenous fluid therapy to replace lost fluid, antibiotic therapy, and therapy to control diarrhea. Some dogs may also need electrolyte replacement therapy and/or blood transfusions.   Living and Management Animals will need to be adequately cared for and proper hygiene will need to be maintained to help the animal return to good health. Your veterinarian may recommend that you keep your dog caged for a short time to prevent overexertion while it is recovering. This will also help you monitor your pet’s progress toward recovery. Prevention The most effective way to prevent SPD in a dog is to preclude it from consuming raw fish."}]