[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live after being diagnosed with prostatic adenocarcinoma?", "acceptedAnswer": {"@type": "Answer", "text": "The average survival time after diagnosis varies depending on whether or not treatment is performed. As disease is often advanced once a diagnosis is made, survival time is very short. If no treatment is pursued, euthanasia is usually performed within a month of diagnosis. Depending on the treatment used, survival times average around 7 months after diagnosis.  "}}, {"@type": "Question", "name": "How aggressive is prostatic adenocarcinoma in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Canine prostatic adenocarcinoma is very locally aggressive and has a very high metastatic rate. "}}, {"@type": "Question", "name": "Is prostatic adenocarcinoma curable in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Prostatic adenocarcinoma is not curable, but it may be successfully removed with surgery in some cases.   References Axiak, S. M., &amp; Bigio, A. Canine prostatic carcinoma. Compendium, 34. 10th ed; 2012   Cohn, L. A., &amp; Côté, E. Cote’s Veterinary Clinical Advisor Dogs and Cats. 4. Elsevier. 2020: 828–831.  Iowa State University Lloyd Veterinary Medical Center. (n.d.). Canine prostate carcinoma.   Featured Image: istock.com/uchar"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Prostate Cancer in Dogs (Prostatic Adenocarcinoma)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/old.dog_.sleeping.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/old.dog_.sleeping.jpg"}, "author": {"@type": "Person", "name": "Joel DeJaynes, DVM", "url": "https://www.petmd.com/author/dr-joel-dejaynes"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_adenocarcinoma_prostate"}, "datePublished": "December 13, 2021", "dateModified": "August 12, 2022", "description": "Dr. Joel DeJaynes explains canine prostatic adenocarcinoma, including their symptoms, diagnosis, and treatment.", "articleBody": "What Is Prostate Cancer (Prostatic Adenocarcinoma) in Dogs?  The prostate gland is located near the neck of the bladder in male dogs, close to where the urethra exits the bladder. The urethra passes through the prostate gland after exiting the bladder. The canine prostate gland produces some of the fluid found in semen.   Cancer of the prostate occurs when the cells of the prostate gland grow out of control. The most common type of prostate cancer in dogs is adenocarcinoma. The age of the average dog at diagnosis is 10 years old. Like human men, aging dogs can also have a benign (harmless) enlargement of the prostate. Prostatic cancer in general in dogs is rare.  The exact cause for this cancer is unknown, but there are certain risk factors such as the dog’s environment and genetics that may play a role.   Like other types of adenocarcinomas, prostatic adenocarcinoma is highly metastatic, meaning it easily spreads to other parts of the body. In fact, prostatic adenocarcinoma spreads in more than 85% of dogs that develop this type of cancer.   Common sites for the spread of prostatic adenocarcinoma include:  Other parts of the urinary tract   Lymph nodes   Lungs   Abdominal organs such as liver and spleen   Bone  Uncommon (but reported) sites of spread also include the brain and spinal cord.  Symptoms of Prostate Cancer in Dogs The most common symptoms of prostate cancer in dogs are related to the urinary tract. As the prostate enlarges, it compresses the urethra, which leads to abnormal urinary habits such as straining to urinate, frequent urination with only small amounts of urine produced at a time, blood in the urine, and the complete inability to urinate.   Symptoms of prostatic adenocarcinoma, however, may not be limited to just the urinary tract. If the cancer spreads, other organs can be affected. The mass may invade into the bladder, which can cause further bleeding, infection, and trouble urinating. Potential damage to the kidneys can occur if a ureter (the tube that transports urine from the kidneys to the bladder) becomes obstructed.   If the prostatic mass is very large, there may be compression of the colon. This can lead to straining to defecate and abnormal-appearing stools.   Metastasis  This type of cancer readily spreads to other nearby organs, including:   Lungs: May cause coughing, abnormal breathing, potential fever, loss of appetite, and weight loss.  Bones: May cause lameness at the site of spread. This can be characterized by a limp in the specific limb, or possibly both hind limbs if the pelvis is the site of spread.  Brain or spinal cord: May result in neurological dysfunction, such as the inability to walk and abnormal behavior.  Causes of Prostate Cancer in Dogs The exact cause for development of cancer in the canine prostate has not been identified, but both intact and castrated male dogs can develop prostatic adenocarcinoma.   A few risk factors such as environment and genetics may have a link to development of prostatic adenocarcinoma, but the exact cause is unknown. A potential link between neutering too early in life and the increased risk of development of prostatic adenocarcinoma has been found.  How Veterinarians Diagnose Prostate Cancer in Dogs Diagnosis of prostatic adenocarcinoma will be made with a combination of clinical signs, a thorough physical exam, and diagnostics.   The first screening tests will include blood work and a urinalysis. Blood work may show signs of anemia (low red blood cell count) and infection or inflammation (high white blood cell count). The urine will be checked for abnormalities such as evidence of blood, bacteria, inflammation, or cancerous cells.  As prostatic carcinoma is very metastatic, radiographs (x-rays) of the abdomen and chest will be performed. A radiograph of the abdomen may show an enlarged prostate or possible mineralization of the prostate. The bony structures of the pelvis and spine will be evaluated for possible signs of metastasis.   Because the lungs are a very common place for spread, chest radiographs will most likely be obtained. Chest radiographs may show nodules within the lungs.  Advanced diagnostics, such as an abdominal ultrasound or CT scan, may also be performed. An abdominal ultrasound will allow for a more detailed examination of the prostate and the nearby lymph nodes, as well as the rest of the urinary tract and remaining abdominal organs.   A CT scan may be performed less commonly but can allow for very detailed information on the prostate and possible sites of metastasis.  Cytological (cell) samples can also aid in the diagnosis of prostatic carcinoma. Samples may be obtained by catheterization, prostatic wash, or fine needle aspiration.  Treatment for Prostate Cancer in Dogs If caught very early in the disease process, before metastasis has occurred, surgical removal of the diseased portion of the prostate may be considered. Surgery is often followed by radiation therapy or chemotherapy.   If metastasis has already occurred, then palliative care should be considered. The goal of palliative care is to relieve pain and any clinical symptoms that may be present, while also trying to improve your dog’s quality of life for as long as possible.   If a urinary obstruction is present, a small tube called a stent may be placed within the urethra to keep it open so the dog can urinate. Surgery of the prostate is not often performed when advanced disease is present because of the high risk of complications. Radiation therapy may be considered in certain cases.  Your veterinarian may also recommend a nonsteroidal anti-inflammatory drug (NSAID) to relieve pain. Any urinary tract infection that may be present will be treated with appropriate antibiotics. Chemotherapy may be considered, but long-term efficacy has not been established.   Recovery and Management of Prostate Cancer in Dogs If disease is detected early, before any spread has occurred, then more definitive treatment may be performed to extend survival time. Once the cancer has spread, management of clinical signs is often performed until the disease progresses too far to control.   Overall prognosis for prostatic adenocarcinoma is poor. Euthanasia may be required once quality of life has deteriorated or clinical signs cannot be controlled. "}]