[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How can I treat my dog&#039;s seborrhea at home?", "acceptedAnswer": {"@type": "Answer", "text": "After seeing a vet to confirm your dog’s diagnosis, you can treat seborrhea at home by using an anti-seborrheic shampoo containing coal tar and salicylic acid. Home treatment also includes bathing your dog every 2 to 7 days on a schedule set by your vet. You will also clean your dog’s ears with a medicated ear cleaner every 2 to 3 days. If an underlying health issue is causing your dog’s seborrhea, you’ll need to follow all treatment protocols for that illness to ensure the seborrhea is properly managed. If your dog’s seborrhea is not improving, however, take them to the veterinarian. They might have developed bacterial and yeast infections of the skin and ears that require a prescription medication."}}, {"@type": "Question", "name": "Does seborrhea in dogs cause hair loss?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, it can cause hair loss."}}, {"@type": "Question", "name": "What does seborrhea smell like on dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Seborrhea can smell very badly, like grease, corn chips, or a strong doggy scent."}}, {"@type": "Question", "name": "Is seborrhea in dogs contagious?", "acceptedAnswer": {"@type": "Answer", "text": "No, seborrhea is not contagious to other dogs or humans.   Image Credit: iStockphoto.com/photo-vista.de"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Seborrhea in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/brown-dog-scratching-itself-picture-id1155876248.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/brown-dog-scratching-itself-picture-id1155876248.jpg"}, "author": {"@type": "Person", "name": "Emily A. Fassbaugh, DVM", "url": "https://www.petmd.com/author/dr-emily-fassbaugh"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_canine_seborrhea"}, "datePublished": "October 20, 2021", "dateModified": "March 24, 2023", "description": "Dr. Emily Fassbaugh explains seborrhea in dogs, including how to identify and treat this skin condition, and why it’s so important to address the underlying cause.", "articleBody": "What Is Seborrhea in Dogs? Seborrhea in dogs is a condition that affects keratin in the skin. Keratin is a protein that gives skin and hair its form. In canine seborrhea, keratin is produced in the wrong amounts—either too much or not enough. Seborrhea causes dogs to have a coat of hair that’s dry and lackluster or greasy. Seborrhea in dogs can be what veterinarians call “primary” or “secondary.” Primary Seborrhea in Dogs Primary seborrhea is a genetic disease that always causes the dog to produce abnormal keratin. American Cocker Spaniels, West Highland White Terriers, English Springer Spaniels, and Basset Hounds are the most common breeds to have primary seborrhea, but any dog can have this condition. Secondary Seborrhea in Dogs With secondary seborrhea, an underlying issue is causing your dog to make abnormal keratin.  Health issues that can cause secondary seborrhea include: Hormonal imbalances Allergies Vitamin deficiencies Immune-mediated diseases such as lupus  Lymphoma of the skin Symptoms of Seborrhea in Dogs Possible symptoms of seborrhea in dogs are: Very dry, dull coat Dandruff Greasy, oily skin that smells bad Crusted, plaque-like (rough and scaly) skin lesions Itching that ranges from mild to severe Large amount of earwax and ear debris Generally, all the skin is affected by seborrhea, but the folds of skin between the toes, in the armpits, on the belly and perineum (the area under a dog’s tail), and at the bottom of the neck are usually worse. Dogs with lots of skin folds, like Basset Hounds, usually experience more affected skin in those folds.   Causes of Seborrhea in Dogs The cause of a dog’s seborrhea depends on whether it’s primary or secondary. Causes of Primary Seborrhea in Dogs Primary seborrhea is a congenital, genetic disease that typically starts at a young age and gets worse as your dog gets older. West Highland White Terriers, Basset Hounds, American Cocker Spaniels, and English Springer Spaniels are most commonly affected. Causes of Secondary Seborrhea in Dogs Diseases and other health issues that can cause secondary seborrhea in dogs include: Skin allergies to fleas, food, and the environment Hypothyroidism, caused by an underactive thyroid gland Cushing’s disease, caused by an overactive adrenal gland Diabetes mellitus Mites and lice Autoimmune diseases like pemphigus foliaceus, sebaceous adenitis, and lupus erythematosus A type of cancer called cutaneous epitheliotropic lymphoma Vitamin deficiencies like zinc-responsive dermatosis and vitamin A-responsive dermatosis How Vets Diagnose Seborrhea in Dogs Diagnosis of seborrhea starts with a physical examination by your veterinarian to check your dog’s skin and look for other symptoms. You will also be asked how long it has been happening, if your dog has been scratching, and if there are any changes in your dog’s food and water intake. Your veterinarian will perform testing to determine the cause of your dog’s skin condition. The following tests could help: A skin scraping to test for mites and lice An impression cytology (collection) of skin and ear debris to test for a yeast or bacterial infection that looks like seborrhea, such as Malassezia yeast A blood chemistry panel to screen for diabetes or Cushing’s disease (your vet will need further tests to confirm the diagnosis before starting treatment) A blood test for thyroid hormone levels to determine whether your dog has hypothyroidism A biopsy to look for autoimmune disease or cancer Treatment for Seborrhea in Dogs Based on the test results, your veterinarian will have a better understanding of what is causing your dog’s seborrhea. The most important aspect of seborrhea treatment is treating any underlying conditions. Treating the Underlying Cause Hypothyroidism: If your dog has hypothyroidism, they are treated with hormone replacement, an oral medication called levothyroxine that your dog will take for the rest of their life. Cushing’s disease: Treatment of Cushing’s disease involves lifelong medication called Vetoryl.  Diabetes: Treatment of diabetes requires daily insulin injections.  Cancer or autoimmune disease: If a biopsy shows that your dog has autoimmune disease or cancer, they will be started on medication to manage the disease, or your veterinarian may refer you to a specialist.  Lice or mites: If a skin scraping finds lice or mites, the veterinarian will put your dog on medication to kill the parasites. Fleas: If your dog has fleas, a monthly flea preventative will curb flea allergies that can cause or worsen seborrhea. Vitamin deficiency: If your veterinarian suspects vitamin A-responsive dermatitis or zinc-responsive dermatitis, they will recommend additional vitamins in your dog’s diet.  Food allergy: If your veterinarian suspects a primary food allergy, they may recommend a hypoallergenic food trial. Infection: If your dog has an infection that developed because of seborrhea, then the infection must be treated. Your dog will require a three- to four-week course of oral antibiotics and/or antifungals.  Treating the Seborrhea Itself To treat the seborrhea itself, your dog needs frequent baths with anti-seborrheic shampoos, typically every 2 or 3 days to start with. These shampoos typically contain coal tar and salicylic acid. Frequent bathing is continued for 2-3 weeks or longer, until the skin improves. The goal of bathing is to remove excess keratin. Depending on how your dog responds to treatment, bathing frequency may decrease to every 1 to 2 weeks, or it may stay at every 2 to 3 days. Additionally, you will need to clean your dog’s ears with a medicated ear cleaner every 2 to 3 days. If there is an infection in the ears, your veterinarian will prescribe an ear medication as well.  Your dog may also be started on prednisone to decrease inflammation and debris buildup. Regular rechecks with your veterinarian, typically every one to three weeks, are important to monitor how your dog is responding to treatment. Recovery and Management of Seborrhea in Dogs Recovery and management depend on the cause of the seborrhea. If a primary cause of seborrhea can be found, managing the primary disease is key.  It can take several weeks for the signs of seborrhea to resolve, and the primary disease-causing seborrhea will need to be managed for life. It is also important to understand that once seborrhea is present, abnormal keratin placement in the skin will continue to occur. Using anti-seborrheic shampoos and ear cleaners on a schedule recommended by your vet for the rest of your dog’s life helps to decrease keratin buildup and prevent infections.  If your dog gets itchier or develops skin lesions, schedule an appointment with your veterinarian as soon as possible. Management of seborrhea often requires a lifelong routine of bathing and ear cleaning, but with consistent treatment, your dog can enjoy a good quality of life."}]