[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Intestinal Parasitic Infection (Strongyloidiasis) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_strongloidiasis"}, "datePublished": "May 29, 2010", "dateModified": "August 16, 2022", "description": "Strongyloidiasis is an intestinal infection with the parasite Strongyloides stercoralis (S. canis). Typically, only the female nematode will be present in the dog&#039;s intestinal lining, causing, among other things, severe diarrhea.", "articleBody": "Strongyloidiasis in Dogs Strongyloidiasis is an intestinal infection with the parasite Strongyloides stercoralis (S. canis). Typically, only the female nematode will be present in the dog&#039;s intestinal lining, causing, among other things, severe diarrhea. S. stercoralis is relatively host-specific, but there is a potential for transmission to humans. Symptoms and Types     Inflammation of the skin, rash (dermatitis)    Cough, bronchopneumonia    Diarrhea or constipation, especially in newborn puppies    Blood in stool    Mucus in stoolCauses There are several ways your dog may become infected with S. stercoralis, including skin penetration, ingestion of contaminated feces, and nursing from an infected bitch. There is an increased prevalence of stronglyoidiasis in kennels, especially when there is poor sanitation and high temperatures and humidity. Diagnosis The challenge your veterinarian will face will be distinguishing the cause of the dog&#039;s symptoms, which may be due to several other parasites or bacteria or viruses. He or she may culture a sample of your dog&#039;s feces, or perform a colonoscopy on the animal to identify the infective agent.  Treatment Unless intravenous fluid supplementation is needed to stabilize your dehydrated dog, it will be treated as an outpatient. Preferred anthelmintic medication, which destroy and remove internal parasites, include ivermectin and fenbendazole. Living and Management Your veterinarian will want to schedule monthly fecal examinations monthly for the first six months after treatment to assure clearance of infection. During this time, your dog will intermittently shed parasitic larvae and require regular deworming sessions. He or she will also recommend a thorough cleaning of your pet&#039;s area and/or kennel to eradicate any potential larvae. You should, however, take precaution when handling the dog or items used by the animal, as humans can sometimes become infected with S. stercoralis., causing rashes, severe abdominal discomfort, and diarrhea."}]