[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fungal Infection of the Lower Urinary Tract in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Urinary", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/urinary/c_dg_lower_urinary_tract_infection_fungal"}, "datePublished": "September 14, 2010", "dateModified": "August 16, 2022", "description": "Fungal infections are uncommon in dogs. Fungi are usually found on the skin of dogs and are also prevalent in the environment. Because of the widespread existence of fungi in the environment, these organisms are harmless most of the time, or the body is adept at fighting off any ill effects the fungus might have. In some cases, thought not all, some types of fungus can cause symptoms of infection in the body. The fungus may inhabit and infect the lower urinary tract and may also appear in the urine after being released from the kidneys.", "articleBody": "Fungal Infection of the Bladder and/or Urethra in Dogs Fungal infections are uncommon in dogs. In fact, because of the widespread existence of fungi in the environment, these  organisms are harmless most of the time, or the body is adept at  fighting off any ill effects brought on by the fungus. In some cases, thought not all, some types of fungus can cause symptoms of infection in the body. For example, fungi may inhabit and infect the lower urinary tract and may also appear in the urine after being released from the kidneys. Dogs of any age, breed, or gender may be affected. Symptoms and Types Even when a fungal infection has become well established in the lower urinary tract, there are many dogs that display no clinical symptoms. However, in others the following symptoms may be seen:     Difficulty in passing urine    Increased frequency of small amounts of urine    Blood in urine (hematuria)Causes Following are the risk factors which may predispose your dog to a lower urinary tract fungal infection:     Diabetes mellitus    Surgery    Placement of urinary catheters    Concurrent lower urinary tract bacterial infections    Excessive use of antibioticsDiagnosis You will need to give your veterinarian a thorough history of your dog’s health, including a description of the symptoms and any events that might have occurred around the time of onset, such as field outings, visits to wooded areas, lakes, etc. After taking a detailed history, your veterinarian will conduct a complete physical examination on your dog. Laboratory tests will include a complete blood count (CBC), biochemistry profile, and urinalysis. The results of the complete blood count and biochemistry profile are often normal.  However, if a fungal infection has spread to other body organs, the abnormalities in these tests will depend on which of the organs is being affected. Urinalysis is important in the diagnosis of this disease as the fungus is often passed into the urine and the laboratory testing may confirm the presence of the fungus in urine. Your veterinarian will also recommend a urine culture test, which will allow for the growing and identification of the causative fungus. Various species of fungi can be identified on the basis of their different growth patterns and characteristics on culture. More specific tests are also available for the identification of the most common species of fungi that cause infections in animals. Your veterinarian will recommend these tests if the fungus that is involved in the infection could not be identified by the culture testing.  Treatment Fungal infections are relatively uncommon in dogs, usually occurring in the presence of other certain risk factors that are known to predispose a dog to fungal infections. Identifying and correcting these risk factors is important for the overall treatment of these infections. Antifungal drugs are prescribed to eliminate the infection, with the duration of the treatment varying according to the individual animal. A urinary catheter may be used to infuse drugs directly in to the lower urinary tract. Repeat infusions may be required for complete recovery. Living and Management In some dogs long-term treatment may be required for the complete resolution of clinical symptoms. During treatment, urine samples will again be collected and sent to the laboratory for culture testing. Usually two urine cultures are performed at a 10-14 day interval to see if the fungal infection has resolved or not. The fungal culture will be repeated two months after the cessation of therapy. You’ll need to take care of your dog’s diet and also adhere to your veterinarian&#039;s recommendations regarding treatment. Monitor the appearance of your dog&#039;s urine for changes in the color of the fluid, or to note if the dog is having difficulty urinating. If anything appears out of the ordinary, consult your veterinarian so that adjustments to the treatment can be made."}]