[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Eyelash Disorders in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/eyelash-disorders-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/eyelash-disorders-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_dg_trichiasis_distichiasis_ectopic_cilia"}, "datePublished": "October 20, 2009", "dateModified": "August 16, 2022", "description": "Trichiasis, distichiasis, and ectopic cilia are eyelash disorders that are found in dogs. Trichiasis is in-growth of the eyelashes; distichiasis is an eyelash that grows from an abnormal spot on the eyelid; and ectopic cilia are single or multiple hairs that grow through the inside of the eyelid.", "articleBody": "Trichiasis, Distichiasis, and Ectopic Cilia in Dogs    Trichiasis, distichiasis, and ectopic cilia are eyelash disorders that are found in dogs. Trichiasis is in-growth of the eyelashes; distichiasis is an eyelash that grows from an abnormal spot on the eyelid; and ectopic cilia are single or multiple hairs that grow through the inside of the eyelid. In all of these conditions, the eyelash hair can come into contact with and damage the cornea or conjunctiva of the eye. These conditions are commonly seen in young dogs but dogs of any age or breed may be affected. However, trichiasis does tend to appear more frequently in Pekingese, English cocker spaniel, pugs, and bulldogs; distichiasis is common in cocker spaniels, miniature long haired dachshunds, English bulldogs, golden retrievers, toy and miniature poodles, Shetland sheepdogs and Pekingese; and ectopic cilia are more commonly found in dachshunds, lhasa apsos, shih tzus, boxers, golden retrievers, and Shetland sheepdogs. Symptoms and Types  Trichiasis Change in pigmentation of the iris (colored portion of the eye)Abnormal ticking or twitching of the eyelid (blepharospasm)Overflow of tears (epiphora)Swelling of eyesDistichiasis Mostly no symptoms can be seenStiff cilia (eyelash)Pawing at eyeAbnormal tick or twitch of eyelid (blepharospasm)Overflow of tears (epiphora)Increased blood vessels in the corneaChange in iris pigmentationCorneal ulcersEctopic cilia Eye painSevere abnormal ticking or twitching of the eyelid (blepharospasm)Overflow of tears (epiphora)Causes Facial conformation and breed predispositionUnknown etiology in many catsDiagnosis Your veterinarian will carefully inspect the eye structures and eyelashes to discern exactly which eyelash disorder your dog has. The diagnosis is usually straightforward in most cases. Your veterinarian will perform a Schirmer tear test to measure tear production and evaluate whether the affected eye is producing enough tears to keep it moist, and a fluorescein stain over the surface of the eye to make corneal ulcers visible. Determination of intraocular (within the eye) pressure is also an important test in evaluating the eye. This test will allow your veterinarian to evaluate the level of fluid pressure inside the eye. More specific testing may be performed to evaluate both the superficial and deep structures of eye.     Treatment Eliminating the eye irritation will resolve symptoms in most cases. In case of trichiasis, in some patients the hair will be cut short to prevent eye irritation. In others patients surgery may be required for correction of the defect. In distichiasis no treatment is usually required. Hairs that have been mechanically plucked will regrow within four to five weeks, and will need to removed again. In some cases of distichiasis, surgery may be required. For example, in cases where the hair is a frequent irritation to the surface of the eye. In case of ectopic cilia, surgery is the preferred method for removing the ectopic eyelash hairs. Living and Management Observe your dog&#039;s eyes and consult your veterinarian if you notice any recurrence of symptoms. Keep the eyes clean, either with fresh water, or with a veterinarian recommended eye wash. In cases of distichiasis, re-growth is common, in which case you may need to revisit your veterinarian for follow-up care."}]