[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Clotting Deficiency (Liver Related) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Liver health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_coagulopathy_of_liver_disease"}, "datePublished": "May 26, 2010", "dateModified": "August 16, 2022", "description": "The liver is the primary site of synthesis of coagulation, anticoagulant, and fibrinolytic proteins. In fact, only five blood clotting factors are not produced there. Therefore, liver diseases that cause clotting issues in dogs can be very serious and sometimes life-threatening.", "articleBody": "Coagulopathy of Liver Disease in Dogs  The liver is the primary site of synthesis of coagulation, anticoagulant, and fibrinolytic proteins. In fact, only five blood clotting factors are not produced there. Therefore, liver diseases that cause clotting issues in dogs can be very serious and sometimes life-threatening. Symptoms and Types     Black feces due to digested blood (melena)    Bright red blood in the feces (hematochezia)    Vomiting or spitting up blood (hematemesis)    Prolonged bleeding after drawing blood, urine, or from recent surgical wounds    Spontaneous bruising (rare)Causes The causes of coagulopathy of liver disease are abundant, including:     Severe liver failure    Acute viral liver disease    Cirrhosis (hardening and shrinking of the liver with loss of functional tissue)    Extrahepatic bile duct obstruction (EHBDO)    Vitamin K deficiency linked to severe intra- or extrahepatic cholestasis (blockage of the bile ducts) or steatorrhea (fat in the feces due to trouble digesting fat since enzymes the liver makes are lacking).    Portosystemic Vascular Anomaly (PSVA), causing insufficient blood flow to the liverDiagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to the veterinarian. He or she will then perform a complete physical examination as well a biochemistry profile, urinalysis, complete blood count (CBC), and electrolyte panel. Hemostatic tests like prolonged activated partial thromboplastin time (APTT), activated clotting time (ACT), prothrombin time (PT), thrombin clotting time (TCT), and Proteins invoked by Vitamin K Absence (PIVKA) are useful for measuring the severity of the dog’s inability to clot normally.  Tests can also be performed to detect low coagulation/anticoagulant factor (antithrombin (AT) and protein (C) activity. X-rays, meanwhile, are used to identify liver abnormalities, fluid in the abdomen, abnormal intestinal motility and thickening in affected areas.     Treatment In many cases, invasive procedures are unnecessary unless there is severe hemorrhaging. Fresh whole blood, fresh frozen plasma, cryoprecipitate or platelet-rich plasma are viable options to treat hemostatic disorders. However, if the dog has fluid buildup in the abdomen, a sample should be taken to determine if it is due to a hemorrhage or ascites. This must be done with extreme care to avoid exacerbating the problem. Living and Management A vitamin-rich, well-balanced diet is vital for a quick recovery. Deworming your pet of parasites can also help prevent future intestinal bleeding."}]