[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Intestinal Tumor (Leiomyoma) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/intestinal-tumor-leiomyoma-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/intestinal-tumor-leiomyoma-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_leiomyoma"}, "datePublished": "April 27, 2010", "dateModified": "August 16, 2022", "description": "A leiomyoma is a relatively harmless and non-spreading tumor that arises from the smooth muscle of the stomach and intestinal tract.", "articleBody": "Leiomyoma of the Stomach, Small, and Large Intestine in Dogs A leiomyoma is a relatively harmless and non-spreading tumor that arises from the smooth muscle of the stomach and intestinal tract. The main concern is that this type of tumor can block the normal progress of fluids and solids through the digestive tract, or displace organs, resulting in secondary health complications. It typically occurs in middle-aged to older dogs, generally over six years of age. Otherwise, there is no gender or breed predisposition. Symptoms and Types Stomach  VomitingOften no abnormal findingsSmall intestine  VomitingWeight lossRumbling stomachGas (flatulence)May feel mid-abdominal massOccasionally distended, painful loops of small bowelLarge intestine and rectum  A feeling of incomplete defecation (tenesmus)Bright red, bloody stools (hematochezia)Sometimes protrusion of the rectal wall through the anus (rectal prolapse)May feel palpable mass during rectal examinationCauses Unknown Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms, and possible incidents that might have led to this condition. He or she will first be looking for evidence of a foreign body in the digestive tract, or an inflammatory bowel disease, parasitic infection, or pancreatitis.  Once a tumor has been confirmed, your veterinarian will need to differentiate it from a cancerous gland tumor. There are different types of cancerous tumors that can affect the digestive tract, including leiomyosarcoma, a cancer that grows from the smooth muscle of the digestive tract; and lymphoma, a solid neoplasm that originates in the lymphocytes -- a type of white blood cell in the bloodstream. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. Your doctor may need to order an abdominal ultrasound, which may reveal a thickened wall of the stomach or bowel. Gastric leiomyoma is most common at the esophageal–gastric junction, where the esophagus meets the stomach cavity. If necessary, a special imaging technique called a contrast study may be used. This study will involve giving the dog an oral dose of liquid material (barium) that shows up on X-rays. Films are then taken at various stages to examine the passage of the barium through the body. This technique may reveal a space-occupying mass in the digestive tract. Double-contrast radiography of the large intestine and rectum may also be used to reveal a space-occupying mass in these organs. Your veterinarian may also perform an upper gastrointestinal tract endoscopy, by which a flexible tube with an attached camera is inserted into the space to be examined, in this case the gastrointestinal tract, allowing the doctor to visually inspect the space for abnormalities. These devices also have attachments for gathering samples of tissue and fluid, so that a biopsy can be performed to confirm the preemptive diagnosis. If a tumor is suspected, your doctor will need to perform a mucosal biopsy, and if possible, will take a tissue sample of the mass in the gastrointestinal tract. This method is often not useful for the diagnosis of deep tumors. In these cases, a more invasive surgical biopsy is often required to confirm the diagnosis.  Treatment Surgical resection (removal) is the treatment of choice. This method is generally curative if the tumor can be removed safely. In many cases, owing to their benign nature, even large leiomyomas with narrow margins can be removed successfully. Living and Management If your doctor is able to perform a complete resection, normal postoperative care will be required; no additional follow-up will be necessary. However, your doctor will want to monitor your dog&#039;s blood glucose postoperatively, particularly if your dog was hypoglycemic (low in blood sugar) prior to surgery."}]