[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Heart Murmurs in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-854129862.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-854129862.jpg"}, "author": {"@type": "Person", "name": "Janice Thomas, DVM", "url": "https://www.petmd.com/author/dr-janice-thomas"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_heart_murmur"}, "datePublished": "January 19, 2023", "dateModified": "January 20, 2023", "description": "Dr. Janice Thomas explains what a heart murmur is, what a heart murmur sounds like and underlying conditions that may cause a heart murmur in a dog.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. What Are Heart Murmurs in Dogs? A heart murmur is the noise made when there is abnormal movement of blood through the heart. An abnormal flow of blood changes or muffles the normal (lub-dub) heartbeat sound. Murmurs are common in dogs, but they are only a symptom or sign of disease. So treatment and care are usually aimed at the underlying condition. The heart is composed of four chambers: left atrium, left ventricle, right atrium, and right ventricle. Between each atrium and ventricle, there is a “door” called a valve. Each valve prevents blood from flowing back into the previous chamber and keeps it moving in the right direction at the right time. The circuit of blood through the body is as follows: body  right atrium  tricuspid valve  right ventricle  pulmonary valve  lungs  left atrium  mitral valve  left ventricle  aortic valve body, then the cycle repeats. As the blood flows through each valve, it produces a sound. When a veterinarian uses a stethoscope to listen to the heartbeat of a healthy dog, they can hear the closing of the mitral and tricuspid valves (lub) and the closing of the aortic and pulmonary valves (dub). There are four main reasons for an abnormal flow of blood in the heart: Abnormal valve shape or size Obstruction of the valve or in the chamber Back-flow of blood through a valve because the valve does not shut tightly Abnormal opening between structures What Does a Heart Murmur Sound Like? With a stethoscope, veterinarians can hear a regular heartbeat (lub-dub) in dogs. But, when there is an abnormal flow of blood, the murmur changes or muffles the normal heartbeat sound. A murmur can have a distinct “whoosh,” “shoosh,” or continuous muffle. With each progressive stage of murmur, the sounds become more intense. Heart Murmur Grades in Dogs Heart murmurs in dogs are graded on a scale of I to VI. As the grade increases, the murmur becomes easier to hear and indicates the disease process is advanced. Grade I: Least serious; murmur is barely heard with a stethoscope and requires a very quiet room to hear it Grade II: Soft; murmur is easily heard with a stethoscope Grade III: Loud; murmur is easily heard with a stethoscope on one side of chest Grade IV: Loud; murmur is heard on both sides of chest Grade V: Very loud; murmur is felt with hand when placed against chest Grade VI: Most severe, loudest; murmur is felt through chest wall and easily heard with a stethoscope off the chest Symptoms of Heart Murmurs in Dogs A heart murmur is only one sign of an underlying disease. Other signs associated with heart murmurs in dogs include: Coughing Weakness, collapsing, or fainting Exercise intolerance Decreased stamina Heavy breathing while resting Pale or blue gums Poor growth Weight loss Poor oral/dental health How Veterinarians Diagnose Heart Murmurs in Dogs The sound a heart murmur creates is detected with a stethoscope during a physical exam. To identify the underlying condition, veterinarians rely on the following:  X-rays: determine the physical size of the heart and allow a view to surrounding organs, such as the lungs. Electrocardiograms (ECGs): detect irregular heartbeats, abnormal heart rates, and arrhythmias (irregular rhythms). Echocardiograms (echos): determine the location of a heart murmur and, in some instances, indicate the speed and direction of blood flow across valves and in the chambers.  Blood work: identifies underlying diseases that cause murmurs, such as heartworm disease, anemia, and hypothyroidism, by adding stress on the heart, worsening the heart murmur. The result of each test provides one piece of the puzzle, and when put together, the vet can identify the problem causing the murmur. Treatment of Heart Murmurs in Dogs Treatment of heart murmurs in dogs focuses on identifying the underlying disease and ways to address it. To promote heart health, your dog may be put on a combination of specialized diet, medication, and supportive care. Your vet may recommend physical exam visits every 6 months to monitor the murmur. This may include repeated testing, depending on your pet’s condition.  Some heart defects that are present since birth may be surgically corrected. A small group of murmurs that are common in puppies are called benign (innocent or physiological) murmurs. These do not require any treatment because they usually resolve by 16 weeks of age. Regular monitoring every 3-4 weeks is advised to ensure that no other problems develop until the murmur resolves. Heart medications are used for dogs with advanced stages of the disease. Not every cause of a heart murmur is related to heart disease, but if needed, these medications promote healthy blood flow (decreasing stress on the heart) and improve the heart’s ability to pump efficiently.  Diuretics improve the kidney’s ability to remove excess water from the body and improve blood flow (furosemide)Angiotensin Converting Enzymes inhibitors open blood vessels and decrease fluid retention to promote smoother blood flow (benazepril or enalapril).Inodilators improve the heart muscle’s ability to pump and relax blood vessels to allow blood to flow more easily (Pimobendan).Medications often need adjustments to find the right combination for each pet. Nutrition is a great way to encourage the health of your pet. For dogs with advanced heart disease, diets are aimed to decrease the retention of sodium and chloride and promote healthy blood flow. Options include: Purina Pro Plan Veterinary Diets CC CardioCare Royal Canin Veterinary Diet Canine Cardiac Royal Canin Veterinary Diet Adult Early Cardiac Dry Dog Food Hill’s Prescription Diet h/d Your veterinarian can help you determine the most appropriate diet and provide the prescription. For other underlying diseases such as hypothyroidism, which causes weight gain and increased stress on the heart, your dog may be placed on a diet to promote weight loss and balance thyroid hormones. Recovery and Management of Heart Murmurs in Dogs Obesity in dogs has been associated with breathing difficulty and increased stress on the heart. A balanced diet with light, frequent exercise can promote good heart health. Talk to your veterinarian before starting any exercise regimen. Poor oral health is associated with heart diseases such as endocarditis, so prevent tooth decay by regularly brushing your dog’s teeth and treat dental disease as recommended. The prognosis for pets with heart murmurs depends on the cause of the murmur. In the case of a benign puppy murmur, no treatment is required and the prognosis is generally good to excellent. If the murmur is caused by a repairable defect or obstruction, it may resolve over time after surgical repair. For a dog that has advancing heart disease the prognosis for a murmur is extremely variable, depending on the type of defect. Featured Image: iStock.com/FatCamera"}]