[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Glucose in the Urine in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_glucosuria"}, "datePublished": "April 26, 2010", "dateModified": "August 16, 2022", "description": "Glucosuria (or glycosuria) is the excretion of glucose into the urine.", "articleBody": "Glucosuria in Dogs Glucosuria (or glycosuria) is the excretion of glucose into the urine. Normally, the kidneys are able to reclaim all of the filtered glucose from the urine into the bloodstream. Glucosuria therefore is nearly always due to kidney disorders, such as diabetes mellitus. Symptoms and Types Glucosuria is categorized as hyperglycemic (170–220 mg/dL) or normoglycemic, and subcategorized as transient or persistent. Symptoms will depend on the underlying disease, but some possible signs include:     Diluted urine    Increased thirst and drinking (polydipsia and polyuria, respectively)    Renal failure (especially when associated with Fanconi&#039;s syndrome)    Urinary tract disease    Possible systemic disease (in hyperglycemic glucosuria)                   Causes Hyperglycemic glucosuria     Transient            Stress-related hyperglycemia        Adverse drug reaction (e.g., epinephrine, morphine, and phenothiazines)            Persistent            Systemic disease        Diabetes mellitus        Overactive adrenal gland (hyperadrenocorticism)        Sudden inflammation of the pancreas (acute pancreatitis)        Lesions in the central nervous system (brain, spine, etc.)        Adrenal gland tumor (pheochromocytoma)        Progesterone-associated hyperglycemia        Bacterial infection in the blood (sepsis)        Glucagonoma (tumor in the pancreas which secretes glucagon, a hormone which increases blood sugar)        Chronic liver failure        Etiologic agents such as heavy metal poisons, drugs, and chemicals        Normoglycemic glucosuria     Congenital normoglycemic glucosuria            Primary renal glucosuria (Scottish terriers and mixed-breed dogs)        Congenital Fanconi’s syndrome (basenji, Norwegian elkhound, miniature Schnauzer)        Congenital diseases associated with kidney dysfunction (Norwegian elkhound)            Acquired normoglycemic Glucosuria            Acute kidney failure        Fanconi’s syndrome secondary to heavy metal poisoning, drugs, and chemicals        Diagnosis You will need to give a thorough history of your dog’s health to your veterinarian, including the onset and nature of the symptoms. He or she will then perform a complete physical examination as well as a complete blood count, biochemistry profile, electrolyte panel, and urinalysis to detect any underlying systemic diseases causing the glucosuria -- though often there is too little glucose present in the dog&#039;s urine to be detected. Hexokinase- or glucose dehydrogenase-based techniques are recommended for quantification of urinary glucose.  Treatment The type of treatment will depend on the underlying cause of glucosuria. If a urinary tract infection is present, for example, antibiotics will be employed and adjusted according to the culture. Meanwhile, solutions or medications that may have caused the glucose to appear in the urine should be discontinued immediately."}]