[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is the life expectancy of dogs with malignant mammary gland tumors?", "acceptedAnswer": {"@type": "Answer", "text": "The average survival time for dogs diagnosed with a malignant mammary tumor is variable, depending on the type (sarcoma vs. carcinoma), stage, spread of the tumor, degree of invasiveness, and grade. It can range from 1 month to almost 2 years but depends on the dog’s diagnosis."}}, {"@type": "Question", "name": "How do you get rid of mammary gland tumors in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "These tumors are generally removed with surgery. Other therapy options such as chemotherapy and radiation can also be used, but typically mammary tumors need to be surgically removed."}}, {"@type": "Question", "name": "What does a mammary tumor look like on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Most mammary tumors in dogs often look like a ball of varying size protruding from the skin on the abdomen. Additionally, mammary tumors can feel like small, well-defined, firm masses on, near, or around the gland itself. Some can feel as if they are attached to structures deeper than the skin and are not easily moveable, and their borders are usually indistinct."}}, {"@type": "Question", "name": "Are mammary tumors in dogs painful?", "acceptedAnswer": {"@type": "Answer", "text": "Mammary tumors in dogs can often be painful and uncomfortable, which is one of the reasons to have your dog examined. Your veterinarian may want to diagnose and treat her and may prescribe pain medication."}}, {"@type": "Question", "name": "What does mammary gland tumor removal surgery cost?", "acceptedAnswer": {"@type": "Answer", "text": "Depending on the type of surgery performed—from a simple lumpectomy to a more aggressive and involved bilateral mastectomy—you could expect to spend anywhere from a couple hundred dollars to more than a thousand. Featured Image: iStock.com/Thirawatana Phaisalratana"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mammary Gland Tumors in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/shiba.inu_.family.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/shiba.inu_.family.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_mammary_gland_tumor"}, "datePublished": "February 11, 2022", "dateModified": "August 12, 2022", "description": "Dr. Michael Kearley discusses mammary gland tumors in dogs, including diagnosis, symptoms, and treatment.", "articleBody": "What Are Mammary Gland Tumors in Dogs? Female dogs have five pairs of mammary glands on their abdomen, usually starting just below the armpits and running down toward the groin area. The function of the mammary glands is to provide milk and nutrients to the dog’s offspring.   While most dogs are typically spayed during their puppy years, many dogs who are not spayed at a young age will go on to have litters during their lifetime. Female dogs that have had previous litters will often exhibit prominent mammary glands that can be visible or felt by touch.    Only about half of mammary tumors in dogs are malignant (cancerous).   These types of mammary tumors include:   Benign adenomas (nonmalignant)  Mammary carcinomas (malignant)   Mammary sarcomas (malignant)  Mixed mammary tumors (can be nonmalignant or malignant)   Inflammatory carcinoma (highly malignant and more aggressive)  It’s important to check your dog’s mammary glands at routine exams with a veterinarian.  Symptoms of Mammary Gland Tumors in Dogs A female dog’s mammary glands should be soft and pliable; and there shouldn’t be any lumps or firm swellings. If you happen to notice a lump, have your dog examined by a veterinarian immediately.   Sometimes, dogs with mammary tumors can experience a variety of other symptoms, such as:  Tenderness, warmth, or pain at the location of the tumor   Lethargy   Decreased appetite and weight loss   Weakness   Coughing   Causes of Mammary Gland Tumors in Dogs Mammary tumors are common, especially in unspayed female dogs, as hormones like estrogen and progesterone play a role in both mammary development and cancer formation. The exact cause, however, is unknown at this time.   Mammary tumors are less common in dogs that are spayed. The likelihood of a dog spayed prior to her first heat cycle developing a mammary tumor is about 0%. If that same dog were spayed after her first heat cycle, the chance of mammary tumor development would rise to 8%. If the same dog went through two or more heat cycles, she would have about a 25% chance of developing a mammary tumor.  Even though only about half of these tumors are cancerous, any tumor should be taken seriously and tested for further diagnosis.   How Veterinarians Diagnose Mammary Gland Tumors in Dogs Your veterinarian will perform a physical exam in which the mammary mass can easily be palpated (touched). Often, but not always, benign tumors feel like small, well-defined, firm masses, while malignant tumors feel stuck to underlying tissues, are not easily moveable, and have indistinct borders.   Your veterinarian may also want to perform some basic blood work along with a fine needle aspirate. In this test, a needle is inserted into the mass and cells are collected and sent to a lab for analysis. This test is often performed in a hospital on an outpatient basis and does have some limitations. Your veterinarian may also want to do a biopsy (removal of skin/mass tissue) to send out for further diagnosis.   Chest radiographs and an abdominal ultrasound may be recommended as follow-ups if the results show cancer, since most mammary tumors spread, or metastasize, to the local lymph nodes, chest, and possibly the liver.   Tumors that are large, have spread to other organs, are ulcerated (skin broken open), have a history of growing rapidly, or are attached to deeper tissues (i.e., the muscle layer) unfortunately carry a poor prognosis. Average survival times range from several months to several years.   Treatment of Mammary Gland Tumors in Dogs Mammary gland tumors in dogs typically requires surgery. Chemotherapy and radiation can be used if the tumor is too large, has been incompletely removed through surgery, or has already metastasized, but surgical removal of the tumor is usually the treatment of choice.    Tumors that are not cancerous can most likely be left alone (unless cosmetically concerning or bother the dog) but should continue to be monitored for any changes in size or consistency. There are five types of surgeries for mammary gland tumors in dogs:   Lumpectomy: removal of the mass   Simple mastectomy: removal of the mass and associated gland  Regional mastectomy: removal of the mass, the associated gland, and nearby glands and lymph nodes  Radical or unilateral mastectomy: removal of the entire mammary chain (radical or unilateral mastectomy)   Bilateral mastectomy: removal of both mammary chains (bilateral mastectomy)    Recovery and Management of Mammary Gland Tumors in Dogs The best preventative care for mammary gland tumors in dogs is to ensure your dog is spayed, especially at a young age. If you adopt a dog who has had litters in the past, or an unknown history, it’s important to have a conversation with your veterinarian to determine spay options in order to limit any further mammary gland issues.   For mammary gland tumors that are diagnosed and surgically removed, your veterinarian will most likely recommend follow-up appointments to check in on your dog’s recovery. "}]