[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Shaker Syndrome in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shaker-syndrome-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shaker-syndrome-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Syndromes", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_dg_shaker_syndrome"}, "datePublished": "March 20, 2010", "dateModified": "August 16, 2022", "description": "Shaker syndrome is a disorder which causes a dog&#039;s entire body to shake.", "articleBody": "Generalized Tremor Syndrome in Dogs Shaker syndrome is a disorder which causes a dog&#039;s entire body to shake. It is also known as idiopathic cerebellitis, which describes inflammation of the cerebellum (the part of the brain that is responsible for the coordination and regulation of voluntary muscular movement) for unknown reasons. While dogs of any coat color can be affected, those with a white hair coat are over-represented in the medical literature. For example, Maltese and West Highland white terriers appear to be predisposed. In addition, both genders are affected by shaker syndrome, especially young to middle-aged dogs. Symptoms and Types Diffuse body tremorsMay be mistaken for anxiety, or low body temperature (hypothermia)Causes Although a dog may be affected by the syndrome due to unknown reasons (idiopathic), it is most often associated with mild central nervous system disease. Diagnosis You will need to provide a thorough history of your dog&#039;s physical and behavioral health leading up to the onset of symptoms. Your veterinarian will perform a complete physical exam on your dog, including standard laboratory work, such as a blood chemical profile, a complete blood count, a urinalysis and an electrolyte panel to rule out other diseases. A cerebrospinal fluid (fluid from the spinal cord) sample may also be taken by your veterinarian and sent to the laboratory for analysis of the nervous system. Your doctor will use the process of differential diagnosis to rule out each of the more common causes until the correct disorder is settled upon and can be treated appropriately. Some other causes for the tremors can be anxiety/fear, seizures, and hypothermia.  Treatment Depending on how severe the tremors are, and your dog&#039;s overall condition, care will be given inpatient or outpatient. If your dog is very ill as the result of tremors, or if there is an underlying condition or infection, your dog will be hospitalized until its health stabilizes. The primary treatment for neurological shaker syndrome is the use of corticosteroids for reducing the inflammatory response in the body. Most dogs recover in a week although some rare patients never entirely recover. The steroids will be gradually reduced over the course of a few months until they are not being used anymore. Steroid treatment will be  reinstated if symptoms recur, and in some cases, steroid treatment will need to be continued for a longer period and possible even the lifetime of the dog in order to maintain health. Living and Management Your veterinarian will schedule weekly evaluations for your dog for the first month after the initial treatment. Thereafter, your veterinarian will schedule monthly follow-up appointments with you for your pet until the corticosteroids are discontinued."}]