[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much does it cost to remove a histiocytoma on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "As with most aspects of veterinary medicine, costs can vary dramatically depending on your location. Rural areas tend to be cheaper, whereas urban areas are typically more expensive. Fortunately, histiocytomas in dogs can be easily removed by most general practitioners and do not require referral to a specialist in most cases. Talk to your veterinarian for more specific information about the treatment costs and options in your area."}}, {"@type": "Question", "name": "Can a dog die from a histiocytoma?", "acceptedAnswer": {"@type": "Answer", "text": "Histiocytomas in dogs are rarely lethal or even painful. However, a very rare disease called Langerhans cell histiocytosis (LCH) causes hundreds of these growths to erupt all over the body, even in the mouth. Dogs with this condition are often euthanized due to poor quality of life."}}, {"@type": "Question", "name": "Do histiocytomas go away?", "acceptedAnswer": {"@type": "Answer", "text": "In most cases, histiocytomas in dogs go away on their own without any treatment. Treatment is warranted when a growth does not resolve itself within 3 months."}}, {"@type": "Question", "name": "Can you pop a histiocytoma?", "acceptedAnswer": {"@type": "Answer", "text": "No, these growths cannot be popped. Do not attempt to pop any growth or bump that you find on your dog. Instead, call your veterinarian. Featured Image: iStock.com/DarioEgidi"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Histiocytoma in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/three-dachshund-dogs-wire-long-and-short-haired-portrait-picture-id175179535.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/three-dachshund-dogs-wire-long-and-short-haired-portrait-picture-id175179535.jpg"}, "author": {"@type": "Person", "name": "Matthew Everett Miller, DVM", "url": "https://www.petmd.com/author/dr-matthew-everett-miller"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_histiocytoma"}, "datePublished": "October 20, 2021", "dateModified": "August 29, 2022", "description": "Dr. Matt Miller explains histiocytomas in dogs: where and why they appear, and how to treat this common condition that occurs in young dogs.", "articleBody": "What Are Histiocytomas in Dogs? Histiocytomas in dogs are small skin growths that occur most commonly in young dogs under 3 years of age. These benign growths appear suddenly—pet owners will often say overnight—but histiocytomas generally take 1-4 weeks to sprout. Histiocytomas can occur anywhere on a dog’s body, but they usually show up on the front half, particularly the head and the ears. They are especially common in Boxers and Dachshunds, and they account for almost 1/5 of canine skin tumors. Symptoms of Histiocytomas in Dogs Histiocytomas in dogs typically have no symptoms other than the sudden eruption of a domed pink growth on the skin. These growths are neither painful nor itchy in most cases, although both symptoms are possible. In rare cases, nearby lymph nodes can become swollen. Histiocytomas located near a dog’s eye may cause irritation, leading to eye redness and discharge. Causes of Histiocytomas in Dogs Histiocytomas are a type of benign tumor on dogs. Tumors occur when cells multiply in an unregulated fashion. In the case of histiocytomas, the cell that’s responsible is the Langerhans cell, which is a part of the skin’s immune system. Genetic factors most likely cause these cells to overmultiply, rather than environmental factors associated with other tumors, like radiation or pet owners who smoke. How Vets Diagnose Histiocytomas in Dogs Often, veterinarians make an initial diagnosis of histiocytoma in dogs based on: The appearance of the growth The location of the growth The dog’s breed and age A definitive diagnosis requires microscopic testing, typically through a needle biopsy of the growth. Treatment for Histiocytomas in Dogs In most cases, histiocytomas in dogs require no treatment, especially if your dog does not experience discomfort. Since we expect histiocytomas to disappear in less than 3 months, growths that last longer are surgically removed and tested to confirm the tumor type. Your veterinarian might also recommend the removal of a histiocytoma that grows too rapidly or becomes infected. These growths can be frozen off with cryotherapy if the growth occurs on a part of the dog’s body where surgery is difficult, like their feet or eyelids. Recovery and Management of Histiocytomas in Dogs When histiocytomas require surgical removal, your dog’s recovery will be like that of most minor surgeries. Avoid bathing your dog or allowing vigorous activity until the incision heals, typically within 2 weeks. An E-collar (also known as a cone) may be required to prevent your dog from licking the incision. In some cases, anti-inflammatory medication is prescribed for pain relief."}]