[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Why does my dog have scabs on their nose?", "acceptedAnswer": {"@type": "Answer", "text": "Scabs on a dog’s nose are an indication of skin inflammation and irritation. Scabbing may be caused by several diseases, such as bacterial pyoderma (skin infection), demodicosis (mange caused by the Demodex mite), dermatophytosis (ringworm), trauma, and autoimmune disease."}}, {"@type": "Question", "name": "Why does my dog have bumps on their snout?", "acceptedAnswer": {"@type": "Answer", "text": "Bumps on the muzzle, like scabs on the nose, often indicate skin inflammation and irritation. Large bumps could be growths or hives, but small bumps often indicate skin infection and inflammation."}}, {"@type": "Question", "name": "How do you treat a dog&#039;s sore nose?", "acceptedAnswer": {"@type": "Answer", "text": "If your dog’s nose is raw, inflamed, or irritated, it is important to have it checked by a veterinarian to determine the cause. Once the cause is determined, the best treatment can be discussed. In the meantime, it may be helpful to make sure that your dog’s nose stays clean and dry until it can be evaluated by a veterinarian. "}}, {"@type": "Question", "name": "Can I put Vaseline on my dog&#039;s nose?", "acceptedAnswer": {"@type": "Answer", "text": "While a small amount of Vaseline now and then is unlikely to be a problem, petroleum jelly (the main ingredient in Vaseline) can cause stomach upset, vomiting, and diarrhea in larger amounts. It also may be minimally effective because dogs tend to just lick it off.  Some products are specifically formulated as paw and nose balms, but you should always talk to your veterinarian first in case your dog’s snout needs more treatment.  Featured Image: iStock.com/Image Source"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Nasal Dermatoses in Dogs (Dog Nose Skin Issues)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/nasaldermatoses%20in%20dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/nasaldermatoses%20in%20dogs.jpg"}, "author": {"@type": "Person", "name": "Ellen Malmanger, DVM", "url": "https://www.petmd.com/author/dr-ellen-malmanger"}, "keywords": "Dog, Condition, Nose health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_Nasal_Dermatoses"}, "datePublished": "November 24, 2021", "dateModified": "August 12, 2022", "description": "Dr. Ellen Malmanger explains nasal dermatoses in dogs: why they appear, what to do about them, and how they can be a sign of something more serious.", "articleBody": "What Are Nasal Dermatoses in Dogs? The term “nasal dermatoses” describes skin issues that can affect both the hairy part of a dog’s muzzle (nasal bridge) and/or the hairless part of the nose with the nostrils (nasal planum).  Most conditions affect the junction between the two—an area called the mucocutaneous junction.  Symptoms of Nasal Dermatoses in Dogs Signs of a possible nasal dermatosis in a dog include:  Hypopigmentation (a loss of pigment) of the nasal planum Hyperpigmentation (excess pigment) of the nasal planum  Ulceration (sores)  Crusting  Swelling  Redness  Scabbing  Bumps  Oozing lesions  Most of the diseases that cause nasal dermatoses in dogs have very similar symptoms. This makes it hard to diagnose this condition just by looking at it.  Causes of Nasal Dermatoses in Dogs The four most common causes of nasal dermatoses in dogs include:  Bacterial infection (pyoderma/mucocutaneous pyoderma) Demodicosis (Demodex mites in the skin)  Dermatophytosis (ringworm)  Autoimmune disorders Bacterial Infection  Pyoderma is a skin infection, most commonly caused by bacteria. It is usually superficial, affecting only the upper layers of skin and hair follicles. Bacterial pyoderma around the nose can also cause hypopigmentation (loss of pigment), crusting, oozing, and ulceration (sores).  Bacteria such as Staphylococcus and Streptococcus are common causes of pyoderma in dogs. Malassezia yeast, which grows naturally on the skin but can grow too fast in cases of infection, is often found on affected skin along with the bacteria.  Demodicosis  Demodicosis is a condition caused by the microscopic Demodex mite. It is also known as demodectic mange.  These mites normally live on the dog’s skin, but they can reproduce quickly and cause skin lesions in young dogs or dogs with weakened immune systems. You may see lesions around the nostrils (hairless nasal planum). Dermatophytosis (Ringworm) Dermatophytosis is the clinical name for ringworm. Ringworm is not caused by a worm or parasite, but by a fungus (most often Microsporum canis).  Because ringworm lesions are often not ring-shaped and can look like many other types of skin conditions, they can be easy to miss. Dermatophytosis is most common in young animals or animals with a weakened immune system. However, it can also affect healthy adult animals.  Autoimmune Disease  If infection and mites are ruled out, it may be time to consider autoimmune disease. Diagnosing an autoimmune disease in your dog will usually require taking a small sample of skin (biopsy).  Autoimmune conditions such as pemphigus, lupus erythematous, uveodermatologic syndrome, and cancers like cutaneous lymphoma, can look identical to a skin infection, Demodex mites, or ringworm.   How Veterinarians Diagnose Nasal Dermatoses in Dogs A vet can identify nasal dermatoses by doing a physical exam, but tests for the following underlying conditions are necessary to figure out what’s causing the condition. Diagnosing Pyoderma in Dogs Pyoderma in dogs is diagnosed through a procedure called skin cytology. During this test, the vet will take a sample of inflamed, crusted skin and examine it under a microscope. In some cases, a biopsy and/or culture of the skin may also be recommended.  Diagnosing Demodicosis in Dogs Demodex mites are diagnosed with a skin scraping, although it can be hard to find them because they live deep in the hair follicles.  A skin scraping can be done in your vet’s office. The test consists of massaging a small area of your dog’s skin to squeeze any Demodex mites out of the hair follicles. A scalpel blade is then used to gently scrape a sample away from the top layer of skin. This sample is then examined under a microscope.  While a skin scraping may cause some rawness and mild bleeding, it is well-tolerated and not invasive.   Diagnosing Dermatophytosis in Dogs Diagnosing dermatophytosis can be tricky because it often requires a fungal culture, which can take weeks to return a result. It may also be diagnosed by examining a sample of affected skin or hair under a microscope.  The fungal organism can sometimes be seen on skin and hair samples, but a fungal culture or other specialized testing (like a fungal PCR test, which confirms the presence of ringworm DNA) may be necessary to rule out dermatophytosis.  In some cases, a Wood’s lamp, which is a special lamp used to examine skin and eye lesions, will cause affected hairs to fluoresce (glow bright yellow) in the dark.  While a positive Wood’s lamp test does confirm a ringworm diagnosis, a negative Wood’s lamp test does not rule out ringworm, as only a fraction of ringworm infections will actually glow.  Treatment for Nasal Dermatoses in Dogs The treatment for nasal dermatoses depends on the underlying cause.  A simple topical antifungal or antibiotic may be recommended for mild cases of pyoderma, while an autoimmune disease will likely require long-term oral medication.  Flea and tick preventatives in the isooxazoline class (such as Bravecto, Credelio, Nexgard, and Simparica Trio) will kill the mites that cause demodicosis, although this would be considered off-label use.  Once your veterinarian has determined the underlying cause of the dermatosis, they will be able to give more treatment information.   Recovery and Management of Nasal Dermatoses in Dogs Recovery and management of nasal dermatoses in dogs also depend on the underlying cause of the skin issue.  Pyoderma and dermatophytosis (ringworm) can usually be fully cured with the correct treatment.  Skin mites can be treated and prevented with certain types of flea and tick preventatives, although dogs with skin mites may also have coexisting skin infections that need treatment.  Treating autoimmune diseases may be a bit more complicated. Depending on the type, it may require more than one medication and long-term treatment. "}]