[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Jawbone Enlargement in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Joint health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_dg_craniomandibular_osteopathy"}, "datePublished": "June 29, 2009", "dateModified": "August 16, 2022", "description": "Craniomandibular osteopathy is a condition by which extra bone forms along the mandible and TMJ, making it painful and difficult for the affected dog to open its mouth and eat. Signs are usually seen in puppies that are four to eight months of age.", "articleBody": "Craniomandibular Osteopathy in Dogs A dog’s mouth is made up mainly of two bones, the mandible (lower bone) and the maxilla (upper bone). These two bones come together at a joint called the temporomandibular joint (TMJ). The TMJ is the joint that allows the jaw to open and close. Dogs use their cheek muscles to move the TMJ in order to open and close their mouths. Craniomandibular osteopathy is a condition by which extra bone forms along the mandible and TMJ, making it painful and difficult for the affected dog to open its mouth and eat. Signs are usually seen in puppies that are four to eight months of age, and it is seen more in some breeds of dogs than others. Breeds that are the most commonly affected are Scottish Terriers, Cairn Terriers, and West Highland White Terriers. Breeds with a lesser incidence of this condition, but which also have a higher than normal diagnosis are Labrador Retrievers, Great Danes, Boston Terriers, Doberman Pinschers, Irish Setters, English Bulldogs, and Boxers. Symptoms and Types     Pain when opening the mouth    Difficulty opening the mouth    Difficulty picking up food    Difficulty chewing and concurrent loss of appetite    Pain and difficulty eating get worse with time    Fever that comes and goes    Eyes that seem to bulge out (exophthalmos), due to swelling within the skull    Swelling in jaw    Excessive droolingCauses Inherited. The genetic predisposition is strongest with West Highland white terriers. Diagnosis Your veterinarian will need a thorough history of your dog&#039;s health leading up to the onset of symptoms. Paying careful attention to your dog&#039;s head during the examination. your veterinarian may be able to feel a decrease in the amount of muscle on the sides of your dog&#039;s head, along with a thickening of the bone along the sides of the jaws. There will also be obvious pain when trying to open your dog&#039;s mouth, and it may not even open all the way. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and biochemistry levels. These will be used to identify whether there are any abnormalities in your dog&#039;s bones. Further blood tests may help to rule out or verify fungal or other types of infection. The most precise diagnostic tool for this condition will be x-rays images taken of your dog&#039;s head, which will show the abnormal bone growth. In most cases these will be all of the tests that need to be done, but for some cases, your veterinarian may also want to get a sample of the bone (bone biopsy) to make sure your dog&#039;s symptoms are not caused by a tumor or bone infection.  Treatment Treatment with anti-inflammatory drugs for the swelling, along with pain relievers, will help to minimize your dog&#039;s symptoms but will not effect an immediate cure. This condition has a “wait and see” outlook, since there is no method for slowing the progression other than for treating the swelling. The growth typically slows down at about a year of age, when the puppy&#039;s growth slows, and the growth will often recede as well, but many dogs will continue to have a larger than normal jaw bone, and may have difficulty chewing normally for the remainder of their lives. In some cases, surgery may be used to repair the jaw enough to make your dog more comfortable. You may need to feed your dog a special food during the treatment process, such as a high calorie soup or liquid if it is having trouble eating regular food. If your dog cannot eat even a liquid diet, surgical placement of a feeding tube into the stomach or esophagus will be necessary. Because prescribed medications can sometimes cause an upset stomach, it is important that you follow all of the instructions you are given about these medications. Living and Management Your veterinarian will want you to return for regular follow-up visits to make sure your dog is getting enough nutrition and is not in excessive pain. If you need to feed your dog through a tube, it is important that you follow all of your veterinarian’s instructions regarding how to use the tube and how often to feed your pet. Once your pet reaches ten to twelve months of age, the pain may decrease. The amount of extra bone which has built up on the jaw may decrease as well. How well your dog does will depend on the amount of extra bone which has formed around the jaw. Your pet may still need special food, or a feeding tube for the rest of its life. Prevention Dogs that are affected with craniomandibular osteopathy should not be used for breeding again, nor should siblings from the same litter, whether they have symptoms of the disorder or not. And it is recommended that you have your dog spayed or neutered to avoid passing this genetic abnormality along."}]