[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hole in the Trachea in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/c_dg_tracheal_hole"}, "datePublished": "March 19, 2010", "dateModified": "August 16, 2022", "description": "Tracheal perforation is a loss of the integrity of the tracheal wall, in the form of a hole or rip, allowing leakage of air into the surrounding tissues and creating air pockets under the skin, air collection in the mediastinum (in between the lungs), and potentially air in the sac around the heart, free air in the chest cavity, and air in the most posterior part of the abdominal cavity (pneumoretroperitoneum).", "articleBody": "Tracheal Perforation in Dogs Tracheal perforation is a loss of the integrity of the tracheal wall, in the form of a hole or rip, allowing leakage of air into the surrounding tissues and creating air pockets under the skin, air collection in the mediastinum (in between the lungs), and potentially air in the sac around the heart, free air in the chest cavity, and air in the most posterior part of the abdominal cavity (pneumoretroperitoneum). This loss of integrity can be caused by a penetrating trauma, trauma from inside the trachea, or blunt neck or chest trauma. The severity of tracheal perforation ranges from a small perforation to complete tracheal avulsion (tearing away of the trachea). In dogs with complete avulsion, the mediastinal tissues can help to maintain the airways. Symptoms and Types The following signs may occur immediately after injury or up to a week later:     Pockets of air      collected under the skin    Respiratory      distress    Lack of appetite (anorexia)    Lack of energy    Gagging    Excessive      salivation (ptyalism)    Vomiting    Coughing    Harsh crowing      sound as dog breathes in    ShockCauses Penetrating cervical (neck) wounds:     Bite wounds    Missiles (e.g.,      gunshots, arrows)Perforation by a veterinarian (iatrogenic):     During a      transtracheal wash (a saline wash and collection of tissue and fluid      through [trans] the trachea when evaluating for respiratory diseases)    Inadvertent      puncture while drawing blood, or during neck surgery     Anesthesia and      intubation procedures (to maintain an airway during anesthesia)Blunt trauma can cause intrathoracic tracheal avulsion:     Motor vehicle       accident    Falling from great       heightsDiagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have led to this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, a urinalysis and an electrolyte panel. An arterial blood gas analysis may also be done to check oxygenation of blood. A pulse oximetry measurement may show less than normal (or even low) oxygen saturation. Side view X-rays of the neck and chest are essential for diagnosis. Air pockets under the skin, air collection in the mediastinum, free air in the chest cavity, and potentially air in the sac around the heart will be seen with tracheal perforation. In cases of tracheal avulsion, the site of disruption may be visible. Abdominal X-rays may show a pneumoretroperitoneum -- air that has escaped into the space behind the lining of the stomach (peritoneum). An examination of the interior walls of the trachea can be done by tracheoscopy to confirm the diagnosis of tracheal perforation and to estimate its severity. False-negative examinations can sometimes occur.  Treatment     Dogs with a tracheal perforation should be hospitalized for oxygen therapy    It should be kept in a low-stress environment with as little stimuli as is possible    In cases of iatrogenic perforation, healing is spontaneous as long as medical and supportive therapy are provided    If pneumothorax develops, thoracocentesis and even thoracostomy tubes may be indicated    Surgery is indicated if the patient does not stabilize or decompensates (the heart is unable to maintain adequate blood circulation), or if the tracheal rupture is secondary to a blunt trauma or penetrating wound    Tracheal cutting and rejoining to another uninjured part of the trachea is indicated in cases of severe tracheal damage or tracheal avulsionLiving and Management Your veterinarian will schedule follow-up appointments to monitor healing of the surgical incisions if surgery was indicated.  Dogs that suffer from an avulsed trachea (one that has been torn away) and do not receive surgery may suffer sudden death. In fact, even with surgery, an animal with a repaired avulsed trachea  have a guarded prognosis. Call your veterinarian immediately if signs of redness, oozing or swelling are noted at the surgical incision site. The veterinarian should also be called immediately, on an emergency basis, if your dog begins to have difficulty breathing."}]