[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Overproduction of Estrogen in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_Hyperestrogenism"}, "datePublished": "July 1, 2008", "dateModified": "August 16, 2022", "description": "Overproduction of estrogen can result in what is known as estrogen toxicity (hyperestrogenism). This can happen without any outside interference or it can occur when estrogens are being introduced artificially.", "articleBody": "Hyperestrogenism in Dogs Estrogen -- a type of hormone -- is naturally produced in female dogs. It is responsible for normal sexual behavior and development, and the customary biological function of the female reproductive tract. Overproduction of estrogen can result in what is known as estrogen toxicity (hyperestrogenism). This can happen without any outside interference or it can occur when estrogens are being introduced artificially. Estrogens sometimes cause abnormal (cystic) cells to line the uterus and this permits the invasion of bacteria from the vagina. The cervix is open during &quot;heat,&quot; but if it is closed it can lead to a serious infection (pyometra). In addition, a concentration of estrogen can result in infertility, as well as an imbalance in the blood. Symptoms and Types     Weakness (lethargy)    Pale gums    Bleeding—skin, urine, stool, vomit    Fever    Persistent infections    Thinning of the hair    Female characteristics in males    Infertility    Prolonged estrus    Enlarged vulva    Enlarged teats in female    Decreased attraction to opposite sex    Excess attraction to opposite sex in females (nymphomania)    Bleeding from the vulva    Hair loss (alopecia)    Tumor on tail in male (stud dog tail)    Testicular mass in male    Testicular atrophyCauses     Excessive production of estrogen    Administration of estrogen supplements    Ovarian cysts    Ovarian tumor    Testicular tumor   Diagnosis     Complete blood count (CBC)    Bone marrow biopsy (aspirate)    X-ray of the abdomen    Ultrasound of the abdomen    Thorough examination of testicles in intact males    Needle biopsy (aspiration) of testicular masses    Ultrasound-guided aspiration of ovarian cysts    Biopsy of lymph nodes    Skin biopsy to determine cause of hair loss Treatment     Stop estrogen supplementation    Supportive care, including antibiotics and blood transfusions    Blood transfusions, if anemic    Antibiotics in case of infections    Masses may be examined via small scope instrument (laparoscopy)    Masses may be removed via incision (laparotomy)    If estrogen is not being administered artificially, surgical neutering in either male or female    Removal of testicle or ovary may be considered for valuable breeding animals    Testicular prosthetic devices are not advised    Medications to increase blood production in bone marrow    Medication to induce ovulation may be prescribed if there are cystsLiving and Management Recovery may take a while -- up to several months -- so be prepared to provide long-term care for your pet. Be vigilant in providing prescribed medications and aware of any changes in your pet. Blood tests (and sometimes bone-marrow biopsies) must be performed to evaluate your pet&#039;s response to the therapy. Do not give estrogen-containing compounds unless advised to by your veterinarian. Females will undergo tests to determine whether ovulation is occurring. In addition, a male dog should not show signs of feminization once a testicular tumor has been removed."}]