[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Congenital Heart Defect (Atrial Septal Defect) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_atrial_septal_defect"}, "datePublished": "May 19, 2010", "dateModified": "August 16, 2022", "description": "Atrial septal defect (ASD) is a congenital heart anomaly that enables blood flow between the left and right atria via the interatrial septum (the separating wall).", "articleBody": "Atrial Septal Defect in Dogs Atrial septal defect (ASD) is a congenital heart anomaly that enables blood flow between the left and right atria via the interatrial septum (the separating wall). Typically, the blood will shunt into the right atrium, causing a volume overload to the right atrium, right ventricle, and pulmonary vasculature, which can sometimes lead to pulmonary hypertension. However, if right-sided pressures are too high, shunting may occur right to left, causing generalized cyanosis. ASD is more common in cats (9 percent of congenital heart defects) than dogs (0.7 percent), though a recent study from France suggests a higher incidence, with ASD accounting for 37.7 percent of congenital cardiac defects in pooled data from dogs and cats. Symptoms and Types ASD occurs in one of three locations: lower atrial septum (ostium primum defect, which is the most common), near the fossa ovalis (ostium secundum defect), or craniodorsal to the fossa ovalis (sinus venous defect). Common signs associated with ASD include:     Exercise intolerance    Fainting/loss of consciousness (syncope)    Trouble breathing (dyspnea)    Coughing    Heart murmur    Bluish skin (cyanosis)    Fluid buildup in the abdomen (ascites) if right-sided heart failure developsCauses The underlying cause of atrial septal defect is currently unknown. Diagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to the veterinarian. He or she will then perform a complete physical examination as well as a biochemistry profile, urinalysis, complete blood count, and electrolyte panel. X-rays and electrocardiograms will typically show right-sided heart and lung vessel enlargement in patients with large defects, while an echocardiogram may reveal right atrial and right ventricular dilation and the actual hole (a septal dropout). Arrhythmias and intraventricular conduction disturbances may also be visible using these diagnostic procedures. To document the blood flow through the hole and high ejection velocity through the pulmonary artery, doppler echocardiography is useful.     Treatment Dogs with congestive heart failure should be hospitalized until they are stable. Open heart surgery may be necessary to repair the defect, but this is often very expensive. Consult with your veterinarian the best and most affordable course of treatment for you and your pet. For some secundum-type defects, an amplatzer device may be implanted to close the hole. Living and Management The prognosis in dogs with ASD depends on the size of the defect and coexisting abnormalities, though it is often guarded to poor. Small, isolated defects, for example, are unlikely to progress, while primum-type defects are typically larger with a worse prognosis."}]