[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can a dog recover from tick paralysis?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs recover from tick paralysis if the tick is removed, and receive supportive care is provided."}}, {"@type": "Question", "name": "How do you get rid of a paralysis tick on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "If a dog is sick, your veterinary staff is best equipped to remove the tick to ensure all mouthparts are removed. If you remove the tick at home, make sure to mark the area with a sharpie so the veterinary team can examine it. You can also keep a tool called the Tick Tornado at home to help fully remove these pests. Do not use a match or flame, as you could injure yourself or your dog."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Tick Paralysis", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.outside.grass_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.outside.grass_.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Tick, Parasite", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_tick_paralysis"}, "datePublished": "May 26, 2022", "dateModified": "August 12, 2022", "description": "Dr. Lauren Jones discusses dog tick paralysis, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Dog Tick Paralysis? Tick paralysis, or toxicity, is a rapid, progressive disease affecting the nerves of dogs. It is caused by the bite of certain ticks, most commonly the Amblyomma, lxodes, and Dermacentor tick, that injects a unique neurotoxin through its saliva. Signs of tick paralysis usually begin between five to nine days after the first bite. The ticks release the toxin in a pulse-like fashion when attached. The toxin inhibits neurotransmitters required for muscles to move appropriately. Paralysis typically starts in the hind legs, first with incoordination and gait abnormalities, and then progressing to the pet’s inability to use its legs. Paralysis is usually symmetrical, involving both legs. This paralysis rapidly advances over the next 24 to 48 hours to affect the front legs, muscles involved with breathing, and sometimes even the nerves in the face. Tick paralysis can be difficult to diagnose, and progression and recovery can be unpredictable. Contact a veterinarian immediately if a pet has a change in neurologic status—either in mental activity or ability to move. Symptoms of Dog Tick Paralysis The hallmark of tick paralysis is its ascending paralysis that begins in the hind legs. Dogs can also show other symptoms secondary to tick paralysis, including: Facial nerve paralysis, decreased jaw tone, and eye reflexes Laryngeal dysfunction, changes in bark quality and volume Aspiration pneumonia secondary to laryngeal dysfunction Decreased ability to breathe Decreased muscle tone Causes of Dog Tick Paralysis Tick paralysis in the United States is most related to the bites of deer ticks and dog ticks, but it can also be seen in other species. Ticks pulse a neurotoxin through its saliva, so infected dogs are sick only during tick attachment and while the tick feeds.  Dogs who are not on tick prevention are at a higher risk, as well as those who spend a significant amount of time in wooded or grassy areas where ticks live—even if they are on preventatives.  There is no age, breed, or sex predisposition for dogs to get tick paralysis. There is some seasonality to tick paralysis, with most cases occurring in the spring and early summer. How Veterinarians Diagnose Dog Tick Paralysis Veterinarians diagnose tick paralysis based on clinical history and response to treatment. As it is a rapidly progressing neurologic disease, dogs or areas known for ticks and tick-borne diseases are examined for engorged ticks. Routine bloodwork—including blood chemistry and complete blood counts—may rule out other causes or side effects of tick paralysis. Tick paralysis is not always routinely associated with blood work abnormalities. Since tick paralysis progresses rapidly, it is important to seek veterinary care as soon as a dog shows symptoms. If you find a tick, remove it if you can do so safely. Make sure to save it and mark the site of attachment (with a permanent marker) so the veterinarian can shave and examine the site for further evidence of infection or tick mouthparts. Treatment of Dog Tick Paralysis Tick removal is the primary treatment for tick paralysis. To prevent further toxin release, the mouthpiece is removed, and applying a tick preventative is essential for treatment, as it kills any other unseen ticks on your dog and prevents any future infestations. Some dogs who have survived tick paralysis may have natural immunity, although how long the immunity lasts is unknown. Some veterinarians use blood from hyperimmune dogs, or anti-tick serum, to treat other dogs with tick paralysis. This transfusion can anecdotally help speed up recovery but should be thoroughly discussed with your veterinarian regarding its benefits and risks.  Supportive care for dogs recovering from tick paralysis is crucial. Fluids, nutritional support, and oxygen support may be needed. Some dogs may need a mechanical ventilator or breathing machine until they fully recover. Respiratory failure is common in dogs with tick paralysis. These dogs may not be able to urinate independently and will require urinary bladder management. Recovery and Management of Dog Tick Paralysis Prognosis is typically good for dogs with tick paralysis, with 90 to 95 percent of patients recovering. But recovery can be unpredictable. Most dogs will improve once the tick is removed, however different ticks may release different levels of toxins and some dogs may be more susceptible. It is difficult to determine a prognosis based on type of tick or time attached alone. In general, dogs will improve over 1 to 3 days after tick removal. Some dogs may experience longer recovery times. Dogs will need hospital stays if they require breathing support. Once they are stable, they may be released to finish recovering at home. These dogs may still be uncoordinated and require help to move, especially with stairs. Pet parents may need to learn how to help them urinate until these muscles regain function. Dogs with severe respiratory compromise may have permanent lung disease, resulting in the need for chronic medications and exercise intolerance. Dogs with aspiration pneumonia generally recover with antibiotics. Dogs who have recovered from tick paralysis may have a natural immunity to future tick bites and the resulting paralysis. However, the time span that the natural immunity lasts varies greatly. Prevention of Dog Tick Paralysis There is no vaccine for tick paralysis, but there is a wide array of flea and tick preventatives that will help keep your pet safe from ticks. Keep your pet on flea and tick prevention year-round for the best success. Just one warm flare-up in cold months can be enough for ticks to find and attach themselves to your pet. Prescription preventatives are typically the safest and most efficacious. Your veterinarian can help decide the best medication for your pet."}]