[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Parasite Infection (Leishmaniasis) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/parasite-infection-leishmaniasis-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/parasite-infection-leishmaniasis-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_leishmaniasis"}, "datePublished": "May 28, 2010", "dateModified": "August 16, 2022", "description": "Leishmaniasis, the medical term used for the diseased condition that is brought about by the protozoan parasite Leishmania, can be categorized by two types of diseases in dogs: a cutaneous (skin) reaction, and a visceral (abdominal organ) reaction - also known as black fever, the most severe form of leishmaniasis.", "articleBody": "Leishmaniasis in Dogs Leishmaniasis, the medical term used for the diseased condition that is brought about by the protozoan parasite Leishmania, can be categorized by two types of diseases in dogs: a cutaneous (skin) reaction and a visceral (abdominal organ) reaction -- also known as black fever, the most severe form of leishmaniasis. The infection is acquired when sandflies transmit the flagellated parasites into the skin of a host. The incubation period from infection to symptoms is generally between one month to several years. In dogs, it invariably spreads throughout the body to most organs; renal (kidney) failure is the most common cause of death, and virtually all infected dogs develop visceral or systemic disease. As much as 90 percent of infected dogs will also have skin involvement. There is no age, gender, or breed predilection; however, males are more likely to have a visceral reaction. The main organ systems affected are the skin, kidneys, spleen, liver, eyes, and joints. There is also commonly a skin reaction, with lesions on the skin, and hair loss. There is marked tendency to hemorrhage. Affected dogs in the U.S. are frequently found to have acquired the Leishmania infection in another country, notably the Mediterranean basin, Portugal, and Spain. There have also been sporadic cases confirmed in Switzerland, northern France, and the Netherlands, and endemic areas found in South and Central America, and in southern Mexico. Endemic cases in Oklahoma and Ohio have been reported in dog populations there as well. It is important to note that leishmaniasis is a zoonotic infection, and the organisms residing in the lesions can be communicated to humans. Symptoms and Types There are two types of leishmaniasis seen in dogs: visceral and cutaneous. Each type affect different parts of the dog&#039;s body. Visceral — affects organs of the abdominal cavity    Severe weight lossLoss of appetite (anorexia)DiarrheaTarry feces (less common)VomitingNose bleedExercise intolerance   Cutaneous — affects the skin    Hyperkeratosis — most prominent finding; excessive epidermal scaling with thickening, depigmentation (loss of skin color), and chapping of the muzzle and footpadsAlopecia — dry, brittle hair coat with symmetrical hair lossNodules usually develop on the skin surfaceIntradermal nodules and ulcers may be seenAbnormally long or brittle nails are a specific finding in some patients Other signs and symptoms associated with leishmaniasis include: Lymphadenopathy — disease of the lymph nodes with skin lesions in 90 percent of casesEmaciationSigns of renal failure — excessive urination, excessive thirst, vomiting possibleNeuralgia — painful disorder of the nervesPain in the jointsInflammation of the musclesOsteolytic lesions — a &quot;punched-out&quot; area with severe bone lossInflammation of the covering of bones; rareFever with an enlarged spleed (in about one-third of patients)    Causes Traveling to endemic regions (usually the Mediterranean), where the dog can be exposed to sandflies -- a Leishmania host  -- is the most common way of contracting the infection. However, receiving a transfusion from another infected animal can also lead to leishmaniasis. Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have led to this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. Your doctor will be looking for evidence of such diseases as lupus, cancer, and distemper, among other possible causes for the symptoms. Tissue samples from the skin, spleen, bone marrow, or lymph nodes will be taken for laboratory culturing, as well as fluid aspirates. Since there are often related lesions on the skin&#039;s surface, a skin biopsy will be in order as well. Most dogs with leishmaniasis have high levels of protein and gammaglobulin, as well as high liver enzyme activity. Even so, your veterinarian will need to eliminate tick fever as the cause of the symptoms, and may test specifically for lupus in order to rule it out or confirm it as a cause.  Treatment Unless your dog is extremely ill, it will be treated as an outpatient. If it is emaciated and chronically infected, you may need to consider euthanasia because the prognosis is very poor for such animals. If your dog is not severely infected, your veterinarian will prescribe a high-quality protein diet, one that is designed specifically for renal insufficiency if necessary. This is a zoonotic infection, and the organisms residing in the lesions can be communicated to humans. These organisms will never be entirely eliminated, and relapse, requiring treatment, is inevitable. There are medications that can be helpful in treating symptoms and in addressing the disease. Your veterinarian will advise you on the best course. Living and Management Your veterinarian will want to monitor your dog for clinical improvement and for identification of organisms in repeat biopsies. You can expect a relapse a few months to a year after the initial therapy; your veterinarian will want to recheck your dog&#039;s condition at least every two months after completion of the initial treatment. The prognosis for a successful cure is very guarded."}]