[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/k0dyt2k1cs", "@type": "VideoObject", "duration": "PT2M3S", "name": "5324794627001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/6f317f019d9bdf6c6fed811dac15c2683eaf3fc9.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/k0dyt2k1cs", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/23a7c7add0ca01e72509742aeb16e4c114b8a372.m3u8", "transcript": "If your dog is in pain you want to do all that you can to help him feel better. But while over the counter medications are safe and effective treatments for humans they can be very dangerous for dogs Human non steroidal anti inflammatories commonly referred to as incense should not be given to dogs for a few very important reasons. First, it's very easy for pet parents to administer an inappropriately high dose of these medications and second instead that mix with pre-existing health conditions in dogs or other medications can have an unfavorable and even dangerous outcome. These drugs may also produce scary side effects in certain dogs and should be avoided.\n\nCommon and says include aspirin and ibuprofen Tylenol or acetaminophen is another over-the-counter human pain medication that should not be given to dogs. If dogs ingest large amounts of acetaminophen the drug can destroy their liver cells damaged the kidneys and result in poor oxygen delivery throughout the body. As an aside Tylenol can be deadly for cats so it's really just best to keep all pills meant for humans in a safe spot in your home that's inaccessible to your four legged family members to treat pain and dogs pet parents should work directly with their veterinarian to identify the best options.\n\nThere are several pain medications designed specifically for treating pain and dogs, including car paraffin Derek Cox live and Maalox a Cam. Dog owners should always follow veterinary instructions for administering these drugs and report back if they notice any side effects such as an accident vomiting, diarrhea, or bleeding. In addition dogs with arthritis may benefit from a change in diet or a weight loss program. Supplements like glucosamine conjoined and hyaluronic acid may also assist with reducing inflammation in dogs but pet parents should consult their veterinarians before giving dogs any supplements.\n\nAnd it is OK to think outside the box to talk with your veterinarian about any herbal therapies available. And even acupuncture and physical therapy. These methods have also been shown to decrease the effects of arthritis pain in pet.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/neurological/c_dg_tremors?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Involuntary Muscle Trembling in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/trembledog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/trembledog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Brain health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_dg_tremors"}, "datePublished": "October 6, 2010", "dateModified": "August 16, 2022", "description": "Tremors are involuntary, rhythmic and repetitive muscle movements that alternate between contraction and relaxation, usually involving to-and-fro movements (twitching) of one or more body parts. The tremors may be rapid, or they may be slow vibrations, and they can occur in any part of the body. Tremor syndrome usually affects young-to middle aged dogs, and has been known to primarily affect white colored dogs, but a variety of hair-coat colors have been found to be affected as well. There are some dog breeds that are believed to be predisposed to tremors. Some of the most commonly affected breeds include chow chows, springer spaniels, Samoyeds, Weimaraners, Dalmatians, Doberman pinschers, English bulldogs and Labrador retrievers. Dogs that are prone to this condition are referred to as &quot;shaker dogs.&quot;", "articleBody": "Tremors in Dogs Tremors are involuntary, rhythmic and repetitive muscle movements that alternate between contraction and relaxation, usually involving to-and-fro movements (twitching) of one or more body parts. The tremors may be rapid, or they may be slow vibrations, and they can occur in any part of the body. Tremor syndrome usually affects young-to middle aged dogs, and has been known to primarily affect white colored dogs, but a variety of hair-coat colors have been found to be affected as well. There are some dog breeds that are believed to be predisposed to tremors, including chow chows, springer spaniels, Samoyeds, Weimaraners, Dalmatians, Doberman pinschers, English bulldogs and Labrador retrievers. Dogs that are prone to this condition are referred to as &quot;shaker dogs.&quot; Symptoms and Types Involuntary tremors involving any body part may be seen in an affected dog. The tremors may be localized or generalized. Localized cases usually affect the head or hind limbs. Causes Idiopathic (unknown)GeneticTrauma or injuryCongenital - present at birthAs a side-effect of certain drugsSevere weakness or painIn concurrence with kidney failureLower than normal levels of glucose in the blood (hypoglycemia)Toxicity - chemical or plant basedInflammationNervous system diseaseDiagnosis Your veterinarian will perform a complete physical exam on your dog after taking a complete medical history, including a background history of the symptoms and the time of onset, and possible incidents that might have led to this condition. Routine laboratory examinations include a complete blood count, biochemistry profile, urinalysis and electrolyte panel. If brain disease is the primary cause of the tremors, the laboratory tests are usually found to be normal. In metabolic diseases, the biochemistry profile may indicate lower than normal levels of glucose (hypoglycemia), lower than normal levels of calcium (hypocalcemia), and abnormal kidney functions. Other diagnostic tests will include X-rays, computed tomography (CT-Scan), and magnetic resonance imaging (MRI), especially in cases where the pelvic limbs are affected. These tests may reveal abnormalities in the posterior portion of the spinal cord and vertebrae. In some animals, cerebrospinal fluid, or CSF, is also taken for further testing. The results will vary depending on the primary disease underlying the external symptoms.  Treatment As tremors are merely a symptom of an underlying and often unseen problem, the major goal of therapy will involve treating the underlying disease or disorder. The laboratory tests will help your veterinarian to establish a diagnosis for proper treatment. There are a number of causes that can lead to tremors in affected animals. Some conditions are treatable, while some others have no treatment available. If a drug is responsible for this condition, your veterinarian will recommend an alternative drug to prevent tremors. If intoxication is suspected, removal of the toxin from the environment will be necessary to prevent further exposure to the same toxin. The toxin may be related to a chemical substance that your dog has easy access to, a poison, or a toxic plant that has been chewed and ingested. In some cases, an antidote may be available for the poison, if that is the finding. If the tremors are related to a disease or disorder of the nervous system, surgery may be indicated to treat the primary nervous system disease. To control the symptoms of tremors, your veterinarian may recommend drugs to control the movement of the muscles. Living and Management Over excitement and strenuous exercise should be avoided in affected animals, as these activities may exacerbate the symptoms. Exercise should be gentle and low impact. The overall prognosis of this disease largely depends on the successful treatment of the underlying disease. However, most causes of tremors in dogs are treatable. Good patient monitoring is required during the treatment phase. Consult your veterinarian if symptoms worsen despite the prescribed therapy. See Also"}]