[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Incoordination of the Legs in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/incoordination-legs-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/incoordination-legs-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Brain health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_dg_hypermetria_dysmetria"}, "datePublished": "April 10, 2010", "dateModified": "August 16, 2022", "description": "Dysmetria and hypermetria are outward symptoms of a dysfunction of the pathways that control voluntary movement in a dog.", "articleBody": "Hypermetria and Dysmetria in Dogs Dysmetria and hypermetria are outward symptoms of a dysfunction of the pathways that control voluntary movement in a dog. More specifically, dysmetria is characterized by the dog&#039;s inability to judge the rate, range, and force of its movements -- literally, an inability to measure space. Hypermetria, meanwhile, describes the action of overreaching, or high stepping, the intended location. Symptoms and Types Signs of cerebellar disease that may be present include: Head tiltBody swayingBody tremors; often more pronounced with movementWide leg stanceLoss of the menace response – the reflexive closing of the eyes when a finger is stabbed toward the eyeUnequal pupil size (anisocoria)Abnormal, jerky movementsCauses Trauma to the brain or back is often the primary cause for spinal or brain injury, leading to lack of coordination or overreaching of the  limbs. Lesions on the cerebellum, the part of the brain that is responsible for coordinating voluntary movements and balance, or on the nerves leading to the cerebellum, are believed to be one of the causes for these symptoms. Lesions can be caused by strokes, or by tumors located near these nerves. Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have led to this condition. If there are no other signs of cerebellar disease, it will be important to establish whether a high-stepping thoracic limb gait is normal for your dog. Some dogs, especially small breeds, have a normally occurring high-stepping gait in their front limbs, so your veterinarian will want to differentiate what is normal as opposed to what might be an underlying cause for the odd movements. If there are no other signs of cerebellar disease, it is important to establish from the owner whether a high-stepping thoracic limb gait is normal for his or her dog. Diagnostic imaging, such as with X-ray or ultrasound, is generally performed to review possible injury or damage to the brain and spine, and is especially recommended for older animals. Your veterinarian will check your dog&#039;s reactions and responses to stimulus. One test that is standard is checking the dog&#039;s menace response, or menace reflex, an involuntary eye response that occurs when a finger is stabbed toward the the eyes. If the dog does not reflexively close its eyes and jerk away when your veterinarian does this, your doctor can assume that there is a of loss of eye sight, or neurological dysfunction.  Treatment If the condition is severe and/or rapidly progressive, hospitalization is recommended for an immediate diagnostic work-up and treatment. If the condition is mild or slowly progressive, treatment is often done on an outpatient basis. Generally, dogs that are suffering from this condition are confined to ensure that they are not at risk of being injured while they are healing. You will need to set up a place in the house where your dog can rest comfortably and quietly, away from other pets, active children, and busy entryways. Trips outdoors for bladder and bowel relief should be kept short and easy for your dog to handle during the recovery period. You may consider cage rest for a short time, if it is difficult to keep your dog confined to one place. However, it is important that your dog is not left alone for extended times, as this can be a very stressful time for the dog. Your dog&#039;s healing process will benefit from being comforted by you. Living and Management It is recommended that periodic neurologic examinations be performed to monitor your dog&#039;s progress."}]