[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lice in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/lice-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/lice-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin-hair/c_dg_lice_canine_pediculosis"}, "datePublished": "October 22, 2012", "dateModified": "August 16, 2022", "description": "Lice are parasites that live on the skin. Left unchecked, they can grow to be an infestation on the dog’s body", "articleBody": "Canine Pediculosis Lice are parasites that live on the skin of an affected dog. They are actually a small insect that feeds by chewing on the skin of the dog or by sucking the blood, depending on the type of louse. Left unchecked, they can grow to be an infestation on the dog’s body. Dog lice are not as common as dog fleas, and are most often seen in situations where sanitary practices are poor. Symptoms and Types of Dog Lice Symptoms seen in infested dogs include: Excessive itchiness and scratchingA dry scruffy-looking coatHair loss, most often around the ears, neck, shoulders, groin, and rectal areaAnemia, particularly in puppies and small dogs and particularly with severe infestationCauses of Dog Lice There are two species of lice that infest dogs: Trichodectes canis, known as a chewing louse; that is, it chews the skin of the dog it is infestingLinognathus setosus, a sucking louse, one that sucks the blood of the dog instead of chewing the skinBoth types of lice can be passed directly from one dog to another through direct contact or through contact with contaminated objects, such as grooming utensils or bedding. Lice are species-specific. They do not move from one species to another. That means that you cannot get lice from your dog nor can your dog get human specific lice from you. Diagnosis of Dog Lice Diagnosis is easily made by visually observing lice or their nits (eggs) in the hair. Adult lice are flat, six-legged insects with no wings. Nits can be seen attached to the individual hair shafts and appear as small white dots. Treatment for Dog Lice There are a wide variety of shampoos, as well as insecticidal sprays and powders that are effective in killing lice. In addition, products such as fipronil and selamectin can also be used. (They come in various brand names.) It may be necessary to treat your dog more than once to kill the developing nits as they hatch. Follow your veterinarian’s directions closely, as these products can be harsh on some dogs, especially puppies. In cases where your dog’s fur is badly matted, it may be necessary to shave the fur to be sure of getting to the deeper lice and their nits. To prevent reinfection, dispose of or wash all of your dog’s bedding, as well as thoroughly cleaning all of the places your dog spends time. Some items that cannot be laundered or washed down may be sealed tightly in plastic bags for a few weeks. Disinfect all grooming utensils and anything else your dog comes into contact with regularly, such as crates, and of course, all of the furniture, rugs, carpeting and hard flooring. "}]