[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/zbmm5c9hal", "@type": "VideoObject", "duration": "PT2M7S", "name": "5361799490001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/13f2c4dc32b1c0a41e7e51c6bde22b9705a52bc0.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/zbmm5c9hal", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/f6280d6ab24e4b3ccd597093a1b329d5ebe6d7f6.m3u8", "transcript": "Aggression between dogs can be caused by a variety of factors. But understanding why the behavior is happening and taking steps to modify the behavior is important for maintaining harmony in your household or community. Signs of aggression in dogs may include growling snarling biting and lunging dogs may also show dominance by staring intently at the other dog or blocking a dog from entering the room. Aggressive behavior can happen at any age and in any breed.\n\nBut it's most common in non neutered male dogs and happens more often between dogs of the same gender. There are a variety of reasons why dogs may show signs of aggressive behavior. These include a lack of socialization as a puppy or a lack of positive training from a pet parent. A dog's past experiences including abuse or traumatic experiences with another dog may also influence the dog's behavior.\n\nDogs that are experiencing fear and anxiety or even physical pain may become uncharacteristically aggressive towards other dogs or people initially keeping your dog away from situations that trigger aggression may be necessary. This could mean avoiding off leash dog parks or walks in areas that are heavily populated. If the aggressive behavior is happening in your house. You may need to separate the dogs using secure gates or crates.\n\nBehavior modification using positive reinforcement training is the best way to help. A dog overcome aggression. Pet owners should incorporate high value rewards like pieces of hot dog or cheese for appropriate behaviors like when your dog looks at you instead of reacting to another dog. Always keep a buffer of distance between your dog and other dogs as you work through behavioral modification exercises.\n\nAnd remember to keep your practice sessions short and upbeat. If your dog's aggression towards other dogs is severe or he doesn't seem to be responding well to behavior modification efforts. It's a good idea to set up time with a certified trainer or canine behaviorist to help you work with your dog.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/behavioral/c_dg_aggression_toward_familiar?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Aggression in Dogs Toward Familiar People", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Behavioral", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-aggression-towards-familiar-people.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-aggression-towards-familiar-people.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior, Aggression", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/behavioral/c_dg_aggression_toward_familiar"}, "datePublished": "July 1, 2008", "dateModified": "August 16, 2022", "description": "While some consider aggression to be normal behavior in dogs, it can be impulsive, unpredictable, and even dangerous. Aggressive behavior includes growling, lip lifting, barking, snapping, lunging, and biting.", "articleBody": "Dominance, Fear, or Predatory Aggression in Dogs While some consider aggression to be normal behavior in dogs, it can be impulsive, unpredictable, and even dangerous. Aggressive behavior includes growling, lip lifting, barking, snapping, lunging, and biting. With aggression directed towards family members or other people familiar to the dog, treatment is currently aimed at controlling the issue, as there is no known cure. Symptoms and Types It can be challenging to determine whether a dog is demonstrating abnormal aggression. Aggression is often exhibited near the dog&#039;s food bowl, toys, and times when the dog is being handled. This type of aggression is shown to familiar people, most often their handlers or household members. Aggression can be seen often and it may not even be towards the same person regularly. Aggression is often displayed as: Ears tucked backSnarlingEye aversionBitingLungingWhile most aggression towards familiar people is a sign of a serious problem, there are some instances where an animal will be aggressive following a painful medical procedure or if they are in pain regularly. Causes Some breeds are more aggressive than others. These breeds include Spaniels, Terriers, Lhasa Apsos, and Rottweilers, amongst others, but aggression can appear in any breed. Dogs will normally demonstrate signs of aggression between the ages of 12 and 36 months, and is seen more in male than female dogs. Medical conditions and the after-effects of medical procedures can also cause an animal to exhibit aggression towards familiar people. In addition, inconsistent or harsh punishment from the dog&#039;s owner can contribute to the animal’s aggression. Diagnosis During a medical examination, your veterinarian will look for fear-based aggression, anxiety conditions, and pathological disease. Typically, however, a traditional blood test will not find any abnormalities.  Treatment Animals exhibiting aggression towards familiar people require strict behavior modification therapy, and possibly medication. Behavior therapy involves eliminating or controlling situations that may trigger aggression. Veterinarians will help the owner identify the triggers and behaviors, so they can work to correct them. Some dogs will require a muzzle until the behavior is under control. Affection control (working to make the animal obey a command before they receive any treats) is also effective for behavior modification. In addition, desensitization can decrease the animal&#039;s responsiveness to anxiety and fear. In some cases, physical activity can help reduce feelings of aggression in dogs. A low-protein/high-tryptophan diet has had success in reducing aggression. There currently are no approved medications to treat canine aggression, but surgically neutering aggressive male dogs is a common recommendation. Living and Management The treatment recommendations given to reduce aggression are designed to be lifelong and should be strictly and consistently followed by the dog&#039;s owner. There is currently no cure for aggression. Prevention One of the best preventative measures is to not breed aggressive animals, and to begin socialization and hierarchy training at an early age. See Also"}]