[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Blue Skin and Mucus Membranes in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/blue-skin-mucus-membranes-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/blue-skin-mucus-membranes-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_cyanosis"}, "datePublished": "January 19, 2010", "dateModified": "August 16, 2022", "description": "Cyanosis is a medical condition characterized by blue colored skin and mucous membranes, which occurs as the result of  inadequate amounts of oxygenated hemoglobin (the molecule which carries oxygen) making it into the blood.", "articleBody": "Cyanosis in Dogs Cyanosis is a medical condition characterized by blue colored skin and mucous membranes, which occurs as the result of inadequate amounts of oxygenated hemoglobin -- the molecule which carries oxygen to the body tissues -- or due to hemoglobin abnormalities. Unfortunately, dogs that are suffering from cyanosis caused by advanced lung/airway disease and severe heart disease have a poor long-term prognosis. Symptoms and Types Heart murmurCrackles heard when listening to the lungsMuffled heart soundsHarsh sounds upon inhalationHonking coughDifficulty breathingCyanotic, cool, pale, painful, swollen limbs lacking a strong pulseWeaknessPosterior (hind limb) paresis or paralysisCauses Originating in the Respiratory System Larynx (voice box): can be due to paralysis (acquired or congenital); collapse; spasm; swelling; trauma; cancer; chronic inflammatory diseaseTrachea: can be due to collapse; neoplasia; foreign body; trauma; underdevelopmentLower airway: can be due to pneumonia (viral, bacterial, fungal, allergic, mycobacteria, aspiration); chronic swelling of the bronchioles; allergies, asthma; chronic dilation of the bronchioles; cancer; foreign body; parasites; bruising of the lungs; swelling due to inhalation, snake bite, electric shock; near drowningPleural space: may be due to air in the chest cavity; infectious (bacterial, fungal); pus in the chest cavity; blood in the chest cavity; cancer; traumaChest wall, or diaphragm: may be related to congenital defects such as hernia around the heart or through the diaphragm (when an organ pushes through the wall, or enclosure that normally contains it); trauma (diaphragmatic hernia, fractured ribs); neuromuscular diseaseOriginating in the Cardiovascular System Congenital defectsAcquired disease: may be linked to mitral valve (left side of heart valve between atrium and ventricle) disease; disease of heart muscleFluid collection around the heart: due to cancer or unknown causesClogging of lung blood vessels with a clotPulmonary hypertension: unknown origin (idiopathic); right-to-left cardiac shunts (blood is diverted to another pathway)Peripheral blood vessel diseaseOriginating in the Neuromusculoskeletal System Brain-stem dysfunction: due to brain swelling; trauma; bleeding; cancer; drug-induced depression of the respiratory centerSpinal cord dysfunction: may be due to swelling; trauma; vertebral fractures; disk slippageNeuromuscular dysfunction: may be caused by overdose of paralytic drugs; tick paralysis; botulism; coonhound paralysisMethemoglobinemia Methemoglobin (metHb) binds to water molecules rather than oxygen moleculesElevated concentrations of methemoglobin in the red blood cells leads to tissue hypoxia due to reduced oxygen carrying capacity of bloodCongenitally acquired NADH-methaemoglobin reductase (NADH-MR) deficiency: deficiency of an intracellular reductive enzyme, which helps keep methemoglobin at levels of less than two percent, preventing cyanosisMay be linked to ingestion of oxidant chemicals: acetaminophen, nitrates, nitrites, phenacetin, sulfonamides, benzocaine, aniline dyes, dapsoneDiagnosis Your veterinarian will first stabilize your dog&#039;s oxygen levels. This is usually done in ICU (intensive care unit) in a specially equipped oxygen cage. Once your dog is stable, your veterinarian will be able to perform a full physical exam. A blood chemical profile, complete blood count, urinalysis, electrocardiograph (EKG), thoracic radiographs (and echocardiogram with Doppler, if heart or lung disease is suspected), and an electrolyte panel should be ordered to determine the underlying cause of the disease that is causing cyanosis. A laryngoscopic (voice box) and/or bronchoscopic (lung airway) exam should be given. If bronchopulmonary (lung disease) disease is suspected, a transtracheal wash, a bronchoalveolar lavage or fine-needle lung aspirate may be performed. For pleural space disorders, a thoracocentesis (a procedure which removes fluid from the chest cavity) will be required. Methemoglobinemia is a condition that can be measured; one of the most obvious indications is that the color of the blood will be darker than the bright red it is supposed to be. Arterial blood can be taken so that a blood gas analysis can be performed at the laboratory. Your dog&#039;s breathing patterns will also give your veterinarian a clue as to the origin of the cyanosis.  Treatment Your dog will need to be kept stabilized by giving it oxygen. Depending on what underlying illness is causing the cyanosis, drugs may be prescribed to treat the condition, or surgery and/or further therapy ordered. Living and Management You will need to restrict your dog&#039;s activity during treatment and possibly after. A low-salt diet can be put in place if your veterinarian determines that heart disease is involved. You should also check your dog&#039;s gums for normal color, making sure they are a healthy pink or reddish color. If your dog&#039;s gums are purple or white, you should take it immediately to the veterinary hospital for emergency treatment. "}]