[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is elbow dysplasia in dogs curable?", "acceptedAnswer": {"@type": "Answer", "text": "Unfortunately, elbow dysplasia cannot be cured. But it can be well managed. Surgery and medications can give your dog a relatively good quality of life. Playing fetch is not out of the question!"}}, {"@type": "Question", "name": "How long can a dog live with elbow dysplasia?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with minimal arthritis at the time of diagnosis have a much more favorable prognosis than those that have significant arthritis. Fortunately, with surgical therapy, and even with medical management to an extent, dogs with elbow dysplasia can go on to live a fairly healthy life. Featured Image: iStock/xavierarnau"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Elbow Dysplasia in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/elbow-dysplasia-in-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/elbow-dysplasia-in-dogs.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_dg_elbow_dysplasia"}, "datePublished": "November 14, 2022", "dateModified": "March 30, 2023", "description": "Dr. Michael Kearley discusses elbow dysplasia in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Elbow Dysplasia in Dogs? The canine elbow is a complex articulating joint made up of three bones: the humerus, the radius, and the ulna. These bones work together to allow a dog to bend, run, and play. Elbow dysplasia is a condition related to abnormal bone growth and/or development that alters the function of this joint, leading to abnormal weight distribution, pain, and arthritis—which most certainly affect a dog’s ability to bend, run, and play. Elbow dysplasia is seen more often in younger, large-breed dogs.    Typically, elbow dysplasia is diagnosed as having four lesions, involving different parts of the joint: Ununited anconeal process (UAP): UAP occurs when there has been separation of the anconeal process, a part of the ulna. This is usually noted at 4-8 months of age. Initially, the anconeal process is held by fibrous tissue to the ulna, but due to variable factors like trauma, it fails to fuse or becomes detached and the joint becomes unstable.Fragmented coronoid process (FCP): FCP occurs when the coronoid process, a part of the ulna, fails to attach to the rest of the bone. It is problematic because that piece aids in the articulating surface of the joint. Without it, looseness, inflammation, and arthritis develop within the joint.Osteochondrosis of the medial humeral condyle: During development, cartilage eventually turns into bone, but in this case, that process doesn’t occur. So, where bone should be—specifically, where the medial condyle attaches to the humerus—cartilage, instead of bone, becomes the articulating surface. This can subsequently flake off, causing pain, swelling, and lameness. Medial compartment disease (MCD): MCD occurs when an abnormal amount of pressure from one joint surface erodes the other articulating joint surface, causing bone to become exposed, inflamed, and painful. This form of dysplasia carries the worse prognosis, as it cannot be reversed, and the cartilage cannot be replaced. Surgery may be a possibility, but further research is needed.  Symptoms of Elbow Dysplasia in Dogs Dogs are typically not screened for elbow dysplasia, unless it is known to have occurred in the dog’s bloodline, or the breed is predisposed. Most signs are fairly noticeable to the pet parent and the veterinarian, but some can be subtle, making the condition hard to diagnose. Dogs most often experience: Lameness or limping in one or both forelimbs, sometimes seen with a head bob. Most dogs will still be able to bear weight on the limb Swollen elbow Thickened joint Decreased range of motion Pain on manipulation of the joint Elbow bulges out toward the side Abnormal gait Hesitant to run or play as before Causes of Elbow Dysplasia in Dogs Elbow dysplasia is thought to be an inherited condition, but it has also been associated with: Prior trauma Nutritional imbalances or deficiencies Defects in cartilage growth or bone development Hormonal factors Certain large-dog breeds are predisposed to the condition, which more often affects both elbows rather than one. These include: Bernese Mountain Dogs Labrador Retrievers German Shepherds Rottweilers Newfoundlands Mastiffs How Veterinarians Diagnose Elbow Dysplasia in Dogs A physical exam will help localize the source of pain and discomfort to the elbow before x-rays will be taken of the limb. Sometimes, in order to obtain more accurate diagnostic images, your dog may need to be sedated or anesthetized. X-rays are almost always taken of the opposite limb as well for comparison purposes and to determine if disease is present in that elbow as well. If the signs cannot be determined on x-rays, a CT scan or arthroscopy (scoping, using a camera called an arthroscope, to take images of the elbow joint) may be ordered. In some cases, treatment of the condition can also occur during the arthroscopic procedure. Treatment of Elbow Dysplasia in Dogs The goal of any treatment for elbow dysplasia is to slow the progression of arthritis and allow the dog to use the elbow properly. Surgery is by far the most recommended course of treatment, not only to remove any diseased or damaged tissue but also to return functional ability to the joint. Surgery should be performed as soon as possible in order to prevent further joint trauma. It is important to note, however, that even with surgery, some degree of arthritis will develop. Because most surgeries are aimed at removing the part that is causing the dysplasia, the joint will be missing vital structures and won’t fit perfectly together. Given the technical prowess needed for repair, arthroscopic surgery is often preferred, as it is minimally invasive. This is usually performed by a veterinary orthopedic surgeon.  Dogs that are not candidates for surgery are treated supportively with: Medications aimed at decreasing pain and inflammation, such as NSAIDs like Rimadyl®, Galliprant®, and meloxicam Joint supplements containing glucosamine and chondroitin, which help decrease inflammation, promote healing, and retain water, giving the joint more cushioning (similar to WD-40 for gears) Weight management, as any additional weight is that much more problematic for the joint Adequan®, an injectable medication that inhibits cartilage loss, to help restore joint lubrication and relieve inflammation How Much Does Elbow Dysplasia Surgery Cost? Cost and the ability to properly care for your dog post-op and throughout the rehabilitation process should be strong considerations in determining the best course of treatment for your dog. Of course, this should be a conversation you have with your veterinarian, but most surgeries cost $1,500-$4,000 per elbow, depending on your region. Recovery and Management of Elbow Dysplasia in Dogs The prognosis for elbow dysplasia in dogs is good long-term, especially if degeneration is minimal or not apparent. The recovery period is often several weeks followed by several more of physical therapy and rehabilitation. It’s important to follow through, as this will often lead your dog to a faster recovery and better outcome than surgery alone. Rehabilitation with passive range-of-motion exercises, massage, acupuncture, or even physical therapy will be recommended and should be pursued in order to provide the best return to function as soon as possible. Additionally, exercise restriction will be important long-term, along with minimizing the impact of running, especially on hard flooring.  Dogs that cannot undergo surgery for one reason or another can live a long time with the condition. However, degenerative changes will develop over time, along with osteoarthritis, and your dog will suffer chronic pain. As such, medications like those mentioned above may be prescribed, along with joint supplements and diets. Prevention of Elbow Dysplasia in Dogs Because the condition is thought to have a genetic component, any pets with elbow dysplasia should be spayed or neutered to keep them from passing on the condition. Also, the parents shouldn’t be bred again. Minimizing trauma or additional stress to the joints—by, for example, keeping your dog from jumping down from furniture or going up and down stairs—may be helpful, as well as maintaining a healthy weight. Screening your puppy for this condition with x-rays would be advisable if your puppy is a breed susceptible to the condition."}]