[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Severely Abnormal Heart Rhythm in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_ventricular_fibrillation"}, "datePublished": "April 19, 2010", "dateModified": "August 16, 2022", "description": "Ventricular fibrillation (V-Fib) is a condition in which ventricle muscles in the heart begin to contract in a disorganized fashion, making them quiver.", "articleBody": "Ventricular Fibrillation in Dogs Ventricular fibrillation (V-Fib) is a condition in which ventricle muscles in the heart begin to contract in a disorganized fashion, making them quiver. Due to this uncoordinated contraction, blood circulation may cease within minutes, which may be fatal. Although it can affect dogs at any age, it seems to affect those that are older. Symptoms and Types     Systemic illnesses associated with cardiac disease    Previous history of heart beat rhythm problems (cardiac arrhythmia)    Collapse    DeathCauses     Absence of oxygen in inspired gases or in arterial blood or in the tissues    Blockage of the aorta (aortic stenosis)    Heart surgery    Drug reactions (e.g., anesthetics, especially fast-acting barbiturates, digoxin)    Electrical shock    Electrolyte imbalances    Hypothermia    Inflammation of the heart muscle (myocarditis)    ShockDiagnosis Unless some underlying infection, metabolic problem, or other such condition is present, the results of routine laboratory tests are usually normal. Your veterinarian will, however, record the ECG (electrocardiogram) results, which is helpful in identifying V-Fib and other related heart problems.  Treatment This is an emergency that requires prompt and aggressive treatment. In fact, without treatment, most dogs die within a matter of minutes. Often, electrical cardioversion is used, wherein an electrical defibrillator is used to deliver small electrical shocks to return the heart to normal rhythm. Initially, low intensity shocks are given; if the heart does not respond, the emergency veterinarian may increase the voltage. If there is no access to an electrical defribillator, he or she may administer a precordial thump, whereby a sharp blow is applied to the chest wall over the heart with an open fist. Although rarely successful, it may be the only alternative. Living and Management Once the dog&#039;s heart has returned to a normal rhythm, it will require hospitalization for a few days to fully recover. Regular follow-up exams with the veterinarian will also be required, so that he or she may evaluate the dog&#039;s progress (typically with the ECG and other diagnostic procedures)."}]