[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/xizxgxqjzx", "@type": "VideoObject", "duration": "PT1M37S", "name": "5327088404001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/99d0c1bdd941b72451e98edcb3e551c52fb9a76c.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/xizxgxqjzx", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/83d6f641244a5434acfdfa9af3abb3cdafaa0868.m3u8", "transcript": "Discovering blood in your dog's urine can be unsettling for any pet parent. This condition known as materia is usually a sign of an underlying medical problem and a veterinary visit is recommended. The most common causes for blood in a dog's urine include urinary tract infections bladder, kidney stones blood clotting disorders or even trauma he material may also develop from tumor is associated with certain types of cancer, which is more common in older dogs. Female dogs are more likely to develop urinary tract infections than male dogs resulting in blood tin's urine.\n\nThe most common symptom ommatidia in dogs is urine that is red or pink in color. This is sometimes difficult to spot if your dog goes to the bathroom outside or on the grass. If kidney or bladder stones are causing the blood your dog may also show signs of abdominal pain straining to urinate urinating more frequently or even vomiting. In addition to a thorough physical exam veterinarians will often recommend a urinalysis chemistry panel and a complete blood count to determine the cause of blood in a dog's urine.\n\nX-rays or ultrasounds may also be suggested as a way to identify potential stones tumors blockages or evidence of trauma treatment for materia will depend on the cause of the condition. Antibiotics may be prescribed for a urinary tract infection or a change in diet may be necessary if bladder or kidney stones are noted sometimes larger stones have to be removed with a surgical procedure. Cancer or blood disorder related conditions can be much more complicated therapeutically but are not considered untreatable by any means.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/urinary/c_dg_hematuria?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Blood in the Urine in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Urinary", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/urinedog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/urinedog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/urinary/c_dg_hematuria"}, "datePublished": "April 21, 2009", "dateModified": "August 16, 2022", "description": "Hematuria is a condition which causes blood to fall into the urine, and which may indicate a serious underlying disease process.", "articleBody": "  Hematuria in Dogs Hematuria is a condition which causes blood to fall into the urine, and which may indicate a serious underlying disease process. Familial hematuria (a condition in which blood in the urine runs in certain families of animals) is usually implicated in young dogs, while cancer is the usual cause in older dogs. Females are at greater risk for urinary tract infections that lead to blood in the urine than are males. Symptoms Symptoms of hematuria include blood in the urine, a sign in itself. Red-tinged urine, with or without abnormal frequent passage of urine will be evident. In patients with cancer, a mass may be palpated during physical examination. In male dogs an enlarged and/or painful prostate gland may be felt during physical examination, and abdominal pain will be evident in some patients. Patients with a blood-clotting disorder may present with subdermal skin hemorrhages, conditions known as petechiae and ecchymoses, which appear as bruises. These discolored spots will be indicated by round, purplish, non-raised patches on the skin. Causes Systemic causes are generally due to coagulopathy (clotting)Low number of platelets or thrombocytes in the blood (a condition known as thrombocytopenia)Diseases of the upper urinary tract are caused by inflammation of the blood vessels (known as vasculitis)Upper urinary tract – the kidneys and ureters:Structural or anatomic disease, such as cystic kidney disease and familial kidney diseaseMetabolic diseases, such as kidney stonesNeoplasiaInfectious diseasesNephritisIdiopathic causesTraumaIn the lower urinary tract:Infectious diseaseInflammatory disease in the kidneyUnknown causeTraumaLower Urinary Tract ‒ bladder and urethra:Structural or anatomic issues such as bladder malformations are implicated in bringing on hematuriaMetabolic causes, such as stones, are possibleNeoplasiaInfectious disease (such as bacterial, fungal, and viral disease):Idiopathic causesTraumaChemotherapy can elicit hematuriaUnknown causeTraumaIssues involving the genitalia include metabolic conditions:Heat cycle, or estrusNeoplasiaCancer or tumorsIinfectious disease such as from bacteria and fungusInflammatory diseaseTraumaDiagnosis You will need to give a thorough history of your dog&#039;s health, including a background history of symptoms, and possible incidents that might have precipitated this condition. The history you provide may give your veterinarian clues as to which organs are causing secondary symptoms. Your veterinarian will perform a thorough physical exam on your dog, with a complete blood profile, including a chemical blood profile, a complete blood count, and a urinalysis. In male dogs, examination of an ejaculate sample will help to identify prostatic disease. Differential diagnoses for blood-tinged urine will include other causes for discolored urine. The common urine reagent strip tests for blood are designed to detect red blood cells, hemoglobin, or protein. Diet will also be considered. If you are supplementing your dog&#039;s diet with vitamins or anything different from a regular kibble diet, you will need to share this with your veterinarian, since substantial doses of vitamin C (ascorbic aid) may cause false-negative reagent test strip results. Ultrasonography, radiography, and contrast radiography may be useful in obtaining a diagnosis. If any mass lesions are indicated, a biopsy may be necessary for a definitive diagnosis. A vaginoscopy in female dogs, or a cystoscopy in male dogs will rule out neoplasia and lower urinary tract issues.  Treatment Treatment of the hematuria will be dependent on the primary or associated diseases that are the underlying cause for the condition. Urinary tract infection may be associated with another disease involving the urinary tract, such as cancer, or urinary tract stones (urolithiasis). Or, hematuria may be caused by a condition that involves the body in general, such as with an excessive production of steroids by the adrenal glands, or diabetes. A systemic generalized condition will need to be treated before the hematuria can be resolved. Surgery may be indicated for cases with urinary tract stones, neoplasia, and traumatic injuries to the urinary tract. Blood transfusions may be necessary if your dog has a severely low red blood cell count. Fluids will be used to treat dehydration, and dog antibiotics can be used to treat urinary tract infection and generalized diseases due to bacteria in the blood (bacteremia). Urolithiasis and kidney failure may require diet modification top prevent relapse. If your dog is suffering from a clotting disorder, the blood thinner Heparin may be used to bring it under control. Living and Management Because hematuria may indicate a serious underlying disease process, ongoing treatment will be dependent on the primary or associated diseases that are related to it."}]