[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/k0dyt2k1cs", "@type": "VideoObject", "duration": "PT2M3S", "name": "5324794627001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/6f317f019d9bdf6c6fed811dac15c2683eaf3fc9.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/k0dyt2k1cs", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/23a7c7add0ca01e72509742aeb16e4c114b8a372.m3u8", "transcript": "If your dog is in pain you want to do all that you can to help him feel better. But while over the counter medications are safe and effective treatments for humans they can be very dangerous for dogs Human non steroidal anti inflammatories commonly referred to as incense should not be given to dogs for a few very important reasons. First, it's very easy for pet parents to administer an inappropriately high dose of these medications and second instead that mix with pre-existing health conditions in dogs or other medications can have an unfavorable and even dangerous outcome. These drugs may also produce scary side effects in certain dogs and should be avoided.\n\nCommon and says include aspirin and ibuprofen Tylenol or acetaminophen is another over-the-counter human pain medication that should not be given to dogs. If dogs ingest large amounts of acetaminophen the drug can destroy their liver cells damaged the kidneys and result in poor oxygen delivery throughout the body. As an aside Tylenol can be deadly for cats so it's really just best to keep all pills meant for humans in a safe spot in your home that's inaccessible to your four legged family members to treat pain and dogs pet parents should work directly with their veterinarian to identify the best options.\n\nThere are several pain medications designed specifically for treating pain and dogs, including car paraffin Derek Cox live and Maalox a Cam. Dog owners should always follow veterinary instructions for administering these drugs and report back if they notice any side effects such as an accident vomiting, diarrhea, or bleeding. In addition dogs with arthritis may benefit from a change in diet or a weight loss program. Supplements like glucosamine conjoined and hyaluronic acid may also assist with reducing inflammation in dogs but pet parents should consult their veterinarians before giving dogs any supplements.\n\nAnd it is OK to think outside the box to talk with your veterinarian about any herbal therapies available. And even acupuncture and physical therapy. These methods have also been shown to decrease the effects of arthritis pain in pet.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/muscokeletal/c_dg_dog_hernia_inguinal?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hernia (Inguinal) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/hernia-inguinal-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/hernia-inguinal-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/muscokeletal/c_dg_dog_hernia_inguinal"}, "datePublished": "October 15, 2012", "dateModified": "August 16, 2022", "description": "An inguinal hernia is a condition in which the abdominal contents protrude through an opening which occurs in the muscle wall in the groin area.", "articleBody": "Inguinal Hernia in Dogs Much like humans, dogs can suffer from hernias. An inguinal hernia is a condition in which the abdominal contents protrude through the inguinal canal or inguinal ring, an opening which occurs in the muscle wall in the groin area. Inguinal hernia can occur in both dogs and cats. If you would like to learn how this type of hernia affects cats, please visit this page in the petMD health library. Symptoms and Types Inguinal hernias may be uncomplicated or complicated. A complicated hernia is one in which contents of the abdominal cavity have passed through the opening and become entrapped. Symptoms seen with an uncomplicated inguinal hernia are: A soft swelling in the groin area, which may occur on one or both sides of the bodySymptoms seen with a complicated inguinal hernia may include: Swelling in the groin area, which may become painful and warm to the touchVomitingPainFrequent attempts to urinateBloody urineLack of appetiteDepressionCauses In dogs, inguinal hernias may be acquired (not present at birth but developing later in life) or congenital (present at birth). Factors which predispose a dog to develop an inguinal hernia include trauma, obesity, and pregnancy. Most inguinal hernias are uncomplicated and cause no symptoms other than a swelling in the groin area. However, if contents from the abdominal cavity (such as the bladder, a loop of intestines or the uterus) pass through the opening and become entrapped there, the situation can become life-threatening. Diagnosis Inguinal hernias can usually be diagnosed by finding the swelling caused by the hernia on a physical examination. However, sometimes contrast radiographs (X-rays) or an abdominal ultrasound are needed to determine which abdominal contents, if any, are entrapped.  Treatment Treatment is surgical correction of the opening and replacement of abdominal contents back into the abdomen if necessary. Prevention Because inguinal hernias can be hereditary, dogs with these hernias should not be bred. See Also"}]