[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hearing Loss in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Ears", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/hearing-loss-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/hearing-loss-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Ear health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/ears/c_multi_Deafness"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Deafness refers to the lack (or loss) of an animal&#039;s ability to hear -- this can either be complete or partial loss. Learn more about Dog Hearing Loss and ask a vet today at Petmd.com.", "articleBody": "Deafness in Dogs Deafness refers to the lack (or loss) of an animal&#039;s ability to hear -- this can either be complete or partial loss. If the dog is deaf at birth (congenital), it will be very apparent to you at a young age. More than 30 breeds of dogs have a known susceptibility for deafness, including the Australian shepherd, Boston terrier, cocker spaniel, Dalmatian, German shepherd, Jack Russell terrier, Maltese, toy and miniature poodle, and West Highland white terrier. Typically, it is more common in senior dogs. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the petMD health library. Symptoms Unresponsive to everyday soundsUnresponsive to its nameUnresponsive to the sounds of squeaky toysNot woken by a loud noiseCauses Conduction (sound waves do not reach the nerves in the ear)Inflammation of the outer ear and other external ear canal disease (e.g., narrowing of the ear canal, presence of tumors, or ruptured ear drum) Inflammation of the middle ear NerveDegenerative nerve changes in elderly dogsAnatomic disorders — poor development (or lack of development) in the part of the ear that contains the nerve receptors used for hearing; the condition leads to fluid buildup in specific areas of the brain and damages the part of the brain involved with hearingTumors or cancer involving the nerves used for hearingInflammatory and infectious diseases — inflammation of the inner ear; canine distemper virus may cause alterations in hearing, but not complete deafness; inflammatory masses that develop in the middle ear or eustachian tubeTraumaToxins and DrugsAntibioticsAntisepticsChemotherapy drugsMedications to remove excess fluid from the bodyHeavy metals such as arsenic, lead, or mercuryMiscellaneous — products used to break down waxy material in the ear canalOther risk factorsLong-term (chronic) inflammation of the outer, middle, or inner earCertain genes or white coat color  Diagnosis A complete history of the dog, including any drugs that may have damaged the ear or caused a chronic ear disease, is completed by the veterinarian. Early age onset usually suggests birth defects (congenital causes) in predisposed breeds. On the other hand, brain disease is a slow progressive disease of the cerebral cortex, usually caused by senility or cancer -- making the brain not able to register what the ear can hear. Bacterial cultures and hearing tests, as well as sensitivity testing of the ear canal, may also used to diagnose the underlying condition.    Treatment Unfortunately, any deafness present in the dog at birth (congenital) is irreversible. If it is caused by an inflammation of the outer, middle, or inner ear, medical or surgical approaches may be used. These two methods, however, are dependent on extent of disease, bacterial cultures, sensitivity test results and X-ray findings.  Conduction problems, in which sound waves do not reach the nerves of hearing, may improve as inflammation of the outer or middle ear are resolved. Hearing aids can also sometimes be used for dogs. Living and Management Your dog&#039;s activity should be reduced to avoid any any possible injury (e.g., a deaf dog cannot hear an approaching car). The home environment may also need to be controlled for the dog&#039;s protection. The veterinarian will need to see your dog weekly and treat it for the ear disease, or until the condition is resolved."}]