[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live after being diagnosed with nasal adenocarcinoma?", "acceptedAnswer": {"@type": "Answer", "text": "Without treatment, the average survival time for dogs is about 3 to 5 months after a diagnosis of nasal adenocarcinoma."}}, {"@type": "Question", "name": "Is nasal adenocarcinoma painful for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, this cancer can be extremely painful and can interfere with eating and breathing."}}, {"@type": "Question", "name": "How aggressive are nasal adenocarcinomas in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Nasal adenocarcinoma is extremely aggressive where it occurs, but it does not typically spread to other areas of the body."}}, {"@type": "Question", "name": "Is nasal adenocarcinoma curable?", "acceptedAnswer": {"@type": "Answer", "text": "While radiation therapy can shrink tumors and improve quality of life, the disease is rarely cured. Survival time after appropriate treatment can be close to 2 years. However, in some cases dogs can live longer. A dog who lives 4 to 5 years after treatment can be considered cured."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Nose Cancer in Dogs (Nasal Adenocarcinoma)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/beagle.nose_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/beagle.nose_.jpg"}, "author": {"@type": "Person", "name": "Heather Newett, MPH, DVM", "url": "https://www.petmd.com/author/dr-heather-newett"}, "keywords": "Dog, Cancer, Nose health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_multi_adenocarcinoma_nasal"}, "datePublished": "February 22, 2022", "dateModified": "August 12, 2022", "description": "Dr. Heather Newett describes nasal adenocarcinoma in dogs, including their symptoms, diagnosis, and treatment.", "articleBody": "What is Nasal Adenocarcinoma in Dogs? Nasal adenocarcinoma is the most common type of nasal tumor (cancer) found in dogs. This type of tumor can occur anywhere in a dog’s nasal passage, including the sinus area. Nasal adenocarcinoma is typically aggressive in the nasal area, but it rarely metastasizes (spreads) to other areas of the body. If the cancer does spread, it usually spreads to nearby lymph nodes, lungs, and the brain.  Dogs tend to develop these tumors at twice the rate of cats, and studies have shown that these tumors are usually diagnosed around 10 years of age.   Signs and Symptoms of Nasal Adenocarcinoma in Dogs Most dogs with nasal adenocarcinomas will experience a runny nose prior to a diagnosis. Because this is a common symptom of many conditions, the nasal discharge may improve with treatment, which can delay a proper diagnosis.  The discharge may become bloody, clear, or appear like mucus. It often comes out from one side of the nose. As the tumor grows, the discharge may begin to emerge bilaterally, and may be associated with sneezing or snoring sounds.  If the tumor grows large enough, it can cause deformities of the face and destroy the surrounding soft and bony tissue. This may cause the eyes to protrude. In rare cases when the tumor spreads to the brain, the pet parent may see changes in behavior as well as sudden blindness or seizures.  Common symptoms of nasal adenocarcinoma include:  Chronic nasal discharge or bleeding  Swelling of the muzzle/face  Sneezing  Symptoms for nasal adenocarcinoma can sometimes mimic symptoms caused by:  Allergies  Fungal infections  Foreign material lodged in the nasal passages  Causes of Nasal Adenocarcinoma in Dogs Although the exact cause for nasal adenocarcinoma is considered idiopathic (unknown), risks appear to increase with exposure to tobacco smoke, kerosene, coal combustion and other airborne pollutants. Due to these types of exposures, dogs in urban environments, especially dogs with longer noses, tend to have higher incidences of this cancer. Flea sprays has also been correlated with the development of nasal tumors in dogs.    Breeds that are predisposed to nasal adenocarcinoma include:  Airedale Terriers  Poodles  Basset Hounds  Scottish Terriers  Collies  Sheepdogs  German Shorthair Pointers  Labrador and Golden Retrievers  How Veterinarians Diagnose Nasal Adenocarcinoma in Dogs When a tumor is suspected, a veterinarian will recommend CT scans and radiographs (x-rays). CT scanning is usually the preferred method to confirm a diagnosis of invasive nasal neoplasia.   Following the scans, the vet will perform a tissue biopsy (a process called histopathology) to identify the type of cancer. The biopsy is taken from the nasal passage by using surgical equipment to extract the tumor sample.   Further x-rays may be taken to determine if the tumor has spread (metastasized) to surrounding areas. Other tests may include taking samples from lymph nodes.  Treating Nasal Adenocarcinoma in Dogs Unfortunately, nasal adenocarcinoma is usually advanced by the time it’s diagnosed, so surgery to remove the tumors completely, is often not possible. The gold standard for treatment is radiation therapy with adjunctive surgery and chemotherapy.  Radiation therapy may require more than 20 treatments to shrink tumors. Therapy may also include radiosurgery, which is when the tumor’s center is attacked with a high dose of radiation to reduce damage to healthy tissue. The treatment may be a single dose or several smaller doses depending on your dog’s specific tumor characteristics.  Although side effects are often minimal and temporary, a pet parent may notice a permanent change in their dog’s fur color, as well as skin peeling or ulceration.   Recovery and Management of Nasal Adenocarcinoma in Dogs Although nasal adenocarcinoma is rarely cured, radiation therapy can push the disease into remission. Dogs can enjoy a good quality of life, with a survival rate of roughly 2 years or more.  Some plastic surgery may be necessary after treatment because the therapies used in treatment can destroy facial tissue.   Dogs that do not undergo a treatment for their nasal adenocarcinoma have a life expectancy of about three to five months after their diagnosis.  "}]