[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Nerve Disorder Affecting Multiple Nerves in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/nerve-disorder-affecting-multiple-nerves-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/nerve-disorder-affecting-multiple-nerves-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Brain health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_multi_peripheral_neuropathies"}, "datePublished": "September 24, 2008", "dateModified": "August 16, 2022", "description": "Polyneuropathy is a nerve disorder that affects multiple peripheral nerves. Unlike the central nervous system, the peripheral nerves are more exposed to the elements that enter into the body and come into contact with the body, so they are more susceptible to physical injury and toxic damage.", "articleBody": "Peripheral Neuropathy (Polyneuropathies) in Dogs Polyneuropathy is a nerve disorder that affects multiple peripheral nerves. Unlike the central nervous system, which has the vertebrae of the spine, and the bone of the skull to protect it, the peripheral nerves are more exposed to the elements that enter into the body and come into contact with the body, so they are more susceptible to physical injury and toxic damage. They are spread over the entire body, and are responsible for conscious, coordinated movement (somatic), for automatic physical responses (autonomic), and for the movement of the digestive system (enteric). Myelin, the white, fatty, lipid material that acts as an insulator coat (also called a sheath) for some nerve fibers, can be lost through a process called demyelination, a condition that causes the myelin to deteriorate, resulting in electrical signals in the nerves being lost, and impairing function. Or, there may be axonal degeneration with secondary demyelination. Axonal degeneration occurs when the actual nerve fibers deteriorate within the myelin sheath. Symptoms and Types Motor and sensorimotor nerve disorders (automatic movement):Weakness or paralysis in all four legsWeak reflexes, or lack of reflexes (automatic physical responses)Weak to no muscle toneMuscle deterioration (atrophy)Muscle tremors, tremblingSensory nerve disorders (pain/pleasure nerve receptors):Spatial disorientation (inability to judge the space around oneself)Weakness to loss of consciousnessNo muscle deteriorationNo muscle tremorsUnder-active thyroid glandParalysis of the voice boxParalysis of the throat/esophagus, affects ability to eat and drinkFacial paralysisDizziness, instabilityDysfunctioning autonomic nervous system (not under conscious control) :Dry noseDry mouthDry eyes - low tear productionSlow heart beat rateLack of an anal reflex Causes Congenital/inheritedDysautonomia: abnormal functioning of the autonomic nervous system, which causes excessive body fluid output, lack of reflexes, and lack of coordinationImmune-diseaseMetabolic diseaseHypothyroidism (under-active thyroid gland)A tumor in the pancreas, the gland that produces insulinInfectiousNeospora caninum parasite -- affects the hind legs, possibly with paralysis, deteriorates muscles (atrophy), impairs immune system; parasite is transmitted through infected animal meat (i.e., dog eats animal that has the parasite in its body), through contact with animal feces that has the parasite in it, usually another dog&#039;s feces, or soil that still has residual infected feces in it; can also be passed from a pregnant animal to its developing fetus through the placentaCoonhound paralysis (polyradiculoneuritis) -- mainly affects hunting dogs that have come into contact with raccoons that carry the infection; affects the four legs, and the muscles that control barking and breathingCancer medicationsToxinsThallium -- used in rodent poisonOrganophosphates -- used in fertilizers and pesticidesCarbon Tetrachloride -- used in insecticidesLindane -- used for killing weeds, insects, and lice  Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have precipitated this condition. A chemical blood profile, a complete blood count, an electrolyte panel, and a urinalysis will be used for confirming, or for ruling out any underlying diseases. Your veterinarian may also opt to perform additional blood tests, and a spinal tap, to look for specific disorders. Chest and abdominal x-rays can be crucial for diagnosing visible peripheral polyneuropathies. X-ray and ultrasound imaging can help to rule out (or confirm) cancer, but the most important diagnostic tool for identifying peripheral neuropathies is electrophysiology – measuring the electrical flow of the body&#039;s tissues and cells. An analysis of tissue sample (biopsy) from the muscles or peripheral nerves can provide further information about the disease process your dog is experiencing.   Treatment   Animals can usually be treated on an outpatient basis. However, dogs with acute polyradiculoneuropathies will have inflammation at the roots of the spinal cord nerves, and are at risk of respiratory failure. They should be hospitalized for observation in the early phase of the disease to prevent this. Dogs with dysautonomia should be hospitalized to receive fluid therapy and/or administered (parenteral) feeding.  Dogs with hyperchylomicronemia, conversely, may spontaneously recover after two to three months of being fed a low-fat diet. Dogs that have been diagnosed with diabetes mellitus should have their blood glucose and diet closely monitored. An excellent related treatment for patients with peripheral polyneuropathies is physiotherapy, for encouraging restoration of the affected musculature and nerve memory.   Living and Management It is important to understand that the cause of many polyneuropathies can never be determined, and treatment of the primary cause of polyneuropathy may not cure your dog. In some cases, the peripheral nerves will continue to deteriorate, and your dog&#039;s disease will worsen. Dogs that have been diagnosed with congenital or inherited forms of polyneuropathies should not be bred. Generally, it is advisable to neuter an animal that is suffering from this condition to prevent accidental breeding. For example, female dogs that have been infected with the Neospora parasite should not be bred, since one of the ways the parasite transmits itself is by spreading to the fetus through the placenta. Dogs that have developed coonhound paralysis (polyradiculoneuritis) will need to be protected from repeated exposure to raccoons, since the initial infection does not impart later immunity from it."}]