[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can you get histoplasmosis from dogs?", "acceptedAnswer": {"@type": "Answer", "text": "While direct transmission from pets to people has never been documented, H. capsulatum can certainly infect people on its own."}}, {"@type": "Question", "name": "Is histoplasmosis contagious in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "No. Dogs do not pass this infection to other dogs."}}, {"@type": "Question", "name": "Is it okay for dogs to eat bird or bat poop?", "acceptedAnswer": {"@type": "Answer", "text": "In addition to putting dogs at risk for histoplasmosis, eating bird droppings can also expose dogs to caustic substances like uric acid and bacteria like salmonella, resulting in vomiting, diarrhea, and other health problems. The best way to minimize your dog’s risk of histoplasmosis is to keep your dog away from potential sources of the fungus, including bird coops and decaying wood."}}, {"@type": "Question", "name": "Can bat poop make dogs sick?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Bat poop can carry fungus spores that infect your dog with H. capsulatum.  Don’t allow your dog to go near caves and other places where bats live."}}, {"@type": "Question", "name": "How common is histoplasmosis in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "While histoplasmosis is the most common systemic fungal disease in dogs, it is uncommon in general. Histoplasmosis in dogs can be found more often in the Midwest and South than elsewhere in the United States."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Histoplasmosis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/female-golden-retriever-waits-with-ball-on-pink-bed-with-brown-cat-in-picture-id1306521054.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/female-golden-retriever-waits-with-ball-on-pink-bed-with-brown-cat-in-picture-id1306521054.jpg"}, "author": {"@type": "Person", "name": "Matthew Everett Miller, DVM", "url": "https://www.petmd.com/author/dr-matthew-everett-miller"}, "keywords": "Dog, Condition, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_Histoplasmosis"}, "datePublished": "October 20, 2021", "dateModified": "August 12, 2022", "description": "Dr. Matt Miller explains the condition histoplasmosis in dogs, a fungal infection that can cause symptoms like diarrhea, straining to poop, and more serious complications.", "articleBody": "What Is Histoplasmosis in Dogs? Histoplasmosis is a fungal infection more commonly seen in cats, but it can also be found in dogs. Dogs under 4 years of age are most commonly affected. Predisposed breeds include the Brittany, Pointer, Weimaraner, and other working dogs. The fungus that causes histoplasmosis in dogs, Histoplasma capsulatum, can be found anywhere in the world, but it’s especially common in the major river valleys of North and South America. The infection is normally contracted after the dog inhales the organisms, often from the droppings of birds or bats. Ingesting the fungus by eating bird and bat poop or rotting wood is another method of transmission, although this is theoretical and has not been documented. Symptoms of Histoplasmosis in Dogs Symptoms of histoplasmosis in dogs emerge about 2-3 weeks after infection and can vary widely depending on which organs the fungus infects. Common First Symptoms Because H. capsulatum, the fungus causing the disease, spreads to the gastrointestinal tract of dogs so often, the most common symptoms are gastrointestinal, including: Straining to poop Producing diarrhea with small amounts of blood or mucus As with dogs who develop certain types of metastatic cancer, other symptoms may be vague at first: Vomiting Appetite loss Weight loss Lethargy Fever Symptoms of More Serious Infection As the disease progresses, organ-specific symptoms emerge. Dogs with a heavy fungal burden in their lungs may experience: Coughing Rapid breathing Nasal discharge Jaundice (yellow skin), if the liver is affected Swollen lymph nodes Less commonly, the infection spreads to the eyes, bones, and skin, where symptoms can occur including: Blindness Limping Swollen joints Strange, unexplained skin lesions, wounds, or oozing nodules Causes of Histoplasmosis in Dogs By definition, histoplasmosis in dogs is caused by the fungus Histoplasma capsulatum (also known as H. capsulatum). Eating fungal spores in bat feces (guano) is the classic source of the infection, although the fungus can also be transmitted when dogs eat bird droppings and rotting wood, among other sources. These spores then infect a dog’s intestines. In dogs, the gastrointestinal tract is the most common site of spread, but other organs are often affected as well, including the lymph nodes, spleen, liver, eyes, joints, bones, and skin. Dogs can also inhale the spores, which then go into the lungs. Once inside the lungs, the fungus multiplies. Sometimes the infection remains in the respiratory tract, where it may or may not cause symptoms. However, the fungus commonly spreads or “disseminates” to other organs, behaving eerily like metastatic cancer. How Vets Diagnose Histoplasmosis in Dogs Because the symptoms can be so vague, and because the infection is uncommon in many parts of the United States, diagnosis of histoplasmosis in dogs is challenging. When presented with a sick animal with no obvious underlying cause, veterinarians often run baseline diagnostics. Diagnostic Testing (Blood/Urine) This set of general tests analyzes blood and urine to measure things like organ function, electrolyte levels, and cell counts. While these tests do not always give a clear-cut diagnosis, they are useful in narrowing down the list of possibilities. Dogs with histoplasmosis will show anemia (low red blood cells) and low platelet counts on these tests, as well as low protein and increased calcium, blood sugar, and liver values. As with the symptoms, however, these results are not specific to histoplasmosis and can be caused by other diseases. X-Rays and Ultrasounds Diagnostic imaging like X-rays of the chest or ultrasounds of the abdomen may show nodules or masses in the lungs or other organs, similar to metastatic cancer. Biopsies and Needle Aspirates Histoplasmosis in dogs could cause organs that may be abnormal in appearance or size. Biopsies or needle aspirates (using a needle to remove cells) of these abnormalities are common ways veterinarians diagnose histoplasmosis. Direct Testing for Histoplasmosis Your veterinarian may also become suspicious enough of histoplasmosis that she tests for it directly. The blood tests for histoplasmosis are very reliable but are usually only performed after other tests raise suspicion for the disease, since testing every sick animal for every infectious disease every time is not realistic. Treatment for Histoplasmosis in Dogs Treatment for histoplasmosis in dogs is focused on long-term antifungal medication to destroy the H. capsulatum organisms. The goal is to treat until the dog has been symptom-free for at least 1 month. Many dogs require over 6 months of antifungal treatment. Other medications or therapies may be necessary to manage the symptoms and secondary effects of the disease, like antibiotics for pneumonia or skin infections. Fluids to correct dehydration, or even feeding tubes for dogs that won’t eat, can help keep the dog comfortable until the antifungal medications can resolve the infection. Recovery and Management of Histoplasmosis in Dogs Once your dog has a diagnosis of histoplasmosis, your vet will require multiple physical exams to monitor the success of treatment and to look for any new symptoms or problems that may emerge. Repeated blood and urine tests can make sure the medications are working and are not damaging your dog’s organs. Once your dog has been symptom-free for at least 1 month after testing negative for H. capsulatum, they should be retested one more time. A negative result on this final test before discontinuing medications will ensure the infection has been fully cleared and minimize the risk of relapse. Your dog should be tested 3-6 months later to look for relapse."}]