[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bacterial Infection (Streptococcus) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/bacterial-infection-streptococcus-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/bacterial-infection-streptococcus-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/c_multi_streptococcal_infections"}, "datePublished": "July 16, 2008", "dateModified": "August 16, 2022", "description": "Streptococcal infection refers to a bacterial infection caused by streptococcus. Puppies and older dogs are most suscetible to developing this disease, as their immune systems are not fully developed or have declined.", "articleBody": "Streptococcal Infections in Dogs Streptococcal infection refers to a bacterial infection caused by streptococcus. Puppies and older dogs are most suscetible to developing this disease, as their immune systems are not fully developed or have declined. The condition described in this medical article is common in both dogs and cats. If you would like to learn how it affects cats, please visit this page in the PetMD health library. Symptoms and Types Some of the common symptoms of this infection include: PainFeverArthritisLethargyCoughingPneumoniaAbscess(es)Difficulty swallowing due to swelling (tonsillitis)Causes Age often determines the propensity for developing this bacterial infection. Both the oldest and youngest dogs have less developed immune systems -- the youngest because of the lack of antibodies to fight infection, and the oldest because of a decline in antibodies and a weakened immune system. Some of the causes for infection are viruses, bacteria, fungi, and protozoa, often resulting from recent exposure through a wound or surgical procedure.  Treatment Antibiotics and hydration will be part of the prescribed treatment. Living and Management Good nursing care is important to help the dog recover from this bacterial infection. Rehydration is also important for restoring the body with fluid and flushing the system of the infection. Prevention Avoid environments overcrowded with other animals. Other than avoidance of contact with other animals, there are no known preventative measures for this bacterial infection."}]