[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Low Blood Oxygen in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/low-blood-oxygen-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/low-blood-oxygen-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_multi_hypoxemia"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "When the brain is deprived of oxygen, irreversible damage may be the result, even when the deprivation has been for a short period of time.", "articleBody": "Hypoxemia in Dogs When the brain is deprived of oxygen, irreversible damage may be the result, even when the deprivation has been for a short period of time. Oxygen deficiency may also lead to anemia in the organs, which can progress to arrhythmia and heart failure. Hypoxemia occurs when arterial blood is not being oxygenated sufficiently. This is a serious condition and needs to be treated quickly. Symptoms and Types  CoughingDifficulty breathingShortness of breathRapid breathing (tachypnea)Open-mouthed breathingRapid heartbeat (tachycardia)PainGaggingUnable to endure exercise (exercise intolerance)Discoloration of skin and mucous membranesCollapseCauses High elevationInjuryPneumoniaDisease of the lining of the lungsAnesthesiaHeart diseaseLung diseaseLung or heart disease in elderly animalsDiagnosis Your veterinarian will be looking for rapid breathing, over-excitement, and anxious behavior in your dog. You will need to give your veterinarian a thorough history of your dog&#039;s health, including a background history of symptoms, and any possible incidents that might have led to this condition. The more details you can provide, the better able your doctor will be to determine which organs are being affected by the lack of oxygen. The veterinarian will also check for an elevated body temperature, and will examine your dog for any head injuries. Blood samples from specific areas will be drawn; blood gas analyzers may be also used to make measuring more convenient. In addition, X-rays and echocardiograms can be used to rule out lung and heart disease as the cause of the oxygen deficiency in the blood. If the cause cannot be determined using any of these methods, an endoscopy or biopsy of the lung may be performed.  Treatment Treatment is dependent on the underlying cause of the oxygen deficiency. Oxygen will be given to support your dog&#039;s heart and lungs (cardiovascular system) using a face mask placed securely around the muzzle to deliver the oxygen. It is important to keep in mind, however, that this treatment is not always successful. If the problem is low cardiac output, intravenous (IV) medications to strengthen muscle action will be prescribed. In case of cardiac failure, diuretics and oxygen will be administered, as well as medications to strengthen muscle action. If there is hemorrhaging, injury, or shock from infection, hospitalization will be required to get an IV inserted and fluids flowing into the veins. This will also allow the oxygen to reach appropriate levels. Living and Management Hypoxemia is a life-threatening condition. Therefore, observe your dog&#039;s behavior carefully following the treatment. Symptoms to watch for include a decreased ability to breathe, as well any paleness of the tissues, which would be indicative of a lack of oxygen diffusion to the tissues. Frequent follow-up visits to the veterinarian will be needed to track arterial blood gas levels."}]