[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fungal Infection in Dogs (Cryptococcosis)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/fungal-infection-dogs_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/fungal-infection-dogs_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_Cryptococcosis"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Cryptococcosis is a localized or systemic fungal infection caused by the environmental yeast, Cryptococcus. This fungus grows in bird droppings and decaying vegetation, and is generally associated with Eucalyptus trees. However, it is found worldwide and some areas of southern California, Canada and Australia have been found to be more prone to the fungus.", "articleBody": "Cryptococcosis is a localized or systemic fungal infection caused by the environmental yeast, Cryptococcus. This fungus grows in bird droppings and decaying vegetation, and is generally associated with Eucalyptus trees. However, it is found worldwide and some areas of southern California, Canada and Australia have been found to be more prone to the fungus. The fungus is contracted through the dog&#039;s nasal passages and then passes into the brain, eyes, lungs, and other tissues. It is usually rare in dogs. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms Symptoms will vary and depend greatly on the organ systems affected by the fungus. However, animals may have a history of problems for weeks or months, be especially sluggish, and (in less than 50 percent of animals) have a mild fever. Other symptoms include: Nervous system signs — seizures, wobbly, uncoordinated or “drunken” movements weakness, blindnessSkin ulcerationEnlarged lymph nodesVomiting and diarrheaLack of appetiteNasal dischargeCauses The Cryptococcus yeast is usually inhaled through the nasal passages. Occasionally, these organisms may reach the terminal airways, although it is unlikely. It can also infect the stomach and the intestines, entering through the gastrointestinal tract. Diagnosis   Your veterinarian will be making a diagnosis based on findings from the following tests: Samples will be taken from the nasal passages, or a biopsy from the bumpy tissue that protrudes from the nasal passages; flushing the nose with saline may dislodge infected tissueBiopsy of skin lesions of the headAspirates of affected lymph nodesBlood and urine culturesBlood tests to detect the presence of Cryptococcus antigensIf your dog is showing symptoms of neurological disease, a spinal tap and examination of cells will need to be done   Treatment Any nervous systems shown in your animal may require inpatient supportive care. Outpatient care is used when the dog is stable. Surgery is recommended if the dog has nodular (granulomatous) masses in its nose and throat; removal of these masses will alleviate breathing difficulties. Living and Management Monitor blood work (liver enzymes) monthly in dogs receiving antifungal drugs. Improvement in clinical signs, resolution of lesions, improvement in well being, and return of appetite measure response to treatment. Conduct blood tests that detect the presence of antigens of Cryptococcus. Anticipated duration of treatment is three months to one year; patients with central nervous system disease may require lifelong maintenance treatment. Measure the presence of antigens of Cryptococcus every two months, and up until six months after completion of treatment (or until the antigen is no longer detectable). If patient maintains low titers -- the amount of medicine or antibodies found in a patient&#039;s blood – for several months after all signs of disease have resolved, continue the treatment for at least three months. If titers suddenly rise after treatment, resume the therapy."}]