[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Liver Failure (Acute) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/liver-failure-acute-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/liver-failure-acute-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Liver health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_multi_hepatic_failure_acute"}, "datePublished": "September 8, 2008", "dateModified": "August 16, 2022", "description": "Acute hepatic failure, or acute liver failure in dogs, is a condition characterized by the sudden loss of 70 percent or more of the liver&#039;s function due to sudden, massive, hepatic necrosis (tissue death in the liver). Learn the signs of liver failure in dogs.", "articleBody": "Acute Hepatic Failure in Dogs Acute hepatic failure is a condition characterized by the sudden loss of 70 percent or more of the liver&#039;s function due to sudden, massive, hepatic necrosis (tissue death in the liver). Symptoms of Liver Failure in Dogs Primary and secondary hepatobiliary disorders - those dealing with the liver, gallbladder, bile ducts or bile - are generally associated with variable hepatic necrosis. However, acute liver failure from severe hepatic necrosis is an uncommon phenomenon. Acute liver failure can affect the body through a number of system failures: Gastrointestinal: vomiting, diarrhea, blood in the stool (hematochezia)Nervous system: hepatic encephalopathy (brain disease related to liver failure)Hepatobiliary: the liver plus the gallbladder; jaundice, necrosis (tissue death) of the liver cells and bile duct cellsRenal: the tubules of the kidney may be injured from toxins/metabolitesImmune/Lymphatic/Hemic: imbalances in the blood and lymphatic systems, may lead to coagulant (clotting) complicationsCauses of Liver Failure in Dogs Acute liver failure is most often caused by infectious agents or toxins, poor flow of fluids into the liver and surrounding tissues (perfusion), hypoxia (inability to breathe), drugs or chemicals that are destructive to the liver (hepatotoxic), and excess exposure to heat. Necrosis (tissue death) sets in, with loss of liver enzymes and impaired liver function ultimately leading to complete organ failure. Acute liver failure also occurs due to extensive metabolic disorders in protein synthesis (albumin, transport protein, procoagulant and anticoagulant protein factors), and glucose absorption, as well as abnormalities in the metabolic detoxification process. If this condition is not treated promptly, it can result in death. Diagnosis of Acute Liver Failure in Dogs Acute liver failure is diagnosed through a full blood workup (hematology), biochemistry analysis, urine analysis, biopsy (the removal and analysis of affected tissue), and ultrasound or radiology imaging. Hematology/biochemistry/urine analyses will test for: AnemiaIrregularities in thrombocytes (clot promoting blood platelets)Abnormally high liver enzyme activity, or liver enzymes spilling out into the bloodstream, signaling liver damage – tests will look for alanine aminotransferase (ALT) and aspartate aminotransferase (AST) enzymes in the bloodstream, as well as an increase in alkaline phosphatase (ALP), and declining levels of aminotransferases (enzymes that cause the chemical change of nitrogen carrying amino)Impairment of protein synthesisLow blood sugarNormal to low blood urea nitrogen (BUN) concentration (i.e., nitrogen level in the urine)The presence of bilirubin in the urine – the red-yellow bile pigment that is a degraded product of the deep red, nonprotein pigment in hemoglobin (the oxygen carrying pigment in red blood cells)The presence of ammonium urate crystals in the urineThe presence of sugar and granular casts (solid deposits) in the urine, indicating internal tubular injury from drug toxicity, such as the drug induced toxicity that affects some dogs being treated with pain relievers (also known as non-steroidal anti-inflammatory drugs [NSAIDS])Lab Tests will be used to look for: High values of total serum bile acid (TSBA) concentrations, which will indicate liver insufficiency. However, if non-hemolytic (not destructive to blood cells) jaundice has already been confirmed, TSBA findings will lose their significance in relation to acute liver failureHigh plasma ammonia concentration; this, in conjunction with high TSBA concentrations, would be strongly indicative of hepatic insufficiencyAbnormalities in blood platelets and coagulation (blood clotting) factorsTissue necrosis and cell pathology; biopsy (tissue sample) results will confirm or negate zonal involvements, and identify any existent underlying conditionsImaging tests will look for: X-rays and ultrasound tests may indicate an enlarged liver, and other hepatic abnormalities, including conditions that may not be directly related to the liver. Treating a Dog With Liver Failure Hospitalization is vital for treating acute liver failure. Fluids and electrolytes, along with colloid (the gelatinous substance necessary for proper thyroid functioning) replacements and oxygen supplementation, are key aspects of treatment and care. Your dog will be placed on restricted activity in order to give the liver an opportunity to regenerate. Catheter feeding is recommended for highly unstable patients, while enteric feeding (feeding directly into the intestines) in small amounts is recommended for otherwise stable patients. A normal protein diet with supplemental vitamins E and K is advised. The common medications used for liver failure are antiemetics, drugs for hepatic encephalopathy (brain disease, with or without edema), hepatoprotectants (to decrease the activity of aminotransferases), coagulopathy drugs, and antioxidants. Preventing Acute Liver Failure in Dogs Vaccinating dogs against the infectious canine hepatitis virus (an acute liver infection), and avoiding the use of drugs that have potentially harmful hepatotoxins as ingredients can act as preventives against acute liver failure."}]