[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pus in the Urine in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Urinary", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/pus-urine-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/pus-urine-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/urinary/c_multi_pyuria"}, "datePublished": "November 18, 2008", "dateModified": "August 16, 2022", "description": "Pyruria is a medical condition that is characterized by white blood cells in the urine. Large numbers of white blood cells in voided urine samples can indicate an active inflammation somewhere along the urogenital tract.", "articleBody": "Pyuria in Dogs Pyruria is a medical condition that is characterized by white blood cells in the urine. Large numbers of white blood cells in voided urine samples can indicate an active inflammation somewhere along the urogenital tract. Pyuria can also be associated with any pathologic process (infectious or noninfectious) that causes cellular injury or death; tissue damage can provoke oozing inflammation, characterized by evidence of pyuria and increased red blood cells and protein in the urine. Symptoms Local Effects of InflammationRedness of mucosal surfaces (e.g., redness of vaginal or prepuce mucous tissue)Tissue swellingPustulent dischargePain (e.g., adverse response to touch, painful urination, frequency of urination)Loss of function (e.g., excessive urination, painful urination, frequent urination, urinary incontinence)Systemic Effects of InflammationFeverDepressionLoss of appetite (anorexia)DehydrationCauses  KidneyInflammation of the renal area, branches, or recesses of the pelvis of the kidney, and pelvis, particularly due to local bacterial, fungal, or parasitic, infectionKidney stonesTumorTraumaImmune-mediatedUreterUreteritis: inflammation of the ureter (e.g., bacterial)Stones in the ureterTumorUrinary BladderCystitis: inflammation of the bladder (e.g., bacterial, fungal, or parasitic)Urocystolith(s): stones in the bladder or kidneyTumorTraumaUrethral obstructionDrugsUrethraUrethritis: inflammation of the urethra (e.g., bacterial, fungal)Urethrolith(s): stones in the urethraTumorTraumaForeign bodyProstateProstatitis/abscess (e.g., bacterial or fungal)TumorPenis/PrepuceInflammation of the glans penis and overlying prepuce (foreskin)TumorForeign bodyUterusVaginaVaginitis: inflammation of the vagina; bacterial, viral, or fungalTumorForeign bodyTraumaRisk FactorsAny disease process, diagnostic procedure, or therapy that alters normal urinary tract defenses and predisposes an animal to infectionAny disease process, dietary factor, or therapy that predisposes an animal to formation of metabolic stonesDiagnosis Your veterinarian will perform a thorough physical exam on your dog, including a chemical blood profile, a complete blood count, and a urinalysis. You will need to give a thorough history of your dog&#039;s health, including a background history of symptoms, and possible incidents that might have precipitated this condition. The history you provide may give your veterinarian clues as to which organs are being affected. Urinalysis will be used to determine the cause of the symptoms, if possible, before using more invasive procedures. Your doctor may also do a microscopic examination of urinary sediment, prostatic fluid, urethral or vaginal discharges, or biopsy specimens, which will be obtained either by catheter, or by needle aspiration. A survey by abdominal x-ray and ultrasound imaging also may be used if your veterinarian has not been able to settle on a conclusive diagnosis.  Treatment Treatment varies depending on the underlying cause and the specific organs involved. Your veterinarian will set up a schedule with you so that your dog&#039;s progress can be followed. Further urinalyses tests will show whether the treatment is working. If the expected benefit outweighs the risk of introducing bacteria into the urinary tract, your veterinarian will most likely settle on a catheter for withdrawing the urine samples. If the benefit does not outweigh the risk, and if your dog is already ill from an infection or otherwise, your doctor will probably collect urine specimens using a more sterile method in order to avoid contamination, such as by direct fine needle aspiration from the bladder. Infectious and noninfectious inflammatory disorders of the urinary tract can cause primary renal (kidney) failure, urinary obstruction, blood poisoning, and even death."}]