[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/v5xqghl0mr", "@type": "VideoObject", "duration": "PT1M36S", "name": "5327099471001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/d86638ac1f99de50139255e7a84c95143725667e.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/v5xqghl0mr", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/4ca971024ed4659da086170ef33265801ac48939.m3u8", "transcript": "Tapeworms are parasites that typically settle in the small intestine of dogs puppies and other pets. Treatment to kill tapeworms is critical to avoid transmission to humans pets and to avoid damage to the dog's health tapeworm infestation occurs in dogs in just the immediate host of the tapeworm larva most commonly adult fleas rabbits birds and small rodents are also common tapeworm hosts. So dogs who scavenger hunt small animals may also be more susceptible to a tapeworm infection as the tapeworm grows pieces of it break off into segments and pass into the dog's intestines. You may see dried white to cream colored segments or pieces of tapeworm in the dog's feces or in the fur under the tail.\n\nSome tapeworm species break off into segments that are too small for the ITC. While the segments of other tapeworm species will resemble a grain of rice in size and appearance dogs may bite or lick their rectal area or drag their hindquarters across the floor in response to the itching tapeworms can be found in the anal sacks or in the feces of the animal. So your veterinarian will request or take a stool sample in order to diagnose tapeworms false negatives do occur. But most tests are conclusive.\n\nTreatment is given on an outpatient basis for adult tapeworms either by injection or oral medication. It's very important to administer all the prescribed medication to ensure that the tapeworms are removed from your dog's body to prevent tapeworms from infecting your dog. You should use year round flea and take medications and keep your dog away from dead animals in garbage.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_cestodiasis?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Get Rid of Tapeworms in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/dog-rolling-in-grass_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/dog-rolling-in-grass_0.jpg"}, "author": {"@type": "Person", "name": "Leslie Gillette, DVM", "url": "https://www.petmd.com/author/dr-leslie-gillette"}, "keywords": "Dog, Parasite, Worms, Symptom Checker, Tapeworms", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_cestodiasis"}, "datePublished": "November 3, 2020", "dateModified": "September 12, 2023", "description": "What are tapeworms and how can they affect your dog? Dr. Leslie Gillette discusses the symptoms of tapeworms in dogs, the causes, and treatment and preventive measures for tapeworms.", "articleBody": "If you have a pet, you’ve probably heard about tapeworms or had to deal with them before. Worms can affect a dog’s overall health and cause some seriously nasty gastrointestinal issues. However, tapeworm infestations in dogs are not usually considered dangerous or life-threatening. Here’s what you need to know about tapeworms in dogs—from what they are and how they spread to how to treat and prevent them. What Are Tapeworms in Dogs? Tapeworms are just one type of intestinal parasite that can affect dogs.       These worms are typically flat and segmented, and each segment is called a proglottid. They almost look like a piece of rice to the human eye. There are several common tapeworm species in the cestode family of worms that can affect dogs, including: Taenia Echinococcus Metacestoides Dipylidium caninum The most common species of tapeworms in dogs is Dipylidium caninum. What Are the Symptoms of a Dog With Tapeworms? There are not many obvious symptoms of tapeworm infestation in either puppies or adult dogs.  Typically, you may notice your dog licking or biting at his anus or scooting along the ground due to an itching sensation. This occurs as the proglottid segments break away from the adult tapeworm in the intestine and migrate through the anal opening.  When that happens, you may see what looks like a small piece of rice around your dog’s anus or in their poop. You may also notice anal irritation if your dog is scooting excessively. Your dog might experience weight loss if he is heavily infected, and on occasion, dogs with heavy adult parasite burdens have vomited whole tapeworms that were dislodged during the act of vomiting. How to Spot Tapeworms in Dog Poop Tapeworm proglottids may often be seen “wiggling” around the anal opening as they exit the intestinal tract. After they dry out, they may resemble dried grains of rice attached to the fur around the anus and under the tail. The proglottid segments may also be visible on or in freshly passed feces, again resembling grains of white rice or sesame seeds.  The proglottid packets contain the tapeworm eggs, which are not visible to the naked eye.  Tapeworm eggs can be seen in fecal samples through a microscope, but their absence in a fecal sample does NOT necessarily mean that the dog is negative for tapeworms, as the expulsion of proglottid packets is unpredictable. What Causes Tapeworms in Dogs and Puppies? Dogs get tapeworms when they ingest fleas that are infected with the tapeworm larvae. This can happen during grooming if they lick their fur and accidentally eat an infected flea. The flea is the intermediate host in the cycle of transmission of tapeworms, which means that your dog will not become infected by simply eating poop that contains proglottid packets with fertilized tapeworm eggs. So that means that your dog can’t get tapeworms from eating cat poop, either, if you have a dog that likes to hang around the litter box. A dog would need to ingest the flea that is carrying the tapeworm larvae to get tapeworms. To help understand how that works, here is a breakdown of the tapeworm life cycle. Life Cycle of Tapeworms in Dogs The life cycle of the tapeworm begins after a dog ingests the intermediate host—the adult flea that’s carrying tapeworm larvae. Once the adult flea has been digested, the tapeworm larvae are released into the dog’s small intestine. They attach to the intestinal wall and mature to adulthood. As the adult tapeworm continues to grow, the segmented proglottid packets that make up the body of the worm will break off. These packets exit the intestine with the feces or move through the anal orifice and attach to the fur around a dog’s hindquarters and tail. Egg packets that reach the soil are then ingested by larval fleas. They develop into immature tapeworm larvae as the larval flea also matures to adulthood. How to Treat Tapeworms in Dogs Tapeworms in dogs can be treated with a parasiticide drug called praziquantel.       This drug is available in both oral and injectable form and is dosed by weight.       Once praziquantel has been administered, it causes the adult tapeworms to detach from the intestinal wall. This allows the tapeworms to be digested as they pass through the dog’s gut.       As a result, you will usually not see worms passed in the feces after treatment.  Praziquantel is available in both prescription and over-the-counter preparations. As with any over-the-counter remedy, you should talk to your veterinarian to determine a safe and effective dose before giving any medication at home. Side effects of praziquantel are not common, but they may include vomiting, diarrhea, lethargy, and loss of appetite. Are There Home Remedies for Tapeworms in Dogs? While finding a remedy for tapeworms without going to vet might be tempting, there are no proven home remedy solutions. Dewormers are inexpensive and offer proven treatment for tapeworms in dogs. The “home” remedies that people claim to be effective in treating and preventing tapeworm infestation include: Garlic Apple cider vinegar Pumpkin seeds Turmeric  Garlic and apple cider vinegar have been touted as natural preventatives that make the normal gut environment “inhospitable” for the immature larvae.       Pumpkin seeds and coarsely chopped carrots allegedly “treat” tapeworm infestation by physically debriding the attached worms from the lining of the intestine, causing them to pass through the digestive tract and exit with the feces.       Turmeric has been touted as a gut anti-inflammatory that supposedly promotes gut healing following tapeworm infestation.       Consult with your veterinarian before attempting to treat your dog with any over-the-counter treatments or home remedies. Can Humans Get Tapeworms From Dogs?  Transmission of tapeworm infestation in humans is relatively uncommon, as it would require the human to ingest an infected flea.       This occurs slightly more often in children, usually in environments where good personal hygiene is not practiced or with heavy flea infestations in the home or yard. How To Prevent Tapeworms in Dogs Preventing tapeworms in dogs doesn’t require much effort. Here’s how you can keep your dog free of tapeworms. Use Flea and Tick Prevention The most effective means of preventing tapeworm infestation in dogs is with the regular use of approved flea prevention products.       There are a number of safe and effective products available by prescription and over the counter in topical and oral form. Maintaining a regular flea prevention schedule for your dog will significantly reduce the flea population in your home environment and protect your dog against new infestations of fleas if you regularly visit dog parks or other public areas.       Practice Good Hygiene Cleaning up your dog’s feces will also decrease the opportunity for the tapeworm life cycle to be perpetuated in the soil.       Practicing good personal hygiene (handwashing) and encouraging this behavior in young children will significantly reduce the risk of tapeworm transmission to humans as well. Featured Image: iStock.com/alexei_tm"}]