[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Head Pressing in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/head-pressing-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/head-pressing-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Brain health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_multi_headpressing"}, "datePublished": "November 5, 2008", "dateModified": "August 16, 2022", "description": "Head pressing is a condition characterized by the compulsive act of pressing the head against a wall or other object for no apparent reason. This generally indicates damage to the nervous system, which may result from a number of causes, including prosencephalon disease (in which the forebrain and thalamus parts of the brain are damaged), and some types of toxic poisoning.", "articleBody": "Pressing the Head Against Objects in Dogs Head pressing is a condition characterized by the compulsive act of pressing the head against a wall or other object for no apparent reason. This generally indicates damage to the nervous system, which may result from a number of causes, including prosencephalon disease (in which the forebrain and thalamus parts of the brain are damaged), and some types of toxic poisoning. This condition can affect dogs of any breed or age-range. Symptoms and Types The act of head pressing is just one sign of prosencephalon disease, in which the forebrain and thalamus parts of the brain are affected. Other symptoms that may accompany this include compulsive pacing and circling, changes in learned (trained) behavior, seizures, damaged reflexes, and visual problems. Some of these symptoms may lead to lesions, for example, sores on the feet as a result of compulsive pacing, or injuries to the face and head as a result of pressing the head against a surface for long periods of time. Causes There are a number of reasons for why a dog might feel a compulsion to press its head against objects, depending on the primary cause that is leading to this symptom. Possible causes may be a metabolic disorder, such as hyper or hyponatremia (too much, or too little sodium in the body’s blood plasma), a primary or secondary tumor (meaning a tumor located in the brain vs. a tumor located elsewhere in the body), or an infection of the nervous system, such as rabies or fungal infection. Other causes can include head trauma, such as from a car accident, or from exposure to toxins, such as lead. Diagnosis One primary diagnostic procedure in cases of head pressing includes a fundic examination of the retina and other structures in the back of the eye, which may indicate infectious or inflammatory diseases, as well as irregularities in the brain. Other likely tests are blood pressure measurements to test for high blood pressure, and computed tomography (CT) or magnetic resonance imaging (MRI) scans of the brain. Your veterinarian will also include a urine analysis (which may reveal a problem with the metabolic system), and tests for blood lead concentration (which can indicate toxins in the system). You will need to give a thorough history of your dog&#039;s health, the onset of symptoms, and possible incidents that might have preceded this condition.  Treatment Care is dependent on the symptoms that appear and the diagnosis your veterinarian settles on. Severe clinical signs will require hospitalization and immediate treatment. Different causes require different treatment, and no drugs or therapies should be administered until a diagnosis has been reached. Living and Management Specific diseases require various methods of follow up care; however repeat neurological examinations to monitor progress are generally the main requirement."}]