[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Enlarged Gums in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/enlarged-gums-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/enlarged-gums-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_gingival_hyperplasia"}, "datePublished": "August 20, 2008", "dateModified": "August 16, 2022", "description": "Gingival hyperplasia refers to a medical conditon in which a dog&#039;s gum (gingival) tissue becomes inflamed and enlarged. Learn more about Dog Enlarged Gums at PetMd.com.", "articleBody": "Gingival Hyperplasia in Dogs Gingival hyperplasia refers to a medical conditon in which a dog&#039;s gum (gingival) tissue becomes inflamed and enlarged. Enlargement is typically caused by irritation due to dental plaque or other bacterial growth along the gum line. In many cases, this can be prevented with good oral hygiene habits. This enlargement is typical in dogs, and while it can occur in any breed, Boxers, Great Danes, Collies, Doberman Pinschers, and Dalmatians appear to be especially prone to developing an inflammation of the gums. Symptoms and Types Common symptoms of  gingival hyperplasia include:Thickening of the gumsIncrease in the height of the gumsPockets developing in the gumsAreas of inflammation in the gumsGrowth or tissue mass formation on the gum lineCauses The most common cause of gum enlargement (gingival hyperplasia) is bacteria and plaque along the gum line. If left untreated this disease can also affect the bones and structures supporting the teeth (periodontal disease). Diagnosis This medical condition is often diagnosed during a routine inspection of the dog&#039;s mouth. If there is a mass present, a biopsy of tissue taken from the mass will likely be performed to rule out or confirm the presence of cancer (neoplasia). X-ray images may also be taken to rule out the presence of other potentially serious underlying medical conditions.  Treatment For serious cases, surgical repair and/or deep cleaning, with re-contouring of your dog&#039;s gums may be performed to help return the gum line to its original shape and to return any formed pockets to normal so that food and bacteria will no longer be problematic. Pain medication can be given as needed to reduce your dog&#039;s discomfort during the recovery process. Overall, a dental cleaning, along with oral antibiotics (antimicrobials), should be sufficient for cleaning your dog&#039;s mouth and for reducing the swelling and enlargement of the gums. Living and Management It is important that you take your dog for complete routine dental cleanings with your veterinarin, and to maintain good oral hygiene and diet to prevent the formation or recurrence of enlarged gums. Animals with gingival hyperplasia generally will have a good outcome with treatment, although relapse is common. There are some potential complications with gum enlargement, including deeper pocket formation in the gums, which can encourage additional bacterial growth within the pockets."}]