[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long do dogs live with anal gland adenocarcinoma?", "acceptedAnswer": {"@type": "Answer", "text": "If surgery is performed to remove the tumor, and there’s no evidence of metastasis (spread), dogs can live 1-2 years."}}, {"@type": "Question", "name": "How aggressive is anal gland cancer in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Anal gland adenocarcinomas are very aggressive and invade tissues around the tumor. They also have a high rate of metastasis (spread). Anal cancer in dogs can spread to any part of the body but usually spreads to local lymph nodes first."}}, {"@type": "Question", "name": "Is perianal/anal sac adenocarcinoma curable in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Anal gland cancer can be curable in rare cases if it’s caught in the very early stages and treated aggressively with surgery plus chemotherapy."}}, {"@type": "Question", "name": "References", "acceptedAnswer": {"@type": "Answer", "text": "Vail DM, Thamm DH, Liptak JM. Withrow &amp; MacEwen’s Small Animal Clinical Oncology. Elsevier; 2020.   Featured Image: iStock.com/RyanJLane"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Anal Gland Cancer in Dogs (Anal Sac Adenocarcinoma)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/beagle-sitting.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/beagle-sitting.jpg"}, "author": {"@type": "Person", "name": "Virginia LaMon, DVM", "url": "https://www.petmd.com/author/dr-virginia-lamon"}, "keywords": "Dog, Cancer, Symptom Checker, Anal Gland Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_multi_adenocarcinoma_anal"}, "datePublished": "November 17, 2021", "dateModified": "September 12, 2023", "description": "Dr. Virginia LaMon shares how to identify, diagnose, and treat anal gland cancer in dogs, including the prognosis for dogs with this condition.", "articleBody": "What Is Anal Gland Cancer in Dogs? The most common type of anal gland cancer in dogs is called anal gland adenocarcinoma. Adenocarcinomas are cancers that start in glands. The anal glands are scent glands that are positioned on either side of your dog’s anus. Anal glands spray a small amount of a foul-smelling substance when your dog poops. This natural function helps dogs mark their territory. Anal gland secretions are stored in the anal sacs. Cancer can develop in the apocrine (sweat) glands associated with the anal sac. This cancer usually forms a mass that your vet may be able to feel during a rectal exam. Causes of Anal Gland Cancer in Dogs The exact cause of anal gland cancer in dogs is unknown. Anal gland cancer can affect both male and female dogs. It is more commonly found in the following breeds: German Shepherd Alaskan Malamute Dachshund Dogs in the Spaniel family, such as: English Cocker Spaniel Cavalier King Charles Spaniel Springer Spaniel Symptoms of Anal Gland Cancer in Dogs Symptoms of anal cancer in dogs include: Discomfort in the area around the anus (perianal region) Anal discharge Scooting across the floor Licking around the perianal area Straining to poop Constipation Anal gland cancer may be hard to detect at home. Instead, a mass in the anal region may be noted during a routine vet examination. If the tumor is large enough, it may look like swelling in the anal region. It may also interfere with your dog’s ability to defecate, or it may cause ribbon-shaped stool. In about 25% of anal gland adenocarcinoma cases, dogs will also have an elevated blood calcium level. Elevated calcium in dogs may cause increased thirst and urination, as well as decreased energy level and appetite. Elevated calcium levels in dogs can be harmful to your animal. If high calcium levels are not medically addressed, your dog is at risk of kidney failure or damage. How Veterinarians Diagnose Anal Gland Cancer in Dogs Anal gland cancer in dogs is usually diagnosed when your vet feels a mass during a rectal exam or you or your vet notice swelling in the anal region caused by the mass. To diagnose anal gland cancer in your dog, your vet will collect cells from the mass during a procedure called a fine needle aspirate. During this procedure, a thin needle is inserted into the affected gland and used to collect a small sample of cells. These cells are then examined under a microscope.   If your vet still suspects cancer after the fine needle aspirate, they will confirm the diagnosis and determine the exact type of cancer. This will require a procedure called a biopsy with histopathology, meaning they will collect more cells and closely examine them. Bloodwork, abdominal ultrasound, and chest x-rays may also be recommended. The bloodwork looks at the overall health of your dog’s organs, including calcium levels, which may be high due to the cancer. Chest x-rays can detect cancer that has spread to the lungs or other nearby organs. An abdominal ultrasound can show if the cancer has spread to internal organs and lymph nodes. Consultation with a board-certified veterinary oncologist is recommended when anal sac cancer is diagnosed. Treatment for Anal Gland Cancer in Dogs When a dog is diagnosed with anal gland cancer, surgical removal of the anal gland and sac are recommended. Removing the tumor can help your dog live longer and can lower elevated calcium levels.   If the cancer has spread to local lymph nodes, they will also likely be removed with surgery. If the cancer has already spread to other parts of your dog’s body, surgery to remove the anal gland mass may still be performed to make your dog more comfortable, but it might not prolong their life span. Recovery and Management of Anal Gland Cancer in Dogs Chemotherapy is frequently recommended to prevent further spread or recurrence. In cases where surgery is not possible, radiation therapy may be recommended to shrink your dog’s tumor."}]