[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does cherry eye in dogs go away on its own?", "acceptedAnswer": {"@type": "Answer", "text": "Unfortunately, cherry eye will not resolve without surgical intervention."}}, {"@type": "Question", "name": "What happens if cherry eye in dogs is left untreated?", "acceptedAnswer": {"@type": "Answer", "text": "If left untreated, the condition will persist, and the dog will be predisposed to developing chronic dry eye. The gland of the third eyelid is responsible for a significant amount of the tear production in dogs. Tears are critical to help flush debris, dust, pollen, and other pollutants out of dogs’ eyes. Without enough tears, dogs are more susceptible to eye infections and corneal ulcers."}}, {"@type": "Question", "name": "Can cherry eye in dog cause blindness?", "acceptedAnswer": {"@type": "Answer", "text": "Cherry eye itself does not cause blindness in dogs. However, while unlikely, the secondary issues that occur due to untreated cherry eye can potentially cause blindness."}}, {"@type": "Question", "name": "Are there over-the-counter eye treatments for cherry eye in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Ointments and eye drops can be purchased over-the-counter to help to keep the eye lubricated, but unfortunately, there are no products that will specifically treat cherry eye in dogs."}}, {"@type": "Question", "name": "Does eyelid protrusion hurt dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Eyelid protrusion itself does not hurt dogs. However, the secondary issues that can occur due to cherry eye can cause discomfort."}}, {"@type": "Question", "name": "Is cherry eye in dogs a recurring condition?", "acceptedAnswer": {"@type": "Answer", "text": "When treated surgically, cherry eye generally does not recur in the same eye. However, the outcome greatly depends on the surgeon’s experience and technique utilized. One study found a failure rate of approximately 3% (97% of surgeries were successful).  If only one eye is affected and surgery is performed, this does not prevent the other eye from eventually becoming affected. Most dogs that develop cherry eye in both eyes will either have both eyes affected at the same time or have the second eye affected within three months of the first eye."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Eyelid Protrusion (Cherry Eye) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/cherry.eye_.dog_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/cherry.eye_.dog_.jpg"}, "author": {"@type": "Person", "name": "Brittany Grenus, DVM", "url": "https://www.petmd.com/author/dr-brittany-grenus"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_multi_prolapsed_gland"}, "datePublished": "February 7, 2022", "dateModified": "August 12, 2022", "description": "Dr. Brittany Grenus discusses the condition eyelid protrusion, cherry eye, in dogs. Including symptoms, treatment options, and preventative care.", "articleBody": "What is Eyelid Protrusion (Cherry Eye) in Dogs? Cherry eye is the common name for prolapsed gland of the third eyelid, meaning the gland has moved (prolapsed) out of its proper position. While humans only have two eyelids, dogs have three. Their third eyelid is located in the lower inner corner of the eye (close to the muzzle). This eyelid is made of conjunctiva (a thin, protective membrane), a T-shaped cartilage (firm connective tissue), and a lacrimal gland (tear gland). The tear gland is located at the bottom of the cartilage and cannot typically be seen.   In some dogs, the T-shaped cartilage flips upside-down, exposing (prolapsing) the third eyelid gland. When exposed, the gland often appears like a red or pink mass in the lower inside corner of the eye—this is where the term “cherry eye” comes from.  Certain dog breeds are more predisposed to cherry eye than others. Researchers aren’t sure exactly why, but there is likely a genetic component. It is suspected that the connective tissues that hold the gland in place are not as strong as they should be in these particular breeds.  Some of the most commonly affected breeds include:   Cocker Spaniel (American Cocker Spaniel)  Beagle  Bulldog (English Bulldog, British Bulldog)  French Bulldog   Chinese Shar-Pei  Newfoundland  Neapolitan Mastiff  Great Dane  Lhasa Apso  Cane Corso  Bloodhound  Shih Tzu  Boston Terrier  Pekingese  Symptoms of Eyelid Protrusion (Cherry Eye) in Dogs The hallmark sign of cherry eye is a round, red or pink mass in the lower inner corner of the eye that looks like a cherry pit. This disease can affect either one eye or both eyes.   Symptoms of cherry eye that may be noticed at home include:   Red mass in the inner corner of the eye  Discharge from the eye  Redness of the eye  Inflammation and redness of the conjunctiva  Pawing at the eye or rubbing the face on various surface (to scratch the eye), these signs indicate that the eye is uncomfortable and another issue is occurring secondary to cherry eye  It is important to note that prolapse of the third eyelid gland is not painful. However, cherry eye can lead to secondary issues, such as ulcers of the cornea (the eye’s clear, protective outer layer) and chronic dry eye (not enough tears), which can be uncomfortable.   Causes of Eyelid Protrusion (Cherry Eye) in Dogs It is still unknown what causes cherry eye in dogs. It is suspected that in certain breeds, the connective tissues that hold the third eyelid gland in place are weaker, predisposing them to cherry eye.   It also suspected that in giant breed dogs, their large orbit (eye socket) has more room and flexibility, making the eyelid more likely to prolapse.   Conversely, in small breed dogs, their orbit (eye socket) may be too small for the eye, and the lack of space for both the eye and the gland of the third eyelid may predispose them to cherry eye.   However, these are only theories as to why cherry eye occurs more frequently in certain breeds, as the true cause is still unknown.   Treatment of Eyelid Protrusion (Cherry Eye) in Dogs Cherry eye in dogs is typically treated with surgery and post-surgical medication. Your veterinarian will be able to determine the best course of action based on your pet’s diagnosis.  Surgical Treatment If left untreated, cherry eye can cause secondary issues in the dogs’ eyes. For this reason, surgery is recommended to place the gland back in the proper position. Surgery, generally, also prevents the disease from recurring.   There are several surgical techniques that are effective. The specific technique used depends on the surgeon’s experience and preference.   Medication (post-surgery) After surgery, a dog will likely be placed on a few medications. The first is a topical eye antibiotic to prevent infections at the surgical site, as an infection could cause the surgery to fail.   The pain from the procedure typically comes from inflammation. As such, an oral non-steroidal anti-inflammatory drug (NSAID) will likely be given for inflammation and pain.   It is essential to keep an Elizabethan collar (e-collar) on your pet while the surgical incisions are healing. This will prevent the dog from scratching at the incisions, which could potentially cause the surgery to fail.  Recovery and Management of Eyelid Protrusion (Cherry Eye) in Dogs In general, unless complications occur, most dogs are rechecked about 2-4 weeks after surgery. At this time a Schirmer tear test will be performed to check for dry eye, as that is the most common secondary condition to occur in pets with cherry eye. The Schirmer tear test will measure the amount of tears produced to determine whether a pet has dry eye.  The third eyelid gland is responsible for producing approximately 33% of a dog’s tears. When the gland prolapses it may become damaged, predisposing the pet to chronic dry eye (keratoconjunctivitis sicca or KCS), even after the gland is repositioned. This is why it’s critical to monitor tear production throughout the pet’s life. If tear production is normal at the time of recheck, the Schirmer tear test will likely be done as an annual follow up."}]