[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/8kio6beiho", "@type": "VideoObject", "duration": "PT1M51S", "name": "5327083681001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/7c3e1fb90b082be2466b86c3a49db46a3ac6cb74.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/8kio6beiho", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/64e46c34f277c0c926f146785a4ddd2e901389fa.m3u8", "transcript": "Conjunctivitis also known as pink eye is an inflammation of the conjunctiva, which is the moist tissue that covers the front part of a dog or cats eyeball. And lines the eyelids. There are several primary causes of pink eye and pets from viral infections to allergies to bacterial infections and even dry eye allergic conjunctivitis is usually seasonal and can be brought on by dust mites, pollen dander or mold. This form is not contagious viral conjunctivitis however is usually due to a cold or upper respiratory infection.\n\nSo other viruses such as canine distemper virus the dogs and the herpes virus and cats can cause viral conjunctivitis as well. This form is contagious and spreads easily bacterial conjunctivitis happens when bacteria such as staph or strep infect the conjunctivitis symptoms of conjunctivitis include persistent squinting excessive blinking redness of the eye tissue discharge from the eyes and swelling. Veterinarians will do a complete eye exam to determine the cause and type of conjunctivitis and to rule out any other ocular disorders. This may include a foreseen stain which is spread on the surface of the eye to make the scratches ulcers and form material stand out under light.\n\nVeterinarians will also test for glaucoma and may even take a swab of the conjunctiva cells. Treatment will be dependent on the cause of the conjunctiva. If a bacterial infection is the cause you're that will likely prescribe antibiotic waypoints are drops and possibly an oral antibiotic to help clear the infection. If allergies are suspected your veterinarian may help determine the cause of the allergies and the symptoms of conjunctivitis should disappear once the allergen is removed.\n\nSurgery may be required if a foreign body is found in the tissue of the eye.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/eyes/c_multi_hyphema?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Blood in the Front of the Eye in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/c_multi_hyphema"}, "datePublished": "August 20, 2008", "dateModified": "August 16, 2022", "description": "Hyphema, or blood in the anterior chamber of the eye, is a common condition among dogs. However, hyphema is a clinical sign and not a specific disease.", "articleBody": "Hyphema in Dogs Hyphema, or blood in the anterior chamber of the eye, is a common condition among dogs. However, hyphema is a clinical sign and not a specific disease. Symptoms and Types The symptoms of hyphema are dependent on the extent of bleeding, whether vision has been impaired, and whether your dog has other, underlying systemic diseases. Common signs that are observed during a physical examination are: Blood within the anterior chamber of the eyeCorneal edema or corneal lesionsElevated intraocular pressure (IOP)Causes The most common causes of hyphema are: Injury or trauma to the eye or headSevere retinal detachmentHypertension, hyperthyroidism, systemic deficienciesInfection by parasitesBleeding vessels - vasculitis, uveitis, uveal neoplasia, and lymphoma particularlyOcular defects - retinal dysplasia, collie eye anomaly, glaucoma, etc.Hyphema can also be indicative of various ocular (eye) and systemic deficiencies, some of which may be life threatening. Therefore, its diagnosis and proper treatment is very important. Diagnosis Hyphema is diagnosed through hematology and blood biochemistry tests, lab tests, and diagnostic imaging using X-rays and ultrasound tests. A complete medical history will be taken and a thorough physical examination done to include or exclude possible causes for the condition. Common diagnostic tests and procedures include: Complete blood count with platelet countSerum biochemistry to measure serum levels in proteinCoagulopathy tests to assess blood coagulation functionsBlood pressureUrinalysis to exclude kidney diseasesChest and abdominal X-raysOcular ultrasounds (ultrasonography) to investigate the anterior portion of the eye and include/exclude possibilities of retinal detachment, lens displacement, abnormal masses, and vitreal hemorrhage.Other advanced tests that may be performed include abdominal ultrasounds, X-rays of the head and eye orbit to detect hitherto unknown traumatic injuries, and hormonal tests (assays) of the adrenal glands. To detect bone marrow cancer, a bone marrow aspirate - the liquid found within the bone marrow - may also be done.  Treatment The objectives of hyphema treatment involve containing the inflammation and removing the underlying causes which contribute to the bleeding in the anterior chamber of the eye. The common approaches to treatment are: The use of corticosteroids as eye drops or ointment to cure inflammation arising out of the bleedingAtropine eye drops to dilate the pupil and minimize sticking between the lens and the irisInitiation of appropriate treatment for ocular deficiencies like retinal abnormalities (i.e., dysplasia), collie eye anomaly, glaucoma, etc.Surgery may also be necessary for the correction of traumatic injuries and lesions. Your dog&#039;s activity will need to be restricted if the problem has been caused by a clotting disorder. A clot in a vein or artery can quickly become fatal when vigorous movement encourages the clot to travel to the heart. In cases of clotting, your dog will need to be treated specifically for dissolving the clot. In addition, if hyphema has significantly damaged your dog’s vision, it should not be allowed to go outside without supervision. Regular monitoring of the fluid pressure within the eye is also very important - daily checks for severe diseases, and in less severe cases, every two to three days until the condition has cleared up. To prevent your dog from inflicting further injury or irritation to the eye by scratching at it, you may want to ask your veterinarian for an Elizabethan collar - a wide collar that fits around the neck, preventing the dog from being able to reach its face with its paws. Unless the ocular structures have suffered irreversible damage, the prognosis is usually good in case of traumas. In case of retinal detachments, secondary glaucoma will eventually develop, and surgical intervention may be necessary for relief of pain. See Also"}]