[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/2knbg9bgay", "@type": "VideoObject", "duration": "PT1M27S", "name": "5327088413001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/3680ad47b875d54cdfce09018cc69ceac2357343.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/2knbg9bgay", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/4a37f39b6b25068aa5d26b84d4d43851bc0e5be1.m3u8", "transcript": "Ringworm is a fungal infection that affects a dog's skin, hair, and nails. It can spread to other animals and to humans ringworm in dogs is caused by an infection with certain types of fungi which differ based on geographic location. Dogs suffering from immune disorders or young dogs that have underdeveloped immune systems are more susceptible to fungal infections environments that are densely populated with animals such as shelters and kennels may also increase dogs risk of infection ringworm and dogs manifests itself in several noticeable ways on a dog's body. You may notice red scales on your dog's skin dark or reddened skin itchiness or hair loss, which may be patchy or circular.\n\nAnother sign of ringworm in dogs is the appearance of rays rounded spots known as cranial ominous lesions on your dog's skin and lesions that use inflammation near your dog's nails. May also signal a fungal infection such as ringworm. To diagnose ringworm your veterinarian may perform a fungal culture using skin scrapings. Conduct a microscopic examination of your dog's hair and possibly perform a skin biopsy.\n\nTreatment for ringworm can usually happen on an outpatient basis. Your veterinarian may prescribe topical or oral antifungal medication if a topical medication is recommended. Your veterinarian will also likely suggest the use of an e collar to prevent your dog from licking and ingesting the medication.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_aspergillosis?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fungal Infection (Aspergillosis) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/fungal-infection-aspergillosis-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/fungal-infection-aspergillosis-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_aspergillosis"}, "datePublished": "August 14, 2008", "dateModified": "August 16, 2022", "description": "Aspergillosis is an opportunistic fungal infection caused by the Aspergillus, a species of common mold found throughout the environment including, dust, straw, grass clippings, and hay.", "articleBody": "Aspergillosis in Dogs Aspergillosis is an opportunistic fungal infection caused by the Aspergillus, a species of common mold found throughout the environment, including dust, straw, grass clippings, and hay. An &quot;opportunistic infection&quot; occurs when an organism, which does not generally cause disease infects a dog. However, in the case of aspergillosis, it does because the pet&#039;s immune system and/or body is weakened from some other disease. There are two types of Aspergillus infection, nasal and disseminated. Both types can occur in cats and dogs, but they occur more frequently in dogs. Young adult dogs with a long head and nose (known as dolichocephalic breeds) and dogs with a medium length head and nose (known as mesatcephalic breeds) are also more susceptible to the nasal form of aspergillosis. The disseminated version of the disease seems to be more common in German Shepherds. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types There are two types of Aspergillus infections. The first is the nasal form, where the infection is localized in the nose, nasal passages, and front sinuses. It is believed that this develops from direct contact with the fungus through the nose and sinuses. For example, if an animal is outside and around dust and grass clippings, the fungus may enter via the moist lining of the nose. The second type of Aspergillus infection is disseminated, meaning it is more widespread, and is not only located in the nasal area. It’s not certain how this form enters the body. Symptoms of nasal aspergillosis include sneezing, nasal pain, bleeding from the nose, reduced appetite, visibly swollen nose, and long-term nasal discharge from the nostril(s), which may contain mucus, pus and/or blood. In some cases, loss of pigment or tissue on the surface of the skin may also occur. Symptoms of disseminated aspergillosis in dogs may develop suddenly or slowly over a period of several months, and include spinal pain or lameness due to infection, and cause inflammation of the animal’s bone marrow and bones. Other signs which aren’t specific to the disease include fever, weight loss, vomiting, and anorexia. Causes Aspergillosis is an infection caused by the Aspergillus fungus, which is commonly found in the environment in substances such as dust, hay, and grass. The nasal form of the disease is usually seen in outdoor and farm dogs because there more frequently exposed to the substances in which the fungus Aspergillus is found. As an opportunistic infection, an animal is only likely to contract Aspergillosis if the immune system is already in a weakened state. Dogs exhibiting immunodeficiency -- an inability to produce a normal immune response -- are at higher risk. Diagnosis Diagnostic procedures vary depending on whether the case is nasal or disseminated. For suspected nasal aspergillosis, analysis of nasal swabs, fungal cultures of nasal discharge, and a rhinoscopy -- inserting a small fiber-optic scope into the nose in order to examine the inside of the nose and its mucus linings -- can be expected. The symptoms for disseminated aspergillosis are mostly nonspecific and therefore more difficult to diagnose. Tests may include a urine analysis and X-rays to examine the spine.  Treatment Treatment varies depending on whether the disease is nasal or disseminated. The primary choice of treatment for dogs with nasal aspergillosis is the administration of an antifungal drug directly into the patient’s nose and nasal passages, while the patient is under anesthesia. Disseminated cases in dogs are difficult to treat and rarely cured. Antifungal drugs are generally given to treat symptoms, and may cure the condition. Living and Management Continued treatment depends on the type and severity of aspergillosis. Dogs with the nasal version should be monitored for reduced nasal discharge, while those with disseminated disease need to be monitored with urine analysis and via X-ray every one to two months. Prevention General good health will help ensure a strong healthy immune system to ward off this opportunistic disease. Keeping dogs indoors may be helpful, as it will limit access to grass clippings, hay, straw, and other substances where the Aspergillus fungus can be found. See Also"}]