[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Joint Cartilage Erosion in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/joint-cartilage-erosion-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/joint-cartilage-erosion-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_multi_polyarthritis_erosive_immune_mediated"}, "datePublished": "September 24, 2008", "dateModified": "August 16, 2022", "description": "Erosive, immune-mediated polyarthritis is an immune-mediated inflammatory disease of the joints, in which the cartilage of the dog&#039;s joint (articular cartilage) is eroded away.", "articleBody": "Erosive, Immune-Mediated Polyarthritis in Dogs Erosive, immune-mediated polyarthritis is an immune-mediated inflammatory disease of the joints, in which the cartilage of the dog&#039;s joint (articular cartilage) is eroded away. In this disease, cell-mediated immunity is thought to attack articular cartilage. The suspected causes for this are T lymphocyte effector cells that carry out the attack response, and an abnormal antigenic response to the host antibody. That is, an immune response to a substance that stimulates production of antibodies, an antigen, which acts as a “trigger”. In effect, the body is fighting against itself. Leukocyte cells (white blood cells), leukocyte enzymes (catalyzing reactions), cell-mediated immunity, immune complexes (an antibody bound to its triggering antigen), and autoallergic reactions are all directed against cartilage components. This leads to an inflammatory response by the tissue surrounding the cartilage, and complement protein activation in response to the immunity displaying cells.  Destructive enzymes, which are released from inflammatory cells, damage the articular cartilage, synoviocytes (cells which produce a lubricating fluid, called synovia, for the joints), and chondrocytes (cartilage cells), leading to erosive changes in the joints. The disease described in this medical article can affect both dogs and cats. If you would like to learn more about how it affects cats, please visit this page in the PetMD health library. Symptoms Symptoms for dogs are often cyclic, coming and going at random intervals. These symptoms include: LamenessStiffness in walkDecreased range of motionCracking sounds from the jointsJoint swelling and pain in one or more jointsJoint instability, subluxation (partial dislocation of the joint), and  luxation (complete dislocation of the joint)The typical onset of immune-mediated erosive polyarthritis in dogs is from eight months to eight years of age. Young Greyhounds, between the ages of 3-30 months, are most susceptible to erosive polyarthritis of Greyhounds (EPG), a specific type of this disease. There is also idiopathic erosive polyarthritis (IEP), which can occur in any breed and is of unknown cause. Causes The suspected causes for this form of joint cartillage erosion are T lymphocyte effector cells that carry out the attack response, and an abnormal antigenic response to the host antibody. That is, an immune response to a substance that stimulates production of antibodies, an antigen, which acts as a “trigger.” In cases of IEP, the cause remains unknown. Diagnosis You will need to give your veterinarian a thorough history of your dog&#039;s health leading up to the onset of symptoms. Your veterinarian will perform a thorough physical exam on your dog, taking note of signs of pain, decreased range of motion, and any lameness. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, a urinalysis, and an electrolyte panel. Joint fluid aspirate will be taken for lab analysis, and submitted for bacterial culture and sensitivity. A biopsy (tissue sample) of synovial tissue will also help to make a definitive diagnosis. X-ray images can also be used as a diagnostic tool. If an erosive, immune-mediated polyarthritis condition is present, it will be visible on the radiograph image.  Treatment Physical therapy, including range-of-motion exercises, massage, and swimming can help treat severe disease. Bandages and/or splints may be placed around the joint to prevent further degradation of the cartilage, especially in dogs that are experiencing difficulty walking. Weight loss also helps decrease pressure on the joints if the dog is overweight. Surgery for this condition is generally not recommended. However, total hip replacements, and femoral head ostectomy (surgical removal of part of the thigh bone) may be considered. Arthrodesis of the carpus (wrist) is generally quite successful for treating joint pain and instability. Arthrodesis of the shoulder, elbow, stifle (knee), or hock (ankle), meanwhile, is not as reliable at yielding positive results.   Living and Management Your veterinarian will schedule frequent follow-up appointments to examine your dog&#039;s progress. If your dog’s condition continues to worsen, you must contact your veterinarian immediately for care."}]