[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cavities in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cavities-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cavities-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_multi_dental_caries"}, "datePublished": "September 11, 2008", "dateModified": "August 16, 2022", "description": "Dental caries is a condition in which the dental hard tissues decay as the result of oral bacteria on the tooth surface. Learn more about Dog Cavities Treatments, diagnosis, and symptoms at PetMd.com.", "articleBody": "Dental Caries in Dogs Dental caries is a condition in which the dental hard tissues decay as the result of oral bacteria on the tooth surface. While dental caries is not common in the domestic pet, it does occur and should be watched for. A 1988 study, reported in the Journal of Veterinary Dentistry, found that 5.3 percent of dogs one year of age or older had one or more caries lesions, with 52 percent of that group having bilaterally symmetrical lesions. Caries can affect the crown or the roots of the teeth, and is classified as pit-and-fissure caries, smooth-surface caries, or root caries. There is no known breed, age, or gender risk. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types Incipient (about to become apparent) smooth-surface caries appears as an area of dull, frosty-white enamelA structural defect on the surface of the crown or root will be apparent, and will show dark, soft, decayed dentin - the layer just under the enamelCauses Caries is caused by bacteria fermenting carbohydrates on the tooth surface. This fermentation leads to the production of acids that demineralize the enamel and dentin. Following demineralization, the organic matrix of the tooth is digested by oral bacteria and/or white blood cells. The health of the teeth is based on the constant exchange of minerals between enamel and oral fluids, so when there is prolonged retention of fermentable carbohydrates and bacterial plaque on the tooth surface, and this condition leads to a net loss of mineral, the tooth will be disposed to the development of caries. Early caries may be reversible through re-mineralization, but once the protein matrix collapses, the lesion is irreversible. Even if only one tooth has become irreversibly damaged, care must be taken to protect the remaining teeth, since dental surfaces in close contact with an established caries are at risk of developing a lesion as well. Some of the inherent risk factors that will encourage the development of caries are when the teeth are very tight together, resulting in smooth-surface caries; and when deep pockets between the teeth and gums allow bacteria to gather. Fermenting carbohydrates will take up residence in these pockets, inflicting damage low on the tooth, closer to the root. But, it is where the top and bottom teeth meet on the maxillary first molar, in the pit of the tooth, that dental caries most commonly develops. Developmental grooves on the crown surface of the tooth, and deep pits where the teeth touch each other, will dispose the tooth to pit-and-fissure caries. Overall health and diet play a role in the development of caries as well. Animals with poorly mineralized enamel, lower salivary pH, diets high in fermentable carbohydrates, and poor oral hygiene are all at risk for developing dental caries. Diagnosis There are five primary stages of the pathology: Stage 1 : defect involves enamel onlyStage 2 : defect extends into dentin; pulp chamber not involvedStage 3 : defect extends into pulp chamberStage 4 : significant structure damage of crownStage 5 : majority of crown lost; roots remainingYour veterinarian will need to examine your dog&#039;s teeth for enamel hypocalcification, which will show exposed and stained dentin, and will also test the stability of the dentin. Sound dentin is hard, and will not yield to a dental explorer, whereas carious dentin is soft and will yield to a sharp instrument. If the dentin is exposed, and is lacking in stability, your doctor will look for the cause of this defect. Crown fracture, abrasive wear, attrition with exposed dentin, or extrinsic staining may be some of the possible causes. If the condition has progressed to caries, and especially if it has progressed below the gum-line into the root of the tooth, extraction of the tooth will be the most likely solution for resolving the problem.    Treatment There are several stages for the treatment of dental caries: Stage 1 or 2: remove carious dentin and unsupported enamel, then restore the crown with amalgam (the traditional treatment), bonded composite restorations, or insert replacementsStage 3: treatment of the tooth pulp and root must precede restorative treatmentStage 4 or 5: extraction may be the only treatment option. Deep pits on the surface of the maxillary first molar where it meets the other teeth will be filled with a pit-and-fissure sealant to prevent caries developmentIf the condition is categorized as incipient (beginning) caries, your veterinarian will apply a fluoride varnish, or a fluoride-releasing dentin-bonding agent. If it has progressed to root caries, your veterinarian will further examine the condition of the tooth to see if the gum disease can be managed, and the restoration placed above the gum. Restoration may be possible, but extraction will be the treatment of choice for most teeth with root caries. If only one root of a tooth with more than one root is carious, extraction of the affected root with treatment of the remaining root(s) is also an option. High-risk patients (such as those with very tight fitting teeth) will most likely need an application of a pit-and-fissure sealant on the remaining teeth. Sealant treatment is especially likely, and probably necessary, for the teeth that are in direct contact with the tooth, or teeth, that have already developed caries. Your veterinarian will help you to make a practical plan for modification of risk factors.   Living and Management If your veterinarian has found it necessary to operate on one or more of your dog&#039;s teeth, you will need to return with your dog again at least six months later for a postoperative examination and radiograph, and then annually, or as the opportunity presents. It is important to commit to a regular routine of mouth hygiene, which includes brushing, and tooth strengthening chew toys and treats, since dogs that have been affected by this tooth condition will frequently have more than one incidence of caries. A healthy diet that is proportionately balanced in carbohydrates, and promotes a healthy pH balance in the mouth, along with regular checks on the teeth to monitor for new lesions (at least weekly), will go along way to helping your dog keep all, or most, of the teeth it was born with."}]