[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How does a dog get rabies?", "acceptedAnswer": {"@type": "Answer", "text": "Rabies is most commonly spread by the bite of an infected animal or through the transfer of infected saliva into the open wound of a non-infected dog."}}, {"@type": "Question", "name": "What should I do if my dog has been bitten by a rabid animal?", "acceptedAnswer": {"@type": "Answer", "text": "If you suspect your dog has been exposed to rabies, take them to an emergency vet immediately. Dogs that have been vaccinated against rabies can be revaccinated as a preventive measure."}}, {"@type": "Question", "name": "How do you know if your dog has rabies?", "acceptedAnswer": {"@type": "Answer", "text": "Rabies will always be considered as a potential diagnosis if your dog has been exposed to an infected animal. This infection should also be suspected in dogs with sudden behavioral changes, neurologic symptoms (such as muscle weakness or paralysis), appetite changes, or respiratory symptoms, especially if other differential diseases can be ruled out. A definitive diagnosis of rabies can only be made after a dog has died."}}, {"@type": "Question", "name": "How common is rabies in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The Centers for Disease Control and Prevention (CDC) indicate that about 60-70 dogs in the United States are infected with rabies each year."}}, {"@type": "Question", "name": "Does the rabies vaccine prevent a dog from getting rabies?", "acceptedAnswer": {"@type": "Answer", "text": "The rabies vaccine can prevent rabies infection. It is considered a core vaccine (one that all dogs should receive) and can be administered to a puppy starting at 14 weeks of age. A booster vaccine should then be given in 1 year, and every 1-3 years after."}}, {"@type": "Question", "name": "Can a dog survive rabies?", "acceptedAnswer": {"@type": "Answer", "text": "No. Rabies should be considered 100% fatal in dogs. Dogs that are strongly suspected to have this disease should be humanely euthanized."}}, {"@type": "Question", "name": "How long does rabies take to kill a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs will die within 10 days of acquiring rabies."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rabies in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-01/dog.vaccine.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-01/dog.vaccine.jpg"}, "author": {"@type": "Person", "name": "Heather Newett, MPH, DVM", "url": "https://www.petmd.com/author/dr-heather-newett"}, "keywords": "Dog, Contagious, Brain health, Symptom Checker, Rabies", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_multi_rabies"}, "datePublished": "January 10, 2022", "dateModified": "October 17, 2023", "description": "Dr. Heather Newett explains how to recognize rabies in dogs, including the symptoms, diagnosis, and treatment.", "articleBody": "What Is Rabies in Dogs? Rabies is a viral disease that is fatal to almost all dogs who catch it. Fortunately, pet parents can help to prevent their dogs from becoming infected with the rabies virus with a canine rabies vaccine.  The rabies virus attacks the central nervous system (CNS), spreading through the nerves from the infection site to the brain. Infected animals experience paralysis that inevitably involves the respiratory system, and leads to death.   Rabies can affect any mammal, including humans. Animals that host and spread viruses like rabies are known as reservoirs for the disease. Possible hosts include skunks, weasels, and bats. Dogs and humans are moderately susceptible to all variants of the virus, and are not considered host reservoirs.  Symptoms of Dog Rabies The initial symptoms of rabies may come on gradually and be hard to detect. These symptoms include fever, as well as decreases in energy and appetite. After 2-4 days, rabies symptoms tend to progress quickly to include weakness or paralysis of the legs, seizures, difficulty breathing, hypersalivation due to difficulty swallowing, and abnormal behavior. Changes in behavior can range from extreme aggression to depression or coma.  Classical rabies has two forms, furious and paralytic. Affected dogs may show signs of either or both forms. If the furious phase develops, dogs can become aggressive and occasionally delusional. They may seem to hallucinate and attack their surroundings with no trigger. The paralytic phase involves dogs starting to develop paralysis of various muscular systems. They often lose the ability to swallow, which leads to hypersalivation and foaming at the mouth—which some people consider to be a classic sign of rabies virus infection.  Eventually, coma and death occur after paralysis or prolonged seizure activity.  Causes of Rabies in Dogs The most common way for a dog to become infected is through a bite from an infected animal, where the virus is transmitted by the saliva. Rarely, the saliva or nerve tissue of an infected animal can contaminate a dog’s open wound or the mucous membranes of the eyes, nose, or mouth, leading to transmission of the virus without a bite occurring. How Veterinarians Diagnose Rabies in Dogs There is no way to definitively diagnose rabies in a living animal, so it is essential to observe the signs and accurately interpret symptoms. If a vet suspects rabies based on the dog’s symptoms, a diagnosis can be made by testing the brain tissue after the dog has died. The brain tissue is examined using a method called direct fluorescent antibody testing. Treatment for Rabies in Dogs There is no treatment for rabies in dogs, and humane euthanasia is recommended if the disease is strongly suspected. Recovery and Management of Rabies in Dogs Rabies is almost certainly fatal in dogs, and there is no hope of recovery or long-term management of the disease once a dog has been infected and has started to exhibit symptoms. For this reason, it is critical to keep your cat up to date on their rabies vaccine to ensure their health and safety should they become exposed to this disease."}]