[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Low Platelet Count in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/low-platelet-count-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/low-platelet-count-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_multi_thrombocytopenia"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Thrombocytopenia is a medical condition where blood platelets become too low in animals.", "articleBody": "Thrombocytopenia in Dogs Thrombocytopenia is a medical condition where blood platelets become too low in animals. Platelets are produced in the bone marrow and then released into the blood stream. They also serve the important function of maintaining hemostasis. Low platelet counts can be found in any breed of dog, and at any age. Treatment options do exist and unless the cause of the condition is serious, prognosis for the dog is positive. Thrombocytopenia affects both dogs and cats. If you would like to learn how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types  Dogs with a low platelet count may display symptoms such as: FeverLethargyHeart murmurUrinary BleedingExcessive coughingExcessive nasal mucusCollapse (in severe cases)Causes  Thrombocytopenia can be caused by a variety of factors, including: LeukemiaLymphomaDecreased platelet productionExtreme blood loss due to a hemorrhageIncreased destruction of platelets in the body (infectious agents are the most common cause of this problem)Diagnosis  Veterinarians will measure the dog&#039;s blood to determine its platelet count and compare the level against normal baselines. He or she will also rule out any recent trauma or other issues related to hemorrhaging. Typical blood laboratory tests will be able to determine the cause and whether it is due to a more serious underlying medical issue. In some instances, a bone marrow sample may be used to rule out a variety of medical conditions. When internal bleeding or issues with ruptured organs are suspected, your veterinarian may perform X-rays and ultrasounds on your dog.  Treatment To normalize the dog&#039;s platelet count, a platelet transfusion may be recommended. In some cases, an entire blood transfusion may be needed to correct anemia. Living and Management  One of the more serious complications to look out for in dogs with thrombocytopenia is the potential for excessive hemorrhaging, which generally occurs during an injury or cut. Your veterinarian may also recommend reducing the dog&#039;s physical activities or removing any hard foods from its diet, as it can cause your pet&#039;s gum to bleed. Prevention There are currently no known preventative measures for this medical condition."}]