[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Constipation (Severe) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/constipation-severe-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/constipation-severe-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_megacolon"}, "datePublished": "September 19, 2008", "dateModified": "August 16, 2022", "description": "Megacolon is a condition in which waste is remaining in the colon, causing the diameter of the colon to become abnormally enlarged. It is typically associated with chronic constipation, or obstipation – severe, obstinate constipation that blocks the passage of gas as well as feces.", "articleBody": "Megacolon in Dogs The colon is the section of the large intestine that begins at the cecum, the sac that joins the colon to the end of the small intestine (ileum), and ends where the rectum begins. All are part of the larger digestive tract. The main purpose of the colon is to serve as a temporary storage conduit while it performs the function of extracting useful water and salt from the waste. Megacolon is a condition in which waste is remaining in the colon, causing the diameter of the colon to become abnormally enlarged. It is typically associated with chronic constipation, or obstipation – severe, obstinate constipation that blocks the passage of gas as well as feces. Medically, the colon is described as exhibiting minimal colonic activity – that is, the colon is not releasing its contents. Megacolon can be a congenital or acquired condition. Dogs with congenital megacolon are born with an abnormal lack of normal smooth muscle function of the colon. Megacolon can also be acquired, such as when feces is chronically retained, fecal water is completely absorbed, and the water and matter bond, causing the feces to become solidified within the colon. If concreted feces remains lodged in the colon for a prolonged period of time, distention of the colon will occur, resulting in irreversible colonic inertia (inactivity). Colonic inertia is characterized by the smooth muscle of the colon no longer contracting or expanding to void feces. Symptoms and Types Constipation: feces trapped in the colonObstipation: severe blockage that impedes both feces and gas, keeping them trapped in the colonInfrequent defecationStraining to defecate with small or no fecal volumeSmall amount of diarrhea may occur after prolonged strainingHard, dry fecesHard colon felt with abdominal examination (palpation)Fecal impaction can be felt when a gloved finger is inserted into the rectumOccasional vomiting, anorexia and/or depressionWeight lossDehydrationScruffy, unkempt hair coatCauses Idiopathic (unknown)Congenital (present at birth)Mechanical obstruction of fecesTrauma to the bodyLimb and/or pelvic fracturesMetabolic disordersLow serum potassiumSevere dehydrationDrugsVincristine: used for lymphoma and leukemiaBarium: used for enhancing x-ray imagesSucralfate: used for treating ulcersAntacidsNeurologic/neuromuscular diseaseSpinal cord diseaseIntervertebral disk diseaseDisease of the anus and/or rectumDiagnosis Your veterinarian will perform a thorough physical exam on your dog. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, an electrolyte panel, and a urinalysis. Your doctor will also perform an abdominal palpation (examination by touch) of the colon, and a manual examination of the rectum, by digital rectal penetration (by finger). You will need to give a thorough history of your dog&#039;s health, including a background history, onset of symptoms, and possible incidents that might have precipitated this condition. Abdominal radiograph imaging is useful for a visual examination of the colon. Recorded images will show whether the colon is full of feces, if there is a mass blockage in the colon, or if there are any other underlying causes for the megacolon. An internal examination of the colon using a lighted tubular instrument (colonoscope) may be performed if obstructive lesions inside the colon, or in the wall of the colon, cannot be ruled out.  Treatment Most patients affected with megacolon will need to be hospitalized for initial fluid therapy, both to rehydrate the body and to correct electrolyte imbalances. The colon can then be gently evacuated. Your veterinarian will administer anesthesia to your dog, and then manually inject warm water enemas and water-soluble jelly, allowing for the easy extraction of feces with a gloved finger or sponged forceps. If the problem is recurrent or especially severe, and is not responding to medical management, as in the case of irreversible colonic inertia, surgery may be necessary to repair the colon. Most dog can be cured of recurrent megacolon after undergoing subtotal colectomy surgery. Living and Management For dogs suffering from megacolon, exercise and regular activity are strongly encouraged for the health and strength of their digestive and abdominal muscles. A low-residue, high fiber diet may also help to prevent recurrences of megacolon. Another alternative is to supplement your dog’s regular maintenance diet with veterinarian approved fiber supplements or canned pumpkin (not pumpkin pie filling). Avoid feeding any bones to your dog to protect against potential injuries to the colon when bones are swallowed, and to prevent clumps of partially digested bone from blocking the intestinal tract."}]