[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live with kidney failure without treatment?", "acceptedAnswer": {"@type": "Answer", "text": "Left untreated, dogs in kidney failure will die, usually within a few days to a few weeks. Death is often preceded by loss of appetite, dehydration, weight loss, vomiting, and multi-organ failure."}}, {"@type": "Question", "name": "Can dogs recover from chronic renal failure?", "acceptedAnswer": {"@type": "Answer", "text": "There is no cure for CRF. However, if CRF is caught early and managed correctly, most dogs that experience kidney disease can go on to live a relatively normal life with some changes and long-term management."}}, {"@type": "Question", "name": "Can chronic renal failure in dogs be reversed?", "acceptedAnswer": {"@type": "Answer", "text": "While CRF is not reversible, early treatment can provide your pet with a happier, longer, and fuller life. Regular, semi-annual checkups are key to early diagnosis and treatment of the development of chronic renal disease. Featured Image: iStock.com/Korneeva_Kristina"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chronic Renal Failure (CRF) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Urinary", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/german.shepherd.under_.blanket.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/german.shepherd.under_.blanket.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Condition, Kidney health, Symptom Checker, Chronic Renal Failure", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/urinary/c_multi_renal_failure_chronic"}, "datePublished": "February 18, 2022", "dateModified": "September 12, 2023", "description": "Dr. Kearley discusses chronic renal failure (CRF) in dogs, including symptoms, diagnosis and treatment options.", "articleBody": "What Is Chronic Renal Failure in Dogs? Chronic renal failure (CRF), renal insufficiency, and chronic kidney disease (CKD) are all medical terms used to describe the same condition. It occurs when the kidneys are unable to perform their required tasks at the same level of efficiency as before.   Dogs have two kidneys located on either side of their abdomen, that play a vital role in filtering waste from the body. Additionally, the kidneys serve to regulate fluid, mineral, and electrolyte balance; conserve water and protein; and play an important role in maintaining blood pressure and red blood cell production by making a hormone called erythropoietin.   Dogs cannot survive without their kidneys, and unfortunately, kidney transplants are yet to be a viable solution. Dialysis (a treatment for failing kidneys including the removal of waste) is often expensive and is extremely rare in dogs. However, early diagnosis and intervention is key to help maintain your dog’s quality of life.  Once diagnosed, CRF is then classified into four different stages based on severity of clinical signs and laboratory values:  Stage I: Clinical signs usually not apparent   Stage II: Some clinical signs noted   Stage III: Many clinical signs noted, and pets often feel “sick”  Stage IV: Majority of clinical signs noted, pets often present as a crisis  Causes of Chronic Renal Failure in Dogs The term “chronic” in chronic renal failure means that the process has been ongoing, is progressive, and unfortunately, cannot be reversed. For some dogs, the disease could have occurred after a serious kidney injury such as from a severe infection (i.e., leptospirosis, pyelonephritis) or ingestion of a toxic substance such as anti-freeze, grapes, or raisins, and certain antibiotics.    For others, it could be inherited, such as with glomerular disease (a specific type of renal kidney disease) and amyloidosis (a rare organ disease) as seen in breeds like the Bernese Mountain Dog and Shar-pei.   For others, it could be attributed to underlying immune-mediated diseases, stroke-like events, or even from clotting disorders. In cases for newly diagnosed dogs the underlying cause will likely remain unknown.    Symptoms of Chronic Renal Failure in Dogs Clinical signs are often related to the severity of the CRF stage, meaning there are additional and more severe signs noted with stages III and IV than there are with stages I and II. Dogs often exhibit symptoms including:   Increased thirst and urination  Intermittent vomiting  Dehydration   Oral ulcerations (sores in the mouth)  Foul breath  Weight loss  Decreased appetite   Some dogs may show muscle wasting and signs attributed to high blood pressure, such as vision loss and weakness.   How Veterinarians Diagnose Chronic Renal Failure in Dogs CRF is often diagnosed based on routine blood work and a urinalysis looking specifically at kidney markers such as:  Blood urea nitrogen (BUN): A by-product of protein metabolism, higher values can often indicate kidney failure  Creatinine (CREA): Measures how well kidneys are filtering waste from blood  Phosphorous: Elevated phosphorus levels typically indicate kidney damage  Electrolytes (Sodium, potassium, chloride)  Calcium  Red blood cell count: A low red blood cell count may indicate kidney failure  Symmetric dimethylarginine (SDMA): An additional test to help determine if kidney disease is present; it can be used for early detection of kidney disease  Urine specific gravity: A marker of how diluted or concentrated the urine is. Usually the higher the number, the more concentrated the urine is and the greater ability of the kidney to conserve water.   Your veterinarian will most likely recommend additional diagnostic testing, including:  A urine protein to creatinine (UPC) ratio to quantify how much protein is being lost in the urine  A urine culture, as dogs in CKD are more likely to acquire urinary tract infections  A blood pressure evaluation  Radiographs or abdominal ultrasound to screen for kidney stones or infarcts (areas of dead tissue)    Treatment of Chronic Renal Failure in Dogs Dogs with CRF are generally older and have other ongoing issues, such as arthritis or liver disease, and so the management of CRF can be challenging. However, CRF can be managed, mostly with the aid of medications, diet, and hydration.   Specific management is geared toward each stage of the disease, with each progressive stage recommendations built upon the previous stage recommendations. Any dog in any stage with an increase in either UPC (urine protein to creatinine ratio) or high blood pressure will most likely be treated with medication.   Throughout your dog’s life, any disease process or illness that could affect his hydration should be treated promptly with IV fluids. Other drugs will be prescribed based on the dog’s diagnosis since renal metabolism will be affected and can lead to overdosages and/or worsening of the kidney disease.    Additionally, for all stages, fresh water should always be available, drinking should be encouraged, and adequate nutrition should be given daily. Dogs diagnosed with CRF are most likely prescribed a kidney friendly diet, which may include feeding your dog a canned diet of wet food that contains additional water.  Recovery and Prevention of Chronic Renal Failure in Dogs As chronic renal failure is not curable and often progressive (although the timeline is variable) in nature, dogs diagnosed early on will benefit from nutritional management and consistent veterinary attention, which may include more frequent check-ups and blood work.    Dogs in stages I and II may often be monitored for further progression of signs, and some may be given a prescription diet specifically geared to help the kidney, by limiting the amount of work they must do.    Many dogs can go on to have a decent quality of life for many months to years. Dogs in stages III and IV often require more medical and dietary assistance. If secondary anemia is present, erythropoietin injections can be given at the direction of your veterinarian.   Dietary supplements, and phosphorus binders (to treat high phosphorus levels) may also be given for low potassium. Anti-nausea and anti-emetic (anti-vomiting) medications can also be prescribed for dogs with a poor appetite, vomiting, or nausea. Fluids given either intravenously or underneath the skin can help dehydration. Because of the severity of signs often seen in dogs with stage III and IV, and the amount of care and effort required to support these dogs, some may be humanely euthanized.  "}]