[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Acid Reflux in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/brown-dog-licking-lips_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/brown-dog-licking-lips_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_gastroesophageal_reflux"}, "datePublished": "August 8, 2008", "dateModified": "November 18, 2022", "description": "Acid reflux in dogs is a condition where gastric or intestinal fluids reverse into the esophagus (the tube connecting the mouth to the stomach). Learn about the signs, symptoms, and treatment of acid reflux in dogs.", "articleBody": "What Is Acid Reflux in Dogs? Gastroesophageal reflux disease (GERD) is a condition where gastric or intestinal fluids reverse into the esophagus (the tube connecting the mouth to the stomach). This may be due to the muscular opening at the base of the esophagus (called the lower esophageal sphincter) relaxing. While this can occur during anesthesia, it also happens for unknown reasons, too. Gastroesophageal reflux, also called “acid reflux,” is thought to be fairly common in dogs. It can happen to any dog (and it crops up in cats, too), although younger pups and brachycephalic (flat-faced) dogs are at greater risk. The gastric acid, pepsin, bile salts, and other components of the gastrointestinal juices cause damage to the protective lining of the esophagus. This can result in inflammation of the esophagus (esophagitis). Symptoms of Acid Reflux in Dogs Gastroesophageal reflux can cause esophagitis, but the condition’s tissue damage and pain levels vary. Mild esophagitis is limited to esophageal lining inflammation, while more severe ulcerative esophagitis causes damage to the deeper layers of the esophagus.  Symptoms of acid reflux in dogs include: Regurgitating food Evidence of pain (whining or pacing, for example) Lack of appetite Lip-licking Coughing Change in the sound of the bark Weight loss Causes  of Acid Reflux in Dogs Gastroesophageal reflux can happen when an anesthetic is administered, which causes the sphincter between the stomach and the esophagus to relax. Head-down positioning of the patient during anesthesia, or if the dog hasn’t fasted properly pre-anesthesia, may increase the chances of gastroesophageal reflux. Congenital hiatal hernias also heighten the risk for gastroesophageal reflux.  Young dogs may be at greater risk of developing GERD because their gastroesophageal sphincters are still developing. Long-term or chronic vomiting can also cause esophagitis.  How Vets Diagnose Acid Reflux in Dogs  The best means of diagnosis is generally an endoscopy, an examination that uses a small camera to view the lining of the esophagus and other parts of the gastrointestinal tract. This is the most effective way to determine if changes in the lining are consistent with esophagitis due to gastroesophageal reflux.   Keep in mind that esophagitis can be caused by other issues aside from acid reflux, such as: Ingestion of a caustic agent A foreign body in the dog’s throat A tumor in the esophagus A hernia next to the esophagus Megaesophagus, a condition in dogs where the muscles of the esophagus do not function properly in pushing food into the stomach Other diseases of the mouth, throat, or stomach Treating Acid Reflux in Dogs Most treatment is done at home. Many dogs respond to eating a low-fat, prescription diet given in small, frequent meals. Dietary fat should be limited because fat stimulates gastric acid secretion. Medications can also help. Drugs known as gastrointestinal pro-kinetic agents help stomach contents move through the organs and strengthen the lower esophageal sphincter. Veterinarians also often recommend medications to reduce stomach acid production and to protect the lining of the esophagus.  Managing Acid Reflux in Dogs After initial treatment, continue monitoring for gastroesophageal reflux in your dog, as it may flare up from time to time. Watch for signs of discomfort and the other symptoms of GERD. A continued low-fat, low-protein diet will help prevent future incidences, and high-fat treats should be avoided, as they may worsen gastroesophageal reflux. Some dogs also require long-term treatment with medications.  If your dog doesn’t respond to initial medical treatments, follow-up diagnostic testing may be advised.  Preventing  Acid Reflux in Dogs High-fat foods can worsen acid reflux. The best way to prevent future flare-ups is a healthy diet that’s low in fat. Also, be sure to keep your dog on any maintenance medications that your veterinarian has recommended.   Featured Image: iStock/Mary Swift"}]