[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "&#039;Mad Itch&#039; Pseudorabies Virus Infection in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/mad-itch-pseudorabies-virus-infection-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/mad-itch-pseudorabies-virus-infection-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_pseudorabies_virus_infection"}, "datePublished": "November 17, 2008", "dateModified": "August 16, 2022", "description": "The pseudorabies virus infection is an uncommon but highly fatal disease found in dogs, especially those that come into contact with swine. Unfortunately, many dogs with this virus die suddenly, often without characteristic signs.", "articleBody": "Suid Herpesvirus in Dogs The pseudorabies virus infection is an uncommon but highly fatal disease found in dogs, especially those that come into contact with swine. Unfortunately, many dogs with this virus die suddenly, often without characteristic signs. When symptoms do occur, they include excessive salivation, intense itching, and neurologic behavioral changes. Because of the extreme itching it causes, pseudorabies is sometimes referred to as “mad itch.” The virus infects both dogs and cats -- primarily those living on farms -- as well as other domestic animals such as swine, cattle, sheep, and goats. Otherwise, there is no breed, gender, or age predilection for this viral infection. If you would like to learn more about how this pseudorabies affects cats, please visit this page in the petMD health library. Symptoms and Types As previously stated, it is possible a dog suffering from pseudorabies displays no symptoms at all. However, some signs which may be seen include: FeverVomitingExcessive salivationRapid and labored breathingOther symptoms and signs may be neurological in nature, such as: DepressionLethargyAtaxiaConvulsionsReluctance to moveLying down excessivelyIntense itching and self-mutilation from scratchingComaCauses Other than direct contact with swine, dogs may contract the pseudorabies virus (or Suid herpesvirus 1) by eating contaminated, uncooked meat or offal from swine, or by ingesting infected rats. Diagnosis Your veterinarian will make a diagnosis of the pseudorabies virus infection by comparing it to diseases with similar symptoms. For example, dogs with the regular form of rabies will attack anything that moves, and there is no itching or sudden death. Meanwhile, a dog that has been poisoned displays no signs of itching or personality change. With canine distemper, there is no hypersalivation, sudden death, or personality change, but respiratory and gastrointestinal signs are common. If your dog does recover from this infection, a blood test will reveal pseudorabies virus antibodies. If sudden death should occur, your veterinarian will examine its brain tissue for confirmation of pseudorabies.   Treatment Unfortunately, there is currently no effective medical or medicinal treatment for the pseudorabies virus. Living and Management Expected course and prognosis: Classic Form of the Infection -- in 60 percent of cases the condition lasts 24 to 36 hours; it is almost invariably fatal.Atypical Form of the Infection -- in 40 percent of cases the condition lasts more than 36 hours; it is almost invariably fatal.There is a mild potential for human infection. Precautions should be taken when treating infected animals, and when handling infected tissues and fluids. Dog-to-dog transmission does not usually occur. Prevention Avoid contact with infected swine, the reservoir hostAvoid ingestion of contaminated porkAvoid ingestion of infected rats"}]