[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/m1sw41k6jw", "@type": "VideoObject", "duration": "PT1M44S", "name": "5327099874001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/6782f5f444b29b0e61fccabefc2681bb45b2e315.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/m1sw41k6jw", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/7bffc1a08713772cc5ffc77342ff49ff9aa75ba4.m3u8", "transcript": "[MUSIC PLAYING]\n\nDogs tend to be a little less discriminating about what they ingest than our other pets, and as a result are more susceptible to gastrointestinal obstruction or a partial or complete blockage from the stomach into and through the intestines. Gastrointestinal obstruction can be caused by any number of conditions.\n\nWhile it is most commonly due to ingestion of foreign bodies, tumors, hernias, gastroenteritis, which is an inflammation of the gastrointestinal tract, pylori stenosis, an anatomical deformity, or even torsion, a twisting of the intestines or stomach, can also cause obstruction. All dogs can experience gastrointestinal obstruction. However, younger dogs and dogs that have a tendency to ingest foreign bodies are more susceptible.\n\nA blockage may occur either in the stomach or intestines, and can lead to vomiting, weight loss, weakness, diarrhea, and anorexia. Vomiting can cause severe dehydration and electrolyte imbalances. So seeking veterinary advice is crucial, as some obstructions can be life threatening.\n\nTreatment of gastrointestinal obstruction usually constitutes surgery to remove the obstructing body, in addition to treatments that address secondary effects of the obstruction, such as administration of IV fluids for dehydration. It is important to restrict your dog's activity after the initial treatment, as well as feed only bland foods for the first few days, followed by a gradual return to his or her normal diet.\n\nDogs with a habit of ingesting foreign objects tend to be repeat offenders. So take care to keep garbage bins and other items not made for consumption out of your dog's reach.\n\n[MUSIC PLAYING]\n\n[BARKING]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/digestive/c_multi_gastrointestinal_obstruction?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can a dog  pass an intestinal blockage?", "acceptedAnswer": {"@type": "Answer", "text": "Sometimes. If the blockage is caused by a foreign body, the dog can often pass it through the gastrointestinal tract and out in the stool. Your vet may recommend fluid therapy—either IV (through a vein) or subcutaneous (under the skin)—to address dehydration and help the object pass. Also, x-rays may be used to track the progress of the object as it moves through."}}, {"@type": "Question", "name": "How  long can a dog live with an intestinal blockage?", "acceptedAnswer": {"@type": "Answer", "text": "Untreated, a dog with a complete obstruction would likely die within 3-4 days. If a dog is diagnosed with an intestinal blockage, surgery is recommended as soon as possible."}}, {"@type": "Question", "name": "What can I do if my dog has an intestinal blockage?", "acceptedAnswer": {"@type": "Answer", "text": "If you suspect your dog has an intestinal blockage, take them to be examined by a veterinarian immediately. The vet will help you determine whether or not your dog needs surgery and how to proceed."}}, {"@type": "Question", "name": "How much is surgery for a dog with an intestinal blockage?", "acceptedAnswer": {"@type": "Answer", "text": "The cost can vary widely depending on many factors, including where you live and how sick the dog is. According to CareCredit, dog owners can expect to pay anywhere between $800 and $7,000. Featured Image: iStock.com/Koh Sze Kiat"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Intestinal Blockage", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-01/dog.tennis.ball_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-01/dog.tennis.ball_.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Condition, Digestive health, Symptom Checker, Intestinal Obstruction", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_gastrointestinal_obstruction"}, "datePublished": "January 21, 2022", "dateModified": "September 12, 2023", "description": "Dr. Veronica Higgs explains how to recognize an intestinal blockage in your dog, including the symptoms and when you should take your dog to an emergency vet. She also discusses treatment options, including surgery, for canine intestinal blockage. ", "articleBody": "What Is an Intestinal Blockage  in Dogs? An intestinal blockage (obstruction) is a partial or complete blockage of the intestines that stops solid foods or liquids from passing through. This can prevent absorption of water and nutrients, which can quickly cause the dog to become dehydrated and have imbalanced electrolytes (minerals that are important for the body to function).   Even worse, the blockage can damage the intestines by pressing on the intestinal wall and causing the tissue to die (necrosis) or break (bowel rupture or perforation).   Symptoms of Intestinal Blockage in Dogs Vomiting: Persistent vomiting can lead to severe dehydration and electrolyte imbalances.   Loss of appetite (anorexia): Dogs may show no interest in eating. Young dogs with a foreign body obstruction (an object they shouldn’t have eaten) will initially still eat, or try to, but then vomit.   Abdominal pain: An obstruction can press on the intestines, which can be very painful and even cause intestinal rupture or inflammation of the abdomen (peritonitis).    Weakness/lethargy: This can be caused by dehydration and/or an electrolyte imbalance as well as by pain.   Diarrhea/difficulty defecating (pooping)/Straining to defecate: A dog with a partial blockage may have diarrhea as liquid squeezes around the obstruction. If there is a complete blockage, the dog may try to defecate but won’t be able to.   Weight loss  If your dog is vomiting but not producing stool (poop), this is a strong sign of an intestinal blockage.   Causes of  Intestinal  Blockage  in Dogs Intestinal blockages are frequently caused by foreign bodies—items the dog eats that cause an obstruction. Common items include bones, balls, toys, rocks, corncobs, cloth (such as underwear or socks), fruit pits, tampons, and linear objects (such as string, yarn, thread, ribbon, or pantyhose).   However, blockages can also be caused by intestinal tumors or masses (abnormal new growths of tissue), especially in older dogs.   Other possible causes include:   Strictures (narrowing of intestines often due to scar tissue)  Adhesions (bands of scar tissue from previous surgery)  Intussusception (telescoping of the intestines where a portion of the intestine slides into an adjacent portion)   Severe intestinal parasite infestation  Hernias   Torsion (twisting of the intestines)   Severe inflammation of the small intestines  How Veterinarians Diagnose  Intestinal Blockage  in Dogs If you see or suspect that your dog has eaten a foreign object, you should seek immediate veterinary attention.   In some cases, the dog can immediately be made to vomit, bringing up the foreign object before it can cause an intestinal blockage. This should be done no more than 30 minutes to 2 hours after the dog ate the object.   If your dog is showing symptoms of an intestinal blockage, it is likely too late to induce vomiting. In this case, your veterinarian will start with a good physical examination, palpating (touching) the abdomen to check for pain or evidence of masses, foreign bodies, or intussusception. Sometimes your vet will be able to feel the actual obstruction, but often they won’t. Most likely they will perform an abdominal x-ray for further evaluation.  If the x-ray is inconclusive or your vet is looking for more information before recommending surgery, they may perform an abdominal ultrasound exam. This is very useful for showing images of foreign bodies but will also provide more information if a tumor or intussusception is suspected.   Bloodwork will likely also be recommended to rule out other causes of the symptoms and to check your dog’s hydration and electrolytes. Treatment for  Intestinal Blockage  in Dogs Depending on the size of the dog, how sick they are, and the size of the foreign body, sometimes dogs can pass an object and poop it out in their stool. However, if it gets stuck and becomes an intestinal blockage, surgery will be needed to identify and remove the blockage.   Before surgery, your veterinarian may want to admit your dog into hospital, where they can receive IV fluids (to rehydrate them) as well as medication for nausea and pain.  Once your dog has been stabilized, surgery is performed under anesthesia to identify the blockage. If a foreign object is the cause of the obstruction, sometimes an incision (cut) can simply be made into the intestines, the object removed, and the intestines sutured (closed) back up (this procedure is called an enterotomy).   However, if the intestines are damaged or there is dead tissue, sections of the intestines may need to be removed along with the cause of the obstruction, such as foreign body or tumor (this is called a resection and anastomosis). Recovery and Management of  Intestinal Blockage  in Dogs  Early diagnosis and treatment of intestinal blockage is important for a good outcome and to prevent complications (such as damage to the intestines, intestine rupture, leakage, splitting, or peritonitis). If surgery is needed. it should be performed as soon as possible.   After surgery, most dogs will need to remain hospitalized for 1-2 days on IV fluids and pain medications. They can usually go home after they start eating again, and if they are not vomiting. The recovery time is typical for any abdominal surgery and includes 10-14 days of rest and restricted activity.  Most dogs make a complete recovery and go back to their normal lives, but this can vary based on the cause of the intestinal blockage. If a foreign body was the cause of your dog’s blockage, it’s important to make sure they don’t eat any foreign objects in the future, as complications are more likely when there is scar tissue from previous surgeries. If a tumor caused the blockage, the vet will send a sample to the lab to identify the type of tumor and the likely outcome.  "}]