[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Intestinal Parasite (Cryptosporidium) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_cryptosporidiosis"}, "datePublished": "July 17, 2008", "dateModified": "August 16, 2022", "description": "Cryptosporidiosis is caused by a variety of factors and can be treated effectively with medications. The disease is caused by the ingestion of the intestinal parasite Cryptosporidium and is commonly ingested through contaminated water, food or feces.", "articleBody": "Cryptosporidiosis in Dogs Cryptosporidiosis is caused by a variety of factors and can be treated effectively with medications. The disease is caused by the ingestion of the intestinal parasite Cryptosporidium and is commonly ingested through contaminated water, food or feces. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types The most common sign of Cryptosporidiosis is fever and diarrhea. Dogs will also display intolerance for food, or in more serious cases, organ disease. Dogs may exhibit lethargy, intolerance for exercise and weakness. Causes Some of the risk factors include the ingestion of contaminated food or water, the ingestion of animal feces, and intestinal infection. When the Cryptosporidium parasite is ingested in the oocyst stage, it is transferred into the body of the host (the dog). It then develops into a sporozoite, the division and development stage, and proceeds to spread and infect the cells of the host body. The disease is more a concern for puppies, as their immune systems are less developed and more susceptible to complications. Diagnosis A fecal examination is often performed to determine what the underlying cause is for the issue.  Treatment Treatment for Cryptosporidiosis is generally on an outpatient basis, with the recommendation to limit food until the diarrhea has subsided, along with an increase in fluids to combat dehydration. Boil the dog’s drinking water to assure that it is clean. For healthy dogs, the condition will generally run its course without treatment. Young, old, and immune compromised dogs may need medication to prevent internal complications. Prescribed medications must be followed through to completion. Living and Management Following treatment, monitoring the dog for signs of improvement is recommended. Overall, prognosis is excellent if the immune system is strong. Prevention The most preventative measure available for this disease is to make sure that the dog is in a clean environment and is not eating animal feces or drinking dirty water, as it could be contaminated with the Cryptosporidium organism that causes this condition."}]