[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/w29qv2r19l", "@type": "VideoObject", "duration": "PT1M25S", "name": "5327099767001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/f27b118af7fdaed8ad0e335236e94c4528133ddf.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/w29qv2r19l", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/2a0524bd63c18fecf156cfae009f10cd96cb5a83.m3u8", "transcript": "When a dog's skin is cut or wounded there is an increased risk of infection. Pio derma refers to a bacterial infection of the skin. That's very common in dogs and characterized by lesions and pustules on the skin and in some cases partial hair loss. Treatment is typically given on an outpatient basis.\n\nAnd the prognosis is good. Symptoms of hypothermia include itchiness pustules crusted skin, hair loss and dry discharge in the affected area. While this bacterial infection can occur in any breed there are a few breeds that are predisposed to developing hypodermic including German shepherds with short coats and breeds with skin folds such as Bulldogs and pugs. Other dogs at a higher risk of developing prior drama are those with current fungal infections endocrine disease and flea or food allergies.\n\nIn most cases the condition will be diagnosed through a physical examination of a dog's skin and coat in the event that the drama appears to be deeper in the dog's skin skin scraping skin biopsies and an examination of bacterial cells may be performed to see if the condition is a result of a more serious underlying medical condition, such as an autoimmune disease Dermot typically responds favorably to medical therapy and treatment is generally done on an outpatient basis. And will involve topical medications as well as oral antibiotics.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/reproductive/c_multi_vaginal_hyperplasia_and_prolapse?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mass Protrusion from the Vaginal Area in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/mass-protrusion-vaginal-area-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/mass-protrusion-vaginal-area-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_multi_vaginal_hyperplasia_and_prolapse"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Vaginal hyperplasia and prolapse refers to a mass which protrudes from the vaginal area. The condition is similar in nature to fluid-filled tissue (edema). If serious, it can prevent normal urination.", "articleBody": "Vaginal Hyperplasia and Prolapse in Dogs Vaginal hyperplasia and prolapse refers to a mass which protrudes from the vaginal area. The condition is similar in nature to fluid-filled tissue (edema). If serious, it can prevent normal urination. Vaginal hyperplasia affects dogs of all ages, although it is found more commonly in younger animals. The outcome is positive for most animals, but the chance of the condition recurring is high. Symptoms and Types Type 1 hyperplasia occurs when there is a slight protrusion, even though it does not exit the vulva itself. Type 2 hyperplasia, on the other hand, is when the vaginal tissue actually protrudes through the vulvar opening. While Type 3 hyperplasia refers to the donut-shaped mass, which can be seen externally. There are several signs that may be noticed with this medical disorder, including the licking of the vaginal area, unwillingness to copulate, and painful urination (dysuria). Causes This disorder can affect almost any breed. But these breeds are more likely to suffer from the condition: Labradors, Chesapeake Bay Retrievers, German Shepherds, Springer Spaniels, Walker Hounds, Airedale Terriers, and American Pit Bull Terriers. Diagnosis Upon physical examination, a round mass may be noticed protruding the animal&#039;s vulvar area. A vaginal examination will be performed to determine the severity and type of the condition. To the touch, the animal&#039;s tissue may feel dry.  Treatment Treatment is typically done on an outpatient basis. If there is a protruding mass, it is important to keep the area clean and watch for problems urinating, as they are common. The recurrence rate is high; 66-100% of animals will have the medical condition return after treatment. Living and Management If the animal is unable to urinate, this is a sign of a serious medical condition and should be treated immediately. The outcome for the animal is positive, but there are complications that can occur when the urethra is involved. Prevention There are no current prevention methods for this medical condition. See Also"}]