[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/039oa06fi8", "@type": "VideoObject", "duration": "PT3M14S", "name": "5327099775001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/c4cf7c2bcb5f405404abc4370aadd661c5ac092d.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/039oa06fi8", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/d364566830d463290df188ebd5bc1d524fa28c0d.m3u8", "transcript": "Enter for table disk disease or IBD is a condition in dogs where the cushioning discs between the vertebra of the spinal column either bulge or burst into the spinal cord space. These disc then pressed on the spinal cord, causing pain nerve damage and even paralysis breeds that are predisposed to IBD include dioxins beagles basset hounds and even shits is type 1 IBD is common in the neck region of smaller breeds. The discs develop a hardening of the outer layer and damages to the disc can allow it to break down even easier. Any foreseeable impacts, such as jumping or landing incorrectly can cause one or more of the disc to burst and the material depressed on the spinal cord with type 2 herniation the discs become hardened and fibrous over a long period of time and eventually break down bulge out and can compress the spinal cord when the nerves of the spinal cord are compressed.\n\nThe nerve impulses aren't able to transmit their signals to the final destination in the limbs or even the bladder depending on the location of the disc that's bulging signs may occur anywhere in the body ranging from the neck all the way back to the rear legs. Symptoms of IBD and dogs may include unwillingness to jump. Pain and weakness in the rear legs crying out in pain anxious behaviour muscle spasms of the back or neck a hunchback or neck with tense muscles reduced appetite and activity level and loss of bladder or bowel control. Examination by your veterinarian will include a complete neurologic exam, which will help identify where in the spinal cord the injuries located x-rays may show an abnormal area in the spine.\n\nBut since the spinal cord itself doesn't actually appear on x-rays special imaging may be necessary to locate the actual source of the injury. One such procedure is called a mile a gram. Your veterinarian will inject a special dye into the spinal column which surrounds the spinal cord and allows it to appear on the x-rays. This test requires your pet to be put under anesthesia and in some cases further testing, such as a c.t. scan or an MRI may also be used to locate where the nerves are being pinched and if it's necessary for surgical repair.\n\nDepending on the severity of the damage to the spinal cord treatment can range from conservative to surgical. Conservative care usually includes treatment with drugs such as steroids or anti-inflammatory as to reduce the swelling of the chord and reduce pain. The dog must also be kept confined in a crate or a cage for up to six weeks to prevent further damage from occurring. If the damage is too severe and the dog is paralyzed or incontinent conservative therapy may not be enough in these cases emergency surgery is needed to open up the space around the spinal cord.\n\nPrognosis will depend on the severity of the spinal cord damage and the treatment that's required in breeds that are predisposed to IBD. Keeping them at a lower weight will help reduce the stress on their backs and necks. Walking with a harness will also help keep stress off the neck and pet parents should discourage these breeds from jumping off of high surfaces.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/musculoskeletal/c_multi_neck_back_pain?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Neck and Back Pain in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/neck-back-pain.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/neck-back-pain.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Pain", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_multi_neck_back_pain"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Unfortunately, your dog can not tell you where it hurts, and it can be difficult to determine the exact location when your dog has been injured and is in obvious pain.", "articleBody": "Unfortunately, your dog can not tell you where it hurts, and it can be difficult to determine the exact location when your dog has been injured and is in obvious pain. Your veterinarian may even have trouble determining the location. And because there are a number of causes for neck and back pain, zeroing in on the underlying cause may take some time. Symptoms and Types Change in postureAbnormal spine alignment (i.e., back is curved upward)Visible trauma to areas around the spine (e.g., bruises, discoloration)Stiff neckUnable or unwilling to turn or raise its headYelps or moans when its neck or back is touchedYelps or moans when it moves its spine, or refuses to move at allLethargy, weaknessFeverWobbly, lack of coordination, inability to walk properly (ataxia)Loss of appetite (anorexia)Causes    Diseases of the muscles surrounding the spine:Soft tissue injuriesBite woundsInflammationInfection Disc disorders:Degenerative discsInfection of the discsInstability of parts of the spine Trauma to the spine:FractureDislocationCancerVertebraRoots of nervesTissues around the spineMembrane disorders in the brain and spineKidney diseaseDiagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and any possible incidents that might have led to this condition. You will need to provide as much detail as possible regarding your dog&#039;s health history, the onset of the symptoms and what type of symptoms have been representing, and what might have been the cause of the injury. The doctor will perform baseline blood tests, including a chemical blood profile and a complete blood count, a urinalysis, and a spinal fluid analysis. Other diagnostic tests that may be used for conclusively identifying the origin of the back pain are computed tomography (CT) scans, magnetic resonance imaging (MRI) scans, and X-ray imaging of the abdominal and spinal areas. Other essential tests include a neurological exam, and a myelogram, whereby a radiopaque agent is injected into the subarachnoid space in the spine so that the spine and nerves of the spine are more clearly visible on an X-ray image.  Treatment  Because the causes for neck and back pain are so varied, the treatment is determined according to the nature of the disease and degree in which the spine&#039;s tissues are involved. Depending on the veterinarian&#039;s plan, your pet may need to be hospitalized. Treatments can often call for dog pain medication, surgery, or both. Some possible treatments include anti-inflammatory agents, such as corticosteroids, antibiotics, and chemotherapy. Surgery, however, is required in the case of spinal trauma, paralysis, disc or vertebrae infection, and/or cancer located near the spinal cord. Living and Management Your pet will require plenty of home care. Make certain you follow the veterinarian&#039;s instructions as to medications and follow-up evaluations. Keep track of changes, watch for signs of improvement, and report them to the veterinarian. Avoid moving your pet and don’t let them exercise until it is approved by the veterinarian. Some animals recover well from neck and back pain; however, it’s a condition that can be very serious, even life-threatening. See Also"}]