[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live after being diagnosed with sweat gland, sebaceous  adenocarcinoma?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs live full lives after diagnosis and treatment for sebaceous  adenocarcinomas."}}, {"@type": "Question", "name": "How aggressive is sweat gland, sebaceous adenocarcinoma in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Skin adenocarcinomas are locally invasive and spread easily to nearby lymph nodes, but they generally do not metastasize to other parts of the body."}}, {"@type": "Question", "name": "Is sweat skin adenocarcinoma curable in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, skin adenocarcinomas are curable with surgical removal and chemotherapy, if required. References Tumors of the Skin in Dogs – Dog Owners. Merck Veterinary Manual.  David M. Vail; Stephen J. Withrow. Tumors of the Skin and Subcutaneous - Small Animal Clinical Oncology. 4th ed. Withrow &amp; MacEwen&#039;s; 2007.  Featured Image: istock.com/Mary Swift"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Adenocarcinoma of the Sebaceous and Sweat Glands in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/old.dog_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/old.dog_.jpg"}, "author": {"@type": "Person", "name": "Heather Newett, MPH, DVM", "url": "https://www.petmd.com/author/dr-heather-newett"}, "keywords": "Dog, Cancer, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_multi_adenocarcinoma_skin"}, "datePublished": "December 13, 2021", "dateModified": "August 12, 2022", "description": "Dr. Heather Newett explains what adenocarcinomas in the sebaceous and sweat glands in dogs are, including how they are diagnosed and treated.", "articleBody": "What Is Adenocarcinoma of the Sweat and Sebaceous Glands in Dogs? Dogs have two types of sweat glands: apocrine and eccrine. Apocrine sweat glands: These are located at the base of hair follicles all over the dog’s body. Although they are considered a type of sweat gland, apocrine glands don’t actually produce sweat. Instead, they produce a thick fluid loaded with pheromones that help dogs identify each other by scent.  Eccrine (or merocrine) sweat glands: These are similar to the sweat glands humans have that produce a clear, odorless fluid and helps cool us off. In dogs, eccrine glands are located in the paws, meaning that dogs “sweat” from their paws. However, sweating is not the primary way dogs cool off (that’s panting), and dogs have far fewer eccrine glands than humans. Additionally, dogs have another type of skin gland called a sebaceous gland, which is also located near the hair follicle. Sebaceous glands are sometimes called oil glands and secrete an oily fluid called sebum that helps moisturize and protect your dog’s skin and coat.  An adenocarcinoma is type of malignant tumor that occurs in the dog’s skin, including sweat glands and the sebaceous glands. Adenocarcinomas in the eccrine glands in dog paws are extremely rare. Instead, the vast majority of these tumors occur in the skin.   Adenocarcinomas in dogs commonly look like raised, irregularly shaped masses, but they may also look like a skin ulcer or sore. They can appear anywhere on the body, but are most commonly found in a dog’s “armpit” where their legs meet their bodies and in the groin area. They are most common in mixed-breed dogs, as well as large breeds including German Shepherds and Norwegian Elkhounds.  Symptoms of Sweat Gland or Sebaceous Adenocarcinoma in Dogs The most common symptom of a sweat gland, sebaceous adenocarcinoma is a bump, or mass, on the skin that develops quickly and may grow rapidly. These masses are usually irregular in shape, are firm, and may be the same color of your dog’s skin or another color. They are usually not painful when touched but may occasionally bleed or ooze. Causes of Sweat Gland or Sebaceous Adenocarcinoma in Dogs There are no known causes of sebaceous in dogs. However, they often occur more frequently in older animals and some breeds are predisposed to developing sweat gland sebaceous adenocarcinoma. How Veterinarians Diagnose Sweat Gland, Sebaceous Adenocarcinoma in Dogs If your vet suspects a skin adenocarcinoma, they will perform an examination. This may include reviewing the dog’s health record and discussing any symptoms you’ve noticed, including difficulty swallowing or eating, bad breath, etc. Fine Needle Biopsy  You veterinarian may perform a fine needle biopsy to collect cells from the tumor to examine under a microscope. During this test, the vet will insert a very fine needle into the tumor to collect a small sample of cells. The cells will be examined under a microscope to determine if they are cancerous.   Surgical Biopsy  Your veterinarian may also perform a surgical procedure to remove all, or a piece, of the tumor. The removed tissue will be sent to a medical provider called a pathologist who specializes in examining tissue to determine if the tumor is an adenocarcinoma.  Treatment for Sweat Gland or Sebaceous Adenocarcinoma in Dogs Surgical procedure Surgical removal of the tumor is the most common treatment of skin adenocarcinomas.    Chemotherapy  Chemotherapy may also be recommended if your veterinarian was unable to remove all of the tumor or the cancer has spread (also called metastasized) to your dog’s lymph nodes.  Radiation Therapy  Radiation therapy may also be prescribed to treat a skin adenocarcinoma. Recovery and Management of Sweat Gland, Sebaceous Adenocarcinoma in Dogs Following surgery, your veterinarian may prescribe medicine to ease pain and reduce inflammation, along with antibiotics to prevent infection. Your dog may also require a follow-up visit with your veterinarian to inspect the surgical site and ensure proper healing.  What Is the Survival Rate for Skin Adenocarcinoma in Dogs?  Your dog should recover completely if a sweat gland, sebaceous adenocarcinoma is completely removed before the cancer spreads to other parts of the body. In rare instances, a sebaceous adenocarcinoma spreads to nearby parts of the body, but it can also spread throughout a larger portion of a dog’s body. "}]