[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hernia (Hiatal) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/hernia-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/hernia-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_multi_hiatal_hernia"}, "datePublished": "July 17, 2008", "dateModified": "August 16, 2022", "description": "A hernia occurs when one part of the body protrudes through a gap or opening into another part. A hiatal hernia, specifically, takes place at the opening of the diaphragm where the food pipe joins the stomach.", "articleBody": "Hiatal Hernia A hernia is most likely to occur in puppies less than a year old and is usually inherited (congenital). However, trauma may also bring on an acquired hiatal hernia, and this can occur at any age. A hernia occurs when one part of the body protrudes through a gap or opening into another part. A hiatal hernia, specifically, takes place at the opening of the diaphragm where the food pipe joins the stomach. Part of the stomach pushes through the opening, and a hernia is formed. Although this can occur in any breed or age, and with both genders, there does appear to be a predisposition for male animals, and with Chinese Shar-Pei and English bulldogs more than other breeds. Symptoms RegurgitationCoughingAnorexiaWeight lossVomitingExcessive salivationShortness of breathCauses Congenital, especially with puppies under a year oldAcquired secondary to trauma or increased effort to inhaleConcurrent — the lower esophageal sphincter slides into the thoracic cavity and allows gastric reflux into the esophagus, causing inflammation of the esophagusDiagnosis X-rays may show soft-tissue density in the region of the esophageal opening (hiatus), but they may not reveal lesions. However, an enlarged esophagus can be detected using X-ray imaging. Contrast exams can show the esophagus as it is joined to the stomach and may reveal the abnormalities that are causing the problems. Your doctor can also perform an exam called an esophagoscopy, by which an internal scope is used to detect inflammation, and possibly show the end (terminal) of the esophagus sliding into the thorax. Diagnosis of hiatal hernia is based on examination and observation of one or more of the following manifestations of the condition: Foreign body in the esophagusAbnormal tissue growth in the esophagusInflammation of the esophagusEnlargement of the lower esophagusProtrusion of the stomach into the esophagusA foreign body in the digestive tractAbnormal tissue growth in the stomachInflammation of the stomach Treatment Surgical treatment may be necessary if your veterinarian finds the need to close the opening (hiatus), or needs to attach the stomach to the abdominal wall so that it does not protrude further. Antibiotics and therapeutic breathing treatments may be necessary if aspiration pneumonia develops as the result of associated breathing abnormalities. Your veterinarian can prescribe drugs that will promote digestion and increase the tone of the sphincter in the lower esophagus. For example, medications such as cimetidine will decrease the acidity of the reflux, and promote healing of the damaged esophagus tissue. But, not all hiatal hernias require treatment. Conservative therapy can be successful for controlling symptoms, and feeding small but frequent portions of a low-fat diet may also control symptoms.  Living and Management If surgery is required for your dog, you will need to follow through with visits to your veterinarian for after care treatment. This is true even if you are managing the hiatal hernia from home. Aspiration pneumonia is one of the possible long term complications related to a hiatal hernia, so you will need to be watchful for signs of this. If you do see symptoms of pneumonia, you will need to take your dog to the veterinarian immediately, as this is a condition that can quickly progress. Some dogs may have a recurrence of all symptoms, in which case you and your veterinarian will need to go back to square one to rule out other causes and settle on a treatment plan that will work."}]