[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Intestinal Tumors (Apudomas) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_adenoma"}, "datePublished": "August 14, 2008", "dateModified": "August 16, 2022", "description": "Apudoma is a gastrointestinal tumor found in dogs and cats which secretes peptide hormones -- hormones that play a role in regulating metabolism, growth, development, and tissue function. In the long run, the tumor(s) can cause ulcers, damage the esophagus because of chronic reflux, and damage the lining of the intestines.", "articleBody": "Apudoma in Dogs Apudoma is a gastrointestinal tumor found in dogs and cats which secretes peptide hormones -- hormones that play a role in regulating metabolism, growth, development, and tissue function. In the long run, the tumor(s) can cause ulcers, damage the esophagus because of chronic reflux, and damage the lining of the intestines. Symptoms     Vomiting (sometimes with blood)    Weight loss    Loss of appetite (anorexia)    Diarrhea    Lethargy    Fever    Depression    Excessive thirst    Tarry-looking stools    Bloody stools (red blood)    Abdominal painCauses The cause of apudoma is currently not known. Diagnosis Your veterinarian will want to rule out the following diseases:     Kidney failure    Inflammatory gastritis    Stress-induced ulceration    Ulceration brought on by medication (e.g., anti-inflammatory drugs or steroids)    Uremia (condition which causes waste products to be retained in the blood)    Other conditions associated with hyperacidity in the digestive tract and ulcerationThe veterinarian will then run blood tests and chemistry analysis to identify if the animal has iron-deficiency anemia as a result of the gastrointestinal bleeding. Other concerns may include inadequate protein in the blood stream and an imbalance in electrolytes, due to the excessive vomiting. In addition, an ultrasound of the abdomen can be used to determine whether there is a tumor in the animal&#039;s pancreas, as well as an aspirate of any masses to test for mast cell disease. An endoscopy and biopsy of the upper digestive tract may also be recommended.     Treatment Unfortunately, most of the apudoma tumors are cancerous (malignant) and by the time they’re discovered, it’s too late to treat them. However, aggressive medical management can sometimes relieve the symptoms and give the animal additional months (or even years) to live. Exploring a pancreatic mass surgically is important for diagnosis, but also to establish a treatment regimen. Living and Management Your pet will need frequent physical examinations, as well as careful observation at home. The veterinarian may also want to conduct X-rays and ultrasound exams from time to time to measure the progression of the disease and the effectiveness of the treatment. As there is no cure for the disease, the best you can hope for is to keep your pet comfortable and pain free for a few months, or even years."}]