[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Liver Disease (Copper Storage) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/liver-disease-copper-storage-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/liver-disease-copper-storage-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Endocrine health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_multi_copper_storage_hepatopathy"}, "datePublished": "November 4, 2008", "dateModified": "August 16, 2022", "description": "Copper storage hepatopathy is a condition caused by an abnormal accumulation of copper in the animal&#039;s liver, which leads to hepatitis and progressive damage and scarring of the liver (cirrhosis) over the long term.", "articleBody": "Copper-Storage Hepatopathy in Dogs Copper storage hepatopathy is a condition caused by an abnormal accumulation of copper in the animal&#039;s liver, which leads to progressive damage and scarring of the liver (cirrhosis). This condition may be secondary to a primary disease or the result of genetic-based abnormal copper metabolism. Bedlington terriers, Doberman pinschers, West Highland White terriers, Skye terriers, and Labrador retrievers are dog breeds known to be susceptible to this disease. Copper storage hepatopathy is more prevalent in females than in males. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this in the petMD health library. Symptoms and Types Primary copper liver diseases (medically referred to as hepatopathies) generally fall into one of three categories: Subclinical disease: a condition where the disease is present in the organ or body, but not detectable by abnormal signs or changes in the dogAcute (sudden) disease which most frequently affects young dogs; associated with a condition that causes the death of liver tissue (hepatic necrosis)Chronic progressive disease in which symptoms are often observed in middle-aged and older dogs with chronic hepatitis, with damage and scarring of the liver (cirrhosis)Conversely, secondary copper hepatopathies show symptoms of progressive signs of liver disease due to chronic hepatitis or progressive cirrhosis. Liver disease in which the flow of bile is slowed or stopped is known as cholestatic liver disease; the abnormal flow of bile results in secondary copper retention. Both types may display symptoms in their acute or chronic forms; they are as follows: Acute: LethargyAnorexiaDepressionVomitingYellowish discoloration of skin and moist tissues (icterus or jaundice)Moist tissues of the body (mucous membranes) are pale due to low red blood cell count; simply referred to as anemiaDark urine due to the presence of bilirubin (bilirubinuria)Hemoglobin in the urine (hemoglobinuria)Chronic signs: LethargyDepressionAnorexiaWeight lossVomitingDiarrheaExcessive thirst and urination (polydipsia and polyuria)Abdominal distention due to fluid build up in the abdomen (ascites)Yellowish discoloration of skin and moist tissues (icterus or jaundice),Spontaneous bleeding, black or tarry stools (melena)Nervous system dysfunction due to the liver being unable to break down ammonia in the body (hepatic encephalopathy)Causes It is important to note that dogs can be affected by copper storage hepatopathy at any age. Genetics is the main contributing factor in this liver disease in Bedlington terriers and possibly other breeds. Here is some information that is known about the contributing genetic factors: An autosomal recessive trait in Bedlington terriers due to the lack of a specific gene (COMMD1) coding for a liver protein involved in the excretion of copper in the bile is confirmed.At one time, possibly as many as two-thirds of Bedlington terriers either were carriers of the gene or were affected by the disease; with recent genetic screening, the incidence is now much lower.A genetic cause is suspected but unconfirmed in breeds other than Bedlington terriers. The mode of inheritance is unknown. The prevalence in certain lines of West Highland white terriers appears to be high, but the incidence in all West Highland White terriers is low.A reported four to six percent of Doberman Pinschers may have chronic hepatitis, which can be a cause of effect of copper storage hepatopathy.Diagnosis A laboratory workup will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. You will need to give a thorough history of your dog&#039;s health, including a history of its symptoms, and possible incidents that might have precipitated this condition. The history you provide may give your veterinarian clues as to whether the condition is of primary or secondary origin. A tissue sample will then be taken from the dog&#039;s liver for laboratory analysis (biopsy), and ultrasound images will be taken of the abdominal area to examine the condition of the liver.  Treatment Inpatient evaluation and treatment are needed for dogs with signs of liver failure. Treatment will be determined by the type of disease and whether it is acute or chronic in nature. Making modifications to the dog&#039;s diet and providing it with foods low in copper have proven to be effective in most cases. Most commercially available diets contain high amounts of copper, so follow your veterinarian&#039;s instructions as to feeding a diet specifically tailored for your dog. You should also avoid giving your dog mineral supplements containing copper. Your veterinarian may also provide you with medications (e.g., penicillamine) and/or nutritional supplements (e.g., zinc) that help eliminate copper from the body. Living and Management Blood tests will be done every four to six months to monitor the dog&#039;s liver enzyme levels and zinc levels, if the patient is on a zinc supplement. The veterinarian may also ask you to monitor your dog&#039;s body weight. Rarely, a liver biopsy will need to be repeated to monitor the effect of treatment. Prevention If you are considering purchasing a Bedlington terrier, you should ask if the dog’s parents have been tested for the gene that causes this type liver disease. There is also a liver registry available that provides information as to a breeding Bedlington’s genetic status. Purchasing Bedlington puppy from a breeder whose dogs are all free from the problematic genes and markers will diminish the probability of receiving an individual who will develop copper storage hepatopathy."}]