[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/csddys56e8", "@type": "VideoObject", "duration": "PT2M26S", "name": "5327091807001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/f44c04d5518cf77cef64568b71e62f3b948470a5.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/csddys56e8", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/c2e4a396f008ada4344c7970adbd5dfe77296621.m3u8", "transcript": "If your dog is breathing abnormally it may be the sign of a serious health condition and should be addressed by a veterinarian immediately. Labored breathing also referred to as dyspnea is when dogs have trouble taking in oxygen rapid breathing. Also called to Kip Mia is when dogs breathe at an abnormally fast rate. Breathing difficulties may stem from a variety of problems ranging from asthma and bacterial infections to trauma and even heart failure diseases that affect the respiratory system or the respiratory center in the brain may bring about breathing issues allergies chest injuries tumours low oxygen levels in the blood and even heart problems such as an enlarged heart or heart worms may also cause dogs to experience breathing issues trouble breathing can affect dogs of any breed and any age and can quickly become life threatening.\n\nSo quick evaluation and diagnosis is key. Symptoms of breathing difficulties and dogs may include open mouth breathing flared nostrils when breathing and an audible noise when trying to take in air. Dogs that are having trouble breathing may also hold their necks and heads low in front of their bodies or turn their elbows away from their chests. Rapid breathing symptoms include short, shallow breaths and a rate of breathing that is faster than normal.\n\nTo diagnose the cause of breathing problems veterinarians will perform a thorough physical exam and listen closely to your dog's lungs and heart. Your vet will also look at your dog's gums since the color may indicate whether or not oxygen is being properly delivered to your dog's organs tests including complete blood count chemistry profile urinalysis and heartworm tests may be run and veterinary might recommend the addition of chest x-rays or an ultrasound. If your dog's breathing problems stem from his nose your veterinarian could perform a right ask if the and run cost copy where a small camera is inserted into your dog's nose and airways while they're sedated.\n\nTreatment will depend on your veterinarians final diagnosis but may include hospitalization oxygen administration or surgery depending on the cause of the problem. Medications may also be administered orally or intravenously to help your dog breathe normally. And many dogs with reading problems are also prescribed cage rest and a reduction in activity during the recovery process. Veterinary follow up visits are recommended to monitor your dog's health.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/respiratory/c_multi_pulmonary_edema_noncardiogenic?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Collection of Fluid in the Lungs (Not Due to Heart Disease) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/collection-fluid-lungs-not-due-heart-disease-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/collection-fluid-lungs-not-due-heart-disease-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Respiratory health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/c_multi_pulmonary_edema_noncardiogenic"}, "datePublished": "November 11, 2008", "dateModified": "August 16, 2022", "description": "Noncardiogenic edema is caused by an increased permeability (or the ability to pass through, as by osmosis) of the blood vessels of the lungs. This increased permeability results in the leakage of fluid into the lung, causing edema, or swelling.", "articleBody": "Noncardiogenic Pulmonary Edema in Dogs  Noncardiogenic edema is caused by an increased permeability (or the ability to pass through, as by osmosis) of the blood vessels of the lungs. This increased permeability results in the leakage of fluid into the lung, causing edema, or swelling. If this becomes severe, the edema may be accompanied by an inflammatory response and an accumulation of inflammatory cells in the lung. There are several factors which can cause changes in the permeability of the lung’s blood vessels. Dogs that have edema as a result of a brain disorder, from a response to an electric cord bite injury, or from an upper airway obstruction might experience a systemic release of catecholamines (neurotransmitters and hormones). This release would lead to a causative effect, with systemic constriction of blood vessels shunting blood into the lungs and overloading the blood vessels of the lung, damaging them, and leading to inflammation and swelling of the lungs. Manifestation of a generalized inflammatory response in the lungs develops in patients with a bacterial infection of the blood, or with pancreatitis, and will often worsen over the 24 hours following the initial episode. The most seriously affected patients may progress from apparently normal health to a fatal condition only hours after the incident. Symptoms and Types Difficulty breathingIncreased breathing rateStanding in unusual positions to breathe betterPale or bluish gumsSpitting up pink, frothy saliva, or bubbles of salivaIncreased rate of heart beatCauses Upper airway obstructionParalysis of the larynxChoke-chain injuryMass in the lungAbscess of the lungAcute neurologic disease (brain disorders)Head traumaProlonged seizuresSystemic inflammatory response syndromeBacterial infection in the bloodInflammation of the pancreasElectric cord bite injurySmoke inhalationAspiration pneumonia (sucking fluid back into the lungs)Diagnosis You will need to give a thorough history of your dog&#039;s health, onset of symptoms, and possible incidents that might have precipitated this condition. The history you provide may give your veterinarian clues as to which organs are causing secondary symptoms. He or she will perform a complete physical exam on your dog, including a chemical blood profile, a complete blood count, a urinalysis and an electrolyte panel. Arterial blood gas measurement, and pulse oximetry will also be performed, along with coagulation testing (whether the blood is clotting normally). Radiograph images of the thoracic (chest) cavity are essential for making a definitive diagnosis, and an echocardiogram may also be performed to rule out, or confirm, pulmonary (lung) edema caused by heart disease.  Treatment Your dog will be hospitalized if it is experiencing severe respiratory dysfunction. Dogs with moderate to severe disease are given oxygen therapy and cage rest in a quiet environment to minimize stress, since anything that can bring on anxiety may cause the production of stress hormones. Some dogs may be put on a mechanical respirator if they are having too much of a problem breathing on their own. Living and Management Often, dogs with noncardiogenic edema will worsen before improving. Severely ill patients have a poor prognosis. However, mild to moderately ill patients stand a good chance of full recovery, and the long-term prognosis is excellent for recovered patients. One of the ways you can prevent noncardiogenic pulmonary edema in your dog is by taking steps to prevent it ffrom chewing on electrical wires. Another way to prevent noncardiogenic pulmonary edema is to get immediate veterinary treatment for your dog at the first sign of seizures or other indications. See Also"}]