[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Enlarged Spleen in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/enlarged-spleen-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/enlarged-spleen-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_multi_splenomegaly"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Splenomegaly refers to the enlargement of the spleen. This medical condition can occur in all breeds and genders, but middle-aged dogs and larger breeds tend to be more prone. Learn more at PetMd.com.", "articleBody": "Splenomegaly in Dogs Splenomegaly refers to the enlargement of the spleen. This medical condition can occur in all breeds and genders, but middle-aged dogs and larger breeds tend to be more prone. It is also not usually directly related to the spleen, but rather a symptom of another disease or condition. Treatment options will be recommended based upon the cause of the splenomegaly. Symptoms and Types   An enlarged spleen may lead to such symptoms as: DiarrheaVomitingLack of appetiteAbdominal painLethargy and reduced activityWeakness and even collapseCauses   A variety of things are known to cause an enlarged spleen including an abdominal injury, canine hepatitis, infectious disorders, inflammatory bowel disease, bacterial infection, cell tumors of the spleen, and other immune disorders. While these are some of the most common causes, the medical causes for an enlarged spleen are not directly related to the spleen itself, but rather a symptom of another disease or condition. Diagnosis Upon examination, a prominent spleen or a protruding abdomen may be noticed. A fine needle aspiration may then be used to diagnose the spleen disorder. Also, ultrasounds and X-rays may be used to view the spleen and surrounding areas for abnormalities. In addition to imaging, blood work will give a comprehensive review of all possible underlying medical issues.  Treatment The recommended treatment options will be dependent upon the underlying causes of the enlarged spleen. As an enlarged spleen is typically a sign of another underlying medical condition, it is important to understand the cause before establishing a proper treatment for the animal. In severe cases, removal of the spleen (splenectomy) may be recommended. Living and Management Many of the common underlying medical causes are treatable with prescription medication. In the event that the spleen is removed, Your dog will require rehabilitation to heal properly; its activity should also be restricted. Prevention There are currently no known preventative measures for an enlarged spleen."}]