[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Liver Fistula in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/liver-fistula-dogs-1175184586.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/liver-fistula-dogs-1175184586.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Liver health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_arteriovenous_malformation_liver"}, "datePublished": "July 16, 2008", "dateModified": "August 16, 2022", "description": "Intrahepatic arteriovenous (AV) fistula is a congenital based condition that is uncommon in most cats and dogs, but it can also develop through surgical injury, trauma, and abnormal tissue or bone growth (neoplasia). When it occurs abnormal passages develop between the proper liver (hepatic) arteries and the inner liver (intrahepatic) portal veins.", "articleBody": "Image via bozsja/Shutterstock.com Intrahepatic arteriovenous (AV) fistula is a congenital based condition that is uncommon in most cats and dogs, but it can also develop through surgical injury, trauma, and abnormal tissue or bone growth (neoplasia). When it occurs abnormal passages develop between the proper liver (hepatic) arteries and the inner liver (intrahepatic) portal veins. This acute illness can be addressed with fair results when a proper diagnosis has been settled on. Most treatment will be on an outpatient basis and will include a planned diet, dietary restrictions, and long term observation. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library.   Symptoms and Types Dogs that suffer from AV fistula may show lethargy, anorexia, vomiting, diarrhea, weight loss, excessive thirst (polydipsia), dementia, and abdominal swelling. There are several other signs of AV fistula, such as:  Ascites, congenital heart malformations, hemorrhages, abnormal portal vein coagulation (thrombosis), protein loss in the kidney (nephropathy), intestinal abnormality (enteropathy) hypertension, liver disease, and cirrhosis of liverOr those affecting the central nervous system: distemper and other infectious disorders, lead poisoning, water on the brain (hydrocephalus), idiopathic epilepsy, metabolic disorders, brain degeneration associated with liver failure (hepatic encephalopathy)Causes There is not a breed that shows a higher predisposition than another. Hepatic AV is a vascular (vessel) malformation that is genetically determined during the embryonic stage of development, also referred to as embryologic anlage. Most conditions present in young dogs, but in some cases, surgical injury, traumas, or tumor growth (neoplasia) can lead to the problem. Diagnosis The disorder can be tested by using complete blood count (CBC), biochemistry, and urinalysis techniques; coagulation tests, abdominal (peritoneal) fluid analysis, evaluation of bile acids (digestive secretion from the liver), X-rays, ultrasounds, liver biopsies, and exploratory laparotomies (incision into the abdominal wall) are other exams that may help diagnose the liver malformation. Treatment While some pets will require surgical care, most can be treated at home with nursing care. Modifications to the diet will often include restrictions on nitrogen intake and sodium. Hydration and electrolyte disturbances will also be addressed and treated. Drugs that rely on liver biotransformation should be avoided, along with any drugs that will react with GABA-benzodiazepine receptors (the transmitters that inhibit anxiety and over excitement). Veterinarians will commonly prescribe histamines for blood pressure reduction, and diuretics (furosemides) to relieve excess fluid. Living and Management It is important to monitor the biochemistry of the dog every few weeks, and then every few months following the initial treatment routines. Prognosis is fair for the dog when it is properly treated, although the dog will require ongoing monitoring and treatment to address any health issues that may arise. Prevention As the health issue is mostly congenital in nature, there are no preventative measures to consider."}]