[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Inability to Protrude or Retract Penis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/inability-protrude-retract-penis-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/inability-protrude-retract-penis-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_multi_paraphimosis_phimosis"}, "datePublished": "August 20, 2008", "dateModified": "August 16, 2022", "description": "Phimosis is a condition that causes a dog to be unable to retract its penis back in to the sheath. Paraphimosis, on the other hand, refers to the dog&#039;s inability to protrude its penis from its outer orifice.", "articleBody": "Paraphimosis and Phimosis in Dogs Phimosis is a condition that causes a dog to be unable to protrude its penis from its outer orifice. Paraphimosis, on the other hand, refers to the dog&#039;s inability to retract its penis back in to the sheath. Both of these medical conditions can occur in male dogs and cats, and at any age. If you would like to learn more about how phimosis and paraphimosis affect cats, please visit this page in the PetMD health library. Symptoms and Types The dog&#039;s inability to protrude its penis may go unnoticed until it tries to copulate with a female. Also, if the dog is having trouble urinating, it may be a sign of this medical disorder. If the animal experiences problems retracting its penis into the sheath, you may notice it licking the exterior of its penis. If it occurs over a prolonged period, there could also be fluid accumulation in the tissues (edema) or swelling in the area. Causes The inability to retract the penis (paraphimosis) often occurs when the dog has a small opening (orifice), and in many cases is a birth defect. If the dog is unable to protrude the penis (phimosis), it may have swelling, or hairs that are obstructing the penis. In some cases, injury or a neurological disease can cause this medical condition. Diagnosis With paraphimosis, the veterinarian will be able to view the exposed penis and/or gland areas upon examination. The goal is to identify the underlying medical cause for the condition for treatment options.  Treatment In some instances surgery can help enlarge the opening of the sheath (orifice), making it possible for the penis to protrude. Also, veterinarians can remove tissue surrounding the penile area to allow for a normal, functioning penis. Immediate treatment is necessary for dogs that are unable to retract its penis into the sheath, as damage to the tissues can occur. Techniques to repair or aid in this medical condition can include removing any foreign objects that are present, lubricating the penile area for retraction, surgical enhancement of the orifice area if it is too small, and catheters if the dog is unable to urinate. At times, ointments and topical medications are prescribed to correct phimosis. Living and Management With treatment, both conditions have a positive prognosis. However, dogs that are unable to retract their penis into the shaft need immediate medical attention, as there are several complications that can occur if the penis is left outside of the body for extended periods of time. Prevention There are currently no known preventative methods for either medical condition."}]