[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "High Cholesterol in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/high-cholesterol-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/high-cholesterol-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Endocrine health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_multi_hyperlipidemia"}, "datePublished": "September 11, 2008", "dateModified": "August 16, 2022", "description": "Hyperlipidemia is characterized by abnormally excessive amounts of fat, and/or fatty substances in the blood. After eating a meal, the nutrients in an animal’s body pass into the small intestine, from which chylomicrons, micro particles of liquid fat, are absorbed 30-60 minutes later.", "articleBody": "Hyperlipidemia in Dogs Hyperlipidemia is characterized by abnormally excessive amounts of fat, and/or fatty substances in the blood. After eating a meal, the nutrients in an animal’s body pass into the small intestine, from which chylomicrons, micro particles of liquid fat, are absorbed 30-60 minutes later. Chylomicrons are in the class of lipids, which includes both triglycerides and cholesterol, and which are formed during the digestion of fats from food.  Normally, the absorption of chylomicrons increases serum triglycerides for 3-10 hours, but some animals will have high cholesterol and high triglyceride levels for more than twelve hours after a meal - one of the main indications of hyperlipidemia. The clear part of the blood, the serum, is referred to as being lipemic when it has levels of triglycerides measuring over 200 mg/dL. Sometimes, levels of triglycerides in an animal’s serum can be even greater than 1000 mg/dL, giving the serum a milky, opaque appearance. This is medically referred to as lactescence (literally, being milky). Certain diseases like diabetes mellitus and hypothyroidism can decrease the enzyme lipoprotein lipase (LPL), which is responsible for dissolving lipids. Diabetes mellitus, obesity, and hyperadrenocorticism can affect the liver in such a way that the liver produces more very-low-density lipoprotein (VLDL), resulting in increased lipid levels in the blood. Other diseases, like nephrotic syndrome, cause the liver to increase production of cholesterol. Conversely, if the liver itself is diseased, it may not be able to excrete cholesterol at all. Hyperlipidemia can also be the result of an inherited disease in certain breeds of dogs. Symptoms and Types Symptoms of hyperlipidemia include seizures, abdominal pain, nervous system dysfunctions, patches on the skin, and cutaneous xanthomata, which are yellowish-orange lipid-filled bumps (i.e., bumps filled with a fatty, greasy liquid). Causes Increased absorption of triglycerides/cholesterol:After eating, especially after a fatty mealIncreased production of triglycerides/cholesterol:Nephrotic syndrome (degenerative kidney diseaseDecreased clearance of triglycerides/cholesterol:Under-functioning thyroid glandOver-functioning adrenal glandDiabetes mellitusInflammation of the pancreasObstruction of the bile ducts (cholestasis)PregnancyDefects in lipid clearance enzymes, or lipid carrier proteinsInherited  Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms, diet, and possible incidents that might have precipitated this condition. You will need to give a thorough history of your dog&#039;s health. Your dog will most probably need to be hospitalized so that it can be put on a strict fast for twelve hours. After twelve hours or more, your veterinarian will order a chemical blood profile, a complete blood count, a serum sample for biochemical analysis, and a urinalysis. If triglycerides are greater than 150 mg/dL, and/or if cholesterol is greater than 300 mg/dL, then your dog will be diagnosed hyperlipidemic. The results of the blood work and urinalysis will allow your veterinarian to rule out the various underlying diseases that cause hyperlipidemia. Your veterinarian may also perform further testing for hyperadrenocorticism and hypothyroidism, depending on the blood work results. It may also be relevant to check your dog&#039;s lipoprotein lipase (LPL) activity.  Treatment Initially, treatment will begin with changing your dog&#039;s existing diet to one which contains less than ten percent fat. If this is not effective, alternative medical treatments may be prescribed at your veterinarian’s discretion. Living and Management Your veterinarian will schedule follow-up appointments so that your dog’s serum triglyceride levels can be monitored. The main concern here is the prevention of possibly fatal bouts of acute pancreatitis as the result of abnormally high levels of fat in the blood."}]