[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Periodontal (Gum) Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-02/dog-smiling.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-02/dog-smiling.jpg"}, "author": {"@type": "Person", "name": "Elizabeth McCalley, DVM", "url": "https://www.petmd.com/author/dr-elizabeth-mccalley"}, "keywords": "Dog, Condition, Oral health, Symptom Checker, Periodontal Disease", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_multi_periodontal_disease"}, "datePublished": "February 8, 2021", "dateModified": "September 12, 2023", "description": "Dr. Elizabeth McCalley explains why your dog’s dental health is so important. Periodontal disease in dogs is something all pet parents should be knowledgeable of.", "articleBody": "Periodontal disease, commonly referred to as gum disease, is the most common disease in dogs. According to recent studies, almost 90% of dogs will have developed some form of periodontal disease by 2 years of age1. This guide will explain the different stages of periodontal disease in dogs and how to recognize, treat, and prevent it. Jump to a section: What is periodontal disease in dogs? Are some dogs predisposed to periodontal disease? What are the signs and stages of periodontal disease in dogs? Is periodontal disease reversible in dogs? What causes periodontal disease in dogs? What is the treatment for gum disease in dogs? How much does periodontal disease treatment cost? What can happen if you don’t treat gum disease in dogs? How can you prevent periodontal disease in dogs? Are anesthesia-free dental cleanings recommended? What Is Periodontal Disease in Dogs? Periodontal disease in dogs is a progressive disease caused by bacteria in the mouth that damages the gums, bone, and other supporting structures of the teeth. Since this disease lurks below the gums, in many cases, visible signs of gum disease in dogs are not present until the disease is very advanced. Due to this, it’s very important to begin preventative dental care for your dog at an early age. Are Some Dogs Predisposed to Periodontal Disease? Poor dental hygiene, genetics, having a maligned bite (malocclusion), and the shape of a dog’s mouth can make dogs more susceptible to periodontal disease. Small and toy dog breeds as well as brachycephalic breeds (dogs with shortened snouts) are among those more prone to the disease. What Are the Signs and Stages of Periodontal Disease in Dogs?  Signs of gum disease in dogs can vary greatly. Some dogs with beautiful pearly whites may have significant disease that’s only found once they are anesthetized and have had full mouth x-rays and an examination of the gums. This is why you should not wait until an issue is apparent to have your dog’s teeth examined and cleaned—it should be a part of your dog’s annual checkup. The signs of gum disease will also be dependent on what stage of periodontal disease your dog’s teeth are at. There are four stages of periodontal disease in dogs, with one being mild disease and four being severe disease. It is important to note that not all teeth may be in the same stage of periodontal disease at any given time. The only way to accurately diagnose this disease is by periodontal probing (checking for abnormal space between the teeth and the gums) and taking x-rays (radiographs) of the teeth, which must be performed under general anesthesia. Stage 1 of Dog Periodontal Disease Stage 1 is gingivitis, or inflammation of the gums, with no loss of bone or tooth attachment. Oftentimes, subtle signs of disease will be present, but you might not notice any obvious symptoms. Symptoms The symptoms of Stage 1 include: Red or puffy gums Gums that bleed during brushing or chewing Bad breath Prognosis The prognosis for a dog with Stage 1 periodontal disease is good as long as they receive the appropriate dental care. Stage 2 of Periodontal Disease in Dogs In Stage 2 periodontal disease, 25% or less of the tooth’s attachment to the supporting structures is lost. During a dental cleaning, mild bone loss may be found on x-rays along with mildly abnormal periodontal pocket depths. Symptoms The symptoms of Stage 2 include: Red or puffy gums Gums that bleed during brushing or chewing Bad breath Receded gums may or may not be present Prognosis The prognosis for a dog with Stage 2 periodontal disease is fair as long as the dog receives the proper dental treatment. Stage 3 of Periodontal Disease in Dogs In Stage 3 of periodontal disease, 25-50% of the tooth’s support is lost. On x-rays, moderate to severe bone loss would be present, and when probing the gums, abnormal periodontal pockets would be present. Symptoms The symptoms of Stage 3 include: Red or puffy gums Gums that bleed during brushing or chewing Bad breath Moderate gum recession Loose teeth Prognosis  The prognosis for a dog with Stage 3 periodontal disease is fair when advanced dental procedures are performed, and you are very diligent about daily home dental care. Otherwise, the teeth should be extracted (pulled) at this stage. Stage 4 of Periodontal Disease in Dogs In Stage 4 of periodontal disease, greater than 50% of the tooth’s attachments are lost, as seen on x-rays and periodontal probing. Symptoms The symptoms of Stage 4 include: Tooth root exposure Loose teeth Missing teeth Pus may ooze from around teeth Prognosis The prognosis for a dog with Stage 4 periodontal disease is poor. Any tooth with stage 4 disease must be extracted. Behavioral Changes You may also notice some behavioral changes as the disease progresses. Your dog may: No longer tolerate having their teeth brushed due to painful gums Start chewing differently or smacking their gums Flinch or pull away when you try to lift their lips to look at their teeth Act more withdrawn or aggressive Be reluctant to play with chew toys Is Periodontal Disease Reversible in Dogs? Gingivitis, Stage 1, is the only stage of periodontal disease that is reversible. This is because gingivitis only consists of inflammation, and at this stage, no destruction of the supporting structures of the teeth has occurred. With proper treatment, dogs with Stage 2 or 3 periodontal disease may not continue to progress into Stage 4. What Causes Periodontal Disease in Dogs? Plaque, that fuzzy white substance that coats our teeth when they aren’t brushed, contains tons of harmful bacteria that cause periodontal disease. Plaque forms in a clean mouth after 24 hours. If your dog’s teeth are not brushed daily, plaque will accumulate. After 72 hours, that plaque will become mineralized and turn into dental calculus—often referred to as tartar. Tartar is easier for plaque to stick to than the natural smooth surface of the tooth, so it allows for more plaque to accumulate.   Plaque on the teeth will cause inflammation of the gums (gingivitis, Stage 1 periodontal disease) and then eventually, it will make its way down to deeper structures around the tooth. The body’s own inflammatory response to the plaque will then lead to destruction of the soft tissues and bone that support the teeth (periodontitis, Stages 2 through 4). What Is the Treatment for Gum Disease in Dogs? The treatment for gum disease in dogs will depend on the stage of periodontal disease your dog has. Here are a few steps your veterinarian will take. Professional Dental Cleaning  The first step to treating gum disease is a complete professional dental cleaning, which includes: Scaling the teeth above and below the gumline to remove plaque and tartar Polishing the teeth Taking full mouth x-rays Probing around each tooth to check for abnormal pocketing This procedure must be done under general anesthesia and will allow the veterinarian to determine which stage of disease each tooth is in. Treatment of Stage 1 Periodontal Disease in Dogs If all teeth are in Stage 1, no further treatment will be necessary, but you need to brush your dog’s teeth daily. Treatment for Stage 2 of Periodontal Disease in Dogs When Stage 2 of periodontal disease is present, your dog will require a professional teeth cleaning. However, during the cleaning, your veterinarian will do a deep cleaning of any abnormal periodontal pockets and apply an antibiotic gel into those areas to help to close those pockets and prevent further destruction of the tooth attachments. Treatment for Stage 3 of Periodontal Disease in Dogs  When teeth are found in Stage 3, your veterinarian will perform advanced restorative procedures. They will also work with you to create a very diligent home dental care plan in order to save those teeth. Otherwise, the recommended treatment would be to extract the teeth. Treatment for Stage 4 of Periodontal Disease in Dogs As stated previously, the only treatment for teeth in Stage 4 is extraction. The teeth are too diseased to save and are a source of significant pain and infection. This is why it is imperative that you address your dog’s gum disease immediately with your veterinarian instead of trying home remedies or dental products at this stage. How Much Does Periodontal Disease in Dogs Cost? The cost of dental cleanings and treatments varies greatly depending on the geographical area and whether or not the veterinarian performing the care is a specialist. The earlier on gum disease is treated, the less expensive the treatment will be. Treating dogs in Stages 3 and 4 will often cost thousands of dollars. What Can Happen if You Don’t Treat Gum Disease in Dogs? When gum disease goes untreated, not only is it painful to your dog, but it can wreak havoc on their entire body. Jaw Fractures Since advanced periodontal disease will lead to destruction of the bone that supports the teeth, it can lead to jaw fractures. The risk of this is highest in toy breed dogs, as the roots of their teeth are very close to the edges of their jawbones. Toy breeds are also more prone to developing periodontal disease, creating a recipe for disaster. Tooth Abscesses Gum disease can also result in tooth root abscesses, which can rupture out of the skin and create nasty open wounds on the cheeks or the chin. Oronasal Fistulas Oronasal fistulas, holes that pass between the mouth and the nasal passages, may develop as a result of untreated periodontal disease. Dachshunds are especially prone to this. Symptoms include chronic sneezing and nasal discharge. Eye Issues In addition, since the teeth in the back of the mouth sit right underneath the eyes, tooth root infections can lead to eye issues. In cases where this isn’t addressed rapidly, it can cause the dog to lose their eyesight. Oral Cancers  While there are not yet any studies of this kind in dogs, numerous human studies show an increased risk of oral cancers in people with chronic periodontal disease1. Increased Risk of Organ Damage  Gum disease in dogs can also have harmful effects on distant organs in the body. This disease will cause bacterial toxins and harmful inflammatory compounds in the mouth to enter the bloodstream and spread to the rest of the body. Periodontal disease is known to increase the risk of chronic kidney disease, liver disease, and heart disease in dogs.1 It can also make it harder to regulate blood sugar in dogs with diabetes.1 How Can You Prevent Periodontal Disease in Dogs? There are quite a few ways that you can help improve your dog’s dental health. Daily Toothbrushing  The best thing you can do at home to prevent periodontal disease in your dog is by brushing their teeth daily. Brushing will only be effective if it is performed consistently, at minimum, three times weekly. However, this may not be feasible for all pet parents and pets. Brushing should be started at around 6 months of age in puppies—as soon as they have their adult teeth. Brushing a puppy’s teeth when they are teething should be avoided, as this can be painful and may make them fearful of having their teeth brushed. Tooth Care Products  Other options to help decrease plaque and gingivitis in dogs include: Dental wipes Oral rinses Dental chews Prescription dental diets Ask your veterinarian which products she recommends, or visit the Veterinary Oral Health Council’s list of approved products. Remember that it is the bacteria in plaque and not tartar that causes periodontal disease. Preventative Veterinary Dental Cleanings Besides receiving some form of daily dental care at home, dogs should start receiving preventative professional dental cleanings under anesthesia at a young age, before any outward signs of gum disease are present. The American Animal Hospital Association (AAHA) recommends that small and toy breed dogs begin receiving regular dental cleanings starting at 1 year of age, and large breed dogs at 2 years of age. If your dog is younger than this, but already has signs of periodontal disease present, a dental cleaning should be performed immediately. The frequency of the cleanings depends on your dog’s breed, the level of periodontal disease, and how diligent you are with home dental care. Are Anesthesia-Free Dental Cleanings Recommended? Anesthesia-free dental cleanings are not recommended, as they do not allow the teeth to be cleaned below the gums and do not allow for a comprehensive assessment of oral health. For more information, read the American Veterinary Dental College statement about their stance on anesthesia-free dental cleanings. References: https://onlinelibrary.wiley.com/doi/epdf/10.1111/jsap.13132 https://www.aaha.org/globalassets/02-guidelines/dental/aaha_dental_guidelines.pdf https://doi.org/10.5326/JAAHA-MS-6763   Featured Image: iStock.com/Vasyl Dolmatov"}]