[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How contagious is Giardia in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Giardia is extremely contagious. Since Giardia is also difficult to eliminate from your home or yard, and dogs develop no immunity after being infected, reinfection with the parasite is endlessly possible."}}, {"@type": "Question", "name": "Can dogs with Giardia go to dog daycare?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with known or suspected Giardiasis (Giardia infection) must not go to daycare. This puts other dogs at risk because the infection is highly contagious. It also puts your dog at risk for reinfection, as Giardia easily passes around doggy daycares and dog parks."}}, {"@type": "Question", "name": "Is Giardia hard to get rid of in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "With the appropriate medication and dosage, most cases of Giardia in dogs are not hard to initially clear. However, infections require environmental decontamination and retesting to ensure the parasite is truly gone. The parasite is hard to eliminate completely without strict adherence to all aspects of treatment. An oral antibiotic like metronidazole is the standard recommended treatment for Giardia in dogs. Fenbendazole is used often for Giardia also. "}}, {"@type": "Question", "name": "How long does it take for Giardia to go away in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Giardia will last until it is treated and removed from the environment, with multiple negative tests confirming the disease’s resolution. The indoor and outdoor spaces that your dog uses must also be decontaminated, or your dog may become reinfected. It typically takes at least a couple weeks of treatment and strict environmental management to clear the disease."}}, {"@type": "Question", "name": "Does Giardia cause loss of appetite in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Giardia can cause vomiting and loss of appetite in dogs, though diarrhea is the most common sign of illness."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Giardia in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/border-collie.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/border-collie.jpg"}, "author": {"@type": "Person", "name": "Laci Schaible, DVM, MSL, CVJ", "url": "https://www.petmd.com/author/dr-laci-schaible"}, "keywords": "Dog, Parasite", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_giardiasis"}, "datePublished": "October 20, 2021", "dateModified": "August 12, 2022", "description": "Dr. Laci Schaible shares tips for getting rid of the contagious parasite Giardia in dogs, including vet-approved treatments and tips for environmental decontamination.", "articleBody": "What Is Giardia in Dogs? Giardia is a single-celled microscopic parasite. It can live in the intestines of dogs (and other animals, including cats and humans) and cause severe gastrointestinal disease. Giardia in dogs is spread by fecal-contaminated water, food, or soil. It is possible for you to catch Giardia from your infected dog, so you must practice safe hygiene habits when caring for an infected pet, such as vigilant handwashing and decontaminating your home and all the areas your dog has access to.  Symptoms of Giardia in Dogs Giardia in dogs is a disease that causes a lot of watery diarrhea. Beyond diarrhea, Giardia symptoms in dogs can include vomiting, excess foul-smelling gas, decreased appetite, decreased energy, and frequent urges to poop.  It is also worth noting that dogs (and other animals, for that matter) can have Giardia present in their intestines and be subclinical, which means they are asymptomatic. Since the test for Giardia is not routinely run in healthy dogs, we’re not sure how often this is the case. The possibility of otherwise healthy dogs carrying Giardia is another reason why hygiene around animal feces is so important beyond the “ick factor” of handling poop. Causes of Giardia in Dogs Found in each corner of the United States and worldwide, Giardia cysts (outer shells that allow the parasite to live outside a host) must be ingested to cause infection. Dogs are infected by eating food or drinking water that carries the cysts, or from ingesting infected feces directly. Ingesting feces does not always mean eating poop from the ground. Ingestion can also happen when your dog sniffs other dogs’ hind ends (the most common greeting between dogs), then licks their nose. Contaminated soil and plants are another source of infection for dogs. Dogs may also hunt and kill contaminated prey and become infected in this manner. How Vets Diagnose Giardia in Dogs Your veterinarian will gather a complete history and conduct a physical exam to evaluate your dog’s overall health and hydration, as well as check for intestinal pain, gas, and possible Giardia exposure. To check for evidence of Giardia infection, called Giardiasis, your veterinarian will likely recommend: A fecal test for routine intestinal parasites (many veterinarians will also send a fecal sample to the lab for further testing)A parvovirus test to eliminate this deadly yet preventable virus as a possible causeA quick, in-house “snap test” or microscope evaluationTreatment for Giardia in Dogs Medications to get rid of Giardia are readily available and affordable. Metronidazole, an antibiotic, is most often prescribed. Fenbendazole is used often for Giardia also.  The disease may take multiple rounds of treatment because it can be hard to completely remove it from your home and prevent reinfection, but many times, the infection is cleared after one round. Additional medications may be prescribed depending on the severity of the infection and your dog’s condition. Dehydrated dogs and puppies may benefit from subcutaneous fluid therapy (fluids injected under the skin), administration of electrolytes, and injectable vitamins. If your dog is moderately to severely dehydrated, they could require hospitalization for intravenous fluid therapy. Recovery and Management of Giardia in Dogs There is no such thing as immunity against future Giardia infections for dogs that have been infected. In fact, dogs that have just cleared a Giardia infection can easily be reinfected. For this reason, you must disinfect all living areas your dog has access to. Ammonia, diluted bleach solution, or steam cleaning can be effective against the cysts. Promptly pick up all of your dog’s poop and dispose of it (whether your dog poops on walks or in your yard). These challenges with thorough environmental disinfection and maintenance make this parasite a tough one to eliminate. Under the right conditions, contaminated soil or inside areas can remain infectious for months, so you need to rigorously clean and avoid those areas when at all possible. If you have other pets in the household, please tell your vet so that you can discuss if medications should be administered to the other animals as a preventive measure.Since Giardia is so contagious, make sure you follow up with rechecks at the vet. Multiple negative tests are required before you can relax and rest easy. If your family includes a baby who crawls around or eats things off the floor, or an immunocompromised person, the vet will likely require more negative Giardia tests to ensure eradication of the parasite. Here are some additional tips for environmental management and prevention of Giardia: Schedule a stool check and Giardia testing before bringing a new pet home and introducing them to your other animals. Use a monthly heartworm preventative that also targets gastrointestinal parasites to keep your dog in tip-top shape. Keep outdoor sandboxes covered when not in use. Maintain a regular checkup regimen with your vet, and always opt in for fecal parasite testing. If possible, prevent your dog from hunting and eating rodents and other small animals."}]