[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a luxating patella painful for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Mild or incidentally detected cases of patellar luxation in dogs are probably not painful, and therefore do not require surgical correction. However, moderate to severe cases, as well as chronic cases, can be painful. Having your veterinarian grade the luxation is the first step in determining whether your dog’s luxating patella is uncomfortable and whether treatment is warranted."}}, {"@type": "Question", "name": "Can a dog live with luxating patella?", "acceptedAnswer": {"@type": "Answer", "text": "Certainly. A luxating patella in dogs does not affect life expectancy, and mild cases do not affect your dog’s quality of life at all. In moderate to severe cases, dogs may limp chronically due to pain and discomfort. If left untreated, arthritis and other orthopedic abnormalities can develop that will significantly affect the quality of life, even if life expectancy is not affected. The pros and cons of medical management versus surgery should be discussed with your veterinarian to develop a plan that maximizes your dog’s comfort and overall health."}}, {"@type": "Question", "name": "How much does it cost to fix a luxating patella in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "As with most aspects of veterinary medicine, costs can vary dramatically depending on your location; rural areas tend to be cheaper, whereas urban areas are typically more expensive. If the condition requires medical management, in which anti-inflammatories and crate rest are recommended, the cost is generally reasonable and affordable. Surgical correction is more involved and of course more expensive.  Your vet will be able to give you an estimate based on your dog’s condition."}}, {"@type": "Question", "name": "How do you know if your dog has a luxating patella?", "acceptedAnswer": {"@type": "Answer", "text": "The classic picture of a luxating patella in dogs is a small dog that will suddenly lift one of its hind limbs off the ground while walking or running. Your dog may go a short distance on three legs before placing the fourth leg back on the ground, seemingly unaware of and unbothered by the issue. In more serious or more chronic luxating patella cases, your dog may display a chronic limp or a crouched back. Their knee may crack or pop when flexed. However, these signs are not entirely specific to patellar luxation and can be seen in other orthopedic conditions. Your veterinarian will be able to confirm the diagnosis."}}, {"@type": "Question", "name": "Will a brace help a dog with luxating patella?", "acceptedAnswer": {"@type": "Answer", "text": "No, braces are typically not useful for dogs with luxating patella. Although many brace products are marketed as nonsurgical solutions to a luxating patella, veterinarians do not commonly recommend braces to help this condition, for several reasons. First, orthopedic braces for dogs are costly, often several hundred dollars. Some vets would say that money would be better spent toward surgical correction. Second, these products typically recommend that your dog be “fitted” by your veterinarian. However, most general practitioners simply are not trained to do this. Third, your dog could become so bothered by the brace that they will shred or otherwise destroy it, setting them up for foreign body obstructions, a much more serious condition than a luxating patella."}}, {"@type": "Question", "name": "How much does luxating patella surgery cost for a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Although some general practitioners will perform surgical corrections for orthopedic conditions like a luxating patella in dogs, these conditions are more commonly treated by veterinary orthopedic surgeons. Costs for these specialists can be significantly higher than costs at your regular veterinarian due to the cutting-edge treatment and diagnostic equipment they use. Talk to your local veterinarian for more specific information about the treatment costs and options in your area."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Luxating Patella in Dogs (Knee Dislocation)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-658045822.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-658045822.jpg"}, "author": {"@type": "Person", "name": "Matthew Everett Miller, DVM", "url": "https://www.petmd.com/author/dr-matthew-everett-miller"}, "keywords": "Dog, Condition, Symptom Checker, Luxating Patella", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_multi_patellar_luxation"}, "datePublished": "October 21, 2021", "dateModified": "September 12, 2023", "description": "Dr. Matt Miller explains the condition of luxating patella in dogs: what breeds are predisposed, what it looks like, and what to do about it.", "articleBody": "What Is a Luxating Patella in Dogs? A luxating patella in dogs is a common condition in which the kneecap (patella) shifts sideways, or luxates, away from the normal position at the front of the knee. You may also refer to it as a dislocated kneecap. About 75% of the time, a luxating patella in dogs tends to occur inward, or toward the other hind limb. This version of a luxating patella is called medial patellar luxation (MPL) and is more common in smaller dogs. Sometimes the shift occurs outward, or away from the other leg. This condition is known as a lateral patellar luxation (LPL) and is more commonly seen in larger dogs, although MPL is still more common overall. Symptoms of a Luxating Patella in Dogs The main symptom of a luxating patella in dogs that is not commonly seen with other conditions is the sudden lifting of one hind limb. Some dogs will yelp when this occurs, but others will show no signs of discomfort. In this brief, sudden limp, a dog will hold their hindlimb off the ground for a short period of time before walking normally again. The affected leg may be held close to the body or extended backwards. This is often termed a “skip” by owners and vets alike. The following symptoms of patellar luxation, however, can also be seen in other orthopedic conditions: Limp that comes and goes Bowlegged stance in the hind limbs Hunched lower back Cracking or popping noises when the knee is bent Your veterinarian will combine these symptoms with the findings of their physical exam to make a definitive diagnosis. Causes of a Luxating Patella in Dogs    A luxating patella in dogs is generally hereditary and has to do with the unusual knee anatomy of dogs that are affected. In some cases, trauma causes the luxation. Although body weight does not directly cause a luxating patella in dogs, it can contribute to the severity of the disease and can increase complication rates if surgery is pursued. Dog Breeds That Are More Likely to Have a Luxating Patella Many small-breed and large-breed dogs are predisposed to having a luxating patella, including: Small-Breed Dogs Affenpinscher American Water Spaniel Boston Terrier Brussels Griffon Chihuahua English Toy Spaniel Eurasier Japanese Chin Lancashire Heeler Löwchen Maltese Manchester Terrier Mi-Ki Miniature Pinscher Miniature Wirehaired Dachshund Papillon Pekingese Pug Shih Tzu Smooth Haired Fox Terrier Tibetan Spaniel Toy Poodle Xoloitzcuintli Yorkshire Terrier Large-Breed Dogs Akita Chinese Shar-Pei Flat-Coated Retriever Great Dane Great Pyrenees Irish Wolfhound Newfoundland St. Bernard How Vets Diagnose a Luxating Patella in Dogs Usually, a physical exam is the only thing needed to diagnose a luxating patella in dogs. In fact, a luxating patella is often diagnosed incidentally during a routine wellness exam, or during an exam for a different problem. A luxating patella in dogs can also show up on imaging like x-rays, CT scans, or MRIs, but these diagnostics are not usually used to make the diagnosis. Treatment for a Luxating Patella in Dogs As with many orthopedic conditions in dogs, treatment options for a luxating patella can be divided into medical and surgical. Medical Treatment   Medical treatment of a luxating patella in dogs often involves anti-inflammatory medications, weight loss, and temporary exercise restriction. Exercise restriction varies based on the severity of your dog’s condition. For patellar luxation, it might be as simple as not letting your dog run up the stairs or jump on furniture, and only going on leash walks long enough for your dog to go to the bathroom. If your dog needs to be confined to their crate, the duration can vary based on the severity of your dog’s condition. Crate rest usually lasts at least 6 weeks, and sometimes more than 12. Surgical Treatment Surgery for a luxating patella in dogs is significantly more involved. Pet parents may pursue surgery in severe cases, or in cases where medical treatment has failed. As with any surgery, it comes with risks and the potential for complications. The most common postoperative problem in MPL surgery is that the luxating patella will come back. Rates of recurrence are as high as 36% for the most severe cases, but often are less than 10% for milder forms. Implant failure, under-/overcorrection, avulsions (separations or detachments), fractures, infections, seromas (fluid-filled pockets), and progressive arthritis are other potential complications. Large-breed dogs and obese dogs are at higher risk for these issues. Interestingly, older dogs have fewer complications.  Recovery and Management of Dog Knee Dislocation Medical management of a luxating patella in dogs can take several weeks to show improvement. This option may also need to be repeated periodically throughout your dog’s life, depending on how often flare-ups occur. Exercise is a common reason for flare-ups, but sometimes flare-ups occur for no apparent reason. Surgical correction has a much longer recovery period—at least 8 weeks, often longer. Regular rechecks with the veterinary surgeon are a crucial part of your dog’s recovery after surgery."}]