[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Excessive Bacteria in the Small Intestine in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/excessive-bacteria-small-intestine-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/excessive-bacteria-small-intestine-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_multi_small_intestinal_bacterial_growth"}, "datePublished": "July 2, 2008", "dateModified": "August 16, 2022", "description": "Small intestinal bacterial overgrowth is a disorder which causes an abnormal amount of bacteria to accumulate in the small intestine. While it is common for this organ to have bacteria, it can become a problem when the count is too high.", "articleBody": "Small Intestinal Bacterial Overgrowth Small intestinal bacterial overgrowth is a disorder which causes an abnormal amount of bacteria to accumulate in the small intestine. While it is common for this organ to have bacteria, it can become a problem when the count is too high. This can then affect the normal intestinal functions, causing loose stools and weight loss. Often clearing up within a few days, and up to a few weeks, treatment options give this bacterial infection an excellent prognosis. Symptoms and Types Common symptoms include loose stools, rapid weight loss, diarrhea, occasional vomiting and intestinal tract sounds (gurgling caused by gas). Causes While a genetic predisposition has been determined as a non-factor for the disorder, some breeds have a higher prevalence in developing it. Among them, German Shepherds and Chinese Shar Peis seem to have the highest incidence rate among dog breeds. Inadequate levels of thyroid, low pancreatic production of enzymes, low levels of hydrochloric acid in the stomach and intestinal disease are also common causes for this bacterial overgrowth. Diagnosis Veterinarians will often perform blood work and bacterial cultures to determine the causes of the intestinal condition. In some cases a more invasive procedure, such as an endoscopy, will be required to view the intestine internally. Treatment  Treatment is commonly given on an outpatient basis and improvement can occur quickly, typically within a few days and up to a few weeks. It is often recommended that the patient be placed on a highly-digestible diet to create less of an impact on the intestines during the healing. Antibiotics are also commonly prescribed to treat the bacterial growth. Living and Management It is important to monitor your dog&#039;s weight and protein levels (albumin) over time to ensure that progress is being made toward a full recovery. Diarrhea must also be observed because if prolonged, it can lead to severe dehydration. In addition, repeat treatments may be required. The prognosis of this disease is positive when it is not associated with other serious medical conditions, such as intestinal cancer. Prevention There are currently no known preventative methods for small intestinal bacterial overgrowth."}]