[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/q91daso2ct", "@type": "VideoObject", "duration": "PT2M10S", "name": "5327099820001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/6b912f5932759ece0d48493d6ff4ecb40b81c6c9.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/q91daso2ct", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/6510696bf528eec4a652af1803778b48cc2867a3.m3u8", "transcript": "Leptospirosis is a bacterial infection that dogs acquire when spiral or corkscrew shaped bacteria known as Spider Keats infiltrate the body through the mucous membranes or the g.I. tract that bacteria spread throughout the entire body reproducing in the liver, kidneys central nervous system eyes and the reproductive system. Soon after initial infection fever and bacterial infection of the blood develops the extent to which this bacteria affects the organs will depend on your dog's immune system and his ability to eradicate the infection fully. Even so leptin can remain in the kidneys reproducing there and infecting the urine infection of the liver or kidneys can be fatal for animals if the infection progresses.\n\nYounger animals with less developed immune systems are at the highest risk for severe complications. The leptospirosis virus key bacteria is zoonotic meaning that it can be transmitted to humans and other animals leptospirosis mainly occurs in subtropical tropical and wet environments. Leftovers more prevalent in marshy and muddy areas which have stagnant surface water and are frequented by wildlife. Dogs will typically come into contact with the bacteria.\n\nAnd infected water, soil or mud or from the urine of another infected animal. Sudden fever and illness sore muscles reluctance to move stiffness in muscles and legs vomiting and diarrhea with and without blood dark red speckled gums yellow skin and or whites of the eye are all symptoms associated with a klepto infection during a veterinary visit. You will need to give a thorough history of your dog's health, including a background history of symptoms recent activities and possible incidents that might have precipitated this condition. Your vet period will perform a chemical blood profile a complete blood count and likely other tests to determine the presence of the leftover bacteria.\n\nDogs with acute severe disease should be hospitalized IV fluid therapy will be the primary treatment along with antibiotics and other medications to treat the symptoms. Prognosis is generally positive barring severe organ damage. A vaccination for the prevention of leptospirosis infection is available in most areas. Your vet nearing can advise you about the availability and the need for this vaccine.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_leptospirosis?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Leptospirosis in Dogs: What It Is and What You Should Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-drinking-out-of-puddle.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-drinking-out-of-puddle.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Parasite", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_leptospirosis"}, "datePublished": "July 27, 2020", "dateModified": "August 12, 2022", "description": "What is leptospirosis in dogs? Your dog may have had the lepto vaccine for dogs, but what does it protect them from? Here’s everything you need to know.", "articleBody": "Reviewed and updated on July 27, 2020 by Laura Allison, DVM Leptospirosis in dogs is a bacterial infection that spreads through the bloodstream. Dogs can get leptospirosis from puddles or bodies of water that carry urine from infected wildlife. The bacteria infiltrate a dog’s body by burrowing into their skin. Canine leptospirosis can be a serious, life-threatening disease. Here’s everything you need to know, including how it’s spread, who can get it, what it does to your dog’s body, how to treat it, and how to prevent it with the lepto vaccine for dogs. How Do Dogs Get Leptospirosis? The infection rate for leptospirosis in dogs has been increasing in the United States and Canada, with infections occurring most commonly in the fall season. Leptospirosis mainly occurs in subtropical, tropical, and wet environments.  It’s more prevalent in places like: Marshy/muddy areas that have stagnant surface water and are frequented by wildlife Heavily irrigated pastures Dogs typically contract leptospirosis through direct contact with urine from an infected animal. Open sores on the skin can increase the chances of contracting this disease. If your dog swims in, passes through, or drinks infected water, or if they come into contact with infected soil or mud, they are at risk. Dogs that are most at risk for getting canine leptospirosis include: Hunting and sporting dogs Dogs that live near wooded areas Dogs that live on or near farms Dogs that have spent time in a kennel Can Leptospirosis Spread to People and Other Pets? The Leptospira spirochete bacteria is zoonotic, meaning that it can be transmitted to humans and other animals from an infected animal. Children are most at risk of acquiring the bacteria from an infected pet. People and pets can be infected and not yet show symptoms. Your veterinarian will be especially cautious when handling your pet and will strongly advise you to do the same. Protective latex gloves must be worn at all times, and all body fluids will be treated as a biologically hazardous material. Symptoms of Leptospirosis in Dogs These are the symptoms you might see in dogs infected with leptospirosis: Sudden fever and illness Sore muscles; reluctance to move Stiffness in muscles and legs; stiff gait Shivering Weakness Depression Lack of appetite Increased thirst and urination—may be indicative of chronic renal (kidney) failure, progressing to an inability to urinate Rapid dehydration Vomiting, possibly with blood Diarrhea, with or without blood Bloody vaginal discharge Dark red-speckled gums (petechiae) Yellow skin and/or whites of eyes (anemic symptoms) Spontaneous cough Difficulty breathing, fast breathing, irregular pulse Runny nose Swelling of the mucous membrane Mild swelling of the lymph nodes How Does Leptospirosis Attack a Dog’s Body? Leptospirosis spreads throughout a dog’s entire body, reproducing in the liver, kidneys, central nervous system, eyes, and reproductive system. Soon after initial infection, your dog will develop a fever and a bacterial infection of the blood, but these symptoms soon resolve as antibodies are produced. The extent in which this bacteria affects the organs will depend on your dog’s immune system and its ability to eradicate the infection fully. Even then, Leptospira spirochetes can remain in the kidneys, reproducing there and infecting the urine. Infection of the liver or kidneys can be fatal for animals if the infection progresses, causing severe damage to these organs. Younger animals with less developed immune systems are at the highest risk for severe complications. How Do Veterinarians Test Dogs for Leptospirosis? Give your vet a thorough history of your dog&#039;s health, including a background history of symptoms, recent activities, and possible incidents that might have precipitated this condition. The history you provide may give your veterinarian clues as to what stage of infection your dog is experiencing, and which organs are most affected. Your veterinarian will order a: Chemical blood profile Complete blood count Urinalysis Electrolyte panel Fluorescent antibody urine test Urine and blood cultures will also be ordered for examining the prevalence of the bacteria. A titer test will also be performed to measure the body&#039;s immune response to the infection by measuring the presence of antibodies in the bloodstream. This will help to definitively identify Leptospira spirochetes and the level of systemic infection. Immediate Treatment for Leptospirosis in Dogs Dogs with acute severe disease should be hospitalized. Fluid therapy will be the primary treatment for leptospirosis in dogs to reverse any effects of dehydration. If your dog has been vomiting, an anti-vomiting drug, called an antiemetic, may be administered, and a gastric tube can be used to nourish your dog if the inability to eat or keep food down continues. A blood transfusion may also be necessary if your dog has been severely hemorrhaging. Antibiotics will be prescribed by your veterinarian, with the type of antibiotic dependent on the stage of infection. Penicillins can be used for initial infections, but they are not effective for eliminating the bacteria once it has reached the carrier stage. Tetracyclines, fluoroquinolones, or similar antibiotics will be prescribed for this stage, since they are better distributed into the bone tissue. Antibiotics will be prescribed for a course of at least four weeks. Some antibiotics can have side effects that appear serious, especially those drugs that go deeper into the system to eliminate infection. Be sure to read all of the warnings that come with the prescription, and talk to your veterinarian about the indications you will need to watch for. The prognosis is generally positive, barring severe organ damage. Home Care for Dogs Recovering From Leptospirosis As your dog recovers from a leptospirosis infection, here are a few things that you will need to be prepared to do. Ensure Strict Rest Your dog should be restricted to crate rest while he recovers from the physical trauma of this infection. Ask your vet how to schedule mealtimes and potty breaks and how to monitor recovery. Take Precautions to Protect Yourself and Family While your dog is being treated, keep him away from other pets and children. Wear latex gloves when handling your dog in any way, or when handling fluid or waste products from your dog. Areas where your dog has urinated, vomited, or possibly left any other type of fluid should be cleaned and disinfected thoroughly with iodine-based disinfectants or bleach solutions. Gloves and a mask should be worn during the cleaning process and disposed of properly. Talk to Your Doctor About Testing the Family for Leptospirosis Finally, if you do have other pets or children in the home, they may have been infected with the Leptospira bacteria but are not yet showing symptoms. It may be worthwhile to have your family tested for the presence of the bacteria. Keep in mind that Leptospira bacteria may continue to be shed through the urine for several weeks after treatment and apparent recovery from the infection. Preventing Leptospirosis in Dogs Here are a few different ways you can help protect your dog from leptospirosis. Leptospirosis Vaccine for Dogs Consult with your veterinarian to see if the leptospirosis vaccine for dogs is appropriate for your pet. The lepto vaccine for dogs covers only certain strains of leptospirosis, so is not 100% guaranteed effective in all cases. Leptospirosis is underdiagnosed, so it’s imperative to speak with your veterinarian about current recommendations about the lepto vaccine for dogs in your area. Research Kennels Before Boarding Your Dog Inspect kennels before placing your dog in one—the kennel should be kept very clean and should be free of rodents (look for rodent droppings). Urine from an infected animal should not come into contact with any other animals or people. Featured Image: iStock.com/Rike_"}]