[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Calcium Deposits in the Urinary Tract in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Urinary", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/urinary/c_multi_urolithiasis_calcium_oxalate"}, "datePublished": "September 9, 2008", "dateModified": "August 16, 2022", "description": "Urolithiasis is described as the presence of stones (calcium deposits) in the urinary tract. The development of these stones is more common in dogs than in cats, and in older animals. In most cases the stones can be removed safely, giving the animal a positive prognosis.", "articleBody": "Urolithiasis, Calcium Oxalate in Dogs Urolithiasis is described as the presence of stones (calcium deposits) in the urinary tract. The development of these stones is more common in dogs than in cats, and in older animals. In most cases the stones can be removed safely, giving the animal a positive prognosis. Causes The primary cause for the formation of stones is high levels of calcium in the urine. Some risk factors can include calcium supplements, excessive dietary protein or Vitamin D, high levels of steroids, Vitamin B6 deficient diets, and the consumption of dry food only diets. While these stones can occur in any breed, several dog breeds comprise over 60% of all cases. These breeds include Miniature Schnauzers, Lhapso Apsos, Yorkshire Terriers, Bichon Frises, Shih Tzu&#039;s and Miniature Poodles. Symptoms and Types Animals generally do not show signs of this issue, although trouble urinating is the most common symptom. If there is inflammation, an enlarged belly or the area surrounding the urinary region may be noticeable irritated. If the stones are large, they can sometimes be felt through the skin by a veterinarian. Diagnosis X-rays and ultrasounds are performed to determine any additional underlying medical conditions causing the animal pain or trouble urinating. Also, blood work will be done to examine levels of nutrients to see if any are outside of the normal range.  Treatment One of the most common treatment options is the surgical removal of the stones. In some cases, shock waves can be used to help break up the stones. Also, depending on the size and severity of the stones, sometimes they can be flushed and massaged out of the animal&#039;s system with a catheter and fluids. Living and Management It is important to reduce the animal&#039;s activity levels following surgery. Possible complications from the formation of these stones are the blockage of the urinary tract and the animal&#039;s inability to urinate. It is common for animals to re-form these calcium-based stones over time. Treatment on an ongoing basis will include the monitoring of calcium intake and the urinary patterns of the animal to observe if any problems develop. If surgery was used to remove the stones, post-surgical X-rays are recommended to ensure that the stones were completely removed. Ongoing X-rays can also be helpful in frequent intervals and if the formation of these calcium stones is detected, non-surgical techniques can be used to remove or dissolve them. Prevention The best prevention of recurrence is to monitor the animal&#039;s calcium levels on an ongoing basis so that adjustments can be made in the diet to maintain normal calcium levels."}]