[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How do you know if your dog has a botfly?", "acceptedAnswer": {"@type": "Answer", "text": "Your dog’s symptoms will vary depending upon where the botfly is in their body. Monitor them for the symptoms listed above—especially if they have access to rodent or rabbit burrows."}}, {"@type": "Question", "name": "Can a botfly kill a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with skin and upper-respiratory Cuterebra infestations have a good prognosis after complete removal of the larvae. Cases of nervous-system cuterebriasis have a 30% mortality rate for dogs—usually as a result of euthanasia due to symptom severity."}}, {"@type": "Question", "name": "How long can a botfly live in a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Botfly larvae live in their host for 3-6 weeks."}}, {"@type": "Question", "name": "Can humans get botfly from dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Once a botfly is inside a dog’s body, it cannot be transmitted to another animal or to a human."}}, {"@type": "Question", "name": "How do dogs get botflies?", "acceptedAnswer": {"@type": "Answer", "text": "During the summer months, adults of the Cuterebra group of botflies lay their eggs at the entrance of rodent or rabbit dens, which are their primary hosts. Dogs can become accidentally infested with Cuterebra after sniffing rabbit or rodent dens or coming in direct contact with eggs. The host’s body temperature stimulates the botfly eggs to hatch, and the larvae attach to the host’s skin. The larvae cannot directly penetrate the skin, but they can enter through a dog’s mouth, nose, open wounds, or any other openings in the skin. They will migrate through the skin and further develop in the tissue layers beneath the skin. A nodule with an external breathing hole can be seen on your dog’s skin after 3-4 weeks of development."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Botflies in Dogs (Cuterebra in Dogs)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/dogs-in-the-forest.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/dogs-in-the-forest.jpg"}, "author": {"@type": "Person", "name": "Krista Seraydar, DVM", "url": "https://www.petmd.com/author/dr-krista-seraydar"}, "keywords": "Dog, Parasite", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_cuterebrosis"}, "datePublished": "October 22, 2021", "dateModified": "August 12, 2022", "description": "Dr. Krista Seraydar explains botflies in dogs, including the various kinds of Cuterebra infestations and how to diagnose and treat them.", "articleBody": "What Are Botflies in Dogs? Cuterebra is a type of botfly whose larvae embed themselves as parasites in a dog’s skin, eyes, upper respiratory tract, or central nervous system (brain/spinal cord). People also call them “warbles” or “wolf worms” when they are in the larval stage. Botflies can be found in the United States, Canada, and Mexico. In the northern U.S., the disease is seasonal, with most cases occurring in late summer and early fall when the adult flies are active. The typical hosts for botflies are rabbits and rodents, but dogs can get warbles if they come across the larvae in the grass, especially if they are hunting these animals or are near their burrows. Symptoms of Warbles in Dogs Symptoms of warbles, or botflies in dogs, vary depending upon where the Cuterebra infestation occurs on your dog. Symptoms of Cuterebra in a Dog’s Skin (Cutaneous Cuterebriasis) Swelling around the area of skin where the larva is (usually around the face or neck) Lethargy Lack of appetite Vomiting In very rare cases, a severe systemic inflammatory condition called disseminated intravascular coagulopathy (DIC) develops as a result of warbles in dogs. This causes excessive bleeding or clots that cut off blood supply to vital organs. Symptoms of Upper Respiratory Tract Infestation Sneezing Facial/nasal swelling Nasal discharge Coughing Increased breathing rate Difficulty breathing Symptoms of Ophthalmic (Eye) Infestation Conjunctivitis (pink eye) Eye discharge Eyelid swelling Inflammation of the inner eye Symptoms of Central Nervous System (Brain and Spinal Cord) Infestation Circling Wobbliness (ataxia) Head pressing Head tilt Seizures Fever Low body temperature Paralysis Abnormal behavior Blindness Causes of Botflies in Dogs Cuterebra is caused by an infestation of larvae from the Cuterebra group of botflies. There are 34 species of Cuterebra in North America. Botflies lay eggs on blades of grass or in nests, where they hatch. Dogs become infected with a botfly larva when they come into contact with a blade of grass that has a maggot on it. The dog&#039;s movement against the blade of grass stimulates the maggot to crawl onto the dog or passing host. The small maggots crawl around until they find an orifice where they can enter (mouth, ear, nose, etc.). Then, they migrate through various internal tissues and, ultimately, make their way into the skin. They establish themselves within a warble (a small lump in the skin). The mature maggots, which may be an inch long, then drop out of the host and form a pupa in the soil. Eventually, an adult botfly will emerge from the pupa and start the whole cycle again. Dog Breeds That Are Prone to Cuterebra Any breed of dog can become infested by Cuterebra. However, one study showed that 80% of affected dogs weighed less than 10 pounds, and 40% of affected dogs were Yorkshire Terriers (likely due to size and popularity of the breed). How Vets Diagnose Botflies in Dogs Your veterinarian will look for evidence of the fly larvae in cases of skin or respiratory tract infestation. If your dog has respiratory disease characterized by a sudden onset of symptoms or symptoms only affecting one side, such as nasal discharge and facial swelling, your vet will evaluate them for botfly larvae within the throat, mouth, or nasal passages. This is usually performed under general anesthesia. In cases affecting the nervous system, CT scans, spinal taps, or MRIs are used to identify evidence of botfly larvae infestation in dogs. Treatment for Botflies in Dogs Treatment for skin, respiratory tract, and eye infestations of botflies in dogs includes manual removal of the larvae followed by cleaning of the wound. Your dog may also need antibiotics to treat secondary infection. Ivermectin, an ingredient used in dog heartworm medications, is used to treat cases affecting a dog’s brain and spinal cord. This can stop symptoms from progressing but may not cure existing symptoms. Your veterinarian might use diphenhydramine (Benadryl) in conjunction with ivermectin to prevent an allergic reaction. Recovery and Management of Cuterebra in Dogs After botfly removal, monitor the area for discharge, swelling, or delayed healing. Cases of eye/brain infestation can take weeks to months to completely resolve. Some dogs with cases of Cuterebra eye infestation do well after removal of the larva and getting anti-inflammatories, but others may develop blindness or glaucoma. Cuterebra skin infestations can result in systemic inflammatory response syndrome (SIRS) or DIC, but this is not common."}]