[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mesothelioma in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_multi_mesothelioma"}, "datePublished": "September 19, 2008", "dateModified": "August 16, 2022", "description": "Mesotheliomas are rare tumors derived from the cellular tissue that lines the cavities and interior structures of the body. These linings are called the epithelial linings, specifically the mesothelium.", "articleBody": "Mesotheliomas are rare tumors derived from the cellular tissue that lines the cavities and interior structures of the body. These linings are called the epithelial linings, specifically the mesothelium. The mesothelial lining, specifically, is a membranous epithelial lining that is derived from the mesoderm cell layer, with its main functions being to line the body cavity, to cover and protect the internal organs, and to facilitate movement within the body cavity (coelom). Mesotheliomas are the result of abnormal division and replication of mesothelial cells, and their migration to other sites in the body. This cellular behavior can occur in the thoracic cavity, the abdominal cavity, the pericardial sac around the heart, and for male dogs, in the scrotum. The resultant tumors will often displace internal organs, causing gastrointestinal or cardiac symptoms. Mesotheliomas also produce a lot of fluid, making microscopic (cytologic) examination of fluid samples an extremely relevant diagnostic tool. The German shepherd is the breed most commonly affected by mesotheliomas. Symptoms and Types     Trouble breathing    Muffled heart, lung, and abdominal (ventral) sounds    Abdominal enlargement/swelling with fluid build-up    Large scrotum    Exercise intolerance    Fatigue    VomitingCauses Exposure to asbestos is one of the known causes for mesothelioma formation. Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background health history, onset of symptoms, and possible incidents that might have precipitated this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. X-rays of the chest and abdominal cavities will be the most important diagnostic aid for confirming mesothelioma. Radiograph and ultrasound imaging can also be used to show effusion (escape of fluid from the vessels) or masses in the body&#039;s cavities, and in the pericardial sac (the lining surrounding the heart). Your doctor will also take a fluid sample for cytologic (microscopic) examination of the fluid.  Exploratory surgery, or a laparoscopy (surgery of the abdomen), can be performed for removal of mesothelial masses for cellular examination in the laboratory.  Treatment Most pets can be treated on an outpatient basis. If your dog is having trouble breathing, it should be given a quiet place to rest, safe from activity and anything alse that would be an exertion. If your dog has an excess of fluid in any of its body cavities as a result of the mesothelioma, such as in the chest or abdomen, your veterinarian will need to hospitalize it for a short period of time in order to drain these cavities. If fluid has collected in the pericardial sac, surgery to relieve the pressure will be required. Living and Management Limit your dog’s activity until it is breathing easier and this is no longer of concern. Slow walks close to home, and gentle playtime will be best until your dog has recovered. You will need to provide a safe and quiet space for your dog, away from active children and from other animals while it recovers. If your veterinarian has prescribed cisplatin chemotherapy to treat the mesothelioma, you will need to continue to monitor your dog&#039;s  progress with frequent follow-up visits in order to test your dog&#039;s kidney health, since some animals will have a toxic reaction to the chemotherapy medicine. Your veterinarian will also want to monitor your pet&#039;s chest and pleural cavity, using X-ray imaging, to be sure the mesothelioma has not metastasized."}]