[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Front Leg Injury in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/front-leg-injury-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/front-leg-injury-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_multi_brachial_plexus_avulsion"}, "datePublished": "July 16, 2008", "dateModified": "August 16, 2022", "description": "Dogs can experience a forelimb issue (sometimes referred to as brachial plexus avulsion) when they are hurt from jumping, have been in a road accident, had a traumatic fall, or have been caught in or on something. Learn more about Dog Front Leg Injury at Petmd.com.", "articleBody": "Brachial Plexus Avulsion in Dogs Dogs can experience a forelimb issue (sometimes referred to as brachial plexus avulsion) when they are hurt from jumping, have been in a road accident, had a traumatic fall, or have been caught in or on something. The possibility of spinal cord injury, or other severe damage, requires that an examination and assessment be made by a veterinarian. Prompt medical attention is advised. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types Dogs that are experiencing this condition will often exhibit muscular weakness, absence of pain perception, loss of shoulder movement, and the inability to put weight on their paws. Causes The most common cause of a foreleg injury is often a road accident, a serious fall, or if the dog gets a foot caught in or on something while jumping. Diagnosis Magnetic resonance imaging (MRI) or a computer tomography (CT) scan may be used to examine the dog&#039;s body for internal lesions. The veterinarian will look for injuries to the spinal cord, or for any associated neurological issues.  Treatment Treatment will be based on the severity of the injury. Bandaging the foreleg and protecting it from further injury is the most common response. Anti-inflammatory drugs are commonly given to decrease swelling. Amputation is sometimes required for injuries that cannot be repaired or under circumstances where the injury is life threatening. Living and Management Clinical monitoring of the dog following treatment is recommended so that improvements to the injured site can be assessed. One of the most common suggestions is for the dog to be confined so that it will not further complicate the injury. Protective swaddling, or binding, is also recommended for keeping the limb in place. Physical therapy may be prescribed for regaining muscle strength during rehabilitation. It is important to observe the dog&#039;s behavior following treatment as there is a potential for infection if the dog rubs its paws repeatedly on the ground. Also, it is important to deter the dog from mutilating itself in an attempt to stop the pain and associated healing sensations. Most cases will resolve within a few months of the initial prognosis and treatment. Prevention There are currently no preventative measures for this medical issue."}]