[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Have Down Syndrome?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-06/happy-dog-on-sofa-can-dogs-have-down-syndrome-article.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-06/happy-dog-on-sofa-can-dogs-have-down-syndrome-article.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/can-dogs-have-down-syndrome"}, "datePublished": "June 7, 2016", "dateModified": "August 12, 2022", "description": "Can dogs have Down syndrome like humans? Are there Down syndrome dogs? While research is inconclusive about Down syndrome in dogs, there may be other conditions in dogs that look like dog Down syndrome. Learn more.", "articleBody": "Down syndrome is a common chromosomal condition in people. It is associated with cognitive delays and certain physical characteristics, along with a higher risk of certain health issues. If you notice that your dog has some traits that are indicative of Down syndrome, you might wonder if it’s possible for dogs to have Down syndrome, too. What is Down Syndrome? To answer that question, we first have to understand what Down syndrome is. The National Down Syndrome Society provides a good explanation: “In every cell in the human body there is a nucleus, where genetic material is stored in genes.  Genes carry the codes responsible for all of our inherited traits and are grouped along rod-like structures called chromosomes.  Typically, the nucleus of each cell contains 23 pairs of chromosomes, half of which are inherited from each parent. Down syndrome occurs when an individual has a full or partial extra copy of chromosome 21.” Traits Associated With Down Syndrome The presence of this extra genetic material has a wide range of effects. People with Down syndrome can have some degree of intellectual impairment, but this varies between individuals and is usually mild to moderate. According to the US Centers for Disease Control and Prevention (CDC), there are also some common physical features of Down syndrome, such as poor muscle tone and a line across the palm of the hand (palmar crease). The Global Down Syndrome Society points out that while some of these features may be common, they are not universal, and “although children and adults with Down syndrome may share some common features, they look more like their immediate family members than like each other.” Can Dogs Have Down Syndrome? Genetically, dogs and people have many similarities, but important differences obviously do exist. For example, people have 23 sets of chromosomes while dogs have 39. Down syndrome happens when there is a full or partial copy of chromosome 21. But a duplication of all or part of chromosome 21 would have different effects in the two species. Simply put, the answer is no. The condition of Down syndrome has not been described in dogs. Three explanations are possible: These types of chromosomal abnormalities typically lead to early death in dogs.The genetic testing needed to identify dogs with Down syndrome simply hasn’t been done.The condition truly doesn’t exist in dogs.Conditions that Look Like Down Syndrome in Dogs On the other hand, congenital or developmental conditions that have some clinical similarities with Down syndrome are routinely diagnosed in dogs. Congenital hypothyroidism is a good example. This condition is caused by low or absent levels of thyroid hormone at birth and early in life, which results in some combination of the following: Slow growth eventually resulting in small statureLarge, protruding tongueShort limbsPoor muscle toneCognitive delayDelayed opening of the eyes and earsOther conditions in dogs that could be confused with Down syndrome include: Pituitary dwarfismCongenital hydrocephalusGrowth hormone deficiencyPortosystemic shuntIf you have noticed any of the above characteristics in your dog, talk to your veterinarian. They can recommend an appropriate diagnostic plan to see if your dog has any health issues and make treatment recommendations once a diagnosis is in place.Featured Image: iStock.com/AJ Watt "}]