[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Transitional Cell Carcinoma of the Urinary Tract in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/transitional-cell-carcinoma-urinary-tract-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/transitional-cell-carcinoma-urinary-tract-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_urinary_carcinoma"}, "datePublished": "March 20, 2010", "dateModified": "August 16, 2022", "description": "Transitional cell carcinoma (TCC) is a malignant (aggressive)  and metastasizing (spreading) cancer arising from the transitional epithelium – the highly stretchable lining of the urinary tract system – of the kidney, ureters (the tubes that carry fluid from the kidneys to the bladder), urinary bladder, urethra (the tube that carries urine from the bladder to the outside), prostate, or vagina.", "articleBody": "Transitional Cell Carcinoma of the Renal, Bladder and Urethra in Dogs Transitional cell carcinoma (TCC) is a malignant (aggressive)  and metastasizing (spreading) cancer arising from the transitional epithelium – the highly stretchable lining of the urinary tract system – of the kidney, ureters (the tubes that carry fluid from the kidneys to the bladder), urinary bladder, urethra (the tube that carries urine from the bladder to the outside), prostate, or vagina. Flea-control products (organophosphates and carbamate) and cyclophosphamide are possible causal agents in dogs. In addition, TCC occurs most commonly in female dogs. Symptoms and Types Straining to urinateFrequent urination of small amounts (pollakiuria)Blood in urine (hematuria)Difficulty urinating (dysuria)Wetting on the floor, furniture, bed, etc. (urinary incontinence)  Causes Flea-control products (organophosphates and carbamate) and cyclophosphamide  Diagnosis Your veterinarian will perform a complete physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have led to this condition. You will need to provide a thorough history of your dog&#039;s health leading up to the onset of symptoms. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, a urinalysis and an electrolyte panel. Urine should also be sent for culture and sensitivity testing since a concurrent urinary tract infection is common. X-rays of the chest and abdomen should be taken to look for possible spread of the cancer. Intravenous pyelography, a procedure that is used to take an X-ray image of the urinary system, will be used to examine the urinary tract, bladder and kidneys. For this procedure, a contrasting dye will be injected into the bloodstream, to be picked up by the kidneys and passed through through the ureters, bladder and urethra. The contrasting dye is visible on the X-ray imaging so that the internal structures can be seen and determined to be functioning normally or abnormally. Other contrast dye procedures that can be used to image the urinary tract may be used, either instead of, or in addition to, a pyelography. They include a  voiding urethrogram (x-rays of dyes as the patient urinates), or vaginogram (X-rays of dyes within the vagina). These latter X-ray techniques are indicated if urethral or vaginal disease is suspected. Double-contrast cystography is the best way to visualize the mass(es) which are normally located at the trigone of the urinary bladder (a smooth triangular area inside the bladder). For a definitive diagnosis, a biopsy of the mass is the gold standard. Biopsies may be obtained through traumatic catheterization (jamming a catheter into the masses), exploratory laparotomy (abdominal surgery), or cystoscopy (using a small camera with instruments attached). However, ultrasound-guided biopsy is not recommended, because this can easily cause further spreading of the cancer.  Treatment TCC spreads very easily. There have been multiple reports of surgery causing the cancer spread. Tube placement into the bladder (through the urethra) may greatly prolong survival times by preventing urethral blockage. Radiotherapy (ionizing radiation, like the type X-rays give off) given during surgery is reported to result in longer survival times and better local control than chemotherapy. The potential side effects of radiotherapy during surgery are urinary bladder stricture and fibrosis with urinary incontinence. Antibiotics based on the culture and sensitivity results should be prescribed to resolve any concurrent urinary tract infections. Living and Management TCC tumors cannot usually be surgically removed in dogs. While a cure is not attainable, the severity and speed of spread of TCC disease can be slowed down and delayed. Your veterinarian will schedule your dog for a contrast cystography or ultrasonography every six to eight weeks to see if treatment is effective and to screen for lymph node spread of TCC. Similarly, chest X-rays should be retaken every two to three months to detect any new cancer spread."}]