[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/z6vbp2m8d7", "@type": "VideoObject", "duration": "PT1M51S", "name": "5327091882001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/a12815cc942f1e5c2062d6b16a2267a8c6ad9b09.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/z6vbp2m8d7", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/dfeb6eb7d4f8e9965e77c2eb3e840253264a56cf.m3u8", "transcript": "Lymph nodes or lymph glands are small masses of tissue that can be found throughout a dog's body. They play a vital role in the functioning of the immune system acting as filters for blood and storage places for white blood cells. Consequently lymph node inflammation known as lymph lymphatic nighties is often the first indication of disease in the body. The swelling is caused by a reactive increase in white blood cells due to the localized presence of an infectious agent.\n\nThis convergence of cells results in the swollen feel and appearance of the nodes cancerous cells may also be found in a lymph node. Cancer cells may be primary originating in the lymph node itself or may be there as a result of the spread of cancer from another location in the body. Swelling of the lymph nodes can be caused by a reaction to an infectious agent or swelling can result when the lymph nodes themselves are infected. Swollen lymph nodes can usually be detected by touch but sometimes there will be no clinical symptoms.\n\nSwelling may be felt in the area beneath the jaw around the shoulder groin and back legs or under the front legs and what corresponds to the armpit area in humans. Your dog may lose his appetite due to nausea have an urge to regurgitate when eating experienced lethargy difficulty chewing or swallowing difficulty breathing or even problems defecating your vet near and will perform a thorough physical exam and perform a complete blood profile on your dog lymph node aspects may also be taken for microscopic examination but you'll need to give your vet a complete history of your dog's health, including a background history of any symptoms noted the history you provide may give your vet Noreen clues as to which organs are causing secondary enlargement of the regional lymph nodes, your veterinarian will prescribe treatment dependent on the underlying cause of the lymph node inflammation.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/cancer/c_multi_lymphadenopathy?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What causes swollen lymph nodes in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Tick-borne diseases. Make sure that if your dog is exposed to ticks that you have them on an effective tick control product. Speak with your vet about what product is right for your dog based on their medical history. Foreign bodies such as plant awns in feet. Do not let your dog wander off-leash, especially in an area with longer grass. Fungal and bacterial diseases. Avoid letting your dog wander while unleashed. This will help minimize contact with fungal and bacterial diseases. Cancer (lymphosarcoma). Be aware of what is “normal” for your dog’s lymph node size. Report any abnormal swellings to your vet as soon as you notice them. Be extra wary if your dog is a high-risk breed such as a Golden Retriever, Boxer, Doberman, or Rottweiler. Immune-mediated diseases such as pemphigus."}}, {"@type": "Question", "name": "What do swollen lymph nodes in dogs feel like?", "acceptedAnswer": {"@type": "Answer", "text": "Swollen lymph nodes feel like grapes just under the skin surface. They can double in size overnight with diseases like lymphosarcoma."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Swollen Lymph Nodes in Dogs (Lymphadenopathy)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/german-shepherd-puppy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/german-shepherd-puppy.jpg"}, "author": {"@type": "Person", "name": "Sandi Huffman, DVM", "url": "https://www.petmd.com/author/dr-sandi-huffman"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_multi_lymphadenopathy"}, "datePublished": "November 23, 2021", "dateModified": "August 12, 2022", "description": "Dr. Huffman explains what swollen lymph nodes in your dog can mean, including how to recognize swollen lymph nodes, possible symptoms, causes, and when to visit the vet.", "articleBody": "What Are Swollen Lymph Nodes in Dogs? The lymphatic system is part of your dog’s immune system. It includes lymph nodes and a network of lymph vessels called lymphatics that run alongside your dog’s regular blood vessels. The lymph system performs several important functions in your dog’s body, including transporting white blood cells, removing waste products from tissues and cells, and helping to produce disease-fighting antibodies.   Lymph nodes are small, bean-shaped organs that contain immune cells. When your dog’s body is invaded by viruses or bacteria, or your dog has a disease that triggers an immune response, the lymph nodes become enlarged as they work to fight off the invader. Swollen lymph nodes are called lymphadenopathy or lymphadenomegaly. Your vet can tell the difference between swollen lymph nodes and regular lymph nodes by feeling the lymph nodes that are closer to the skin. Lymph nodes that can be felt through the skin are known as “palpable” nodes. These are located in a few areas: Submandibular: Just under the jaw where it meets the neck Pre-scapular: Under the submandibular lymph nodes at the front of the shoulders Axillary: In the “armpit” of the dog, or where the front legs meet the chest Inguinal: On the underside of the dog where the rear legs meet the abdomen (groin) Popliteal: Just behind the stifles (“knees”) of the rear legs During a physical exam when your veterinarian looks like she is petting your dog, she is actually feeling for abnormalities in the lymph nodes, as well as unusual lumps or bumps. Generally, the only palpable lymph nodes are the submandibular and popliteal in a healthy dog.  Symptoms of Swollen Lymph Nodes in Dogs Swollen lymph nodes can sometimes be detected by pet parents at home. If you’re petting your dog and feel a new or unusual bump in one of the areas listed above, it may be a swollen lymph node. In most cases, there are no outward symptoms that accompany your dog’s swollen lymph nodes, particularly if they are only mildly enlarged. However, if the lymph nodes are significantly enlarged—including the nodes inside the thorax and abdomen— then you should watch for symptoms including: Vomiting Coughing Lethargy Fever Poor appetite Enlarged abdomen Causes of Swollen Lymph Nodes in Dogs Lymph nodes enlarge when the immune system is activated, usually by a disease process. If just one or two lymph nodes are enlarged, this often indicates a localized disease. For example, an infected toe could result in enlarged lymph nodes that drain that area. A systemic infection in which the whole body is affected will often cause many or all of the lymph nodes to be enlarged. Examples include: Demodectic mange Puppy “strangles” (i.e., juvenile cellulitis) Tick-borne diseases (e.g., Lyme disease, ehrlichiosis) Bacterial infection (e.g., Yersinia pestis, which causes canine plague) Reactive hyperplasia (e.g., active immune response) Fungal infection (e.g., Coccidioidomycosis) Immune-mediated diseases (e.g., pemphigus) Cancer (e.g., lymphosarcoma) Dog Breeds Prone to Swollen Lymph Nodes There aren’t specific breeds that are susceptible to swollen lymph nodes. However, some breeds are susceptible to diseases that will cause swollen lymph nodes. Other breeds are prone to developing lymphosarcoma (cancer of the lymphatic system), including Golden retrievers, Boxers, Dobermans, Rottweilers, and others.   Toy breeds (such as Yorkies, Poodles, and Dachshunds) are very susceptible to dental disease, and often have enlarged submandibular lymph nodes when they have infected teeth and gums. In most cases, your dog’s lifestyle is a better predictor of their susceptibility to certain diseases that cause enlarged lymph nodes. For example, a hunting dog or a dog that spends a lot of time in the woods is far more likely than an indoor dog to contract tick-borne diseases like Lyme disease and ehrlichiosis, as well as fungal, bacterial, or parasitic diseases that can lead to enlarged lymph nodes. How Vets Diagnose Swollen Lymph Nodes Enlarged lymph nodes are usually fairly obvious on physical exam. If your vet finds swollen lymph nodes, they may collect a sample through one of these methods:    FNA: Fine needle aspirate (FNA) is a procedure in which a syringe and needle are used to collect cells that can be examined under a microscope. Your vet will examine these cells on a slide, or they might send the sample out to an external lab for analysis.    Biopsy: Your vet may decide instead to perform a biopsy under general anesthesia. In this procedure, a larger piece of the lymph tissue is removed for analysis by a histopathologist. Usually the histopathologist’s diagnosis is available in 7-10 days. Treatment for Swollen Lymph Nodes Treatment of swollen lymph nodes depends on the underlying cause. Sometimes your vet may start treatment for your dog before receiving a confirmed diagnosis from histopath. This is usually done if your vet is certain of the diagnosis. Treatment might include: Antibiotics Antifungals Anti-inflammatories Steroids Surgery If cancer is confirmed, chemotherapy may be started. Recovery and Management of Swollen Lymph Nodes Recovery depends on the cause of the swollen lymph nodes. If the diagnosis is lymphosarcoma, or cancer of the lymph system, steroids and chemotherapy may be warranted. This disease will generally recur after remission.  Many tick-borne illnesses are controlled after one round of antibiotics, but it is possible that symptoms will return. It’s very important to monitor your dog for signs of recurring illness or swollen lymph nodes. Contact your vet immediately if you notice new swelling in your dog’s lymph nodes."}]