[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skin Cancer (Mucocutaneous Plasmacytoma) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/skin-cancer-mucocutaneous-plasmacytoma-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/skin-cancer-mucocutaneous-plasmacytoma-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Cancer, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/c_dg_polycythemia_vera"}, "datePublished": "March 18, 2010", "dateModified": "August 16, 2022", "description": "A mucocutaneous plasmacytoma is a rapidly developing skin tumor of plasma cells origin. A form of white blood cell, plasma cells produce antibodies, which help the immune system identify and neutralize foreign organisms. Often, mucocutaneous plasmacytomas are found on the dog&#039;s trunk and legs. They are also most common in mixed-breed dogs and cocker spaniels.", "articleBody": "Mucocutaneous Plasmacytoma A mucocutaneous plasmacytoma is a rapidly developing skin tumor of plasma cells origin. A form of white blood cell, plasma cells produce antibodies, which help the immune system identify and neutralize foreign organisms. Often, mucocutaneous plasmacytomas are found on the dog&#039;s trunk and legs. They are also most common in mixed-breed dogs and cocker spaniels. Symptoms and Types In addition to being found on the trunk and legs, mucocutaneous plasmacytomas may develop on the mouth, feet, and ears (lip tumors are particularly small and often overlooked). These tumors are generally solitary, solid nodules, either raised or ulcerated. Causes The underlying cause for the development of these tumors has yet to be identified. Diagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to your veterinarian. He or she will then perform a complete physical examination, as well a biochemistry profile, urinalysis, and complete blood count (CBC) -- the results of which should be normal, unless some concurrent disease is also present. The most popular diagnostic procedure is to aspirate a nodule and send it to a veterinary pathologist for further testing. If abnormal tumor cells are identified, your dog may be suffering from mucocutaneous plasmacytoma(s).  Treatment If the tumor has become invasive, surgery is typically recommended to excise the tumor and surrounding tissue. Radiotherapy is also conducted in some dogs in order to destroy the neoplastic tissue. Living and Management Fortunately, most dogs respond well to surgery and radiotherapy, and overall prognosis is excellent with treatment."}]