[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How common is canine herpesvirus?", "acceptedAnswer": {"@type": "Answer", "text": "Canine herpesvirus is a common and deadly virus that has been found worldwide and once infected, will never go away. Chances are, your dog has already been affected, as most are, just from normal daily interactions. But note that older dogs who become infected will rarely show any clinical signs since it is only dangerous to puppies."}}, {"@type": "Question", "name": "Is canine herpesvirus contagious to humans?", "acceptedAnswer": {"@type": "Answer", "text": "No. Only dogs, wolves and coyotes are susceptible to this type of herpesvirus. As is common for this type of virus, however, dogs can become latent carriers and periodically shed or spread the virus throughout their lives and it may even cause signs in the dog during times of stress."}}, {"@type": "Question", "name": "Is there a vaccine for canine herpesvirus?", "acceptedAnswer": {"@type": "Answer", "text": "Unfortunately, there’s no commercially available vaccine in the United States. Good hygiene, isolation of pregnant dogs prior to birth and then isolation of the mom and litter for the first several weeks of life, and a warm and clean puppy environment are precautions you can take to minimize the chances of your puppy getting sick. Fortunately, most household disinfectants are effective in killing the virus."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Canine Herpesvirus", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/little.puppies.stock_.photo_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/little.puppies.stock_.photo_.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Parasite", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/canine-herpesvirus-causes-diagnosis-and-treatment"}, "datePublished": "March 2, 2022", "dateModified": "August 12, 2022", "description": "Dr. Michael Kearley explains canine herpesvirus, including symptoms, diagnosis, and possible treatment.", "articleBody": "What is Canine Herpesvirus? Canine herpesvirus (CHV) is a condition specific to canines including dogs, wolves, and coyotes. CHV is primarily a reproductive disease, which means many of our canine companions (and their pet parents) do not have to worry too much about it.   However, CHV is a significant problem for breeders because it can have a high mortality rate for puppies 3 weeks old and younger and is a major cause of spontaneous abortion and stillbirths. After 3 weeks, a puppy’s body temperature begins to rise and her ability to fight the virus improves. Puppies over 6 months old rarely succumb to the virus.  Exposure usually occurs through the nose, mouth or genitals. For puppies (and canine fetuses), the virus can replicate and can spread throughout the lymphatic system and blood stream causing widespread harm.   Herpesviruses also travels to the nerve cells where they can “camouflage” themselves, lying dormant and causing infection in times of stress. Dogs can then shed the virus intermittently throughout their lives.   Symptoms of Canine Herpesvirus Given the seriousness of the virus, for many pet parents or breeders, the only sign they may notice is unfortunately, a deceased puppy. For others, signs can include:  Failure to thrive, such as failing to nurse or gain weight  Excessive crying  Listlessness  Body temperature lower than normal  Other signs include diarrhea, runny nose, pneumonia, and petechiae (pin-point hemorrhages) on the belly, inner ears, conjunctiva, or gums.   Adult dogs suffering from the virus may not exhibit any clinical signs or may exhibit mild signs associated with a common cold (i.e., cough, runny nose, or lethargy). Some may also exhibit infertility, lesions on their genitalia, and dogs that are pregnant may exhibit a sudden loss of their litter or stillbirth(s). Causes of Canine Herpesvirus CHV is often spread from one dog to another via direct contact, either through saliva, nasal, or vaginal discharge/secretions or by sexual contact. Rarely, the virus can be transmitted by fomites (objects carrying the virus, such as clothes, water, and food bowls). Usually, the virus spreads between puppies and dogs that co-mingle, such as those in a litter. The virus also can also be passed from mother to offspring. How Veterinarians Diagnose Canine Herpesvirus A veterinarian may suspect canine herpesvirus with a puppy that is 3 weeks or younger and shows clinical symptoms (or has passed away).   A PCR test may be done on tissue samples or fluids, but unfortunately most diagnoses are done after the puppy has died by looking for lesions associated with canine herpesvirus.  Treatment of Canine Herpesvirus Unfortunately, once diagnosed or even suspected, the outcome for most infected puppies is poor. In many cases, a puppy will have already passed, or the veterinarian will recommend euthanasia. It is important to examine the puppy even after she has passed so precautions can be taken to limit the virus’ transmission and protect siblings or other dogs in the household.  It’s important to remember that the virus is sensitive to heat so maintaining a warmer ambient temperature for the surviving pups may help prevent transmission. Some antivirals and antibody serum injections have been reported as a form of treatment and other forms of treatment often utilized are usually supportive care measures such as rehydration, getting the puppy to eat, or medications administered to alleviate pain, nausea, and diarrhea.   Recovery and Management of Canine Herpesvirus Unfortunately, most affected puppies do not survive, but those that do often lead a life with long-term debilitating effects such as blindness, kidney disease, or neurologic dysfunction.   Many adult dogs and puppies older than 3 weeks of age go on to lead a relatively normal life. Some may be affected with fertility issues and females that are infected prior to becoming pregnant, or have already suffered an abortion from the virus, can go on to have healthy litters in the future (assuming the pups do not acquire the infection elsewhere).   "}]