[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tetralogy of Fallot in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_tetralogy_of_fallot"}, "datePublished": "December 19, 2012", "dateModified": "August 16, 2022", "description": "Tetralogy of Fallot is a congenital defect of the heart that involves four abnormalities. Learn what each involves and how to best treat the defect in dogs.", "articleBody": "Tetralogy of Fallot is a congenital defect of the heart that involves four abnormalities: ventricular septal defect (a hole between the two ventricles), pulmonic stenosis (obstruction of blood flow through the pulmonary valve), an overriding aorta, and right ventricular hypertrophy (thickening of the heart muscle). Symptoms and Types     Weakness    Fainting    Shortness of breath    CyanosisCauses Tetralogy of Fallot is a congenital disease that likely is influenced by genetic factors. Keeshonds and English bulldogs are predisposed. Diagnosis Your veterinarian will start with a physical examination on your dog, which may reveal a heart murmur. Routine blood testing may be recommended. Your veterinarian will likely want to take radiographs (X-rays) of the heart and an ultrasonic study of the heart (known as an echocardiogram) will probably be necessary as well. Other testing that may be pursued include an electrocardiogram (ECG), pulse oximetry (measurement of hemoglobin saturation), and/or angiocardiography.  Treatment Exercise restriction is important when dealing with dogs with Tetralogy of Fallot in order to reduce the strain on the heart. Periodic phlebotomy may be necessary to maintain an appropriate packed cell volume. Palliative surgical procedures have been advocated to improve blood flow. Medications such as propanolol may be beneficial in controlling symptoms associated with this defect."}]