[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can a dog live with von Willebrand disease?", "acceptedAnswer": {"@type": "Answer", "text": "Yes! Dogs can certainly live with the condition, and you as the pet parent can help by taking certain precautions such as preventing rough play and minimizing undue stress. "}}, {"@type": "Question", "name": "What is the life expectancy for a dog with von Willebrand disease?", "acceptedAnswer": {"@type": "Answer", "text": "It is always challenging to predict the life expectancy of a dog living with von Willebrand disease. Though some dogs can maintain a relatively normal life without any significant complications, others can suffer prematurely from complications or from the disease itself."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Von Willebrand Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/husky.at_.vet_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/husky.at_.vet_.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Adult, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/c_dg_von_willebrand_disease"}, "datePublished": "March 7, 2023", "dateModified": "March 7, 2023", "description": "Dr. Michael Kearley explains von Willebrand disease in dogs, including symptoms, diagnosis, and treatment.", "articleBody": "What Is von Willebrand’s Disease (vWD)? Von Willebrand’s disease or vWD is a common bleeding disorder that dogs can inherit from one or both parents. When there is a deficiency in von Willebrand Factor (vWF) proteins, a dog’s ability to form a blood clot is missing. That means that if your dog is injured and bleeding, and there is a lack of, or abnormal vWF proteins, a blood clot to stop the bleeding will not be able to form. There are three types of von Willebrand disease: Type 1: There are fewer amounts of vWF proteins. Type 2: Some proteins are present, or there is an abnormal structure of the proteins. Type 3: There are little to no proteins available; this is the most severe form. Proper testing and treatment should be considered equally, regardless of type. Both males and females are at risk—and because it can be passed to puppies, it is recommended not to breed any dogs either affected or found to be carriers of the condition.  Which Dog Breeds Are Affected With von Willebrand Disease? Doberman Pinschers are the breed most commonly associated with vWD, but it’s estimated that vWD has occurred in over 40 dog breeds, such as: Golden Retriever Schnauzer German Shorthaired Pointer German Shepherd Scottish Terrier Standard Poodle Shetland Sheepdog Bernese Mountain Dog Symptoms of von Willebrand Disease The main symptom of vWD in dogs is any type of excessive, prolonged, or spontaneous bleeding, but other symptoms can include: Blood in the urine Blood in the feces (bright red or black tarry coloration) Nose bleeds Bleeding from the mouth or gums Excessive bleeding during loss of baby teeth Prolonged bleeding after giving birth Prolonged bleeding during heat cycle Bruising, which can vary from small, pinpoint hemorrhages (petechiae) to large, coalescing bruises (ecchymoses) Prolonged bleeding after any signs of trauma or surgery Anemia (decrease in red blood cell count) and death, if severe It is important to note that the symptoms do not always occur at a young age. Some dogs aren’t diagnosed until much later in life, often brought on by trauma. How Veterinarians Diagnose von Willebrand Disease in Dogs Diagnosis of vWD is often through a blood test. Additionally, your veterinarian may recommend a basic blood cell count, chemistry, and coagulation profile. Most often, these tests are normal and helpful at determining your dog’s overall health status, although some dogs can have prolonged clotting times.  All dogs used for breeding and breeds predisposed to the condition should be screened for the condition, which can be done through commercially available DNA tests like Wisdom Panel™.  Simply swab your dog’s cheek for at least 15 seconds and then mail the swab back to the lab. Results are returned in a few weeks. vWD Types 1, 2, and 3 are all included in the test. Many veterinary practices now offer this test as a standard part of their puppy wellness visits.  Treatment for von Willebrand Disease in Dogs Treatment often requires a blood transfusion. Your veterinarian will be the best source for all treatment options and recommendations on how to best care for your dog. Recovery and Management of von Willebrand Disease in Dogs Unfortunately, vWD cannot be cured, but it can be managed, and certain precautions can be taken to help improve the outcome and prognosis of any dog affected by the condition.  The condition can be prevented if ethical breeding standards are upheld. Dogs suffering from the condition or that are carriers should not be used for breeding due to the potential for passing it on to their puppies.  Notifying the veterinary staff of your dog’s condition is vital so that any medications or future treatments can be performed as safely as possible, or avoided altogether. Limiting rough play, monitoring him for signs of bleeding and/or bruising, and taking steps to decrease stress and anxiety in your dog’s life is key."}]