[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cold and Flu Medication Toxicity in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.bathroom.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.bathroom.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/poisoning/cold-and-flu-medications-toxicity-dogs"}, "datePublished": "September 12, 2022", "dateModified": "September 13, 2022", "description": "Dr. Barri Morrison explains the most common types of cold and flu medications that are toxic to dogs, symptoms, and what to do if you believe your dog has ingested this medication.", "articleBody": "What is Cold and Flu Medication Toxicity in Dogs? People often use over-the-counter cold and flu medications when they’re not feeling well, to help with congestion, fever, coughing, sneezing, pain, and various other symptoms. While some of these medications can be given to dogs for certain conditions, do so only after consulting with your veterinarian. Some cold and flu medications have more than one active ingredient, which can make them dangerous for your dog. If you suspect your dog has swallowed any cold or flu medication, please contact your veterinarian, an emergency hospital, and/or pet poison helpline as soon as possible. How Are Cold and Flu Medications Toxic to Dogs? Human cold and flu medications, both over-the-counter and prescription, contain ingredients that can be deadly to pets. These medications can affect many parts of a dog’s body. While the cardiovascular system (heart and blood vessels) and central nervous system (brain, spinal cord, and associated nerves) are the most affected, the gastrointestinal tract (stomach, intestines, colon), kidneys, and liver can be involved as well. What Cold and Flu Medications Are Toxic to Dogs? Acetaminophen (Tylenol, Paracetamol) Antihistamines* Chlorpheniramine (Clomicalm, ChlorTabs, Aller-Chlor) Clemastine (Dayhist) Diphenhydramine (Benadryl) Promethazine (Phenergan, Promethegan) Meclizine (Bonine, Travel-Ease) Loratidine (Claritin) Cetirizine (Zyrtec) Cough medicine Dextromethorphan* (Delsym 12 hour, Robitussin, Vicks Dayquil and Nyquil, Tussin Cough DM, Robafen Cough) Cough drops Can also contain xylitol, which is highly toxic to dogs Decongestants Imidazolines (over-the-counter topical decongestants) Oxymetazoline, xylometazoline, tetrahydrozoline, and naphazoline Nose drops Afrin Privine Nasop Triaminic Eye drops Albalon Visine LR Oral decongestants (tablets, capsules, syrup taken by mouth) Phenylephrine (Sudafed PE, Benylin, Neo-Synephrine) Pseudoephedrine (Sudafed, Nasofed, Equiphed) Ephedrine * While all the medications listed above can be toxic to dogs, there are some that, if prescribed by your dog’s veterinarian and given in the correct amount, can be useful for dogs with certain medical conditions. Symptoms of Cold and Flu Medication Toxicity in Dogs Clinical signs of toxicity from different cold and flu medications may include: Acetaminophen Stomach upset (vomiting, diarrhea, lack of appetite) Dry eye (redness, discharge, swelling around eyes) Swelling of the face, paws, and forelimbs Symptoms of liver failure Icterus (yellow coloring to the skin and mucus membranes—eyes and gums) Weakness Depression Elevated heart rate Panting Abdominal pain Vomiting Drooling Antihistamines Central nervous system excitement/hyperactivity or depression/sedation Profuse salivation Vomiting Rapid breathing (tachypnea) Elevated heart rate (tachycardia) Cough medication Low doses cause depressive effects and high doses cause stimulatory effects. Ataxia, stumbling Lethargy Agitation Stomach upset (vomiting, diarrhea) Hallucination Tremors, seizures Disorientation Nervousness, shaking Dilated pupils (mydriasis) Elevated body temperature (hyperthermia) Oral decongestants Agitation Hyperactivity Elevated heart rate (tachycardia) High blood pressure (hypertension) Tremors Topical decongestants Stomach upset Ataxia Depression Low blood pressure (hypotension) Low body temperature (hypothermia) Low heart rate (bradycardia) If your dog ingests any cold and flu medication, or you suspect they may have, do not wait for your dog to have symptoms, since time is of the essence. It’s best to bring your dog to your vet’s office or an emergency hospital as soon as possible. Calling the pet poison helpline is recommended as well. They can help to guide the treatment process with you and your veterinarian. Are Vitamins and Natural Medications Toxic to Dogs? Vitamin C and echinacea are the least toxic vitamins or natural medications that are sometimes given to dogs, but they can cause mild stomach upset. However, zinc is highly toxic to dogs at large doses and will cause a dog’s body to destroy its own red blood cells, leading to a possibly life-threatening anemia. Most multivitamins also contain iron, which can be toxic to dogs and cause burning and irritation to the lining of the mouth and the gastrointestinal system. In large amounts, supplemental iron can also cause liver failure in dogs. What to Do If Your Dog Ingests Cold and Flu Medication If you suspect your dog has ingested cold and flu medication or is showing signs of medication toxicity, contact your veterinarian, an emergency hospital, and/or pet poison control as soon as possible. It is never recommended to make your dog vomit at home. All induced vomiting should be done with the guidance of a veterinarian or veterinary staff. If induced vomiting is done at home it can cause life-threatening conditions, such as aspiration pneumonia or chemical burns to the digestive system. It is very important that you provide as much information to the veterinarian as possible, including: Name of medication Milligram dose of each tablet/capsule/liquid Approximately how much medication is missing/suspected to be ingested Time of possible ingestion It’s best to overestimate how much medication your dog may have ingested to determine worst-case scenarios. Treatment Options for Cold and Flu Medication Toxicity in Dogs Poisoning cases can be scary, but treatment is available—and the sooner it is started, the better. Your veterinarian may choose to induce vomiting in your dog if the toxin was recently ingested and the dog is not yet showing signs of toxicity. If your dog has ingested a large amount of cold and flu medication, your vet might insert a stomach tube to flush out your dog’s stomach with water. They can also administer activated charcoal to deter the medication from absorbing into the bloodstream, which causes further toxicity. Treatment of cold and flu medication toxicity is aimed at correcting symptoms and providing supportive care, since there are no specific antidotes to these medications. It is important that dogs in this condition be kept warm and quiet and are closely monitored, to make sure they remain responsive and their breathing is normal. This likely means your dog will have to stay overnight in the hospital. IV fluids will be administered to keep your dog hydrated and keep the kidneys functioning normally. Antinausea medications and liver protectants may also be used to help your dog recover from this toxicity. If anemia develops, a blood transfusion will likely be needed. Prevent Cold and Flu Medication Toxicity in Dogs Good medication practices include keeping all original packaging until the medication is gone, in case the information is needed. Also, when repackaging medications, such as adding them to a pill organizer or other non-medicinal container, use extreme caution. It may seem convenient to put a plastic bag with some Tylenol, vitamins, and a few cold tablets in your purse or pocket, but think of the potential complications if your dog eats the entire contents. Never give your dog human medication unless you have consulted and approved its use with your veterinarian. Do not leave pills on the counter or the bottles within reach of your dog. If you drop any medication, pick it up immediately so your dog cannot eat it. Featured Image: iStock.com/SolStock"}]