[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Collie Eye Anomaly", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/collie-eyes.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/collie-eyes.jpg"}, "author": {"@type": "Person", "name": "Leslie Gillette, DVM", "url": "https://www.petmd.com/author/dr-leslie-gillette"}, "keywords": "Dogs, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/collie-eye-anomaly"}, "datePublished": "October 27, 2023", "dateModified": "October 27, 2023", "description": "Collie eye anomaly (CEA), or choroidal hypoplasia, is an inherited congenital disease. CEA usually affects both eyes, but one eye can be more severely affected than the other. In this article, Dr. Leslie Gillette discusses the causes, symptoms, and treatment of CEA.", "articleBody": "What is Collie Eye Anomaly? Collie eye anomaly (CEA), or choroidal hypoplasia, is an inherited congenital disease. Typically, this condition is present at birth in affected dogs, resulting from a DNA mutation. CEA usually affects both eyes, but one eye can be more severely affected than the other. The condition develops when blood vessels in the choroid (the layer of tissue in the back of the eyeball) that should be carrying nutrients to the retina (the part of the eye that senses light) do not develop properly in the womb. This causes dysfunction in a pup’s retina, leading to blind spots in their normal visual field. If the choroidal layer separates from the retina, retinal detachment may occur and lead to blindness. Sudden onset of choroidal hypoplasia can also develop in puppies who have an abnormal development in the womb. This is typically the result of the mother’s poor maternal health during her pregnancy, including exposure to toxins, infections, or poor nutrition. With either scenario, the result is underdevelopment of the choroid vessel layer, leading to retinal problems in dogs. Other breeds (aside from both Rough and Smooth Collies) that may be affected by this condition include Shetland Sheepdogs (Shelties), Australian Shepherds, and Border Collies. Less commonly affected—but still on the list of breeds that can carry the gene mutation—include: Lancashire Heelers Boykin Spaniels Longhaired Whippets Hokkaidos Silken Windhounds Nova Scotia Duck Tolling Retrievers Mixed breed dogs with Collie-type lineage may also be at risk. CEA typically does not cause pain, but dogs can suddenly go blind if they experience retinal detachment. Retinal detachment by itself is not a painful condition, but it can cause bleeding in the back part of a dog’s eye (fundus). Blood accumulation inside the eye causes an increase in intraocular pressure (glaucoma), which can be very painful. It may lead to blindness or require surgery to remove the affected eye (enucleation) if the pain cannot be adequately controlled. Symptoms of Collie Eye Anomaly Some symptoms of Collie eye anomaly may include: Microphthalmia (smaller than normal eyeballs) Anophthalmia (sunken eyeballs) Cloudy appearance to the eyes Coloboma (a hole in the retina) Retinal folds, which occur if the retinal tissue is too large for a dog’s eye. This often resolves by 12 weeks of age, which is why early examination with a veterinary ophthalmologist can be crucial in correctly diagnosing the condition. Retinal detachment Causes of Collie Eye Anomaly CEA occurs due to a DNA mutation. This is an autosomal recessive condition—meaning that affected puppies inherit a copy of the mutated gene from both of their parents. CEA is passed from parents to their pups as an autosomal recessive gene. This means that a puppy must receive one copy of the mutated gene from each parent to show symptoms. Puppies who receive one normal gene and one mutated gene are considered carriers of CEA. While carriers won’t experience symptoms, there’s still the potential for a carrier puppy to pass on the mutated gene. This happens when the affected dog has their own pups with another carrier as an adult. Typically, CEA is not considered a progressive disease, meaning that any symptoms present at birth shouldn’t worsen with age. Some symptoms, like retinal folds, may even resolve as a puppy matures. However, if an affected dog does develop retinal detachment, this can progress to complete and irreversible blindness. How Veterinarians Diagnose Collie Eye Anomaly CEA can be diagnosed by a veterinary ophthalmologist as early as six to eight weeks of age. Veterinary ophthalmologists may use drops to dilate the eye for a more detailed exam with an ophthalmoscope (a specialized tool that allows a vet to look at the back of the eye) to look for abnormalities. Retinal folds, underdeveloped choroidal blood vessels (choroidal hypoplasia), and colobomas may be visible in the back of the eye after a dog’s pupil is completely dilated. Puppies should be examined by a veterinary ophthalmologist—ideally before they are 12 weeks of age—for a diagnosis. During the exam, the veterinary ophthalmologist will place drops in a puppy’s eyes to dilate their pupils (with the same type of drop a human eye doctor would use to examine your eyes). Once the pupils are dilated, the veterinarian can see into the back of the eye to look for abnormalities with the retina, the blood vessels in the choroid layer, and the optic nerve. Carriers of CEA can also be identified through genetic testing, which can identify affected dogs with up to 95% accuracy. Genetic testing for CEA requires a blood sample, which can be collected by your vet. Pet parents should monitor at-risk puppies for signs of impaired vision, which may include behavioral changes like: Clumsiness (bumping into furniture or walls) Misjudging distances when jumping or having difficulty navigating stairs Difficulty locating toys or food/water bowls Anxiousness in new surroundings or around unfamiliar people or animals Reluctance or refusal to go outdoors A change or decline in normal play behaviors Physical changes may include cloudiness to the eyes, smaller eyeballs (microphthalmia) or a noticeably sunken appearance (anophthalmia) to a pup’s eyes Treatment of Collie Eye Anomaly There is no treatment for Collie eye anomaly. If a puppy is born with CEA but is not completely blind, there are treatments available that a veterinarian can use to help preserve the puppy’s vision later in life if they develop complications. However, the disease is not reversible. Depending on the severity of symptoms, there may be some benefit to the use of prescription eye medications to control symptoms if glaucoma develops. Discuss the benefit of these medications with your veterinary ophthalmologist and if they are right for your pup. A dog’s overall quality of life should not be significantly affected with CEA, since they usually begin experiencing vision issues soon after birth. CEA itself is not painful and does not cause affected dogs to experience discomfort unless complications develop, such as retinal detachment, bleeding into the back of the eye, and an increase in intraocular pressure, leading to glaucoma. Laser surgery may be helpful in repairing partial retinal detachment caused by the presence of a coloboma in some dogs. Cryosurgery is another option for repairing partial retinal detachments to prevent them from becoming fully detached. During this procedure, your vet will freeze the cells in your pup’s tissue to create a scar, which helps reattach loose parts of the retina to the back of the eye to preserve their vision. Recovery and Management of Collie Eye Anomaly Lifestyle changes for dogs with CEA usually involve a daily routine both indoors and outdoors.  A few tips to keep your pup safe and happy include: Keep furniture in the same configuration throughout the house Place dog gates to protect dogs from accidental injury (falling down stairs) Install pool deck fencing to protect them from accidental drowning Keep the same location for their food, water, and bedding. This will help minimize your dog’s anxiety of not being able to “find” familiar items in the home if they cannot see. Halo devices can also be used to protect dogs from bumping into sharp corners or objects at eye level. Featured Image: yanjf/iStock / Getty Images Plus via Getty Images"}]