[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/415a7rxyal", "@type": "VideoObject", "duration": "PT1M25S", "name": "5324817412001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/c4727142dfd479416a5d43c4d54f52e5b5a2c4f4.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/415a7rxyal", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/9d879dc333203508ef57d08d5127a4ac9616d1e3.m3u8", "transcript": "This disease, also known as adrenal criticism is one of the most common endocrine disorders to affect dogs. It occurs when the adrenal glands are triggered to produce an excessive amount of cortisone which hampers the metabolic process. This leads to gastrointestinal disorders and skin disease and hypertension Cushing's disease is most often caused by an increasing cortisone due to a benign tumor of the pituitary gland the gland that controls all hormone production in the body. The disease generally affects middle age to older pets.\n\nThere are several symptoms that may indicate Cushing's disease in dogs. These include increased thirst and hunger increased urination increased panting muscle weakness obesity, lack of energy inability to sleep and a pot-bellied handyman. Other symptoms may include hair loss darkening of the skin white scaly patches on the skin or even bruising. Your veterinarian will run tests to measure cortisone levels in your dog's bloodstream to determine if your dog has Cushing's disease.\n\nMost dogs can be treated with drugs that will vary depending on the severity of symptoms. These drugs may have serious side effects. So dogs taking them should be closely monitored. Pet parents should be aware that dogs diagnosed with Cushing's disease require lifelong medication and care for frequent veterinary follow UPS are recommended to monitor your dog's health.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/endocrine/cushings-disease-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cushing&#039;s Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1216439282.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1216439282.jpg"}, "author": {"@type": "Person", "name": "Krista Seraydar, DVM", "url": "https://www.petmd.com/author/dr-krista-seraydar"}, "keywords": "Dog, Symptom Checker, Cushing&#039;s Disease", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/cushings-disease-dogs"}, "datePublished": "October 29, 2020", "dateModified": "October 6, 2023", "description": "What is Cushing’s Disease and how can it affect your dog? Dr. Krista Seraydar explains the symptoms, causes and how it’s treated.", "articleBody": "Cushing’s disease—also known as hypercortisolism and hyperadrenocorticism—is a serious disease that typically affects middle-aged and senior dogs. It can be serious if left untreated. Here’s what you need to know about Cushing’s disease in dogs—from types and symptoms to treatment and care. What Is Cushing&#039;s Disease in Dogs? Cushing’s disease (hyperadrenocorticism) usually occurs when the adrenal gland secretes too much stress hormone, or cortisol. What Causes Cushing&#039;s Disease in Dogs? Cushing’s disease in dogs is most commonly seen in middle-aged to older dogs—from about 7–12 years old. There are three types of Cushing’s Disease in dogs: Pituitary-Dependent Cushing’s Disease Pituitary-dependent Cushing’s disease occurs when a tumor of the pituitary gland at the base of the brain secretes too much of the hormone that stimulates the adrenal gland to make cortisol. These tumors are typically benign and small; however, 15–20% of dogs with pituitary tumors will eventually develop neurologic signs as the tumor grows. Pituitary tumors are responsible for 80–85% of Cushing’s disease cases. Adrenal Gland Tumor The adrenal glands create stress hormones and are located next to the kidneys. An adrenal gland tumor can be benign (not cancerous) or malignant (cancerous). Adrenal tumors cause 15–20% of Cushing’s disease cases. Iatrogenic Cushing’s Disease Iatrogenic Cushing’s disease in dogs is caused by excessive or long-term use of corticosteroid medications. What Does Cushing&#039;s Disease Do to Dogs? While not inherently painful, Cushing’s disease in dogs (especially if uncontrolled) can be associated with: High blood pressure Bladder stones Diabetes Chronic skin and urinary tract infections Changes in the liver (vacuolar hepatopathy) Increased risk of blood clots High blood pressure and protein loss through the urine are also common with hyperadrenocorticism and can contribute to kidney disease. Additionally, 15–20% of dogs with pituitary tumors develop neurologic signs as the tumor grows and 5–10% of dogs with Cushing’s will also develop diabetes. Although rare, Cushing’s patients are also at risk for pulmonary thromboembolisms (potentially fatal blood clots in the lungs). Are Certain Breeds Predisposed to Cushing’s Disease?  Any dog can develop Cushing’s disease, but it is more commonly diagnosed in these breeds: Poodles, especially Miniature Poodles Dachshunds Boxers Boston Terriers Yorkshire Terriers American Staffordshire Terriers What Are the Symptoms of Cushing&#039;s Disease in Dogs? There are a variety of symptoms that can appear in a dog with Cushing’s disease. Some of the most common signs include: Drinking more water Increased urination Increased appetite Hair loss or poor regrowth Panting Pot-belly appearance Thin skin Blackheads Recurrent skin infections Recurrent urinary infections Sudden blindness Lethargy Urinary incontinence Seborrhea or oily skin Firm, irregular plaques on skin (called calcinosis cutis) How Is Cushing&#039;s Disease Diagnosed in Dogs? Although there is no single test that will diagnose 100% of cases, your veterinarian will likely recommend some combination of the following: Baseline bloodwork (CBC/Chemistry) Urinalysis +/- urine culture (to rule out urinary tract infections) ACTH stimulation test (can have false negatives) Low-dose dexamethasone suppression test (can be affected by other illnesses) High-dose dexamethasone suppression test Urine cortisol to creatinine ratio       Abdominal ultrasound (can identify changes in liver and adrenal gland enlargement or tumors) Computerized tomography scan or magnetic resonance imaging of the brain (can detect pituitary tumors) What&#039;s the Treatment for Cushing&#039;s Disease in Dogs?  Treating Cushing’s disease in dogs is largely dependent on the underlying cause. Treatment options include: Surgery Medication Radiation If Cushing’s disease is caused by the excessive use of steroids, the steroid dosage should be gradually tapered down and discontinued, if possible. But take note: This may result in relapse of the primary disease the steroid was originally used to treat so different medications may be needed. Surgery Adrenal tumors can often be surgically removed. And, if they are benign, surgery can be curative. Because of their location at the base of the brain, pituitary tumors are harder to remove. Surgery for pituitary tumors may be available at some referral veterinary hospitals. Medication Medical management with either trilostane (Vetoryl®) or mitotane (Lysodren®) is the most common form of treatment for pituitary tumors and when surgery isn’t an option for an adrenal tumor. These drugs interfere with the production of cortisol, but very close monitoring is necessary to ensure that adrenal function is not impaired too much too quickly. Depending on which medication is started, your veterinarian will create a plan for monitoring your dog’s bloodwork and reaching an appropriate dose (this will vary depending on patient, length of time on medication, etc.). Once the vet has determined your dog’s proper dosage, an ACTH stimulation test is usually done every three to six months or if you notice signs of Cushing’s beginning to develop again. As pituitary and adrenal tumors progress, they will require an increased dose of medication to control symptoms. While starting medication or changing dosages, please be sure to monitor your pet for lethargy, vomiting, decreased appetite, or trouble breathing. Call your veterinarian immediately if any of these signs are noted. Radiation Radiation treatment for pituitary-dependent Cushing&#039;s disease in dogs has been shown to improve or eliminate neurological symptoms and improve the prognosis, especially when treated early. The median survival time in these cases is 743 days, or about two years. Radiation therapy may also be an option for adrenal tumors that cannot be surgically removed. How Long Do Dogs with Cushing&#039;s Disease Live? The prognosis for dogs with Cushing’s disease depends on whether they have pituitary versus non-pituitary-dependent Cushing&#039;s, whether the tumor is benign or malignant, and on other specifics of the dog’s case. Pituitary Tumors If caused by a small pituitary tumor, medical management can provide long-term control with good quality of life. For pituitary-dependent Cushing’s disease, the median survival time of patients treated with trilostane or mitotane is about two to two and a half years. If a pituitary tumor is large and affects the brain and surrounding structures, the prognosis is poorer. Adrenal Tumors Approximately 50% of adrenal tumors are benign, and surgical removal can be curative. The other 50% of adrenal tumors are malignant and carry a poor prognosis, especially if they have already metastasized at the time of diagnosis. The median survival time is approximately one year when treated with trilostane or mitotane. The prognosis is worse in patients with metastasis of the primary tumor, local invasion of the vessels, or a tumor greater than 5 cm in length. Can You Prevent Cushing&#039;s Disease in Dogs? Unfortunately, you cannot prevent Cushing’s disease if it is caused by a pituitary or adrenal gland tumor. However, you can avoid long-term use of high-dose steroids to minimize the risk of developing iatrogenic Cushing’s disease. Featured Image: iStock.com/devonanne"}]