[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live with DM?", "acceptedAnswer": {"@type": "Answer", "text": "Typically, a patient with degenerative myelopathy will progress within 6-18 months from when symptoms are first noted to when quality of life becomes a concern and euthanasia is considered."}}, {"@type": "Question", "name": "Is DM painful?", "acceptedAnswer": {"@type": "Answer", "text": "Degenerative myelopathy is a non-painful condition. "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Degenerative Myelopathy in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1412454261.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1412454261.jpg"}, "author": {"@type": "Person", "name": "Heidi Kos-Barber, DVM", "url": "https://www.petmd.com/author/dr-heidi-kos-barber"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/degenerative-myelopathy-dogs"}, "datePublished": "January 20, 2023", "dateModified": "January 20, 2023", "description": "Dr. Heidi Kos-Barber explains degenerative myelopathy (DM) in dogs, including symptoms, diagnosis, and treatment options", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. What Is Degenerative Myelopathy in Dogs? Degenerative Myelopathy (DM) is a slow onset, non-painful destruction of the nerve conduction portion of the spinal cord, called axons and myelin. Axons are the nerve fibers that extend from the nerve cell and myelin is the coating around the nerve fiber that allows for conduction of nerve signals. Both the thoracic (upper and middle back) and lumbar (lower back) parts of the spinal cord are affected.  As the disease progresses, a dog will develop weakness and an abnormal gait in the hind limbs. Usually, the condition is worse on one side of the spinal cord than the other, so clinical signs may be worse on one side of the body compared to the other side. With time, the disease causes paralysis of the hind limbs. The entire spinal cord can eventually become affected—causing forelimb paralysis and problems with breathing, vocalizing, and eating. Typically, about one year after the first symptoms are seen, a dog is unable to walk on their hind limbs. Which breeds are predisposed to Degenerative Myelopathy? The German Shepherd is the most common breed affected by DM, but it can also be seen in other large breed dogs, such as: Labrador Retrievers Boxers Bernese Mountain Dogs Chesapeake Bay Retrievers Rhodesian Ridgebacks Siberian Huskies Degenerative myelopathy can also be seen in some smaller breeds, such as the Pembroke Welsh Corgi, Cavalier King Charles Spaniel, Pug, and Miniature Poodle. Affected dogs are most commonly middle-aged or older. Symptoms of Degenerative Myelopathy in Dogs A dog with DM will initially become weak in the hind limbs and have a hard time getting up. They will lose feeling in the hind limbs, which results in dragging of the paws, scuffing of the toenails and/or tops of the paws, and abnormal paw placement. Affected dogs will be wobbly and may knuckle over the paws, cross the hind limbs, or stumble while walking.  With progression of the condition, a severely affected dog will lose the ability to stand on or move the hind limbs. If able to stand on the hind limbs, a patient’s legs may shake due to weakness. In the later stage of the disease, a patient may have problems with fecal and urinary incontinence. Muscle wasting will be noted in the hind limbs, due to the dog not using them. Eventually, the disease will progress to involve the forelimbs and brainstem—rendering a dog fully paralyzed and developing problems with breathing and eating/drinking.  Causes of Degenerative Myelopathy in Dogs A genetic component to the disease has been identified. Dogs that have two copies of a mutated superoxide dismutase 1 (SOD 1) gene are at increased risk for development for DM.  However, a dog with two mutated SOD 1 genes will not necessarily go on to develop DM, which indicates there are other factors involved in the development of the disease that are unknown at this time. How Veterinarians Diagnose Degenerative Myelopathy in Dogs A diagnosis of DM is made by excluding other spinal cord diseases based on exam findings and imaging. Your vet will evaluate your dog for spinal and joint pain and also perform a neurologic evaluation. Based on the physical exam findings, your vet will develop a list of likely causes for your dog’s clinical signs. Your vet may recommend that you meet with a board-certified veterinary neurologist.  Radiographs (x-rays) may be recommended to evaluate the bones of the spine and hips. One can look for evidence of arthritis, misalignment of the spine (subluxation/luxation), bone cancer (neoplasia), lumbosacral spondylosis, or something else.  However, the spinal cord is not visible on x-rays. A neurologist will likely recommend advanced imaging, such as a myelogram, computed tomography (CT), or magnetic resonance imaging (MRI) to evaluate the spinal cord.  These imaging tools can look for compression of the spinal cord, as with intervertebral disc disease, spinal cord cancer (neoplasia), or inflammation.  Is there a test for DM in dogs?  Unfortunately, the only test that results in a certain diagnosis of DM is biopsy of spinal cord tissue, which can only be collected after a dog has died.  A genetic test is available to check for the presence of the SOD 1 mutation to determine if a pet is normal (no copies of the mutated gene), a carrier (one normal copy and one mutated copy of the gene), or has two copies of the mutated gene.  A dog with two copies is at increased risk but may never develop DM.  The genetic test is used to screen for at-risk dogs and those used in breeding programs. A dog that is a carrier for the SOD 1 mutation is at risk for development of degenerative myelopathy, but not at as great a risk as a dog that has two. Stages of Degenerative Myelopathy in Dogs The degree of neurological impairment from DM is divided into four clinical stages. Stage 1: The dog is able to walk but is showing signs of decreased sensation and weakness in the hind limbs. Pup has difficulty rising from a lying position, there is knuckling of the paws, dragging of the feet/wear on the toenails, and stumbling/crisscrossing of the hind limbs.  Stage 2: The patient is unable to walk on the hind limbs. They are severely weak in the hind limbs and may/may not be able to stand on hind limbs.  Stage 3:  The patient has paralysis of the hind limbs and weakness involving the front limbs. Hind limb muscles atrophy due to no use of muscles. Atrophy is the process by which a muscle loses mass and tone.  This occurs when the muscle is not being used.  Fecal and urinary incontinence and a change in bark or other vocalizations may be noted.  Stage 4: The patient is completely paralyzed in all four limbs, has muscle atrophy affecting the entire body, has fecal and urinary incontinence, change in vocalization, difficulty swallowing food/water, and difficulty breathing.  Your veterinarian will monitor your dog’s progression with DM with the staging system.  The length of time between stages varies, depending on the dog. Usually, a large dog will need to be euthanized before a smaller dog with similar signs, because larger dogs are more difficult to care for during this stage of the disease. Treatment of Degenerative Myelopathy in Dogs There is no cure for DM—only supportive care. Physical therapy in the form of water therapy, walking with a supportive harness/sling, and range of motion exercises can be helpful in decreasing muscle mass loss. Your primary veterinarian or neurologist can direct you to rehabilitation centers near you. Dogs that receive physical therapy can typically keep walking longer than those who do not.    Massages can also be helpful in enhancing flow of blood through the muscles and can work out tense areas.  Recovery and Management of Degenerative Myelopathy in Dogs For dogs that are unable to walk, care is needed to keep them clean from feces and urine. Puppy pads or other absorbent pads can be placed under the patient to absorb accidents and make clean-up easier. A patient that cannot get up will need to be turned every couple of hours to help decrease the risk of bed sores. Memory foam bedding and comforters provide good padding between the ground and the patient. Other padding can be placed under the head and between the limbs to ensure the dog is comfortable. Canine carts or dog wheelchairs may be helpful in maintaining mobility longer. Dogs that are mentally frustrated with not being able to get up and move on their own could benefit from the increased freedom a cart can provide.  The cart, however, needs to be used only when a patient can be monitored.  A dog should not be left alone in a cart, as this increases the risk for injury. "}]