[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do certain foods cause diabetes in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "While high-fat diets can cause pancreatitis, which may predispose to diabetes, no official direct link has been found between these diets and diabetes."}}, {"@type": "Question", "name": "How long do dogs live after being diagnosed with diabetes?", "acceptedAnswer": {"@type": "Answer", "text": "Depending on co-morbidities and how easily regulated they are, dogs can live for many years after diagnosis. However, some studies showed a mean survival time after diagnosis to be between 18 and 24 months."}}, {"@type": "Question", "name": "What type of diabetes is more common in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Type I diabetes is most common in dogs."}}, {"@type": "Question", "name": "Can puppies have diabetes?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs diagnosed with diabetes are middle-aged to mature, although juvenile forms of diabetes exist."}}, {"@type": "Question", "name": "Does diabetes in dogs cause blindness?", "acceptedAnswer": {"@type": "Answer", "text": "When extremely high blood sugar becomes trapped in the lens of the eye it causes cataracts. Without treatment for cataracts, a dog can typically go blind."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Diabetes in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/shepherd.vet_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/shepherd.vet_.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Diabetes, Symptom Checker, Diabetes", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/diabetes-dogs"}, "datePublished": "April 28, 2022", "dateModified": "September 12, 2023", "description": "Dr. Lauren Jones explains diabetes in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What is Diabetes Mellitus in Dogs? Diabetes mellitus is a common disorder in which the body fails to produce enough or appropriately respond to insulin. Diabetes is a disease of the endocrine system, which is responsible for producing hormones to regulate the body’s metabolism, among other things. Insulin is responsible for turning food into energy. When a dog eats a meal, the nutrients enter its bloodstream as glucose, also known as blood sugar. All the cells in the body use glucose as fuel. Insulin acts on receptors on the cells, allowing glucose to leave the bloodstream and enter the cells where it can be used as energy or stored. When there is a lack of insulin, cells cannot get enough glucose and become starved for energy. At the same time, the bloodstream contains high blood glucose levels, which can damage nerves and blood vessels. Treating diabetes mellitus involves providing insulin to increase the amount of glucose entering the cells and reducing glucose in the bloodstream. There are three types of diabetes in dogs: Type I is known as insulin-dependent diabetes and is similar to Type I diabetes in humans. This is the most common type to occur in dogs. In Type I diabetes, insulin-secreting cells in the pancreas are destroyed, causing an absolute lack of insulin. These dogs need a lifetime of insulin supplementation to live normally. Type II is known as noninsulin-dependent diabetes and is similar to Type II diabetes in humans. This form of diabetes is typically related to obesity. In Type II diabetes, the pancreas may produce less insulin, and the body’s cells respond poorly to the insulin that is secreted. This leads to less glucose entering the cells (and higher glucose in the blood).Type III diabetes is hormone-induced and typically related to pregnancy. This form of diabetes is rare in dogs, but it can occur and can be fatal. Dogs often return to normal but Type III may occur again during another pregnancy. Because of this danger, vets often recommend spaying a dog as soon as it is medically safe to do so. Regardless of type, reduced glucose in the body&#039;s cells stimulates the liver to produce more glucose, which worsens the sugar in the bloodstream. The kidneys will filter and absorb the extra glucose in the bloodstream. However, as the excess glucose spills into the urine, dogs will urinate and drink excessively. Other issues related to the excess sugar include: Bladder infection Loss of muscle mass Liver damage Roughly 1 in 300 dogs acquire diabetes throughout their life. Females and middle-aged to senior dogs have a higher risk, as are dogs that are obese. Breeds that are predisposed to diabetes include: Alaskan Malamute Australian Terrier Bichon Frise Cairn Terrier Keeshond Labrador Retriever Miniature Schnauzer Miniature Dachshund Norwegian Elkhound Poodle Pug Samoyed Tibetan Terrier Yorkshire Terrier Symptoms of Diabetes in Dogs Signs of diabetes most commonly seen include: Increased thirst (polydipsia) Increased urination (polyuria) Increased appetite (polyphagia) Weight loss Lethargy Dehydration Cataracts Other common diseases and illnesses, such as urinary tract infections, Cushing’s disease, hypothyroidism and pancreatitis often cause complications in diabetic dogs. Diabetic dogs may also show additional symptoms based on underlying disorders. Long-term effects of diabetes, if unregulated or untreated, are severe and eventually fatal. Some common secondary and long-term effects include the following: Seizures can occur if the blood sugar gets too low. Regulating glucose is central to treating diabetes but over-medication can lead to low blood sugar and seizures. Untreated, they can be fatal. It is crucial to get your dog to a veterinarian immediately. Your vet may recommend rubbing Karo syrup (or similar sugary substances) in the gums to relieve the low blood sugar before bringing your dog in for an examination. Pet parents should only use Karo syrup, or other products, under the direction of a veterinarian when it is safe to do so. Hepatopathy, or liver disease, can occur as a side effect of diabetes. Fat metabolism goes awry, leading to abnormally high levels of fatty acids in the liver. This leads to fat accumulation within liver cells which causes damage and swelling. Diabetic ketoacidosis (DKA) results from chronic starvation of the body’s cells. The body turns to alternate sources for fuel, including protein and fat tissues. The body initially uses a new energy product called ketones. However, when ketones accumulate, they cause metabolic acidosis, effectively acidifying the blood. These dogs are typically very sick, requiring intensive nursing care and treatment, often at a 24/7 specialty hospital. Hyperglycemic Hyperosmolar Syndrome (HHS) is a serious complication of diabetes involving extremely high blood glucose and osmolality. Osmolality refers to the number of dissolved particles in the bloodstream. These dogs are typically very sick, requiring intensive nursing care and treatment, often at a 24/7 specialty hospital. Diabetic neuropathy is uncommon, but it can occur when chronic diabetes damages the nervous system. These pets typically have an abnormal, uncoordinated gait with partial paralysis of the hind legs. Diabetic cataracts are formed due to the high levels of blood glucose within the eye&#039;s lens. Glucose is needed to fuel and provide energy for the eye cells, but quickly becomes trapped within the lens, causing cataract to form. Causes of Diabetes in Dogs Diabetes mellitus in dogs has several causes. Most dogs acquire Type I, or insulin-dependent diabetes. Type I diabetes is most likely due to the immune system mistakenly attacking insulin-producing cells in the pancreas, leading to a total—or partial—loss of insulin secretion. Other risks and complicating factors of diabetes include genetics, hormones and other diseases. Genetics likely play a role in many cases of diabetes, which is why some breeds are predisposed to the condition. Increased hormone levels (progesterone, growth hormone and cortisol) can lead to glucose intolerance. Gestational diabetes is the most common form of hormone-related diabetes. Cushing’s disease is another type of endocrine disorder that increases the body’s cortisol, which makes it harder to regulate diabetic dogs. Veterinarians commonly test for Cushing’s disease in newly diagnosed or difficult diabetic patients. Chronic pancreatitis (inflammation of the pancreas) can destroy the insulin-producing beta cells and lead to diabetes. Obesity and high-fat diets can cause pancreatitis and may be a risk factor. How Veterinarians Diagnose Diabetes in Dogs Veterinarians may suspect diabetes mellitus based on physical exam findings and a history of increased thirst, increased urination, and weight loss. However, to officially diagnose diabetes, veterinarians must find persistent high blood and urine glucose values. Veterinarians may also recommend the following tests: Blood chemistry and complete blood count (CBC): Vets look for high glucose in the blood, and often find increased liver values, elevated cholesterol and kidney values, and altered electrolytes. Urinalysis: This test shows when glucose in the urine is is persistently high — a common symptom of diabetes. It may also indicate if a urinary tract infection is present (an extremely common occurrence in diabetic dogs). Without treatment, urinary tract infections will make it difficult to regulate diabetes. A urinalysis will also provide information on ketones to rule out the complicating disease of diabetic ketoacidosis. Fructosamine: Because stress can briefly increase blood glucose levels, some dogs may never have an accurate glucose reading in the high-stress environment of a hospital. A fructosamine test can help confirm a diabetic diagnosis and provide a useful monitoring tool. While a blood glucose reading provides a snapshot of information, fructosamine assays provide information on how well insulin was regulated over the previous two or three weeks. Additional diagnostics may be required to rule out concurrent diseases processes, including Radiography to look for co-morbidities such as kidney or bladder stones, cystitis and pancreatitis Thyroid tests to rule out this common endocrine disease Cushing’s testing Abdominal ultrasonography to look for co-morbidities, like pancreatitis and hepatopathy Pancreatitis blood testing Treatment of Diabetes in Dogs For uncomplicated cases of diabetes (those that do not include diabetic ketoacidosis, etc.) treating diabetes primarily includes insulin and diet changes. Insulin for Diabetic Dogs Insulin is the main treatment in dogs with diabetes. Insulin moves glucose from the bloodstream into the cells where it can be used or stored. All insulin is absorbed subcutaneously (under the skin) which requires an injection under the skin. Most dogs require twice daily insulin injections. While giving injections may sound daunting, the amount of insulin is typically not large, and needles are tiny. Most dogs tolerate insulin injections very well. Vets or vet techs will demonstrate how to give an insulin injection or can approve video demos. The injection must not be given in the same location every day or scar tissue may form. If this occurs, the insulin won’t be absorbed properly. Types of Insulin for Dogs Insulin is available in two strength levels: U-100 and U-40. This relates to how many units of insulin are in one milliliter. U-100 insulin is more concentrated, with 100 units per mL. U-40 insulin has 40 units per mL. The insulin syringes must correspond to the type of insulin. If a U-100 needle is used with U-40 insulin, the dog will not receive the correct amount of insulin, possibly resulting in serious complications. Vets often prescribe the brand Vetsulin. Other types that may be prescribed include: LantusProzincDetemir (Levemir)NPHDiets for Diabetic Dogs Diet therapy is a vital component to treat diabetes. Pet parents should feed their dogs the same thing, around the same time every day. Consistency is key and leads to better and faster regulation of blood sugar. Prescription diets are available for diabetic dogs. These diets typically contain high fiber with appropriate fat, protein and carbohydrate ratios which help maintain blood-sugar levels. It is important to note that pet parents that have underweight dogs, or those experiencing other symptoms related to a diagnosis, should talk to their vet first. Potential Treatments for Diabetes in Dogs Gene therapy is emerging as a potential treatment for diabetes. Studies are showing that gene therapy may reduce the amount of insulin required. While this is not a cure, it has the potential to help dogs with diabetes in the future. Recovery and Management of Diabetes in Dogs Dogs with diabetes require lifelong monitoring and treatment, and pet parents must work with their veterinary teams for success. Initially, veterinarians may check blood-sugar levels 4 to 6 hours after the first dose of insulin to rule out a low blood-sugar event. They may perform additional testing, and this usually occurs in the veterinary hospital. After that, your dog will be evaluated every 7 to 14 days. Insulin doses should not be adjusted more frequently than every 7 days, unless suspected of a low blood-sugar crisis. Insulin doses should only be adjusted under the direct supervision of your veterinarian. Once regulated, diabetic dogs should have a physical exam, including a weight check, at least every three months. Full blood work and diabetic testing may also be analyzed at least every six months. There are four main ways to monitor a dog’s response to insulin treatment: Blood glucose curve is usually the most accurate way to monitor your dog’s blood sugar. Your dog will stay at the veterinary hospital all day, having blood drawn every 1 to 2 hours. These values are plotted on a chart, which typically looks like a curve. Based on the shape of the curve, the highest blood glucose and the lowest blood glucose, your veterinarian will determine if a change in dosage is necessary. Freestyle Libre involves the painless placement of a small sensor on your dog’s skin to measure blood glucose. Glucose can be checked frequently — without drawing blood — on a device reader or smartphone app and is especially useful for dogs who tend to be anxious or uncooperative. Fructosamine can be used to provide a general idea of how well glucose is being regulated over the previous 2 to 3 weeks. This is not ideal but it can be helpful if other methods are not possible due to financial issues or the dog’s behavioral pattern. Urine glucose and ketone measurements are an easy and inexpensive way to monitor dogs at home. This test comes as a small strip that is placed in the stream of urine. A negative test could indicate a low blood-sugar event and would require a call to the vet. The test strip also detects ketones in the urine, which should always be negative. High, persistent ketones in the urine could indicate the dog is going into DKA and is unregulated.Management goals include reducing signs and symptoms, maintaining a healthy blood-glucose level and improving a dog’s quality of life. Therapeutic goals in dogs are different from those in humans with diabetes. Veterinarians do not control animals’ glucose as tightly as humans. This means that goal blood glucose readings for dogs may be much higher than expected if a pet parent is familiar with diabetic regulation in humans. The prognosis for diabetic dogs is based on multiple factors: Uncomplicated diabetics is typically regulated easier, and requires only a few visits to the vet per year for monitoring. Complicated cases of diabetes can be difficult and frustrating for pet parents and veterinarians to manage. Complicated diabetes can be an expensive and emotionally draining condition to treat, and diabetic dogs are often euthanized. Because of this, it is crucial for pet parents to discuss goals and expectations with their veterinarian at the time of a dog’s diagnosis and continue to check in throughout treatment.Prevention of Diabetes in Dogs While diabetes is not technically preventable in dogs, there are some things pet parents can do. All dogs should be seen their vet every year for a general physical exam and routine blood work. Senior dogs, typically over the age of 6, should be taken to the vet every six months. This exam and blood work can detect changes well before they show up as clinical signs. Therefore, dogs can receive treatment or have lifestyle changes before they are sick, leading to a better quality of life and a longer lifespan. In addition to consistent veterinary checks, pet parents can provide a high-quality diet and regular exercise to stay lean and active."}]