[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What causes intestinal ulcers in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "There are many causes of ulcers in dogs, most notably common medications, internal organ dysfunction, chronic diseases, and cancer."}}, {"@type": "Question", "name": "Can a dog survive a stomach ulcer?", "acceptedAnswer": {"@type": "Answer", "text": "Yes! For some types of ulcerations, the prognosis is fairly positive."}}, {"@type": "Question", "name": "What are the symptoms of stomach ulcers in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Vomiting is the most common sign, sometimes with blood or coffee-ground material."}}, {"@type": "Question", "name": "How long does it take to heal an ulcer in a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Most ulcers respond to treatment within 5 to 7 days."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Stomach and Intestinal Ulcers in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/dog.ulstrasound.image_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/dog.ulstrasound.image_.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Ulcers, Symptom Checker, Stomach Ulcers", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_gastroduodenal_ulcer_disease"}, "datePublished": "August 29, 2022", "dateModified": "September 12, 2023", "description": "Dr. Lauren Jones discusses stomach and intestinal ulcers in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What are Stomach and Intestinal Ulcers in Dogs? Gastrointestinal ulcers are an erosion of one or more layers of the stomach or small intestines. Gastric, or stomach ulcers are the most common, followed by ulcers in the first part of the small intestines, called the duodenum.   During digestion, the stomach secretes harsh gastric acids and enzymes, which start breaking down food in the stomach to extract nutrients. To protect against these corrosive stomach juices, the stomach is lined with a mucosal barrier. If this barrier breaks down, the stomach lining will gradually erode, causing ulcers. Ulcers vary in severity. Erosions may wear through a few layers (non-perforating ulcers) or may create a hole through the stomach wall (perforating ulcers). Perforating ulcers are the most dangerous because holes in the gastrointestinal tract allow the stomach’s contents to spill into the abdominal cavity. Ulcers can affect the gastrointestinal and cardiovascular systems which leads to sepsis. Call your veterinarian as soon as possible for an exam and diagnostic testing if you think your dog may have an ulcer. Symptoms of Stomach and Intestinal Ulcers in Dogs The most common sign of gastrointestinal ulcers is vomiting, often with blood. Depending on the ulcer’s severity, location, and frequency, other signs may include: Weight loss Melena (dark, tarry stools) Diarrhea Decreased appetite Drooling Dehydration Abdominal pain (dogs may look at their abdomen, cry when touched, or go into a “praying” position) Lethargy and weakness Fever Pale mucous membranes Causes of Stomach and Intestinal Ulcers in Dogs There are broad categories of conditions or situations that cause ulcers in dogs. Some are more common than others and include: Drugs: such as NSAIDs: (non-steroidal anti-inflammatories, which include Rimadyl and Deramax) and steroids (like prednisone and dexamethasone). Gastrointestinal diseases: including inflammatory bowel disease (IBD), ingested foreign material and an increase in the production of gastric acid. Infectious diseases: such as pythiosis (a waterborne infection) and helicobacter bacterial infections. Metabolic diseases: including liver, kidneys, and adrenal glands (Addison’s disease). Heavy metal poisoning: including arsenic, zinc, thallium, iron, and lead. Cancers of the gastrointestinal tract: such as carcinoma, lymphoma, leiomyoma, and GI stromal tumor. Stress can also lead to ulcers. Severe shock and low blood pressure (usually due to trauma or surgery), heat stroke sepsis, thermal burns, and strenuous exercise in extreme temperatures (cold or hot) are some examples of stressors. Sled dogs, and other elite canine athletes, are prone to develop stomach ulcers. How Veterinarians Diagnose Stomach and Intestinal Ulcers in Dogs A biopsy is required to diagnose an ulcer. Biopsy samples are especially useful to determine the underlying reason for the ulcer, most notably cancer or infections. Veterinarians may recommend many tests before getting to a biopsy. A dog’s history of vomiting, especially with blood, may give veterinarians a strong suspicion of an ulcer, especially a dog who has a history of being prescribed ulcer-causing drugs (NSAIDs or steroids). Tests may include: Complete blood count: This blood test would identify anemia, or a decreased red blood cell count. Shape, size, and color are also noted, which can help veterinarians determine whether ulcers have been chronic. Biochemistry profile: This blood test will identify other diseases that may be causing the ulceration. Fecal occult blood test: This test identifies blood loss from the gastrointestinal tract in normal-appearing feces. Radiographs: Ulcers cannot be seen on radiographs, or X-rays, but they are necessary to rule out other reasons for vomiting and other gastrointestinal clinical signs. Contrast radiographs involve giving the patient a special liquid, called barium, that appears bright white on X-rays. This method may show the barium filling in a defect at the site of the ulcer. Radiographs will also detect air in the abdomen secondary to a perforating ulcer. Ultrasonography: Ultrasound can visualize and measure the thickness of the walls in the GI tract.Treatment of Stomach and Intestinal Ulcers in Dogs Removal of any underlying cause (drugs, toxicities, cancer) is the priority in treating dogs with ulcers. Dogs with stomach ulcers may require hospitalization and supportive care, depending on the severity. Clinically sick dogs and those with perforated ulcers require intensive nursing care. These animals may require: Blood transfusions IV fluid support Emergency surgery Antibiotics and pain medicationsPartial-thickness, non-perforating ulcers may be treated on an outpatient basis. These dogs will require a bland diet and gastroprotectant medications. Common GI medications include: Sucralfate protects the mucosa by coating the ulcer. It can also stimulate ulcer healing. H2 receptor antagonists block receptors in the stomach to decrease gastric acid secretion. The most well-known H2 receptor antagonist is Pepcid (famotidine). Proton pump inhibitors are generally regarded as superior to H2 receptor antagonists to prevent ulcerations. Omeprazole, pantoprazole, lansoprazole, and esomeprazole are all options in this drug family. Prostaglandin E analogs, like Misoprostol (Cytotec) works by increasing mucosal protection by decreasing gastric acid secretion. Some veterinarians will use this drug to prevent ulcers in animals with chronic NSAID therapy. Dogs may require a long-term diet change. However, if the underlying cause is removed, they may return to normal life. Common diet recommendations include: Purina EN Line Royal Canin GI Line Hill’s i/d Line Surgical therapy may also be considered if an ulcer has perforated, or if cancer is present. Recovery and Management of Stomach and Intestinal Ulcers in Dogs The prognosis for dogs with gastrointestinal ulcers is typically good and based on underlying causes and response to treatment. Perforated ulcers are more serious, and the prognosis is guarded. Less complicated forms of ulcers should show signs of improvement within 5 to 7 days. Depending on the cause, some dogs may be at risk for future ulcerations. These dogs may be placed on specialized gastrointestinal diets and may remain on ulcer-preventative drugs. Dogs on chronic NSAID therapy may benefit from receiving their NSAID with food, in addition to preventative GI medications."}]