[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Pooping Blood?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Blood-in-dog-poop-136442117.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Blood-in-dog-poop-136442117.jpg"}, "author": {"@type": "Person", "name": "Christina Fernandez, DVM, DACVECC", "url": "https://www.petmd.com/author/dr-christina-fernandez"}, "keywords": "Dog, Symptom Checker, Blood in Stool", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/why-is-my-dog-pooping-blood"}, "datePublished": "November 3, 2020", "dateModified": "October 7, 2023", "description": "Dr. Christina Fernandez explains why your dog may be pooping blood, what to do about it, and how your veterinarian may treat it.", "articleBody": "As gross as it may seem, we all check out our dog’s poop. And, actually, checking your dog’s poop is a really good habit to get into. Dog poop (or “stool”) can tell us a lot about a dog’s health. Changes in color, consistency, and frequency of your dog’s poop can be one of the first signs of illness. One of the most concerning changes you may notice is blood in your dog’s poop. If your dog is pooping blood, it’s helpful to have an idea of what might have caused it and to know what to do. Why Is Your Dog Pooping Blood? Seeing blood in your dog’s poop is alarming, and it can be caused by many different things. Eating Something Bad or a Switching to a New Food Bloody poop can be a consequence of something affecting your dog’s digestive tract (this can occur anywhere in the stomach, small intestine, colon, or anal region). Common conditions affecting the digestive tract (GI tract) include inflammation that’s called “gastroenteritis,” or “hemorrhagic gastroenteritis” when blood is also present. Either of these can occur when your dog has eaten something he or she should not have. This can include non-food items, such as: Bones Sticks Toys Toxins Garbage It can also occur when dietary changes have been made, such as when a new food, treat, or chew toy is introduced, or when your dog has eaten another pet’s food. Infections, Parasites, or Cancer That Affects the GI Tract  Other conditions that can affect the digestive tract, leading to bloody poop, include: Infections (bacteria or viruses such as parvovirus) Parasites (intestinal worms, coccidia, giardia) Cancer, in some cases Pancreatitis (inflammation of the pancreas) Diseases or Issues That Affect Blood Clotting  Bloody poop can also be seen with conditions “outside” the digestive tract. This may include issues that affect normal blood clotting, such as: Bleeding disorders Toxins Liver disease Kidney disease Diseases of the immune system Hormonal disorders Cancer What Does Blood in a Dog’s Poop Look Like? Bloody stool can appear several different ways. The color and appearance of the blood helps determine which part of the digestive tract the blood is coming from. Hematochezia: Bright Red Blood in a Dog’s Poop “Hematochezia” is the term used to describe when there is bright red blood in a dog’s poop. In this case, the blood is bright red because it is coming from the lower part of the digestive tract (colon or anus and rectum). It is also bright red because it has not gone through the entire digestive process and typically looks “fresh” when it exits the body. When hematochezia is seen, it often accompanies diarrhea and will have a red-tinged appearance. The dog will likely go to the bathroom with increased frequency and may have a larger volume of stool. The consistency can range from a soft, formed texture to complete liquid. Sometimes formed stool will also be covered in mucus, and the blood will appear to be on the outside of the poop. This also indicates an issue with the lower part of the digestive tract, such as the colon.   Dog stool with blood (Photo credit: Nikki Naser)Melena in Dogs: Black and Tarry Poop In the case where blood comes from the upper part of the digestive tract (the stomach or small intestine), it will appear dark to almost black and tarry. Some pet parents are not aware that dark stool can actually mean the presence of blood. This is called “melena.” Melena in dogs can occur with any condition that affects the stomach or upper part of the intestine, including inflammation, ulcers, and cancer. With melena, a dog’s poop usually looks more solid. Dog Is Pooping Pure Blood It is also important to note that in some cases, you may see your dog pass only blood with no poop. If the stool is liquid, or the gut is empty, blood may be all that comes out. Dog stool that is pure blood (Photo credit: Nikki Naser)What To Do if Your Dog Is Pooping Blood If you think your dog has bloody poop, the best thing to do is to call a veterinarian for advice. In some cases, a conversation over the phone can help determine whether your dog needs to see his vet. At-Home Care There are some instances when at-home care may be appropriate. For instance, eating colored foods such as beets or red-dyed treats can give the false appearance of blood in a dog’s stool. Think about all of the things your dog may have been exposed to or given in previous days. This will help you and your vet determine the next best steps. When to Go to the Vet If your dog starts pooping blood and also displays any of these symptoms, take them to the vet: Seeming weak or lethargic Has pale gums (white or pale pink instead of a normal salmon pink color) Vomiting Pushing to have a bowel movement and little to nothing comes out (tenesmus) Refusing food or water Becoming unresponsive This could be a sign of shock and disease that is more serious.  What Is the Treatment for a Dog That&#039;s Pooping Blood? Because there are several reasons why a dog might poop blood, the treatment will depend on the presumed cause. After examining your dog, the veterinarian will provide a list of possible causes. They might need to do blood, urine, and poop testing, as well as X-rays or an ultrasound, to identify the cause. Treating Digestive Tract Upset In the case of simple digestive tract upset due to dietary changes or inflammation, a veterinarian may prescribe an easily digestible (bland) diet and medications to support your dog’s gut. Medications may include probiotics, antibiotics, antacids, or other medications. Treating Dehydration If your dog appears dehydrated, your vet may also recommend giving your dog fluids. In the case of mild dehydration, your vet may give fluids under the skin and send your dog home for further care. In more severe cases, intravenous fluid therapy may be required, along with hospitalization for monitoring and more intensive support. What if Your Dog Is Pooping Blood and Vomiting? If your dog is passing blood in their stool and vomiting, see a veterinarian as soon as possible. Loss of fluid through vomiting along with blood and fluid in the stool can lead to serious and life-threatening dehydration. This can also be a sign of a more serious underlying disease. Can My Dog Die From Pooping Blood? Yes, if the loss of blood through the digestive tract is significant, or it’s combined with significant loss of fluid through vomiting or diarrhea, it can be life-threatening. Severe dehydration and loss of blood (leading to anemia) can lead to serious consequences for your pet. This can include shock, having difficulty breathing, internal organ damage, and death if it goes untreated. It is always best to check with a veterinarian if you are unsure of the status of your dog. Image via Soloviova Liudmyla/Shutterstock"}]