[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Yellow Skin (Jaundice) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/yellow-skin-jaundice-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/yellow-skin-jaundice-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_jaundice"}, "datePublished": "March 28, 2010", "dateModified": "August 16, 2022", "description": "The term icterus (or jaundice) denotes a yellow discoloration of mucous membranes of the gums, nostrils, genitals, and other areas due to a high concentration of bilirubin, a normal bile pigment formed as a result of a breakdown of hemoglobin present in red blood cells (RBCs).", "articleBody": "Icterus in Dogs The term icterus (or jaundice) denotes a yellow discoloration of mucous membranes of the gums, nostrils, genitals, and other areas due to a high concentration of bilirubin, a normal bile pigment formed as a result of a breakdown of hemoglobin present in red blood cells (RBCs). If there is an increased rate of RBC breakdown, as occurs in some diseases, abnormally high levels of bilirubin will form. These high levels of bilirubin cannot be excreted at a normal rate, and thus, accumulates in tissues. Bilirubin levels may also increase in conditions where normal excretion of bilirubin is hampered due to some disease (e.g., cholestasis), in which bile cannot flow from the liver to the duodenum (first section of intestine) due to some mechanical obstruction or neoplasia. Higher concentrations of bilirubin are toxic and may cause discoloration of the skin (i.e., jaundice), liver and kidney injury, and may also affect brain tissue. All breeds of dogs can be affected. Symptoms and Types VomitingDiarrheaLethargyFeverAbdominal painLoss of appetite (anorexia)PalenessYellowish discoloration of the skinChange in color of urine and feces (orange colored)Increased frequency (polyuria) and volume of urineIncreased thirst (polydipsia) and consumption of waterMental confusion in advanced casesWeight lossBleeding (especially in dogs with advanced liver disease)Causes Diseases, toxins, drugs leading to increased destruction of RBCsIncompatible blood transfusionSystemic infections impairing processing of bilirubin in liverCollection of large volume of blood inside body cavityInflammation of liver (hepatitis)TumorsCirrhosisMassive damage to liver tissue (e.g., due to toxins)Obstruction in secretion of bilirubin due inflammation of pancreas, presence of tumor, stones, or parasites.Diagnosis Your dog’s veterinarian will take a detailed history from you and perform a complete physical examination on your dog. Routine laboratory tests including: complete blood count, biochemistry profile and urinalysis will be conducted. These tests will reveal very valuable information for the initial diagnosis. Complete blood count tests may reveal changes in RBC structures, changes pertaining to underlying infections like severe anemia, blood parasites, and abnormally low levels of platelets (cells responsible for blood clotting). The biochemistry profile, meanwhile, may reveal abnormally high levels of liver enzymes pertaining to liver injury. And urinalysis will show abnormally high levels of bilirubin in urine. There are more specific tests available for further diagnosis, including underlying causes. Radiographic studies will help in the determination of structure and size of the liver, which is the central organ of importance in this disease. These X-rays often find the liver enlarged, reveal the presence of a mass or tumor, the enlargement of the spleen in some cases, and foreign bodies. Thoracic X-rays may reveal metastasis if a tumor is the cause. Ultrasound will also be performed, enabling your veterinarian to evaluate the liver structure in detail, helping to distinguish liver disease from an obstruction of biliary tract, as well as differentiating a tumor from a mechanical obstruction. Additionally, the veterinarian may decide to take a sample of liver tissue with the aid of ultrasound for a more detailed evaluation. Liver tissue samples may be taken through a needle or during surgery, which may be performed for confirmatory diagnosis and treatment.  Treatment Treatment largely depends on the underlying cause and is highly individualized. Dogs with serious or advanced disease might need to be hospitalized for initial intensive care and treatment. A nutritionally balanced diet is given according to daily energy requirements and disease status. Vitamin supplementation is also recommended in affected patients. Some cases may require surgery, like those with obstruction of the biliary tract, and a blood transfusion may be required if severe anemia is present. Living and Management Prognosis of this disease largely depends on the underlying cause and treatment offered. However, proper diet, timely administration of medicines, complete rest, and regular monitoring will help your dog throughout the healing process. Do not give any drug or modify dosage without the expressed approval of your dog&#039;s veterinarian, especially painkillers, which may prove to be toxic for the liver in this condition. Because the liver is the central organ for metabolism, toxicity may occur in cases of liver impairment. Dogs with liver failure need an extremely high level of care at home due to the inherent instability of this condition. These animals may bleed at any time. If you see your pet bleeding, immediately call your veterinarian for help. In addition, advise your veterinarian should the dog&#039;s feces or urine change color."}]