[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vascular Ring Anomalies in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/c_dg_vascular_ring_anomalies"}, "datePublished": "December 19, 2012", "dateModified": "August 16, 2022", "description": "Vascular ring anomalies occurs when a congenital heart abnormality causes the esophagus to become compressed. Learn why and how to treat it.", "articleBody": "Persistent Right Aortic Arch in Dogs Vascular ring anomalies occur when a congenital abnormality of the heart&#039;s blood vessels result in the esophagus being compressed at the level of the base of the heart. This, in turn, prevents solid food from being able to pass properly past the compression as well as the dilatation of the esophagus in front of the compressed area. This is termed megaesophagus. Because food is not moved properly through the esophagus, regurgitation occurs. Symptoms and Types German Shepherds, Irish Setters, and Boston Terriers are most commonly affected by vascular ring anomalies. Symptoms of the condition include:     Regurgitation of      undigested solid food in young dogs (less than 6 months of age)    Malnourishment    Aspiration pneumonia      resulting in coughing, increased heart rate and heavy breathingTime between eating and regurgitation varies. Causes The cause for vascular ring anomalies in dogs is a developmental congenital abnormality. Diagnosis A thorough physical examination and routine blood testing is usually performed. However, imaging is usually necessary for accurate diagnosis. Imaging may include thoracic radiographs (X-rays), contrast esophagography (usually performed with barium), fluoroscopy and/or angiography.   Treatment Dogs with aspiration pneumonia may require antibiotics and possibly oxygen supplementation. Surgery to repair the vascular entrapment is indicated. However, the esophagus may be permanently compromised resulting from the entrapment itself, especially if surgical intervention does not take place early enough. In these cases, specialized feeding for megaesophagus (i.e. placing food on an elevated surface or feeding with the dog sitting upright, feeding food processed into a slurry) may be necessary indefinitely."}]