[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can a dog’s dislocated hip heal on its own?", "acceptedAnswer": {"@type": "Answer", "text": "You should NOT wait for your dog’s dislocated hip to “heal on its own.” If the dislocation is not corrected, the body will try to stabilize the area with scar tissue.  However, this type of healing is not very strong and will not give the dog a normal range of motion. The bones might also rub on each other, causing chronic pain. You must take your dog to the emergency vet to have them put your dog’s hip back in place through closed reduction (manual repositioning) or open reduction (surgery).   "}}, {"@type": "Question", "name": "How do you know if your dog’s hip is dislocated?", "acceptedAnswer": {"@type": "Answer", "text": "If your dog is not able to walk or bear weight on a leg, and they have a history of trauma (sustained an injury like being hit by a car), it is highly likely that they have a dislocated hip. Other signs can include intense pain, the affected leg appearing shorter than the other legs, swelling of the joint, and decreased appetite or activity.  "}}, {"@type": "Question", "name": "How long does it take for a dog to recover from a dislocated hip?", "acceptedAnswer": {"@type": "Answer", "text": "Total recovery will likely take two to three months, with additional time for physical therapy. The exact recovery time will depend on the trauma that caused the dislocated hip, as well as the method used to repair it. A recovery plan will be customized by your veterinarian.  "}}, {"@type": "Question", "name": "Can a dog walk with a dislocated hip?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs will not walk on a leg with a dislocated hip and will instead carry the leg.   "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dislocated Hip in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/boston-terrier-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/boston-terrier-dog.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/dislocated-hip-dogs"}, "datePublished": "October 21, 2021", "dateModified": "August 12, 2022", "description": "Dr. Veronica Higgs describes the painful condition of hip luxation in dogs, including what to do if your dog dislocated their hip, and the procedures and surgeries to correct it.", "articleBody": "What Is a Dislocated Hip in Dogs? When a dog has a dislocated hip, also known as a coxofemoral luxation, the ball part of the joint comes out of the socket. Dislocation disrupts and can damage the joint capsule (an outer layer of tough fibrous tissue that stabilizes the hip joint), in addition to the ligaments, muscle, and bones of the hip.    Symptoms of a Dislocated Hip in Dogs Dislocated hips in dogs are extremely painful. Dogs typically cannot bear weight on their back leg, often limping and carrying it so it will not touch the ground. The affected leg may appear shorter than the others. The hip joint may also look swollen and be warm to the touch.    Causes of a Dislocated Hip in Dogs A dislocated hip in dogs is most commonly caused by trauma, such as being hit by a car. However, degenerative joint disease (arthritis or osteoarthritis), Legg-Calve-Perthes disease (or avascular necrosis of the femoral head), or hip dysplasia (malformation of the hip socket) also increases the risk.    How Vets Diagnose Hip Luxation in Dogs Often there is a history of trauma or injury that makes a veterinarian suspicious of a hip luxation in dogs. These dogs are x-rayed to check the positioning of their hips and confirm the luxation.  In most cases, the bone slides forward and up (craniodorsal displacement), but the opposite can happen (ventrocaudal displacement). Knowing the position of the bones helps your vet correct the problem.  X-rays also provide additional information about the hip status that can be important in selecting therapy. One example is when you have fractures of the pelvis or leg that would interfere with correcting the dog’s hip luxation.  Sometimes when ligaments tear during hip luxation in dogs, a bone chip can come off as well. If the luxated hip were popped into place with a bone chip in the joint, this would cause painful bone-on-bone grinding. Instead, the bone chip should be surgically trimmed.  Another helpful piece of information found in the x-ray is if your dog has hip dysplasia (a malformation of the hip socket, making it too shallow to support the ball of the hip) or Legg-Calve-Perthes disease, a condition in which disrupted blood flow to the femur where it meets the pelvis leads to death of the bone cells.           These cases warrant special consideration because manual joint replacement is unlikely to be successful, which means surgical correction is most likely needed.  Treatment for Dislocated Hips in Dogs If you suspect that your dog has dislocated their hip, take them immediately to the emergency vet.  There are two main approaches to correcting a dog’s dislocated hip: closed reduction (nonsurgical) and open reduction (surgical).  Closed Reduction   Closed reduction is the nonsurgical technique that a veterinarian uses to put your dog’s hip back in place manually. It is referred to as closed because you are not “opening” the joint with surgery.  To have the best chance of success with a closed reduction, the vet will make sure that your dog’s hip appears as normal as possible aside from the dislocation, meaning no fractures and minimal hip dysplasia.   To further maximize the chances of success, the closed reduction should be attempted as soon as possible after the dislocation. If you wait any longer than one or two days, muscle contraction will occur that makes the reduction procedure much more difficult.   Since this procedure is painful and the muscles need to be relaxed, it needs to be attempted under general anesthesia. The dog’s femoral head, the highest part of the thigh bone, is manipulated back into the joint manually and then X-rayed to confirm it is in place.  Once the hip joint is restored, a special support called an Ehmer sling is placed. The sling prevents your dog from using the leg and provides an angle that encourages the hip to remain in place.   Your dog needs to wear the sling for 10-14 days at home with frequent rechecks with your veterinarian, and be confined to a crate for an additional two to four weeks afterward.  If successful, a closed reduction is a good noninvasive option. However, closed reductions to correct hip dislocation in dogs are only successful 50% of the time – meaning that the other 50% of the time, the hip will pop back out, and surgery will be needed.   Still, most veterinarians agree it is worth the effort to attempt closed reduction for a dog’s hip luxation before jumping to surgery.    Open Reduction  If closed reduction fails or is deemed inadvisable because of trauma, fractures, or hip dysplasia, the vet will need to perform an open reduction. This means surgery to put your dog’s hip back into its normal position and stabilize it.  There are several techniques to accomplish this. The simplest approach to an open reduction is when the hip luxation only created a small tear in the joint capsule. The hip can be put back into place and the joint capsule can be sewn back together.  However, in cases where the joint capsule is too damaged, the joint may need to be reconstructed with a toggle pin or other implant to keep the femur in place. Each case is different, so the veterinary surgeon will decide the best approach for your dog.   Post-operation, an Ehmer sling will likely be applied for approximately one week, followed by a few weeks to months of crate confinement and physical therapy.  The success rate for open reduction is 85-90%, with a good range of motion and return to normal activity expected.    There are cases, however, where open reduction is not an option for treating a dog’s dislocated hip because of existing arthritis, severe hip dysplasia, or severe trauma to the area. In these situations, restoration of the normal hip joint is not possible, so the surgeon may need to do a femoral head osteotomy (FHO).  This procedure eliminates the pain involved with bone-on-bone contact by removing the femoral head (ball) altogether. In this case, a false joint will develop in the soft tissues, allowing nearly normal function of the leg.  This technique will also require post-operative crate rest followed by physical therapy, but it does eliminate the risk of recurrent dislocation or the complications associated with implants.    Recovery and Management of Hip Luxation in Dogs Post-operative care will be based largely on how your dog was injured to cause the hip luxation (for example, if the dog was hit by a car). However, most recovery will include time spent in an Ehmer sling and crate rest, followed by physical therapy.   Typical recovery can involve up to six to eight weeks of restricted activity. Your veterinarian will customize a recovery plan for your dog.  Initially, your vet will likely prescribe anti-inflammatory medications to reduce pain and swelling, but in the long run, a joint supplement will be recommended to help maintain joint health and combat arthritis.   Another important aspect of long-term recovery from hip luxation in dogs is weight management, as obesity can exacerbate joint disease and pain.  The most significant short-term complications are dislocating the hip again; implant issues such as loosening, fracture, or nerve damage; and infections. You must use caution while your dog is in recovery to ensure your dog is properly restricted and does not slip and fall.   If your dog seems to be in pain or not able to walk or uncomfortable during recovery, you should have them reexamined by their vet immediately to ensure the hip has not moved out of place.  "}]