[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How do you tell the difference between a cyst and a tumor on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "A cyst and a tumor are differentiated by a fine needle aspirate or biopsy. Cysts are usually filled with fluid or waxy debris, whereas tumors are usually more solid."}}, {"@type": "Question", "name": "Can dogs live with mast cell tumors?", "acceptedAnswer": {"@type": "Answer", "text": "Mast cell tumors that are low-grade may be present for years without being detected. Mast cell tumors can look like just about any other type of tumor, so a fine needle aspirate is needed to help diagnose them. High-grade mast cell tumors can spread, invade healthy tissue, and may be fatal in the long term. The only way to determine a high-grade versus a low-grade mast cell tumor is through removal and testing with a pathologist."}}, {"@type": "Question", "name": "What does a tumor look like on a dog? What does a benign tumor look like on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Tumors can present in lots of different ways on your dog: a lump or bump on the skin, a change in coloration, or even a change in the consistency of the skin. Tumors are frequently found on routine physical exam by your veterinarian, which is one of the many reasons you should have your dog checked by the vet regularly. The only way to determine whether a mass is benign or malignant is to take a sample of the tumor for testing."}}, {"@type": "Question", "name": "Are cancerous tumors in dogs hard or soft?", "acceptedAnswer": {"@type": "Answer", "text": "Cancerous or malignant tumors can be hard or soft. The feel of a mass and whether it bothers your dog has little to do with whether it is cancerous or not."}}, {"@type": "Question", "name": "How can you tell the difference between a tumor and a fatty tumor on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "The only sure way to determine whether a tumor is a fatty tumor (lipoma) or something else is with a fine needle aspirate or biopsy. Lipomas are very common in dogs, and while it can be tempting to diagnose them based on feel, this can end up missing a more dangerous diagnosis. Any new lump or bump on your dog should be checked by your veterinarian."}}, {"@type": "Question", "name": "What do skin tumors look like on dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Skin tumors in dogs can come in all shapes, sizes, and colors. The bumps vets get more concerned about are ones that are in the skin layer versus on top of it like a skin tag or wart-like growth common in older dogs."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Tumors", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/senior-golden-retriever.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/senior-golden-retriever.jpg"}, "author": {"@type": "Person", "name": "Laura Dayton, DVM", "url": "https://www.petmd.com/author/dr-laura-dayton"}, "keywords": "Dog, Cancer, Symptom Checker, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/dog-tumors"}, "datePublished": "October 21, 2021", "dateModified": "September 12, 2023", "description": "Dr. Laura Dayton explains the different types of malignant and benign tumors in dogs, including symptoms to look for and how they are treated.", "articleBody": "What Are Dog Tumors? Tumors occur when a cell continues to multiply out of control instead of following the natural cycle that ends in cell death. There are two broad categories of tumors: benign and malignant. Benign tumors lack the ability to spread or invade other healthy tissue. Although they may need medical attention, these are not cancerous. Malignant tumors, or cancers, spread to other organs and tissues in a process called metastasis. Depending on the type of tumor and how aggressive it is, cancers can pose serious health risks for your dog. To determine how dangerous a tumor is, the best place to start is with a vet visit.  Types of Common Dog Tumors Although cancer can occur in many organs and tissues, the following are the most common types of tumors in dogs.  Mast Cell Tumor Mast cell tumors are malignant tumors that occur in the mast cells in a dog’s skin. Normal mast cells are a type of immune system cell. They play a role in allergic reactions, such as hives and bug bites. Mast cell tumors may look like a lot of different things, including a simple pimple or cyst. They can also mimic benign tumors such as lipomas. Lymphoma Lymphoma is a malignant cancer that arises from white blood cells called lymphocytes. Normal lymphocytes are an important part of a dog&#039;s immune system. A classic sign of lymphoma is large, firm lymph nodes, usually found around the jaw, in front of the shoulder, or in the back of the knees. Dogs with lymphoma can also be lethargic or lack interest in food. Lipoma Lipomas are benign growths arising from fat cells. They are typically found in subcutaneous fat (the fatty layer just under a dog’s skin). The malignant form of this tumor is called liposarcoma and is less common. Lipomas are extremely common and can sometimes get very large. They are usually a cosmetic issue (pet parents may not love the look of a lumpy, bumpy pup), but they can sometimes cause problems if they are in a bad location. For example, a large lipoma located under a dog’s leg can cause trouble walking. Osteosarcoma Osteosarcoma is a type of malignant cancer that arises from bone cells. Osteosarcomas are often painful and can result in bone fractures, limb swelling, and lameness. Histiocytoma These benign tumors arise from histiocytes in the skin. Histiocytes are a type of immune system cell that helps fight infection. They will frequently regress and resolve on their own within a few weeks. Sometimes they can become flat, ulcerated, or red across the top, which has earned them the nickname &quot;button tumors.&quot; Histiocytoma is common in young dogs (typically less than 2 years of age). Hemangiosarcoma Hemangiosarcoma is a malignant tumor that arises from the cells that line blood vessels. They can pop up anywhere but are most common in a dog’s spleen, heart, and skin. These tumors are often diagnosed when they rupture, which is an emergency situation that results in internal bleeding. Melanoma Melanoma is a type of malignant tumor that arises from pigment-carrying cells in the skin called melanocytes. Melanomas in dogs can often be pink or non-pigmented. They can also be flat rather than raised. Most melanomas in dogs occur in the oral cavity (e.g., oral melanoma) but can also be found in the eye, nail bed, or skin. Oral Melanoma Oral melanomas are melanomas that grow in a dog’s mouth. They are the most common type of oral tumor in dogs, followed by fibrosarcoma and squamous cell carcinoma. These tumors can be raised or flat and darkly pigmented or pink. You may see them on your dog or you may notice that your dog has bad breath, which is a symptom. They can also be found in routine exams by your veterinarian. Oral melanomas are highly malignant and have often already spread once they are found. Papilloma Papillomas, also called warts, are benign tumors caused by the canine papillomavirus. The virus is shared via contact from one dog to another. They are common in dogs that play in doggy playgroups, dog parks, or daycares and often occur on the lips, tongue, throat, or gums, although they may appear in other locations as well. This virus is species-specific and cannot infect you or any other type of animal in your house. Papillomas will typically resolve on their own within a few weeks. Mammary Gland Carcinoma Mammary gland carcinomas are tumors that arise from the mammary or breast tissue of dogs. These tumors most frequently occur in dogs that are not spayed or were spayed after their second heat cycle. About 50% of mammary gland carcinomas are benign when they are discovered, but this determination can only be made by a pathologist after removal. Thyroid Carcinoma Thyroid carcinomas are tumors that arise from thyroid cells in the thyroid gland, which is located in a dog’s throat. These tumors can be diagnosed by finding a swelling under the skin but are sadly often only found when evidence of spread is noted in other organs. Symptoms of Dog Tumors  The symptoms of a tumor vary based on the type of tumor, location, and whether the tumor is benign or malignant. Tumors in the brain may cause seizures, changes in behavior, or circling. Mast cell tumors have symptoms related to histamine release: swelling, bleeding or difficulty clotting, and vomiting. Tumors associated with the liver can cause increased liver values on lab work. Some types of cancers have symptoms or changes associated with them, called paraneoplastic syndrome. Paraneoplastic syndrome is caused when tumors excrete hormones or hormone-like substances, or when the dog’s immune system reacts to the tumor and causes symptoms not related to the cancer. Paraneoplastic syndrome can show up on lab work and in noticeable physical changes in your dog. These symptoms may be the first indication that cancer is present. Symptoms can include altered reflexes, weakness, and partial paralysis, among others. For example, elevated calcium levels are associated with lymphosarcoma. You may notice your dog drinking more water than normal, or sometimes the elevation can be found on routine lab work. Some tumors consume blood cells and can be associated with anemias (low red blood cells), low white blood cells, and/or low platelets. Others can cause the opposite. Causes of Dog Tumors The cause of cancer in dogs can be complex. Ultimately, cancer is the result of damage to the cells of the body. Cells grow, divide, perform their job, and ultimately die and are replaced by new cells to keep the body going. However, sometimes the DNA within the cell can become damaged, causing a cell to mutate or divide incorrectly. The body has a lot of checks and balances to correct or destroy mutated cells, but if a mutated cell is left in the body it may continue to grow into a tumor or cancer. Damage to the cells may be triggered by many factors, or more likely a combination of factors. Here are some possible contributing factors: Genetics: Some types of tumors occur more frequently in certain breeds, such as Golden Retrievers, Boxers, Bernese Mountain Dogs, and Rottweilers. This suggests a possible hereditary or genetic component, but more research is needed to better define which dogs are at risk of developing specific cancers. Age: Cancer occurs more frequently in older pets. The exact link between cancer and age is not fully understood, but it’s believed to be linked to a weakening immune system as pets age. As bodies age, it becomes more likely that a mutated cell will get past the body’s defense mechanisms and result in cancer.  Environment: Environmental hazards or chemicals can increase the risk of cancer in people—and the pets that live with them. Some examples include a variety of herbicides, pesticides, and other chemicals. Substances such as nickel, uranium, radiation, and asbestos have all been shown to be carcinogens. Prolonged exposure to the sun and UV light may result in higher cancer risks.  Ongoing research will hopefully provide more information and treatment options in the future. What To Do if You Find a Lump on Your Dog If you find a lump or bump on your dog, don’t panic. Schedule an appointment with your vet to get the growth checked out. It’s helpful to take note of when you first noticed it, where it’s located, if it has changed (such as gotten bigger or firmer), and whether or not your pet is licking or chewing at it. Measuring the mass with a tape measure or taking a photo may even be helpful.  How Vets Diagnose Tumors in Dogs Your veterinarian cannot diagnose a tumor is by looking at or feeling it. They won’t be able to give you a definitive diagnosis without sampling. Fine Needle Aspirate Often, the first step to identifying what kind of growth your pet has is through a fine needle aspirate (FNA). This procedure involves inserting a needle into the mass to obtain a sample of the cells. The needle is typically the same size or even smaller than a needle used to draw blood on pets and is a relatively quick and easy procedure.  Your veterinarian will put the cells on a slide and likely send it to the laboratory for evaluation. This will hopefully give them an idea of what kind of growth your pet has.  If the tumor is on an internal organ such as the liver or spleen, a fine needle aspirate with ultrasound guidance may be recommended. The limitations of a fine needle aspirate are that the vet is only to get a sample of cells, so sometimes there isn’t enough information for the pathologist at the laboratory to determine the type of growth. Also, if a cancer is diagnosed, the vet may need additional information to determine the best treatment options. Biopsy If the fine needle aspirate was inconclusive if additional information about the tumor is needed, a biopsy may be suggested. A biopsy can be excisional (the entire tumor) or incisional (a small portion of the tumor). The procedure will typically require general anesthesia, but it can provide more information to help with diagnosis and can sometimes remove the tumor completely.  For tumors of the stomach, intestines or colon, the biopsy may be performed with an endoscope (a camera placed in the mouth or rectum). If the tumor is on an internal organ such as the liver or spleen and additional sampling is needed, a surgical procedure (exploratory laparotomy) may be performed. Treatment for Tumors in Dogs Canine tumors are staged somewhat differently than human tumors. Depending on the type of tumor, they may be staged numerically with Roman numbers ranging from 0 to IV. A higher number means the cancer has spread further. Other types of tumors are graded differently. Different types of cancer have different treatments. The treatment recommended for a dog’s tumor depends on several factors: How aggressive you want to be with treatment Whether the tumor is one that typically spreads to other organs or stays locally invasive How advanced or large the tumor is (the stage) How serious the tumor-related symptoms are Treatment options include surgical removal, radiation, immunotherapy, and chemotherapy. Recovery and Management of Tumors in Dogs Some types of dog tumors can be cured. These are usually tumors that are locally invasive and can be completely removed surgically. Types of cancer that spread or metastasize to other parts of your dog’s body can be managed with treatment but are, unfortunately, not usually curable. The good news is that cancer treatment in dogs is often well tolerated with minimal side effects. For example, chemotherapy in dogs does not typically cause hair loss and has only mild gastrointestinal side effects. You can even administer some chemotherapeutic drugs at home, which decreases stress for your pet. When your pet is diagnosed with cancer, it’s best to get as much information as possible before you start making decisions. A consult with a veterinary oncologist can help provide answers around your dog’s possible outcomes and what to expect. They can explain treatment options in terms of what each one means as far as longevity and quality of life for your pet. Even if you ultimately choose not to proceed with chemotherapy or radiation, the more knowledge you are equipped with, the more at peace you will be with your decisions."}]