[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Flu (Canine Influenza) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1430605092.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1430605092.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/dog-flu-canine-influenza-dogs"}, "datePublished": "February 10, 2023", "dateModified": "February 10, 2023", "description": "Dr. Michael Kearley explains dog flu or canine influenza in dogs including symptoms, treatment options, and how the dog flu vaccine works.", "articleBody": "What Is Dog Flu (Canine Influenza)? Canine influenza virus (CIV), commonly referred to as “dog flu,” is a highly contagious respiratory virus that affects dogs of all ages and breeds. Although dog flu has been discovered in most of the United States, fortunately it doesn’t commonly cause death in dogs and, for many, won’t even necessitate a trip to the veterinarian. CIV is caused by two different types of influenza viruses: H3N2 and H3N8. Both were originally a flu virus affecting other canine species, birds, and equines that now also affects dogs. H3N2 can affect cats as well, but neither virus has been reported to affect humans.   Symptoms of Dog Flu in Dogs Because this is a respiratory virus, your dog will experience symptoms associated with respiratory disease and common flu-like symptoms, such as: Dry cough, which often persists for weeks Fever Nasal and eye discharge Sneezing Decreased appetite Lethargy or decreased energyIn severe cases, your dog may experience secondary bacterial infections, high fever (&gt;103.5 F), and even pneumonia, which can be life-threatening. CIV is extremely contagious to other dogs. Studies have shown that the virus can travel up to 20 feet in dogs’ respiratory droplets when they sneeze or cough. This is the primary route of infection, but dogs can also become infected with the virus through contaminated food and water bowls, shared toys, leashes, etc., as well as through clothing and indirectly through human contact (i.e., handling an infected dog and then touching/playing with other dogs). Once infected, it takes a few days before dogs begin to show signs, and they are considered contagious for about four weeks. Even though any dog can become infected, dogs originating from shelters. Causes of Dog Flu in Dogs CIV belongs to the group of influenza A viruses, which are broken down into types based on their proteins hemagglutinin (H) and neuraminidase (N). Usually, they are specific to a single species, but over time—through mutations and other changes—they can affect other animals. H3N8 and H3N2, the types of influenza viruses seen in dogs, are prime examples. The H3N8 virus was originally found in horses and discovered in the United States dog population in 2004. The H3N2 virus was first discovered in the United States in 2015 and seemed to have originated from the Asian bird population. Fortunately, it has yet to be shown that humans can become infected with the dog flu or vice versa.  How Veterinarians Diagnose Dog Flu in Dogs Symptoms will resemble many other types of respiratory infections, so it is important that your dog be tested so treatment can be directed appropriately. For CIV, a PCR panel is often performed, where a swab is obtained from your dog’s nose, conjunctiva, or pharynx, then submitted to a laboratory and analyzed for viral DNA. Additional testing such as bloodwork and chest radiographs are often recommended to evaluate your dog’s general health and hydration status, and to look for evidence of pneumonia, which can be life-threatening and should be treated aggressively.  Call your veterinarian prior to arrival to let them know that your dog is experiencing flu-like symptoms, as there are protocols and procedures that need to be followed to mitigate transmission to other dogs. Treatment of Dog Flu in Dogs Treatment of CIV in dogs is largely supportive. Keeping your dog calm, rested, and hydrated is paramount to ensuring a speedy recovery. In the hospital, this may include IV fluids, cough suppressants, and nutritional support. For cases involving secondary bacterial infection, an antibiotic such as clavamox or doxycycline, among others, is often prescribed.  Infected dogs should be isolated from other dogs (and cats) at the onset of symptoms and for the following 4 weeks. This means no dog parks, boarding, grooming, and so on. And because the virus can be transmitted from clothing, pet parents should also refrain from interacting with other dogs (and cats) during this period.  Recovery and Management of Dog Flu in Dogs Fortunately, many dogs recover from CIV uneventfully within a few weeks and have little to no lasting complications. Your dog may have a cough that lasts during this period as well. Younger or older dogs, or dogs that are immunocompromised, may experience more severe symptoms such as pneumonia and may even die from the disease. To ensure the best outcome possible, it is important to seek veterinary attention at the first sign that your dog is sick.  Prevention of Dog Flu in Dogs Fortunately, there is a vaccine for dogs designed to protect against both strains of CIV. Nobivac and Zoetis both manufacture the vaccine, which can be given to puppies as young as 7 or 8 weeks of age, with a booster 3 weeks later and annually thereafter. Side effects are rare and include symptoms associated with hypersensitivity and allergic reactions, such as vomiting, diarrhea, facial swelling, hives, and—less likely—shock and death. Not all dogs are at risk of acquiring the disease, but dogs who frequent boarding or grooming facilities, doggie daycares, dog parks, dog shows, or other competitions are at a higher risk. Speak with your veterinarian about risk factors for your dog, and the risks and benefits of vaccination. Keep in mind that vaccines may not always prevent infection but will make it less likely—and, if infected, symptoms are often milder and the course of disease shorter.  Fortunately, the influenza virus is easily killed in the environment, often with routine household cleaners like bleach and soapy water. Wash your hands and clothing before interacting with any dogs as well as in between dogs.  iStock.com/Hero Images"}]