[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can humans get ear mites from dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, humans can get ear mites from an infected dog. It’s not common, but it’s possible. More frequently, other pets in the home get infected with the ear mites from a contagious dog."}}, {"@type": "Question", "name": "What home remedy kills ear mites in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Little research has been done to examine the safety and effectiveness of home remedies for dog ear mites. Since there are so many safe and effective medications readily available, you should always see your veterinarian to prescribe a medication for treatment."}}, {"@type": "Question", "name": "Will tea tree oil kill ear mites in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Do not use tea tree oil on your dog or put it in their ear. Undiluted tea tree oil should never be given to dogs, as it can be very toxic. Although diluted tea tree oil is thought to have some antibacterial and antifungal properties, it can cause burning, stinging, and damage to an inflamed ear. Because there are safe, proven products available to treat ear mites in dogs, you should have your veterinarian prescribe one of those instead."}}, {"@type": "Question", "name": "Does hydrogen peroxide kill ear mites in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Hydrogen peroxide can be very painful when used in inflamed ears. It can also slow healing and damage sensitive tissues. Do not use hydrogen peroxide to treat dog ear mites."}}, {"@type": "Question", "name": "What medication kills ear mites in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "There are many products known to kill ear mites in dogs, including: Milbemite Acarex Tresaderm Frontline Ivermectin Selamectin Advantage Multi Simparica Bravecto Nexgard Credelio Your veterinarian can recommend the right product based on your dog’s particular needs."}}, {"@type": "Question", "name": "References", "acceptedAnswer": {"@type": "Answer", "text": "  Rothrock, K., DVM, &amp; Morgan, R., DVM, DAVIM, DACVO. (2018, April 3). Ear Mites (Zoonotic). VINcyclopedia of DiseasesBrooks, W., DVM, DABVP (2020, July 7). Ear Mites in Dogs and Cats. Veterinary Partner. Tea Tree Oil for Otitis. (2021, April 12). Veterinary Information Network, Vet Boards: Vet to Vet: Alternative Medicine.Hydrogen Peroxide Use in the Ear. (2021, April 12). Veterinary Information Network, Vet Boards: Vet to Vet: Dermatology.Featured Image: iStock/skynesher"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ear Mites in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/ear-mites-in-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/ear-mites-in-dogs.jpg"}, "author": {"@type": "Person", "name": "Amanda Simonson, DVM", "url": "https://www.petmd.com/author/dr-amanda-simonson"}, "keywords": "Dog, Symptom Checker, Ear Mites", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/ear-mites-dogs"}, "datePublished": "October 20, 2021", "dateModified": "September 12, 2023", "description": "Dr. Amanda Simonson discusses how to treat ear mites in dogs, including proper medications and why you should be wary of holistic, at-home remedies.", "articleBody": "What Are Ear Mites in Dogs? Ear mites are highly contagious parasites that live inside and around ear canals. The dog ear mite belongs to the Psoroptidae family, which is a group of parasitic mites that live on the surface of the skin rather than burrowing into it, as some types of mites do. Their scientific name is Otodectes cynotis. They tend to be less than half of a millimeter long and can be seen best under a microscope. These mites affect various species, including dogs, cats, rabbits, ferrets, and occasionally livestock. Symptoms of Ear Mites in Dogs Ear mites cause an intense itch. The most common symptoms of a dog ear mite infection include: Scratching and rubbing at the ears Shaking the head Dark discharge from the ears Hair loss, skin lesions, and secondary skin infections, which can develop around the ears, head, and neck from all the scratching and rubbing Bacterial and yeast ear infections can look like ear mite infestations. If you suspect something is up with your dog’s ears, contact your veterinarian for an exam. Causes of Ear Mites in Dogs Dogs get ear mites by being around other animals that are infested with these parasites. To understand how dogs get ear mites, it’s important to understand the mite life cycle. Adult mites lay eggs that mature into larvae, grow through two stages of nymphs, and then become adults. It takes about three weeks for an egg to become a full-grown ear mite. Adult mites can live for approximately two months. The mites feed on your dog’s ear and skin surface debris, which causes inflammation and irritation. The mite is transmitted from one animal to another through physical contact. Because ear mites are so contagious, you must treat all susceptible animals in your home simultaneously to eliminate them, even if just one pet is diagnosed. How Vets Diagnose Ear Mites A dog with an ear infection can have the same symptoms (scratching and ear discharge) as a dog with ear mites. That’s why it’s important to see your veterinarian for help with diagnosis and treatment. Making a diagnosis allows for appropriate medication for treatment. Using the wrong medication can be dangerous and/or cause discomfort to your pet—plus, it’s a waste of time and money. And if your dog’s eardrum is ruptured, only certain medications can be used, which is why seeing the vet is oh-so-important. For an official diagnosis, your veterinarian will typically look in your dog’s ears with an otoscope and take an ear swab to look for both mite eggs and adult mites under a microscope. Your vet may also run an ear cytology to rule out secondary or concurrent bacterial or yeast infections. Sometimes a skin scrape will also reveal the mite. Ear Mite Treatment for Dogs Treatment for ear mites in dogs involves both cleaning the ears and giving the dog medication. Cleaning your dog’s ear canal removes debris and buildup, allows medication to be more effective, and helps return the ear canal to normal, healthy tissue. Your vet will clean your dog’s ear and show you how to clean them yourself at home, if needed. Medication for ear mites can include: A topical product for inside the ear A topical product applied to your dog’s skin and absorbed throughout their body An oral pill Injections While some of the topical medications for your dog’s ear canal can be single-use, others must be applied daily for 7-30 days. Your veterinarian will make a medication decision based on your pet’s individual situation. Treatment also requires that all household pets receive medicine so they don’t continue to reinfect each other. Ask your veterinarian about appropriate treatments specific to each of your pets. Recovery and Management of Dog Ear Mites Most dogs make a relatively quick, uneventful recovery from ear mites, although some dogs might have an ongoing battle with the pesky mites. Veterinarians may recommend a follow-up examination to make sure that a dog’s ears are back to normal. If they’re not, the vet will provide additional treatments. Sometimes there’s residual debris in your dog’s ear canal that needs to be flushed. And if there’s also a bacterial or yeast infection, your vet may need to prescribe additional medication or a different medication to address the infection. Future ear mite infestations can also be prevented with many of the same products that are used to prevent fleas, ticks, and other types of parasites. These include:  Simparica  Nexgard  Bravecto  Revolution Credelio After treatment, continue to check your dog’s ears regularly for signs of ear mites or other problems. Look for discharge or redness within the ear canal, and headshaking or scratching around the ears."}]