[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tumor of the Thymus in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/tumor-thymus-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/tumor-thymus-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Endocrine health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_tumor_thymus"}, "datePublished": "March 1, 2010", "dateModified": "August 16, 2022", "description": "The thymus is an organ in front of the heart in the rib cage in which T lymphocytes mature and multiply.", "articleBody": "Thymoma in Dogs The thymus is an organ in front of the heart in the rib cage in which T lymphocytes mature and multiply.  A thymoma is a tumor originating from the epithelium (layer of tissue covering the thymus) of the thymus.  Thymomas are rare tumors in both cats and dogs and they are associated with myasthenia gravis.  Myasthenia gravis is a severe autoimmune disease which causes certain muscle groups to tire easily. Symptoms and Types CoughingIncreased breathing rateTrouble breathingCranial caval syndrome -- a side effect of heartworm infestation, which often leads to swelling of the head, neck, or forelimbsMyasthenia gravis, a neuromuscular disease that leads to muscle weakness, enlarged esophagus, and frequent regurgitation  Causes UnknownDiagnosis Your veterinarian will perform a complete physical exam on the patient. He/she will take a thorough history from the owner. Your veterinarian will order a biochemical profile, a complete blood count, a urinalysis and an electrolyte panel. Thoracic X-rays should definitely be taken. They may show a cranial mediastinal mass (a mass in between the lungs), pleural effusion (build-up of fluid in the lungs due to aspiration pneumonia) and megaesophagus. A blood test for antibodies to acetylcholine (a neurotransmitter causing muscles to contract) receptors should be performed so as to rule out myasthenia gravis. A Tensilon test should also be done to test for myasthenia gravis. A fine-needle aspirate of the mass will show mature lymphocytes (white blood cells) and epithelial cells (cells forming the outside layer of the thymus gland).  Treatment Patients should be hospitalized in preparation for surgery to remove the thymoma. They are highly invasive and difficult to remove in dogs. (They are easier to remove in cats.) Dogs with concurrent myasthenia gravis and aspiration pneumonia will have a poorer prognosis despite surgical resection. Twenty to thirty percent of thymomas are malignant and spread throughout the chest and/or abdomen. Living and Management If the tumor is completely surgically resectable (and has not spread), the patient will be cured.  Your veterinarian will schedule follow-up appointments every three months with you to retake thoracic x-rays of your pet in case the tumor should recur."}]