[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is the amount of xylitol that is toxic to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Hypoglycemia (low blood sugar) can occur if a dog ingests as little as 0.045 grams. (0.1gram/kilogram). Liver damage can occur by ingesting 0.11 to 0.22gram/pound. (0.25-0.5gram/kilogram). This means that as little as one piece of gum can cause xylitol poisoning in a 20-pound dog."}}, {"@type": "Question", "name": "How long does it take for xylitol poisoning to affect my dog?", "acceptedAnswer": {"@type": "Answer", "text": "Xylitol is quickly absorbed, so you may see signs as early as 30 minutes, or they could be delayed for up to 12 hours. Clinical signs of xylitol poisoning in dogs include vomiting, weakness, stumbling/loss of balance, lethargy/depression, tremors/seizures, and collapse/coma."}}, {"@type": "Question", "name": "How do I know if my dog has xylitol poisoning?", "acceptedAnswer": {"@type": "Answer", "text": "Seek emergency veterinary care if your pet has ingested a product with xylitol, or you suspect they have. Xylitol is contained in many foods and household products including baked goods, chewing gum/mint, medication, oral hygiene, and beauty products, and more. If you did not see your pet eating xylitol but notice issues such as vomiting, weakness, trouble walking, balance concerns, lethargy, seizures, collapsing, or a coma-like state, it is experiencing xylitol toxicity.  "}}, {"@type": "Question", "name": "What is the most common serious illness related to xylitol exposure in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Ingestion of xylitol can cause hypoglycemia (low blood sugar) in dogs, and at higher doses it can also lead to liver damage and even failure. The mechanism of liver damage is unknown, but it can be fatal if untreated. Featured Image: iStock.com/ArtistGNDphotography"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Xylitol Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/dog.xylitol_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/dog.xylitol_0.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_xylitol_toxicity"}, "datePublished": "August 9, 2022", "dateModified": "August 26, 2022", "description": "Dr. Veronica Higgs discusses xylitol poisoning in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Xylitol Poisoning in Dogs? Xylitol is a natural sugar alcohol, which is a type of carbohydrate that does not actually contain alcohol. It has a sweet taste and is often used as a sugar substitute. Xylitol, also known as birch sugar, is found in:   Sugar-free foods: Baked goods/desserts, peanut butter, ice cream, candy, fruit drink, drink powder, jelly/jam, cereal, pudding/Jell-O, ketchup, syrup, chewing gum, and breath mints  Medications: Cough drop, gummy vitamin, chewable vitamin, and prescription medication   Dental care products: Toothpaste and mouthwash  Beauty products: Shampoo, moisturizer, and deodorant  While xylitol may be unharmful to humans, it is toxic and potentially lethal to dogs. The difference is in the way blood sugar is controlled in the body. In both humans and dogs, blood sugar is regulated by the release of insulin from the pancreas. In dogs, xylitol triggers a large release of insulin which causes the blood sugar level to drop quickly and dangerously; this is called hypoglycemia. In humans, however, xylitol does not affect the pancreas or insulin release, so people do not experience any change in blood sugar levels.    Xylitol can also cause liver damage and even liver failure in dogs. It is unknown how this happens, but it appears to depend on how much xylitol your dog consumes.   Xylitol’s toxic effects are not yet reported in cats. Scientists, however, are not in agreement that cats are completely clear from the effects of xylitol poisoning, so for now it is best to keep xylitol products away from all your furry pets.   If your dog ingests xylitol, you should take it immediately to a local veterinary emergency hospital for evaluation and treatment. Symptoms of Xylitol Poisoning in Dogs Symptoms of xylitol poisoning in dogs are typically due to low blood sugar (hypoglycemia) and may include:   Vomiting   Weakness/Loss of balance   Stumbling/Lack of coordination   Lethargy/Depression   Tremors/Seizures   Collapse/Coma   Signs of hypoglycemia may appear as early as 30 minutes after xylitol ingestion but may be delayed up to 12 hours. If you notice any of these symptoms, and believe your dog may have ingested xylitol, contact your local veterinary emergency hospital immediately. Causes of Xylitol Poisoning in Dogs Xylitol poisoning in dogs is usually caused by accidental ingestion of a product containing xylitol which is included in many foods and household products. Therefore, xylitol poisoning relatively common in dogs.   Xylitol is not always clearly labeled as such, so look for words such as “birch sugar” or “artificial sweetener” in a product’s ingredients list. If in doubt, call the Pet Poison Helpline or ASPCA Animal Poison Control Center for more information on a specific product, and if your pet needs treatment.    One of the most common causes of xylitol poisoning in dogs is ingesting sugar-free chewing gum, which dogs may find rummaging through a bag or purse. Be sure to keep all gum securely away from your pets.    A dog only needs to eat as little as 0.045 grams/pound. (0.1gram/kilogram) to experience hypoglycemia from xylitol ingestion. Liver damage occurs at a much higher dose of 0.11 to 0.22 gram/pound (0.25 to 0.5gram/kilogram). Most chewing gums contain 0.2 to 1.0 grams of xylitol per piece, which means only one piece of gum can cause low blood sugar in a 20-pound dog, and as few as 2 to 4 pieces of gum can cause liver damage and failure.    How Veterinarians Diagnose Xylitol Poisoning in Dogs If you see your dog eat a product containing xylitol or suspect it may have eaten it, take your pet to a local veterinary emergency hospital immediately. The vet will ask for a thorough history of the incident, so it is very helpful to bring the packaging (or what is left of it) from the product your dog ingested. To diagnose xylitol poisoning, a vet will perform a physical exam to assess your dog’s mental and neurological status. A complete blood count, serum blood chemistry, and urinalysis are likely recommended for a baseline evaluation. This includes checking your dog’s blood sugar and baseline liver values, which will need to be monitored for the next 72 hours to ensure there is no liver damage.    Treatment of Xylitol Poisoning in Dogs Dogs should be treated as soon as possible for xylitol poisoning. If your dog is not showing symptoms of poisoning, and the ingestion occurred fewer than six hours prior, your vet will likely induce vomiting.    Next, the vet will try to maintain your dog’s normal blood sugar levels, which may include IV fluids with dextrose supplementation. Your dog will likely be hospitalized overnight for observation and serial blood sugar will be monitored. It may also be given a liver protectant medication. Recovery and Management of Xylitol Poisoning in Dogs Early diagnosis and aggressive treatment are crucial in treating xylitol poisoning in dogs. Hypoglycemia may lead to seizures and coma, and severe liver damage may lead to liver failure. Overall, the prognosis is very good for dogs with only hypoglycemia, and who are treated promptly upon ingesting xylitol. Most dogs are hospitalized for observation for 12 to 24 hours. The pet’s bloodwork is rechecked to monitor Its liver values for 72 hours after ingesting xylitol. If the liver values are normal at that time, then there should be no long-term damage.    Prevention of Xylitol Poisoning in Dogs   Reading product labels is one important way to prevent xylitol poisoning in dogs. Look for xylitol as an ingredient, also for products labeled as “sugar-free,” “no sugar added,” “diabetic friendly,” “reduced sugar,” or “birch sugar.”  If you are unsure about a product’s safety, don’t feed it to your pet. Peanut butter is often used as a treat or to administer medication to dogs, so be sure to select the kind that is safe for your dog.    Keep all xylitol-containing foods and household products away from your dog and in a secure place. Dogs are very clever and will find ways to get to these dangerous items.   "}]