[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/vpq9cmu45q", "@type": "VideoObject", "duration": "PT2M39S", "name": "5327096683001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/88593c226ebc411ddfbc407fc0d7e0534b837464.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/vpq9cmu45q", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/573280ced28bc60d82c95be60b502474ee991f10.m3u8", "transcript": "The pancreas is part of the endocrine and digestive system in dogs that produces enzymes that assist with digestion and insulin creation. Pancreatitis is an inflammation of the pancreas that disrupts the flow of enzymes into the digestive tract. This inflammation forces the enzymes out of the pancreas and into the abdominal area which can cause intra abdominal inflammation, infection, bleeding shock and even death because of their proximity to the pancreas the kidney and liver may also be affected as a result of pancreatitis pancreatitis often progresses rapidly in dogs but if treated quickly the disease may leave no permanent damage to the organ vomiting, diarrhea, loss of appetite abdominal pain lethargy increased heart rate and difficulty breathing can all be signs of pancreatitis.\n\nThere are several possible causes including nutritional factors such as high levels of fat in the blood high levels of calcium in the blood trauma to the pancreas. Inflammation in adjacent organs such as the liver kidney or tract and some medications or toxins. Obesity linked to a high fat diet has also been shown to be a risk factor for pancreatitis in dogs. But even without the presence of a high fat diet any animal can have an occurrence of pancreatitis after eating a large amount of fatty foods.\n\nAnd although pancreatitis can occur in any dog breed it occurs more frequently in miniature snails miniature poodles and Cocker spaniels and pancreatitis is also more common in females than in males and more common in older dogs. A full blood work will be ordered by your vet Neary and to see if there are any nutrient imbalances that Marines will also order radiographs to look for evidence of inflammation in the abdomen and to rule out any other causes of vomiting such as foreign body ingestion or other causes of blockages pancreatic in liver enzymes will be measured to determine if there is an increase of either in the bloodstream.\n\nYour vet will also check glucose levels since inflammation can damage insulin producing cells and potentially lead to diabetes. Long term in many cases an ultrasound will be performed to look for any abnormal masses cysts or abscesses in the body. Pancreatitis can often be treated in your veterans office and may include IV fluid therapy rest pain medication antibiotics and other medication to control the initial symptoms. In cases linked to a blockage surgery may be required to remove the blockage that's causing the inflammation or to remove severely damaged tissue.\n\nFood may be withheld for a short period of time and your vet Marion will likely recommend a bland low fat easily digestible diet when your dog resumes eating.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/endocrine/c_multi_pancreatitis?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Causes Pancreatitis in Dogs and How to Treat It", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/miniature-schnauzer.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/miniature-schnauzer.jpg"}, "author": {"@type": "Person", "name": "Heidi Kos-Barber, DVM", "url": "https://www.petmd.com/author/dr-heidi-kos-barber"}, "keywords": "Dog, Condition, Symptom Checker, Pancreatitis", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_multi_pancreatitis"}, "datePublished": "November 3, 2020", "dateModified": "September 12, 2023", "description": "What is pancreatitis and how does it affect dogs? Dr. Heidi Kos-Barber explains pancreatitis in dogs, including the causes, symptoms, and how it’s treated.", "articleBody": "If you have a dog that’s predisposed to pancreatitis, or one that tends to sneak fatty foods when you’re out on a walk, you might want to know more about the symptoms and treatment of pancreatitis in dogs. Here’s what you need to know about pancreatitis in dogs so you can have a better understanding of this condition. What Is Pancreatitis in Dogs? The pancreas is an organ in the abdominal cavity. One of its roles is producing digestive enzymes, which helps break down food products. Pancreatitis in dogs is an inflammatory reaction within the pancreas that can result in abdominal pain, inappetence, and vomiting. The inflammation results from the inappropriate, early activation of an enzyme within the pancreas, which causes the pancreas to digest itself. What Causes Pancreatitis in Dogs? Classically, the typical history of a canine patient that is diagnosed with pancreatitis is one in which the dog ate a high-fat meal or got into the garbage. Unfortunately, this is not the most common cause of pancreatitis. In reality, 90% of the time, the inciting cause of pancreatitis in dogs is idiopathic (cannot be determined). Are Some Dogs Predisposed to Pancreatitis? Some breeds are more prone to the development of pancreatitis, as well as dogs taking certain medications. Miniature Schnauzers are considered to be a predisposed breed due their tendency to have problems with high blood triglyceride levels. Another example is the English Cocker Spaniel. Immune-mediated diseases, which result from abnormal activity of the immune system, are seen at a higher frequency in this breed in general, and the immune system attacking the pancreas is no exception. Medications that are known to cause inflammation of the pancreas include, but are not limited to, some chemotherapy medications and some antibiotics. What Are the Symptoms of Pancreatitis in Dogs? Pancreatitis can present as a sudden-onset (acute) illness or as a more long-term (chronic) illness.  A dog that has acute pancreatitis will have more serious clinical signs, such as: Severe lethargy Abdominal pain Persistent vomiting Severe dehydration Collapse and shock (sometimes) A dog with chronic pancreatitis is typically not as sick. The clinical signs may include: Lethargy Decreased appetite to not eating at all Abdominal pain and/or vomiting In general, chronic pancreatitis is not as common in dogs as acute pancreatitis. Dogs with chronic pancreatitis can suddenly develop worsening pancreatitis. This is a situation where chronic pancreatitis presents acutely.  How Do Vets Diagnose Pancreatitis in Dogs? Disease of the pancreas can be difficult to identify because, oftentimes, the signs of illness are not specific to the pancreas, and routine blood tests are often not helpful. However, there are pancreatic-specific blood tests that can be performed when the veterinarian has a high suspicion of pancreatitis. Unfortunately, even these special tests are not 100% accurate. Abdominal X-rays are also not very helpful in diagnosing pancreatitis in dogs. However, in a vomiting patient, it is important to take X-rays to rule out a potential foreign-body obstruction of the stomach and/or intestine (something your dog ate, like a squeaker out of a toy). The best method to image the pancreas is via abdominal ultrasound. However, the tissue of the pancreas has to be abnormal enough to visualize using the ultrasound, which is more common in dogs with acute, severe pancreatitis, when compared to those with chronic, mild pancreatitis. Overall, blood testing and abdominal ultrasound are better in helping to diagnose pancreatitis in dogs when it is acute and severe.     How to Treat Pancreatitis in Dogs Treatment is primarily supportive care regardless of whether the patient has acute or chronic pancreatitis.  Severe Pancreatitis in Dogs Patients with severe, acute pancreatitis often require more extensive medical intervention and treatment. These patients are often in need of several days, if not weeks, of treatment, including: Intensive intravenous (IV) fluid and electrolyte support Pain-control measures Antinausea medication(s) Stomach-protectant medications Nutritional support in the form of a feeding tube Antibiotics (sometimes) Severe pancreatitis patients are often critical and best treated in a specialist practice, such as an intensive 24-hour care facility. The cost for treatment is estimated at approximately $2000-5000 but can vary depending on where you live. Moderate to Mild Pancreatitis in Dogs Patients with moderate or mild pancreatitis may be hospitalized for one to a few days for IV fluid therapy to correct dehydration. In a dog with mild pancreatitis, your veterinarian may determine that subcutaneous (applied under the skin) fluid administration—either at the appointment or at home—will be adequate for rehydration. These patients are usually also treated with: Antinausea medication A stomach protectant(s) Pain-reliever medication A bland, low-fat diet is recommended during recovery (this may be a home-cooked and/or home-prepared diet) In general, mild to moderate pancreatitis patients recover in one to two weeks. Treatment can vary with these patients, so the cost varies. If hospitalized for a few days, the costs can approximate $1500-2500. If treated as an outpatient, the cost is around $500-1000. A permanent diet change may be recommended, especially in predisposed breeds (Schnauzers) or dogs with a previous history of pancreatitis.   What Is the Prognosis for Pancreatitis in Dogs? The prognosis for dogs with pancreatitis ultimately depends on the severity of the illness. A dog with severe pancreatitis has a poor to grave overall prognosis, thus a higher risk of death. These patients can die from a severe whole-body inflammatory condition, which results in multiple organ failure. Pancreatic abscess formation and peritonitis (abdominal cavity infection) is another complication of severe pancreatitis that increases the risk of fatality. It is important to note that a dog that has recovered from even a single episode of pancreatitis or repeated episodes of pancreatitis may develop extensive scarring within the pancreatic tissue. This can lead to the development of diabetes mellitus and/or a condition called exocrine pancreatic insufficiency (EPI). EPI occurs as a result of the pancreas not being able to produce a sufficient amount of digestive enzymes.              Pancreatitis has many potential causes, and dogs can present with illness that ranges from mild to very severe. Also, the signs of illness are not specific to the pancreas, so it can be a challenge to diagnose. Ultimately, the earlier the diagnosis and treatment, the more positive the outcome.  Featured Image: iStock.com/Elen11"}]