[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is systemic lupus erythematosus painful in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Systemic lupus erythematosus in dogs is often painful because the disease can affect the blood, organs, or joints. Medications can help to minimize pain."}}, {"@type": "Question", "name": "What is the life expectancy of a dog with systemic lupus erythematosus?", "acceptedAnswer": {"@type": "Answer", "text": "This depends on the severity of the disease and the number of organs affected. The risk of complications in dogs with systemic lupus erythematosus increases with age because damage from the disease can cause organ failure."}}, {"@type": "Question", "name": "Can systemic lupus erythematosus in dogs be cured?", "acceptedAnswer": {"@type": "Answer", "text": "No. However your veterinarian can tailor a treatment plan based on your dog’s health to maximize your dog’s quality of life and manage symptoms. Featured Image: iStock.com/YakobchukOlena"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Systemic Lupus Erythematosus (SLE) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Endocrine", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/dog.in_.home_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/dog.in_.home_.jpg"}, "author": {"@type": "Person", "name": "Stephanie Betbeze, DVM", "url": "https://www.petmd.com/author/dr-stephanie-betbeze"}, "keywords": "Dog, Condition, Endocrine health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/endocrine/c_dg_lupus_erythematosus"}, "datePublished": "February 18, 2022", "dateModified": "August 12, 2022", "description": "Dr. Stephanie Betbeze discusses the rare chronic disease Systemic Lupus Erythematosus (SLE), how it’s diagnosed, symptoms, and treatment options for dogs diagnosed with SLE.", "articleBody": "What is Systemic Lupus Erythematosus (SLE) in Dogs? Systemic Lupus Erythematosus (commonly known as SLE), also known as lupus, is a chronic autoimmune condition that occurs when your dog’s immune system attacks his internal organs. Lupus in dogs is relatively rare and can affect more than one organ.   Every tissue in the body has substances called antigens that can trigger the immune system to react. If the immune system reacts to the antigens, special proteins called antibodies are produced. Antibodies are immune system cells that are programmed to attack invaders. In a dog with lupus, the antibodies attack the dog’s own tissues and organs. Systemic lupus erythematosus in dogs may affect any organ, but it most commonly affects the liver and kidney.  Symptoms of Systemic Lupus Erythematosus (SLE) in Dogs Muscle pain and/or weakness are common symptoms of systemic lupus erythematosus in dogs. Other symptoms may include:   Arthritis (in several joints)  Skin rashes or sores (lesions)  Fever   Lethargy  Loss of appetite   Swollen lymph nodes  Seizures or tremors  Because systemic lupus erythematosus can affect one or several organs, a dog may also experience vomiting, increased water intake, and increased urination.   Dogs with systemic lupus erythematosus can also develop anemia, a severe condition that occurs when a dog has a low red blood cell count. Symptoms of anemia include pale gums, severe weakness, and lethargy.   Causes of Systemic Lupus Erythematosus (SLE) in Dogs There is no known cause for systemic lupus erythematosus in dogs. It is unclear why a dog’s immune system develops the antibodies that attack body tissue and organs.   Systemic lupus erythematosus can develop in any breed, but is most commonly seen in German Shepherds, Beagles, Afghan Hounds, Collies, Poodles, and Irish Setters. Since some dog breeds are predisposed to the disease, veterinarians believe genetics may play a role.   Dogs are generally diagnosed when they are young or middle-age, so aging is not considered a risk factor.  How Veterinarians Diagnose Systemic Lupus Erythematosus (SLE) in Dogs Your veterinarian will perform a complete examination and review your dog’s health history. This will include reviewing symptoms, behavior, and any changes in habits.  Your veterinarian will also perform tests to determine the cause of your dog’s symptoms. Those tests may include:  X-ray: The veterinarian may x-ray parts of your dog’s body to determine the health of organs such as the kidneys and liver.   Blood chemistry test: Your veterinarian will check for antibodies that are attacking the body’s tissues and review liver and kidney function.  Urinalysis: This test can screen for protein loss and kidney function.   Ultrasound: A test that allows your vet to see pictures of the dog’s organs.  Biopsy of skin lesions: A test that involves studying small samples of skin to look for abnormalities.  Cytology: Your veterinarian may collect a small sample of fluid from a swollen joint to examine under a microscope to confirm the diagnosis.  Treatment of Systemic Lupus Erythematosus (SLE) in Dogs Your veterinarian will develop a treatment plan to minimize pain and other symptoms, depending on your pet’s diagnosis. Treatment may include prescription medication to reduce inflammation and medicine to suppress your dog’s immune system. These types of medications can lessen the body’s production of the antibodies.  Dogs experiencing kidney failure may also require hospitalization to receive fluids. If your dog has anemia, a blood transfusion might be required. Your veterinarian may also prescribe medication to manage nausea, vomiting, or anorexia, if those are present.   Recovery and Management of Systemic Lupus Erythematosus (SLE) in Dogs There is no way to prevent systemic lupus erythematosus, but your veterinarian can prescribe medicine to manage symptoms throughout your dog’s life.  Your dog will also require routine visits to the veterinarian to monitor any disease progression, tolerance of medications, and minimize symptoms."}]