[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Safety Tips for Using Heartworm Preventive Medications on Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/heartworm-preventative-medications-safety-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/heartworm-preventative-medications-safety-dogs.jpg"}, "author": {"@type": "Person", "name": "Jennifer Kvamme, DVM", "url": "https://www.petmd.com/author/dr-jennifer-kvamme"}, "keywords": "Dog, Parasites, Heartworm, Preventative health, Prescription medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/parasites/evr_dg_safety_tips_heartworm_treatment_in_dogs"}, "datePublished": "March 2, 2012", "dateModified": "August 25, 2022", "description": "Heartworm preventative medication is important to a dog’s well-being. To prevent heartworm disease, heartworm medications need to be properly applied.", "articleBody": "Proper Application of Dog Heartworm Prevention Medication By Jennifer Kvamme, DVM Keeping our dogs free of heartworms is much cheaper, easier, and safer than treating them for a full-blown disease. However, it is important that you use heartworm preventives properly — both for your safety and your dog&#039;s safety. Consult Your Veterinarian First It’s very important that you use only approved heartworm medications, in the correct dosage, for your dog’s particular age, weight, and health status. But before deciding to give a heartworm medication to your dog, ask your veterinarian for advice. A negative heartworm test is required to obtain a prescription for heartworm medication, so you will need to have your dog tested for heartworms first. Also, your veterinarian will only give you a prescription for a heartworm preventive if the dog is shown to have no heartworms (tested negative). There are several kinds of heartworm preventive medications commonly used today. Many of these preventives have multiple benefits; some also control intestinal parasites as well as external parasites. Oral Heartworm Medications Common active ingredients used in heartworm preventives today include ivermectin and milbemycin. Ivermectin has been used for decades to prevent heartworm disease in dogs. There are rarely side effects, if given at the proper dosage, but some dogs may experience vomiting, diarrhea, or incoordination. In the case of an allergic response to the heartworm medication, a dog may experience itching, hives, swelling of the face, or even seizures or shock. Certain breeds of dog are at risk of having a reaction to ivermectin and milbemycin. These breeds include Collies, Sheepdogs, Australian Shepherds, and Whippets. This is due to a genetic mutation that causes them to be unable to clear the heartworm medication from their brain, bringing on seizures and even death. Your veterinarian can suggest alternative heartworm preventives for your dog if it is one of the breeds at risk. If you want to be completely sure, you can ask your veterinarian to perform a DNA test to check if your dog has the genetic mutation. Topical Heartworm Medications Newer topical or spot-on medications are available to prevent not only heartworms, but also fleas, ticks, mites, and more. Depending on the brand you choose, your dog can be protected from many parasites (internal and external), all in one monthly application. Selamectin and moxidectin work by absorbing into the dog’s skin and collecting in the oil glands under the skin. From there, the drug dispenses slowly over time, protecting the dog. When applying these types of heartworm medications, you want to be careful not to get it on your skin or in your eyes. The fur in the area between the shoulder blades should be separated, to find the skin below. Apply the liquid directly to the skin instead of to the fur. Wash your hands after handling these medications (or wear disposable gloves so there is no skin contact at all). Label instructions should always be followed carefully. Keep your dog indoors and watch him for about 30 minutes following application. Children and other animals should be kept apart while the heartworm medication is absorbing. Adverse reactions to these preventives are rare, but do occur. Possible side effects may include vomiting, diarrhea, drooling, panting, and trembling. Some dogs can have an allergic reaction to these types of medications, similar to the reactions seen with ivermectin. Hair loss at the application site has also been reported. [video]   Injectable Heartworm Preventive Another product that was first approved for use in 2001 in dogs is an injectable moxidectin product that works for six months as a heartworm preventive. It also kills hookworms with just one injection. This product was voluntarily recalled in 2004 and then re-introduced in 2008 under a risk management program in agreement with the U.S. Food and Drug Administration. Veterinarians that offer this product must be registered with the manufacturer and be trained in its use before being able to purchase the product. Only a veterinarian is allowed to inject this product, and only after you are given information about its risks and side effects. You must sign a consent form and veterinarians are required to keep records of each product’s lot number in case any side effects are reported. Adverse effects for this product can include facial swelling, itching, vomiting, diarrhea, seizure, or shock. Other Heartworm Medication Safety Tips Here are just a few more basic tips to consider when giving your dog heartworm preventives: Check with your veterinarian for the proper dosage and type of heartworm medication to give your dog, before giving it.Read all labels carefully before use.Do not allow products to be within the reach of children or pets (e.g., keep them in a locked cabinet).Watch your dog for side effects and call your veterinarian to report any problems.Do not give your dog more than one type of heartworm preventive medication at a time.Ask your veterinarian if your dog requires heartworm preventive all year long. This is an especially practical approach in the warmer climates, where mosquitoes are always present."}]