[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Do Pest Control Products Get Rid of Fleas?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-flea-tick-parasite.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-flea-tick-parasite.jpg"}, "author": {"@type": "Person", "name": "Jennifer Kvamme, DVM", "url": "https://www.petmd.com/author/dr-jennifer-kvamme"}, "keywords": "Dog, Parasites, Flea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/parasites/evr_multi_how_do_pest_control_products_eliminate_fleas"}, "datePublished": "March 7, 2012", "dateModified": "August 25, 2022", "description": "Pest control products have been developed to help battle flea infestations. Insect growth regulators and insect development inhibitors are two common types.", "articleBody": "What are Insect Growth Regulators and Insect Development Inhibitors? By Jennifer Kvamme, DVM In recent years, chemicals have been developed to help in the battle against flea infestations. These relatively new pest control products are called insect growth regulators (IGRs) and insect development inhibitors (IDIs). But what exactly are they and how can they help your pets?  IGRs and IDIs are used in topical spot-on products, oral medications, injectable drugs, and in-home foggers and sprays. They do not kill adult fleas like other flea control products. They work in different ways to break the flea life cycle, by inhibiting growth and preventing fleas from developing into adults that will continue to lay eggs. In the face of a major flea infestation, an adulticide chemical will also be required to kill the adult fleas, bringing the situation under control and making the pet (and you) more comfortable. More importantly, these pest control products are safe to use around pets and people because they work to mimic insect hormones and inhibit certain development processes in insects, which does not affect mammals. Insect Growth Regulators (IGRs) Chemicals called insect growth regulators serve the purpose of mimicking a juvenile growth hormone in the insect’s body. During normal development, the levels of juvenile hormone decrease, allowing the flea larva to molt into the pupal stage. Because IGRs cause insects to be continuously exposed to a version of growth hormone, they never experience the decrease of hormone levels, and they are not able to properly molt. Affected fleas do not immediately die, but they do not reach a reproduction stage, and they die in the immature phase. When flea eggs and larvae are exposed to this kind of chemical, they will die off completely without ever reaching the adult stage.  Common IGRs found in flea preventive products and household sprays include fenoxycarb, pyriproxyfen, and methoprene. Certain varieties of these chemicals last longer in the environment than others. For example, methoprene is easily broken down in the presence of sunlight, while pyriproxyfen will last much longer in ultraviolet light. Be sure to read all labels carefully to make sure you are getting a pest control product that will work best for your needs, whether you are using it indoors or out. Insect Development Inhibitors (IDIs) Chitin is a substance required for insects to develop the hard outer layer that protects them. Without chitin, flea eggs and larvae are unable to form this outer layer, leaving them vulnerable and easy to kill. Insect development inhibitors work to prevent the production of chitin in the insect and halt normal growth. Generally, IDIs are given to pets via an oral medication, which then deposits in the animal’s body fat. This allows the drug to slowly release and stay in the bloodstream for several weeks. When an adult female flea bites the treated animal, it ingests the IDI in the animal’s blood, which then affects the eggs it eventually lays, preventing further development. Common IDIs seen on the market today include diflubenzuron and lufenuron. Both of these products are safe to use in mammals. Because these products do not kill adult fleas, it may still be necessary to provide your pet with other medications that will work in tandem with the IGRs and IDIs to reduce the adult flea populations, such as a spot-on, or shampoo. However, you should check with your veterinarian to be sure the two medications will work together safely before applying them to your pet.   Image: David Mzareulyan / via Shutterstock"}]