[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can dogs recover from flea and tick medicine poisoning?", "acceptedAnswer": {"@type": "Answer", "text": "With quick treatment, dogs can fully recover from flea and tick medication poisoning/toxicity. It is important to catch clinical symptoms early for the best prognosis."}}, {"@type": "Question", "name": "How long does flea and tick medicine poisoning last?", "acceptedAnswer": {"@type": "Answer", "text": "Symptoms may continue for several days after the use of a product, but most clinical signs will resolve in one to three days. Featured Image: iStock.com/Andrey Maximenko"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Flea and Tick Medicine Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.taking.tablet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.taking.tablet.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Tick, Flea, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/poisoning/flea-and-tick-medicine-poisoning-dogs"}, "datePublished": "May 20, 2022", "dateModified": "June 15, 2023", "description": "Dr. Barri Morrison explains what you need to know about flea and tick medicine poisoning in dogs, including emergency symptoms, diagnosis, and treatment options.", "articleBody": "What Is Flea and Tick Medicine Poisoning in Dogs? While it is very important for your dog to be on flea and tick prevention to help minimize the risk of the many diseases these insects carry, there are strict guidelines to prevent toxicity when administering these medications. Substances that are toxic to insects such as fleas and ticks can also be harmful when exposed to pets in large quantities. Some common flea and tick medications contain pyrethrins or pyrethroids. Pyrethrins are a class of drugs derived from the chrysanthemum flower/plant, and pyrethroids are synthetic derivatives of these pyrethrins. Pyrethrins are rarely found in products used daily, but pyrethroids are commonly found in products used around the home for insect control, in addition to common preventative flea and tick medications. Dogs are often exposed to high doses in flea and tick preventives, and then to lower concentrations when these products are used inside or outside the home in the form of insect sprays, foggers, and granules. A newer class of flea and tick prevention medications that have been linked to toxicity are isoxazolines. These medications were the first oral flea and tick products, and while they are highly effective, they can also cause toxicity if given incorrectly or an overdose occurs. These preventions are safe to use if the appropriate dose is administered. Isoxazoline-containing preventives include: Bravecto (topical and oral) Simparica Simparica Trio NexGard Credelio Symptoms of Flea and Tick Medicine Poisoning in Dogs Pyrethroid-based topical flea and tick preventives, especially “spot-on” formulas, cause symptoms that can develop from 15 minutes to several hours after application to your dog’s skin. Clinical signs include:A tingling sensation; dogs will excessively itch or scratch that spot on their skinScratching, intense itchinessAgitation or restlessnessRolling around on the back or trying to bite the backVocalization, crying, whimperingPyrethrin and pyrethroid toxicity after oral ingestion usually causes clinical signs within 1 hour of absorption or exposure. Clinical signs may include:DroolingVomitingLack of appetiteGagging or hackingAgitationOn rare occasions, bifenthrin (frequently used in liquids and granular fire ant products.) ingestion, in large concentrated amounts, can cause: Tremors Twitching Shaking Difficulty standing or walking Weakness Seizures Death Isoxazoline (commonly found in oral flea and tick preventatives) overdose can cause: Muscle tremors Difficulty standing or walking   Seizures If you think your dog or cat is having toxic side effects or was exposed to pyrethrins or pyrethroids, call your veterinarian, ASPCA Poison Control, or a Pet Poison Helpline immediately for potentially life-saving treatment advice. Depending on the severity of clinical signs, seek emergency vet care immediately. Causes of Flea and Tick Medicine Poisoning in Dogs The formulations of pyrethrins and pyrethroids vary depending on how they will be used. Pyrethrins and pyrethroids typically come in varying concentrations. Higher concentrations can be safely used on dogs, but cats are more sensitive to these chemicals and cannot metabolize these drugs. Intended uses of these products include: Home and outdoor yard and garden insecticides, which typically come in liquids, sprays, granules, and foggers Over-the-counter medicated flea shampoos Topical flea and tick preventives Common brands of pyrethrins/pyrethroids include: Advantix Vectra 3D Advantage sprays and home fogger Seresto collars Hartz products Keep in mind there are many more generic and brand-name preventives that include these ingredients. How Veterinarians Diagnose Flea and Tick Medicine Poisoning in Dogs After a complete physical examination, your veterinarian will make a presumptive diagnosis if there is a known or possible history of exposure to a product containing a pyrethrin or pyrethroid, or ingestion of flea/tick medicine. In a presumptive diagnosis, a veterinarian has a good reason to believe that something is causing the problem but cannot prove it with a specific diagnostic test. Treatment of Flea and Tick Medicine Poisoning in Dogs Depending on the severity of the toxicity and the clinical signs your dog is displaying, treatment could be on an outpatient basis, or your dog might need to be hospitalized for supportive care. There is no antidote for these types of poisoning. Treatment includes quick removal of the product by bathing your dog with a liquid dish soap like Dawn, Joy, or Palmolive to get the greasy substance off and rinsing the mouth with copious amounts of water. Use a garden hose, if necessary, to help flush from the mouth any toxins ingested. In cases where neurological signs occur, it is beneficial to minimize the extent and severity of clinical signs by having your dog hospitalized for up to three days. Supportive care might consist of repeat bathing, IV fluids, anti-nausea medications, muscle relaxation, and seizure medication. Your veterinarian might also want to monitor your dog’s temperature, blood sugar levels, and kidney function, as these can be affected by any toxicity. Recovery and Management of Flea and Tick Medicine Poisoning in Dogs With prompt recognition and early treatment, the prognosis is good. If your dog develops neurological signs, kidney issues, seizures, and elevated body temperature, the prognosis is generally poor. Adverse reactions such as excessive drooling, paw flicking/scratching, and ear twitching are often mild and can go away on their own. Although drooling may recur for several days after use of a flea-control product on an animal, most mild to severe clinical signs resolve within three days. Prevention of Flea and Tick Medicine Poisoning in Dogs To prevent accidental exposure, follow all directions on flea and tick preventives and insecticides very carefully. The most important thing to make sure of with a preventive is that dogs are getting the correct dose for their body weight. Also, make sure that you do not give more than one drug at a time, as that can cause an accidental overdose. Do not use part of a larger-sized dose or multiple smaller doses, as this may result in an overdose and increased chance of poisoning. If in doubt, bring your dog to the veterinarian for a weigh-in."}]