[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Best Heartworm Medications for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-06/cute-happy-dog-playing-with-a-stick-picture-id1184184060_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-06/cute-happy-dog-playing-with-a-stick-picture-id1184184060_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Heartworm, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/best-heartworm-medications-dogs"}, "datePublished": "June 16, 2022", "dateModified": "June 13, 2023", "description": "Choosing the best heartworm medication for your dog.", "articleBody": "Heartworm prevention is an important part of keeping your dog healthy. Heartworms are parasites that infest your dog’s heart and the vessels connected to the heart. They are typically spread from dog to dog by mosquitoes. In advanced stages, heartworms can become so large and numerous that they interfere with the heart’s ability to pump blood. This can cause heart failure.   Fortunately, there are many safe and effective options to prevent heartworm disease. Many of these medications are combined with other preventatives to address a range of parasites, including different types of intestinal worms and fleas and ticks. When choosing a heartworm medication, it’s always a good idea to consult with your veterinarian about your dog’s needs.  Heartgard© Plus Chew for Dogs  Heartgard© Plus combines the active ingredients ivermectin and pyrantel. Together, these medications control larval (juvenile) heartworms, as well as roundworms and hookworms. Heartgard© Plus is available in a monthly chew in the following strengths:  HeartGard Plus Chew for Dogs (up to 25 lbs.) HeartGard Plus Chew for Dogs (26-50 lbs.) HeartGard Plus Chew for Dogs (51-100 lbs.) According to the manufacturer, Heartgard© Plus is well tolerated. Side effects may include vomiting and diarrhea within 24 hours of dosing. Less common side effects include depression, lethargy, anorexia, ataxia, staggering, mydriasis, convulsions, and hypersalivation. Complete safety information is available on the product’s safety label. All dogs should be tested for heartworm infection before starting Heartgard© Plus. If you suspect your dog is experiencing side effects after taking Heartgard© Plus, contact your vet right away. The product should be given according to your vet’s instructions, following the included product label. Simparica© Trio Chewable Tablet for Dogs  Simparica© Trio combines the active ingredients sarolaner (in the isoxazoline class of medications), moxidectin, and pyrantel. Together, these medications target a wide range of parasites, including larval (juvenile) heartworms, roundworms, and hookworms, as well as providing flea and tick control against a variety of tick species. The product is available as a monthly chew in the following strengths:  Simparica© Trio Chewable Tablet for Dogs (2.8-5.5 lbs.) Simparica© Trio Chewable Tablet for Dogs (5.6-11  lbs.)   Simparica© Trio Chewable Tablet for Dogs (11.1-22 lbs.) Simparica© Trio Chewable Tablet for Dogs (22.1-44  lbs.)   Simparica© Trio Chewable Tablet for Dogs (44.1-88 lbs.) Simparica© Trio Chewable Tablet for Dogs (88.1-132 lbs.) According to the manufacturer, Simparica© Trio is well-tolerated. In clinical studies, side effects may include vomiting, diarrhea, lethargy, anorexia, polyuria, hyperactivity, and polydipsia. Complete safety information is available on the product’s safety label. If you suspect your dog is experiencing side effects after taking Simparica©, contact your vet.   Interceptor© Plus Chew for Dogs  Interceptor© Plus combines the active ingredients milbemycin oxime and praziquantel. Together, these medications target larval (juvenile) heartworms, adult roundworms, adult hookworms, adult whipworms, and adult tapeworms. Interceptor© Plus chews are available in the following strengths: Interceptor© Plus Chew for Dogs (2-8 lbs.) Interceptor© Plus Chew for Dogs (8.1-25 lbs.) Interceptor© Plus Chew for Dogs (25.1-50.1 lbs.) Interceptor© Plus Chew for Dogs (50.1-100 lbs.) Side effects that may be associated with Interceptor© Plus include vomiting, diarrhea, lethargy, ataxia, anorexia, convulsions, weakness, and salivation. For complete safety information, see the product’s label. If you suspect your dog is experiencing side effects after taking Interceptor© Plus, contact your vet right away.   Tri-Heart© Plus Chewable Tablets  Tri-Heart© Plus chewable tablets contains a combination of ivermectin and pyrantel. Together, these medications provide control of larval (juvenile) heartworms, roundworms, and hookworms. Tri-Heart© is administered once a month as a chew. It is available in the following strengths: Tri-Heart© Plus for dogs (up to 25 lbs.)  Tri-Heart© Plus for dogs (26-50 lbs.)  Tri-Heart© Plus for dogs (51-100 lbs.)    Tri-Heart© Plus is generally well-tolerated in dogs. Side effects may include vomiting, diarrhea, depression, anorexia, diarrhea, mydriasis, ataxia, staggering, convulsions, and hypersalivation. If you suspect your dog is experiencing side effects after taking Tri-Heart© Plus, contact your vet right away. For full safety information on Tri-Heart© Plus, see the product’s label.   Sentinel© Spectrum Tablets for Dogs  Sentinel© Spectrum Chews for dogs contain a combination of milbemycin oxime, lufenuron, and praziquantel. Together, these medications effectively control larval (juvenile) heartworms, adult roundworms, adult hookworms, adult whipworms, adult tapeworms, and fleas. Sentinel© Spectrum tablets are administered monthly in a chew. It is available in the following strengths:   Sentinel© Spectrum for dogs (2-8 lbs.)  Sentinel© Spectrum for dogs (8.1-25 lbs.) Sentinel© Spectrum for dogs (25.1-50 lbs.) Sentinel© Spectrum for dogs (50.1-100 lbs.) Side effects with Sentinel© Spectrum are relatively uncommon. Side effects may include vomiting, depression/lethargy, pruritus, urticaria, diarrhea, anorexia, skin congestion, ataxia, convulsions, salivation, and weakness. If you suspect your dog is experiencing side effects after taking Sentinel© Spectrum, contact your vet for a consultation. For complete safety information, see the product’s label.   "}]