[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/r4kirba2bo", "@type": "VideoObject", "duration": "PT1M33S", "name": "5521293481001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/d504f411529ca98718c384c76a4258252e31144d.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/r4kirba2bo", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/817a2467c899f6839fe6609e6c558639cfc87dd8.m3u8", "transcript": "Hives are raised red spots of irritation that occur when a dog has an allergic reaction to a substance. Hives usually develop quickly after exposure to the substance and can appear anywhere on a dog's body. Hives are caused when a dog comes in contact with or inhales and allergen. Some common causes include insect bites or stings.\n\nPlants such as poison ivy or poison oak insecticides food allergies or any other substance that may cause hypersensitivity in your pet hives may also develop as a reaction to vaccinations. Different dogs will have different allergic reactions, even if exposed to the same allergen. So some cases of hives will be more severe than others. Generally hives manifest as medium to large areas of redness on a dog's body or redness and swelling around a dog's face and muzzle.\n\nUsually these areas are raised and circular in shape because hives are extremely itchy. You may notice your dog scratching excessively, which could lead to more in irritation and discomfort. It is not uncommon for hives to clear up on their own after the allergen is removed from a dog's body. But if your dog is suffering from hives for the first time.\n\nIt's a good idea to see a veterinarian who can prevent the reaction from becoming more severe or spreading to areas such as the throat that could swell and become dangerous. Your veterinarian may provide topical or oral in his means to help control the itching and swelling associated with hives and using a cold towel or ice to soothe your dog's skin. They also prevent excessive scratching.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/skin/hives-dogs-causes-symptoms-and-treatment-options?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are dog hives an emergency?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Hives indicate an allergic reaction within the body. Although the hives themselves are mostly just uncomfortable, they could lead to very dangerous complications, including anaphylaxis and death. It’s best to treat even mild cases of hives."}}, {"@type": "Question", "name": "What can I give my dog for hives?", "acceptedAnswer": {"@type": "Answer", "text": "It is important to speak to your veterinarian before giving your dog any medication. The vet may recommend certain medications to give your dog now or to have ready for future episodes."}}, {"@type": "Question", "name": "How long do hives last?", "acceptedAnswer": {"@type": "Answer", "text": "Hives can disappear within a few hours or last up to 48 hours."}}, {"@type": "Question", "name": "Can anxiety cause hives in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "There’s a small chance that psychological stress can cause dog hives, but generally, anxiety merely worsens hives that are already present."}}, {"@type": "Question", "name": "Should I take my dog to the vet for hives?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, hives indicate a larger issue—an allergic reaction—and require treatment to make your dog comfortable and keep the reaction from progressing."}}, {"@type": "Question", "name": "What do hives look like on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Hives are red, often swollen areas of skin that may be very itchy. They can be anywhere on the body, but you’ll often spot them on your dog’s head, neck, back, stomach, or legs."}}, {"@type": "Question", "name": "What foods cause hives in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "There is no one food that generally causes hives in dogs. However, if your dog is allergic to a particular food or ingredient, that can cause hives for your individual dog."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Hives", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/female-golden-retriever.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/female-golden-retriever.jpg"}, "author": {"@type": "Person", "name": "Katherine Smith, DVM, CVA, CVSMT", "url": "https://www.petmd.com/author/dr-katherine-smith"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/hives-dogs-causes-symptoms-and-treatment-options"}, "datePublished": "November 23, 2021", "dateModified": "August 12, 2022", "description": "Dr. Katie Smith discusses hives in dogs, including what causes them, symptoms of hives, and how to treat this common skin condition.", "articleBody": "What Are Dog Hives? Hives (also referred to as urticaria) are areas of the skin that appear reddened and raised. Just as with humans, hives can be very itchy for your dog. They’re a sign that an allergy is causing the immune system to overreact. Hives can appear very quickly—and disappear just as quickly. The raised red area of the skin is referred to as a “wheal,” and it can appear anywhere from a few minutes to hours after exposure to an allergen. Wheals can appear anywhere on your dog’s body, but they’re usually found on the head, neck, back, stomach, and legs. In mild cases, the hives will generally disappear within 12-48 hours after contact with the allergen. However, because of the risk that the reaction can worsen to dangerous swelling of your dog’s airways or a serious allergic reaction called anaphylaxis, you should seek out treatment any time you see hives on your dog. This is especially true for hives that occur on the face or around the throat, which can lead to dangerous swelling and possible blockage of the airways. Symptoms of Dog Hives Red raised areas of skin called wheals, which can occur anywhere (including mucous membranes) but are most commonly seen on the head, neck, back, abdomen, and legs Intense itching Excessive drooling if the mouth is swollen Swelling (angioedema), which is particularly concerning when it involves the face and respiratory system and can have severe and life-threatening consequences Causes of Dog Hives The allergen that causes the hives may be environmental, chemical, or dietary. Any allergen your dog is sensitive can also lead to hives. Common causes include: Insect stings/bites (often involving the head and neck of your pup) Shampoos or topical agents Medications Vaccinations Toxic plants Food allergens Insects bites, chemical contact, and medications are the most common. How Vets Diagnose Hives Your vet will closely examine your dog to locate the distinctive wheals associated with hives. Wheals typically have hair on them, and may appear in clusters. Beyond the physical examination, other parts of the diagnosis include: Any history you are able to provide; be as thorough as you can in describing allergens your dog might have come into contact with and when and where you first saw the hives Your dog’s response to treatment Treatment for Dog Hives Dogs with hives usually respond quickly to treatment, which may include: Antihistamine (oral or injectable) and a steroid Injectable medications and intravenous fluids (in very serious cases) At-home treatments may include: Cold compresses over the hives or swollen areas to give relief from itching Antihistamines, but only under the supervision of your vet Management of Dog Hives Work with your vet to determine the cause of the hives, using both your dog’s health history and history of exposure to allergens. Depending on the cause and the frequency, your vet may recommend: Allergy testing to confirm environmental allergens Immunotherapy treatment to desensitize your dog to specific allergens A food trial to find ingredients that cause a reaction and develop specific dietary recommendations"}]