[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Horner’s syndrome in dogs considered life-threatening?", "acceptedAnswer": {"@type": "Answer", "text": "Horner’s syndrome by itself is not life-threatening, but it can be caused by more severe health issues, and prompt veterinary attention should be given if symptoms are noticed."}}, {"@type": "Question", "name": "Can Horner’s syndrome in dogs go away naturally?", "acceptedAnswer": {"@type": "Answer", "text": "Horner’s syndrome can resolve completely or partially without therapy. It rarely affects a dog’s quality of life unless the underlying condition is severe."}}, {"@type": "Question", "name": "Is Horner’s syndrome in dogs painful?", "acceptedAnswer": {"@type": "Answer", "text": "Fortunately, it is not painful and does not affect eyesight. Horner’s syndrome is more of a cosmetic issue than a true medical one, but any underlying health cause should be treated. Featured Image: iStock.com/Antonio_Diaz"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Horner&#039;s Syndrome in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1404747511.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1404747511.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/horners-syndrome-dogs"}, "datePublished": "September 5, 2023", "dateModified": "September 5, 2023", "description": "Horner’s syndrome in dogs is a common neurological condition in dogs. Learn how Horner’s syndrome impacts dogs, including symptoms, diagnosis, and treatment depending on underlying cause.", "articleBody": "What Is Horner’s Syndrome in Dogs? Horner’s syndrome is a common neurological condition in dogs and is the name for a group of symptoms that affect one or both sides of a dog’s face, involving the eyes, eyelids, ears, and nose. The syndrome is related to a malfunction of the autonomic nervous system, which controls involuntary bodily functions like blood pressure, heart rate, saliva and tear production, and gastrointestinal functions. The autonomic nervous system consists of the sympathetic and parasympathetic systems. The sympathetic system controls “fight or flight” responses, such as increasing heart rate and blood flow to the muscles so the dog can escape from danger quickly. It dilates the pupils and opens the eyelids while dropping the dog’s third eyelid. The third eyelid moves back and forth across the eye’s surface for extra protection and to keep the eye moist. The parasympathetic system is responsible for the “rest and digest&quot; functions of the body. It constricts the pupil, lifts the third eyelid, and retracts the globe inward. Both systems consist of a network of nerve fibers that send signals from the brain to the eye. If the sympathetic nervous system is compromised, for example when the network is damaged the parasympathetic nervous system takes over. This causes symptoms largely associated with parasympathetic functions. In Horner’s syndrome, this causes a constricted pupil, elevation of the third eyelid, retraction of the eye’s globe, and a drooping upper eyelid. Symptoms of Horner’s Syndrome in Dogs Horner’s syndrome can affect one side of the face (unilateral) or both (bilateral), though bilateral Horner’s syndrome is less common. Symptoms can occur suddenly and typically include: Constricted pupil Elevation of the third eyelid Retraction of the eye’s globe, which may often appear smaller compared to the other eye Drooping of the upper eyelid Depending on where the nerve damage occurs, other symptoms may appear, including: Behavioral changes Weakness or paralysis of the forelimbs Neurologic deficits such as abnormal paw placement Cranial nerve abnormalities (abnormal vision tests, difficulty chewing) Staggering gait (ataxia) Unequal pupil sizes (anisocoria) An ear that is warm to the touch Skin that appears pink, typically on the nose and ear Causes of Horner’s Syndrome in Dogs Any breed or age of dog can be affected by Horner’s syndrome, but it is more commonly seen in dogs aged 5–8 years old and in breeds such as: Labrador Retriever Golden Retriever Doberman Weimaraner Shetland Sheepdog Collie Horner’s syndrome develops when damage occurs anywhere along the path of the sympathetic nervous system (brain to spinal cord to chest to neck to the eyes). In about half of cases, the cause for damage cannot be determined. The most known cause for sympathetic nerve damage is infection of the middle or inner ear. Other causes include: Vestibular disease Diabetes mellitus, especially unregulated or poorly managed Intervertebral disc disease (IVDD) Ocular disease Fibrocartilaginous emboli (FCE), or spinal stroke Blood clot Infectious disease or abscess formation, either bacterial or fungal causes Cancer Injury due to numerous causes (bite wounds, car-related trauma, even from pulling too hard on a leash or forelimbs) Neurological diseases How Veterinarians Diagnose Horner’s Syndrome in Dogs Your veterinarian will perform a complete physical exam, including both an eye and ear examination. Tests to rule out other conditions may be done, including: Schirmer Tear Test to measure tear production Fluorescein eye stain to look for corneal ulcerations and abrasions Intraocular pressure (IOP) test to measure pressure within the eye Eye dilation using medicated solution may be performed to measure how long it takes the eye to dilate. Usually, the longer it takes, the higher chance the damage occurred along the sympathetic nervous system pathway. Cytologies and/or cultures of ear debris may be examined to look for infection. Other tests such as baseline blood work including a complete blood cell count, internal organ screening, and urinalysis are routinely performed to determine any underlying or associated causes such as diabetes mellitus.  X-rays of the chest and neck may be taken to screen for signs of trauma, a herniated disc, or cancer. A referral to a specialist for advanced imaging procedures (MRI and CT scan) and/or CSF (cerebrospinal fluid) tap with biopsies may be needed.  Treatment for Horner&#039;s Syndrome in Dogs There is no specific treatment for Horner’s syndrome other than to treat the underlying cause. Topical application of phenylephrine (a decongestant) is usually prescribed to relieve the symptoms associated with Horner’s syndrome and can be given as needed. Typically, treatment is more of a cosmetic resolution (restoring the dog’s face to a normal appearance) than a true medical one.  Prognosis varies based on the underlying cause. Because about half of cases have no known cause, there is a good chance that symptoms will resolve on their own after several weeks.   Recovery and Management of Horner’s Syndrome in Dogs Managing the syndrome itself is usually not necessary, but it is important to manage the underlying cause if it can be identified. The key is to seek veterinary help promptly when the symptoms appear. Recovery can take a few weeks or longer, especially if the symptoms are due to nerve injury in the shoulder. For prevention, common-sense approaches will help. These include using a harness leash when walking your dog to avoid excessive pulling, and other steps to prevent your pup from injuring itself. Proactively cleaning a dog’s ears and proper treatment of infections are also preventative measures that can help prevent Horner’s syndrome."}]