[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Treat H3N2 Flu in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_72348058.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_72348058.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/how-treat-h3n2-flu-dogs"}, "datePublished": "May 22, 2015", "dateModified": "August 16, 2022", "description": "If your dog has been diagnosed with H3N2 influenza, this is what you can expect to happen. Read more here.", "articleBody": "By Dr. Jennifer Coates, DVM If your dog has been diagnosed with H3N2 influenza, this is what you can expect to happen next. Medication: Many dogs with H3N2 flu receive antibiotics to prevent or treat secondary bacterial infections (pneumonia). In some cases, dogs will also be prescribed medications to dilate their airways, thin mucus, or ease their cough.Diet: Good nutrition and hydration are essential to keeping a dog’s immune system strong and capable of fighting off the H3N2 virus.What to Expect at the Vet’s Office After your dog has been diagnosed with the flu, your veterinarian will determine whether hospitalization is required. Severely affected dogs may need to stay at the veterinary clinic to receive oxygen therapy, injectable antibiotics, and to be closely monitored for a worsening in their ability to breathe. Some dogs may also receive medications that dilate their airways, thin mucus, or ease their cough. Nebulization and coupage (breathing humidified air and chest thumping) can also help dogs cough up and eliminate thick secretions that block their airways. Anti-viral medications (e.g., Tamiflu) are generally not recommended since they work best early in the course of the disease, before most dogs are brought to the veterinarian. Once dogs with H3N2 are stable enough to continue their treatment at home, they can be discharged from the hospital. What to Expect at Home Most cases of H3N2 flu in dogs can be treated at home. Supportive care is critical to a dog’s recovery. Dogs should be encouraged to eat, drink, and rest. If your dog is taking oral antibiotics, make sure to follow the instructions written on the label and give the entire course, even if your dog’s condition appears to be back to normal. Follow your veterinarian’s instructions regarding any other medications that have been prescribed. Dogs who have been diagnosed with H3N2 flu should be isolated from other dogs for 14 days to prevent spread of the disease. Questions to Ask Your Vet If you have more than one dog, ask your veterinarian if anything other than isolation can be done to decrease the chances that your other dogs will come down with H3N2. A canine flu vaccine is available, but it was designed to work against H3N8 flu viruses. It’s efficacy against H3N2 is unknown. Find out whom you should call if an emergency arises outside of your veterinarian’s normal business hours. Possible Complications to Watch For Talk to your veterinarian if you have any questions or concerns about your dog’s condition. Some dogs who take antibiotics can develop loss of appetite, vomiting, and diarrhea.It is possible for a dog to appear to be on the road to recovery and then suffer a setback. If your dog becomes weaker, has to work harder to breath, coughs more, or develops a blue tinge to his mucous membranes, call your veterinarian immediately.More to Explore Canine Influenza (Dog Flu) Should You Vaccinate Yur Dog Against Canine Flu? As the Flu Outbreak Worsens, What Should You Do? How Worried Should You Be About Your Pet&#039;s Health? Image: Melis / Shutterstock"}]