[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Identify, Treat, and Prevent Dog Ear Infections", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Ears", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-02/dog-ears.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-02/dog-ears.jpg"}, "author": {"@type": "Person", "name": "Amanda Simonson, DVM", "url": "https://www.petmd.com/author/dr-amanda-simonson"}, "keywords": "Dog, Condition, Symptom Checker, Ear Infection", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/how-treat-and-prevent-dog-ear-infections"}, "datePublished": "February 8, 2021", "dateModified": "September 12, 2023", "description": "Dr. Amanda Simonson explains the causes of dog ear infections, how they should be treated, and how you can prevent future ear infections in your dog.", "articleBody": "  Dog ears come in all shapes and sizes, but they are unique in their anatomy when compared to human ears. Dogs have a long ear canal with both vertical and horizontal components. This creates a J or L shape that traps debris more easily, which in turn, can lead to dog ear infections. Dog ear infections are common, so it’s not surprising that in 2018, Embrace pet insurance listed dog ear infections as third on the list of the top five dog medical conditions.1 Here’s a guide to help you recognize the signs of dog ear infections so you can take your dog for treatment as soon as possible. Jump to section: Types of Dog Ear Infections Signs of Dog Ear Infections Causes of Ear Infections in Dogs and Puppies Are Dog Ear Infections Contagious? Will Dog Ear Infections Go Away on Their Own? Can You Treat Dog Ear Infections at Home? How to Treat Dog Ear Infections Properly Treating Chronic Ear Infections in Dogs How to Prevent Ear Infections in Dogs and Puppies 3 Types of Dog Ear Infections After the ear canal sits the eardrum, then the middle and inner ear deep inside the head. Otitis is inflammation of the ear. Otitis is divided into three types based on the location of a dog’s ear infection: Otitis externa: inflammation of the ear canal Otitis media: inflammation of the middle ear Otitis interna: inflammation of the inner ear Otitis externa is the most common of these three infections because this is the part of the ear most exposed to external factors. Ear infections can be acute (with a quick onset) or chronic and recurrent. Dogs can also have an infection in one or both ears. This dog has a very severe ear infection with both bacteria and yeast involved. There was redness, swelling, and pus in the ear canal.Photo Credit: Sandra Mitchell, DVMThis dog had a very severe ear infection in both ears–the infection was caused by both yeast and bacteria. Photo Credit: Sandra Mitchell, DVMSigns of Dog Ear Infections A healthy dog ear is clean and dry. It is normal for small amounts of microscopic bacteria and yeast to live in the outer ear canal, but when a buildup of debris occurs, or the normal, healthy ear canal is compromised, those bacteria and yeast can overgrow and create an infection. Common signs of dog ear infections include: Redness Odor Itching/scratching Pain Shaking of the head Head tilt Discharge Occasionally, dogs can experience hearing loss or balance issues. Rarely, an ear infection may affect a dog’s appetite if the pet is having system-wide effects. This is seen more often with otitis media or interna. What Causes Ear Infections in Dogs and Puppies? Many things can cause ear infections in dogs and puppies. Often, an underlying problem leads to the inability of the normal protective barrier of a dog’s ear to work properly. Once the ear environment becomes moist or inflamed, it is easy for bacteria or yeast to overgrow and cause infection. Here are some common causes for a dog’s ear to become infected: Foreign bodies (grass awn, foxtails) that get into the ear Ear mites Excessive moisture from bathing or swimming Food allergies Environmental allergies Endocrine issues such as hypothyroidism Autoimmune diseases such as pemphigus, lupus, or vasculitis Polyps (fleshy growths inside the ear canal) Certain types of cancer Trauma to the ear All of these problems can make the ear canal susceptible to bacterial infection and/or yeast infection. When a dog is in pain and scratching and shaking excessively, an aural hematoma can develop as well. This is seen in the pinna or earflap, where ruptured blood vessels leak blood that clots and causes swelling and pain. Are Dog Ear Infections Contagious? It depends on the cause, but the majority of dog ear infections are not contagious. If the cause is ear mites, though, these parasites are extremely contagious. With ear mites, all pets in the home must be treated simultaneously. Ear mites are relatively common in puppies and kittens and may not be noticed initially when adopting a new pet. But shortly after bringing your new pet home, multiple pets in the house will be scratching and shaking.  Rarely, a methicillin-resistant Staphylococcus aureus (MRSA) or possible other contagious infection can be cultured from an infected ear. It is recommended to practice good handwashing when interacting with a pet with an ear infection and to limit other pets licking the infected pet’s ears. Good handwashing is also recommended after cleaning or medicating the ear to limit any topical absorption of medication. Will a Dog Ear Infection Go Away on Its Own? Most often, a dog ear infection will not go away on its own. All types of otitis require a veterinarian to evaluate the infection and the eardrum. If the eardrum is ruptured, certain cleaners and medications can be toxic to the middle ear. Can You Treat Dog Ear Infections at Home? The simple answer is no. Dog ear infections require vet treatment and medication in order to restore a healthy ear canal. After the veterinarian has evaluated your pet, they will determine if any further home treatment is appropriate. This can be done if a small amount of debris is present and the eardrum is intact. Dr. Wendy Brooks, DVM, DABVP, notes that if a large amount of debris present, a veterinarian must perform a thorough deep clean while the pet is under sedation.2 How to Treat Dog Ear Infections Properly Your veterinarian will likely need to test the ear debris or perform scans of your dog’s ear to choose the appropriate treatment. These are some tests that your vet might conduct: Cytology uses special stains on the swab of debris to color the microscopic bacterial cells or fungus. Viewing these under the microscope can identify the specific cause. Culture/sensitivity testing uses special medium/broth to grow and identify the specific bacteria that are causing the infection. It also tests which antibiotics will be effective in eliminating the infection. Blood testing may be needed to check for endocrine disease as an underlying condition.  Skull x-rays, a CT scan, or an MRI may be needed to assess the extent of severe or inner ear disease. Once the details of your dog’s ear infection are known, therapy will likely consist of multiple elements that may include topical, oral, or surgical therapies. Topical Often, a cleanser in combination with an ointment or eardrop can be used. This medication typically needs to get deep into the ear canal. Sometimes an oti-pack is used. This medication is in a lanolin base that is slowly released and does not require daily cleaning or application of drops. Oral Depending on the severity of the infection, an oral antibiotic, antifungal, or a steroid medication may be used to help heal the ear from the “inside out.” Surgical  Ears that have had severe chronic disease may no longer respond to medical treatments. The goal of surgery for these ears is to open the canal or sometimes to completely remove all diseased tissue.  What If Your Dog Has Chronic Ear Infections? Chronic ear infections can be time-consuming and frustrating for the pet, the owner, and even the veterinarian. Certain breeds of dogs are known to more commonly experience recurring ear infection issues, according to the Veterinary Information Network.3 This can be partly due to genetics, ear shape, or ear confirmation. Over time, proliferative ear tissue can form, making treatment more difficult. Cocker Spaniels and Springer Spaniels commonly get chronic infections due to long, floppy ears and a high numbers of ceruminous glands (ear sweat glands that produce earwax). Shar-Peis have small ear canals that can trap and hide debris. Labrador Retrievers and Golden Retrievers are prone to allergies and underlying sensitivities leading to chronic or recurrent ear infection. Schnauzers and Poodles often have excess hair deep in the ear canal. Chronic dog ear infections require closely working with your veterinarian to treat. It is important that your vet does testing to choose the appropriate medication. Chronic infections can require medication consistently for 6 to 8 weeks. After treatment, testing is needed again to ensure that all the infection has cleared. If we stop medicating too soon or do not treat underlying problems, it is easy for the infection to return, sometimes even becoming resistant to many medications.  How to Prevent Ear Infections in Dogs and Puppies Regular grooming, ear cleaning, and ear maintenance are important parts of pet care. Routine ear cleansing is especially important if your dog swims often. Cleaning is best accomplished with a professional dog ear cleaning product. These typically have been specifically formulated for effective pH ranges for dogs and contain drying agents. Key Points for Dog Ear Cleaning Do not use alcohol or hydrogen peroxide, as they can kill healthy ear cells. Do not stick cotton swabs down into your dog’s ear, as this can risk rupturing the eardrum. It is okay to use cotton balls or ear wipes to clean crevices and the earflap. Dog Ear Cleaning Technique Apply liquid cleanser to the ear as directed. Close the earflap and massage the base of the ears. Gently wipe clean with a cloth or cotton balls. Apply any medication prescribed. References: https://www.embracepetinsurance.com/about-us/press-media/press-release-detail/2019/01/10/top-dog-and-cat-claims-of-2018 Brooks, W. DVM, DABVP: 9/30/2020 (revised) 1/1/2001 (published). Veterinary Partner, Ear Infections (Otitis) in Dogs. Rothrock K. DVM: 5/19/2019 (revised), Morgan, RV. DVM, DACVIM, DACVO: 7/19/2003 (initial author). Veterinary Information Network, VINcyclopedia of Diseases: Otitis Externa, General Information. Featured Image: iStock.com/Natali_Mis"}]