[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live with hyperkeratosis?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs with hyperkeratosis have normal lifespans."}}, {"@type": "Question", "name": "Does hyperkeratosis hurt a dog’s paws?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs affected by hyperkeratosis don’t experience pain—it feels just like calluses to them. Occasionally, the excess tissue can lead to discomfort when it’s severe and on the pads of their feet. Featured Image: iStock.com/rawintanpin"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hyperkeratosis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/dog-with-hyperkeratosis.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/dog-with-hyperkeratosis.jpg"}, "author": {"@type": "Person", "name": "Melissa Boldan, DVM", "url": "https://www.petmd.com/author/dr-melissa-boldan"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/hyperkeratosis-dogs"}, "datePublished": "September 22, 2023", "dateModified": "September 22, 2023", "description": "Hyperkeratosis occurs in dogs when their body is producing too much keratin, a protein that makes up their skin, hair, and nails. Hyperkeratosis appears as thickened dry calluses on their paw pads, or furry protrusions on the pads of their feet.", "articleBody": "What is Hyperkeratosis in Dogs? Hyperkeratosis occurs in dogs when their body is producing too much keratin. Keratin is a type of protein that makes up the skin, hair, and nails in a dog’s body. When dogs have too much keratin it appears as thickened dry calluses on their paw pads. An overproduction of keratin can also look like furry protrusions on the pads of their feet. Other places that are commonly affected include the bridge of the nose and pressure points where calluses form, like the elbows. Common medical names for this condition include canine hyperkeratosis, nasodigital hyperkeratosis, and hyperkeratosis of dog paws. Hyperkeratosis is rarely a medical emergency. However, it can lead to some discomfort when walking if the hardened skin cracks, or if your dog develops a secondary skin infection. Most dogs with hyperkeratosis can be seen by their veterinarian during normal business hours. If they seem to be comfortable and are otherwise acting normally at home, try to get them to their vet within a couple of weeks of noticing their symptoms, to ensure you’re addressing their hyperkeratosis appropriately. Symptoms of Hyperkeratosis in Dogs Thickened, hard skin on the paw pads, nose, or other pressure points Hairlike projections growing off the paw pads Cracked, dry skin on the paw pads or nose Bleeding or cracked paw pads Lameness (not common) Causes of Hyperkeratosis in Dogs Hyperkeratosis is common in many breeds of dogs. It’s often diagnosed in brachycephalic breeds. They have short muzzles with a smooshed-like face, and include: English BulldogsFrench BulldogsBoston TerriersPugsBoxersThese breeds commonly experience hyperkeratosis on their nose and sometimes their paws. Outer layers of the skin typically wear off when a dog walks, runs, or rubs their face on their food bowls when eating. These physical characteristics can lead to a buildup of keratin on top of the nose or on the paw pads: When a dog’s nose is flat and doesn’t touch their bowlIf a dog has bowed legsOther traits that force a dog to be unable to flatten their paws all the way down to the floorCanine hyperkeratosis is also common in: Labrador RetrieversCocker SpanielsIrish TerriersDogues de BordeauxHyperkeratosis may also look like hard hairy skin on the elbows in senior animals. Constant pressure on thin skin, as in over the elbow, can lead to excessive keratin for protection. Since senior pets spend more time lying down and sleeping, it’s common to see hyperkeratosis in dogs aged 8 to 12. How Veterinarians Diagnose Hyperkeratosis in Dogs Hyperkeratosis is diagnosed by a veterinarian through a physical exam. If a dog has thickened, excess callused skin on their feet, nose, or elbows, they are likely affected by hyperkeratosis, especially if they are older or a predisposed breed. While most cases are due to genetics or age-related callus formation, this condition can sometimes be a sign of an underlying condition. Your vet may want to run some baseline tests to ensure that your dog is free from other diseases that could be causing the excess keratin. There are several autoimmune, hormonal, viral, and nutritional diseases that can cause symptoms like hyperkeratosis. Pemphigus foliaceus, lupus erythematosus, Cushing’s disease, canine distemper virus, and a zinc deficiency are all health issues that can lead to hardening and thickening of the skin on a dog’s paw pads. These issues need to be ruled out before a diagnosis can be made. Bloodwork, a urinalysis, cytology, or a skin biopsy may be recommended depending on what symptoms your dog may be experiencing. Let your vet know if your dog is displaying any other signs of illness. Treatment of Hyperkeratosis in Dogs Canine hyperkeratosis is not curable, but it can be managed. Treatment is often aimed at softening the hard thickened skin. Treatment may not be required in dogs that have thickened skin or hairlike projections on their paw pads, nose, or elbows. If they are comfortable and otherwise acting normally without any signs of secondary skin infections, a treatment from their vet isn&#039;t needed. You can help rehydrate and soften your pup’s dry skin by soaking their feet with warm water and then applying petroleum jelly to the affected area. Dogs with more severe symptoms may need to have some of the affected skin taken off, or they may need antibiotics like cephalexin, Clavamox, or cefpodoxime for secondary skin infections. Temporary bandages may be used on the feet after the callused skin is shaved off and ointment is applied. The severity of your dog’s condition determines how much treatment is needed to keep them comfortable. Recovery and Management of Hyperkeratosis in Dogs Most dogs affected by hyperkeratosis live long, high-quality lives. While this condition typically doesn’t go away, some dogs may not be bothered by the extra hardened skin and require very little supportive care. Hyperkeratosis of the paws or nose is usually treated with topical products. Your vet may recommend one of the following to help keep your pup’s skin supple: Some pets benefit from the skin-softening ability of anti-seborrhea shampoos such as Keratolux, DermaBenSs™, and Douxo S3 SEB™. Provide your pup with deep bedding if their elbows are affected by hyperkeratosis; it can help ease pressure on their thin skin and make them more comfortable. Prevention of Hyperkeratosis in Dogs Canine hyperkeratosis is usually a genetic condition. Because of this, there’s little you can do to prevent it in predisposed dogs. When it’s not genetic, hyperkeratosis is usually caused by repeat pressure over thin skin, typically in senior pups. Senior dogs may develop excess calluses. If this occurs, apply a moisturizing balm to their paw pads, nose, and elbows. This can be helpful in keeping their skin soft and free of cracks. Make sure to keep their bed well-cushioned to support their elbows and other areas that are vulnerable to excess keratin."}]