[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/k0dyt2k1cs", "@type": "VideoObject", "duration": "PT2M3S", "name": "5324794627001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/6f317f019d9bdf6c6fed811dac15c2683eaf3fc9.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/k0dyt2k1cs", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/23a7c7add0ca01e72509742aeb16e4c114b8a372.m3u8", "transcript": "If your dog is in pain you want to do all that you can to help him feel better. But while over the counter medications are safe and effective treatments for humans they can be very dangerous for dogs Human non steroidal anti inflammatories commonly referred to as incense should not be given to dogs for a few very important reasons. First, it's very easy for pet parents to administer an inappropriately high dose of these medications and second instead that mix with pre-existing health conditions in dogs or other medications can have an unfavorable and even dangerous outcome. These drugs may also produce scary side effects in certain dogs and should be avoided.\n\nCommon and says include aspirin and ibuprofen Tylenol or acetaminophen is another over-the-counter human pain medication that should not be given to dogs. If dogs ingest large amounts of acetaminophen the drug can destroy their liver cells damaged the kidneys and result in poor oxygen delivery throughout the body. As an aside Tylenol can be deadly for cats so it's really just best to keep all pills meant for humans in a safe spot in your home that's inaccessible to your four legged family members to treat pain and dogs pet parents should work directly with their veterinarian to identify the best options.\n\nThere are several pain medications designed specifically for treating pain and dogs, including car paraffin Derek Cox live and Maalox a Cam. Dog owners should always follow veterinary instructions for administering these drugs and report back if they notice any side effects such as an accident vomiting, diarrhea, or bleeding. In addition dogs with arthritis may benefit from a change in diet or a weight loss program. Supplements like glucosamine conjoined and hyaluronic acid may also assist with reducing inflammation in dogs but pet parents should consult their veterinarians before giving dogs any supplements.\n\nAnd it is OK to think outside the box to talk with your veterinarian about any herbal therapies available. And even acupuncture and physical therapy. These methods have also been shown to decrease the effects of arthritis pain in pet.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/poisoning-toxicity/ibuprofen-toxicity-in-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ibuprofen Toxicity in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/mother-and-daughter-lying-in-bed-with-their-puppy-picture-id951176894.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/mother-and-daughter-lying-in-bed-with-their-puppy-picture-id951176894.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/poisoning-toxicity/ibuprofen-toxicity-in-dogs"}, "datePublished": "September 24, 2012", "dateModified": "August 16, 2022", "description": "If a dog ingests Advil, it can lead to ibuprofen toxicity in dogs. Learn what to do if your dog ate ibuprofen here.", "articleBody": "Image via iStock.com/FluxFactory If you are worried that your dog ate ibuprofen, you should take them to a veterinarian immediately. Ibuprofen toxicity in dogs can cause serious damage to the kidneys, so time is of the essence if you think your dog has gotten ahold of the medication.  Ibuprofen is a non-steroidal anti-inflammatory drug (NSAID) commonly used in humans to relieve pain and reduce fever. It is available in many over-the-counter formulations (Advil, Motrin, Midol, etc.) as well as in prescription-strength medications. Though relatively safe for people, ibuprofen can be toxic for dogs. Symptoms of Ibuprofen Toxicity in Dogs Symptoms may include:  Vomiting Diarrhea Bloody feces (red or black) Blood in vomit Nausea Lack of appetite Weight loss Stomach ulcers and perforation Increased thirst Increased urination Decreased or lack of urine Seizures Incoordination (lack of coordination) Coma Death Causes Ultimately, the cause of poisoning is that the dog ate Advil or another medication containing ibuprofen. Although most cases of ibuprofen ingestion in dogs are accidental, there are instances in which pet owners administer ibuprofen-containing medications to their dog, believing them to be safe. Giving dogs ibuprofen or other OTC human medications can be extremely hazardous to a pet’s health. You should always consult a veterinarian before administering any nonprescribed medications. Ibuprofen inhibits COX enzymes, which normally have a protective effect on the mucosal barrier of the gastrointestinal tract, keep blood flowing normally to the kidneys, and help regulate platelet function. When COX enzymes are inhibited, the mucosal lining of the gastrointestinal tract becomes damaged. This causes symptoms such as vomiting, nausea, diarrhea and intestinal upset, and causes gastric ulcers to form. Reduced blood flow to the kidneys results in kidney damage. Reduced platelet aggregation leads to an increased tendency to bleed abnormally. Diagnosis After asking you questions regarding the dog&#039;s medical history, your veterinarian will perform blood and urine tests in order to assess possible kidney compromise. These test will also check for the appearance of gastrointestinal, renal and neurological signs associated with ibuprofen toxicity in dogs. Tell your veterinarian if you think or know that your dog ate ibuprofen (or any other medication). She is not going to judge you; she is trying to treat your pet quickly and effectively. We all know that accidents happen. Treatment If ingestion has just occurred and symptoms are not present, vomiting may be induced at home with hydrogen peroxide. Or you can take your dog to the vet, where they will use apomorphine to induce vomiting. Consult your veterinarian for instructions before inducing vomiting at home. Activated charcoal may be used to absorb any excess ibuprofen poison in the stomach that has not been vomited out. In some cases, gastric lavage (“pumping the stomach”) may also be necessary. In situations where the kidneys have become damaged due to ibuprofen poisoning, fluid therapy and blood or plasma transfusions will be required. Controlling vomiting in dogs with antiemetic prescription pet medications may be recommended as well as the use of gastrointestinal protectants. Gastric perforation will require surgical correction. Anticonvulsant medications (seizure medications for dogs) may be necessary if seizures occur. Prevention Ibuprofen and dogs do not mix. Keep your pets from accidentally ingesting Advil or other medications containing ibuprofen by securing all drugs in a location that’s inaccessible to your dog.  See Also"}]