[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Do Flea Eggs Look Like and How Do You Get Rid of Them?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Labrador-scratching-behind-ear.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Labrador-scratching-behind-ear.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dogs, Flea, Tick, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/what-do-flea-eggs-look-and-how-do-you-get-rid-them"}, "datePublished": "June 7, 2019", "dateModified": "April 18, 2023", "description": "Are you worried about your pet having fleas? Learn how to spot flea eggs and get rid of them safely and effectively so that you can prevent a full-blown infestation.", "articleBody": "Just the word “flea” can make us itchy—and it’s no wonder why. One flea can rapidly turn into an infestation of parasites that lay innumerable little flea eggs on dogs and cats. Catching fleas early is essential for controlling a flea outbreak. To get a flea infestation under control, it is important to fight fleas at every life stage, including targeting flea eggs. Here are some tips for identifying flea eggs on pets and how to get rid of them so you can keep your pet (and home!) pest-free. What Do Flea Eggs Look Like? Photo credit: Flickr/Denni SchnappWhile adult fleas can be identified pretty easily, flea eggs can be a little trickier to detect. Flea eggs are almost microscopic—typically about 0.5 millimeters in length and about half as wide. That’s about the size of a grain of salt. Flea eggs have a soft shell called a “chorion” that has an off-white color, similar to a grain of salt, though they are more oval in shape. Because flea eggs are easy to mistake for dry skin or sand, it’s usually not the first thing pet parents notice if their pet has a flea problem. If you have a flea infestation, finding flea dirt or actual fleas on your pet or in the home are more obvious signs. If you’d like to discern a flea egg from something else, place the speck on a dark piece of paper under a magnifying glass to identify the characteristically oval shape of a flea egg. Flea Eggs vs. Flea Dirt People often mistake “flea dirt,” or flea feces, for flea eggs—though both are signs of a flea infestation. Unlike flea eggs, flea dirt is dark and crumbly. You can identify flea dirt by putting a few of the specks on a white piece of paper and adding a couple drops of water. If you see a red color—which signals the presence of digested blood—then you’re dealing with flea dirt. Flea dirt itself isn’t actually harmful and it’s easy to wash away with a gentle bath. The bad news is that it absolutely indicates a flea problem, which means your pet will require more than just a bath for treatment. What Do Flea Larvae Look Like? Flea larvae hatch from flea eggs. They are an off-white color and look like tiny worms, ranging from 2–5 millimeters in length. But you may not see them during an infestation because they quickly burrow deep into carpets, cracks, and grass. How To Get Rid of Flea Eggs At any given time, flea eggs make up more than half of a flea population, so it makes sense that you’ll want to address them quickly and effectively. However, getting rid of flea eggs should be a part of a multi-pronged approach to eliminating a flea infestation. Treating Pets to Kill Flea Eggs Many modern flea treatments for pets contain ingredients that kill adult fleas and insect growth regulators (IGRs), which stop flea eggs from maturing into adults. Some IGRs also work to sterilize female fleas so they can’t lay viable eggs. Talk with your vet to decide which treatment they recommend for killing flea eggs on cats or dogs. They can help you choose the best product for your pet. Products for Eliminating Flea Eggs in the Home Foggers provide a simple way to kill flea eggs (and many other pests). It’s recommended to use foggers in combination with sprays or other products that can be used under furniture, where foggers have trouble reaching. Many pet parents choose to use an environmental insect growth regulator to stop fleas from developing. Sprays with IGR, such as Sentry Home household flea and tick spray for pets, are great for killing flea eggs in your home. Vacuuming and Cleaning to Get Rid of Fleas Another effective way to get rid of flea eggs at home is to vacuum thoroughly. Flea eggs aren’t sticky, so while adult fleas typically lay their eggs on their host, those eggs soon fall off into the environment. Several years ago, people commonly believed that the fleas would continue to develop in the vacuum and make their way into the environment, but that’s simply not the case. Vacuuming kills adult and non-adult fleas (eggs, larvae, pupae), which means you don’t need to worry about what to do with the vacuum bag or canister. You can remove 32–90% of flea eggs (depending on the type of carpet you have) by simply vacuuming every other day while treating your flea infestation. Vacuuming will also lift up carpet fibers so that other environmental treatments work more effectively. Vacuuming is a great idea even if you don’t have carpet—on hard surfaces such as hardwoods or tile, vacuuming can lift flea eggs from hard-to-reach cracks. Mopping and steam cleaning can help to kill flea eggs, and washing linens, bedding, and pet beds in the washing machine on the hot cycle is also advisable. If possible, declutter your home so it’s easier to clean and there are fewer places for flea eggs to hide. It’s important that your flea-control program tackles fleas at all of their life stages, including flea eggs. Employing multiple types of flea protection will help to cover any gaps in your strategy. Be sure you speak with your veterinarian about the safety of any products you choose to use in your home and on your pet. Featured Image: iStock.com/Nevena1987"}]