[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How do you test for tick-borne diseases in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "A veterinarian can test for tick-borne diseases with fast, easy blood tests."}}, {"@type": "Question", "name": "What are the long-term effects of tick-borne diseases in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Clinical signs of some tick-borne diseases may wax and wane, with recurrences requiring more courses of antibiotics. Some animals may not have any long-term side effects, although others may suffer from tick-borne chronic illnesses such as kidney disease or arthritis."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tick-Borne Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.running.water_.branch.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/dog.running.water_.branch.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Tick, Parasite", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/6-tick-diseases-dogs"}, "datePublished": "May 26, 2022", "dateModified": "May 31, 2023", "description": "Dr. Lauren Jones breaks down the most common tick-borne diseases in dogs and ways to prevent and treat these diseases.", "articleBody": "What Is Tick-Borne Disease in Dogs? Tick infestations are one of the more common issues facing pets and pet parents. Ticks are ectoparasites, meaning they are pests that live on the outside of their host. There are many species of ticks that feed off dogs and are active throughout most of the United States at different times of the year. For ticks to survive, they must bite their hosts and then feed on their blood. Ticks may carry bacteria, viruses, and parasites. Through their bite they can transmit these to our pets, causing a variety of diseases. Most of these illnesses manifest with combinations of fever, joint pain, lethargy, and bloodwork abnormalities. Ticks commonly flourish in woody, grassy areas, but they can infest homes as well. Most ticks in the United States are classified as hard ticks. The Companion Animal Parasite Council  recognizes the domestic distribution of ticks and the diseases they carry. The following list includes some common ticks and their geographic locations: Lone Star tick (Amblyomma americanum) Prefers leaf litter and wooded areas with wildlife Commonly found in Southeast and Eastern United States Gulf Coast tick (Amblyomma maculatum) Prefers tall, grassy meadows; open woods; and trails Commonly found along the Southern Atlantic coastline and the Gulf Coast American dog tick (Dermacentor variabilis) Prefers tall, grassy meadows and open woods Commonly found east of the Rocky Mountains, also in parts of California Rocky Mountain wood tick (Dermacentor andersoni) Prefers tall, grassy meadows; open woods; and trails Commonly found in the Rocky Mountain states and Southwest Canada in higher elevations Eastern black-legged (deer) tick (Ixodes scapularis) Prefers leaf litter and wooded areas with wildlife Commonly found in the Eastern United States Western black-legged tick (Ixodes pacificus) Prefers leaf litter and wooded areas with wildlife Commonly found in the Pacific coastal regions Brown dog tick (Rhipicephalus sanguineus) Can infest homes and kennels Found across North America, including Alaska and Canada Most Common Types of Tick-Borne Disease: Lyme Disease Causative agent: Spirochete bacteria, Borrellia burgdorferi Transmitted primarily by: Ixodes tick bites Common signs: Lameness, fever, decreased appetite, lethargy, kidney failure Ehrlichiosis Causative agent: Intracellular bacteria, Ehrlichia ewingii and E. canis Transmitted primarily by: Lone Star and brown dog tick bites Common signs: Hemorrhage, fever, lethargy, decreased appetite, lameness Rocky Mountain Spotted Fever Causative agent: Intracellular bacteria, Rickettsia rickettsii Transmitted primarily by: Dermacentor, Amblyomma, and Rhipicephalus tick bites Common signs: Fever, lethargy, weight loss, bleeding abnormalities Babesiosis Causative agent: Hemoprotozoans Babesia species Transmitted primarily by: Rhipicephalus, Ixodes, and Dermacentor tick bites Common signs: Weakness, bleeding issues, fever Bartonella Causative agent: Bacteria of Bartonella species Transmitted primarily by: Some species of Bartonella are transmitted by ticks and fleas Common signs: Fever, weight loss, decreased appetite, coughing, lameness, weakness Hepatozoonosis Causative agent: Protozoans Hepatozoon americanum and H. canis Transmitted primarily by: Brown dog tick ingestion Common signs: Decreased appetite, fever, lethargy, dehydration Tularemia Causative agent: Bacteria Francisella tularensis Transmitted primarily by: Dermacentor and Amblyomma tick bites Common signs: Fever, decreased appetite, enlarged lymph nodes, eye abnormalities, abscesses Tick Paralysis Causative agent: Neurotoxin spread through tick saliva Transmitted primarily by: Dermacentor and Ixodes tick bites Common signs: Rapidly progressive paralysis of legs starting in rear and progressing to all four limbs, difficulty breathing Anaplasmosis Causative agent: Intracellular bacteria Anaplasma phagocytophilum Transmitted primarily by: Ixodes tick bites Common signs: Lethargy, lack of appetite, fever, dehydration  Symptoms of Tick-Borne Diseases in Dogs Many dogs with tick-borne disease are asymptomatic. However, common signs are non-specific and include: Fever Loss of appetite Painful or swollen joints Lameness Swollen lymph nodes Bruising Abnormal bleeding Lethargy When left untreated, tick-borne diseases can cause damage to the kidneys, nervous system, immune system, vascular system, and heart. In particular, many tick-borne diseases cause problems within the blood, leading to serious bleeding and the inability for blood to clot properly. This, as well as other tick-related conditions, can be fatal. Causes of Tick-Borne Diseases in Dogs Tick-borne diseases are spread by ticks, although it is important to realize that in almost all cases, ticks aren’t the cause of the disease. Rather, ticks become infected with bacteria and protozoal organisms at some point in their life cycle. Ticks then transmit, or transfer, these diseases to dogs when they bite. Tick paralysis is an exception, as it is caused by toxins in the saliva of ticks. How Veterinarians Diagnose Tick-Borne Diseases in Dogs Veterinarians may suspect tick-borne disease based on history, symptoms, and exposure (known or suspected) to ticks. There are a variety of possible diagnostic tests for tick-borne disease, but typically veterinarians start with a multi-species test, commonly known as a SNAP 4Dx test. While other tests perform similarly, the SNAP 4Dx test is often used in the hospital with only a few drops of blood. Results are available within 10 minutes, so pets can start on necessary treatments quickly. The SNAP 4Dx tests for the three most common tick-borne diseases: Lyme, anaplasmosis, and ehrlichiosis. It also tests for heartworm disease. Veterinarians will also want to run a blood chemistry analysis, complete blood count, and urinalysis for any animals with confirmed or suspected tick-borne disease. This helps figure out the severity of disease and its impact on organs and metabolism. Treatment of Tick-Borne Diseases in Dogs Treatment of tick-borne diseases is typically a 10– to 28-day course of antibiotics, most notably doxycycline, enrofloxacin, clindamycin, azithromycin, or imidocarb. The dose and length of treatment will vary based on the specific disease. Based on clinical signs, other medications and supportive therapy may be needed, including pain and anti-inflammatory medications, intravenous fluids, and even blood transfusions. Dogs with immune-mediated conditions may require steroids and immunosuppressive drugs, while dogs with kidney failure secondary to tick-borne disease may require intensive and aggressive treatment initially, with lifelong dietary and lifestyle changes. Recovery and Management of Tick-Borne Diseases in Dogs Mild cases of tick-borne disease may only require one course of antibiotics. Management of severe cases varies with symptoms, but these diseases can have lifelong side effects and complications. Some asymptomatic dogs with tick-borne diseases are diagnosed through routine screening. Most cases of tick-borne disease have a good prognosis. However, the outcomes for diseases such as Lyme nephritis are more uncertain. Prevention of Tick-Borne Diseases in Dogs The best way to prevent tick-borne diseases in dogs is to avoid ticks and tick-infested areas when possible. It’s also important to ensure your dog is on tick and flea preventative care throughout the year.  Tick prevention comes in oral, topical, or collar form and uses pesticides, repellents, and growth inhibitors. Treating the environment is also crucial in areas with lots of ticks. Ticks may live in the house, yard, or kennel, and treatment with pesticides may be required. For active dogs who spend a large amount of time outdoors, there is no way to eliminate all exposure to ticks. For these dogs, products that repel ticks may be preferred. Careful grooming after outdoor activities can also catch ticks before they bite. Some diseases are also zoonotic, which means that humans are also susceptible. Because most tick-borne diseases are spread only through the bite of a tick, humans don’t get the disease directly from their pet. Pets can also bring unattached ticks into the house that may find and bite a human."}]