[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Uncoordinated Cilia Function in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_dg_primary_ciliary_dyskinesia"}, "datePublished": "November 14, 2008", "dateModified": "August 16, 2022", "description": "Ciliary dyskinesia is a congenital disorder caused by ciliary dysfunction. The cilia are complex hairlike structures, capable of movement, that line various body organs, including the upper and lower respiratory tracts, auditory tubes, ventricles of the brain, spinal canal, uterine tube, and the ducts of the testes.", "articleBody": "Primary Ciliary Dyskinesia in Dogs Ciliary dyskinesia is a congenital disorder caused by ciliary dysfunction. The cilia are complex hairlike structures, capable of movement, that line various body organs, including the upper and lower respiratory tracts, auditory tubes, ventricles of the brain, spinal canal, uterine tube, and the ducts of the testes. The main function of the cilia is to move cells, or to move the surrounding fluids. They also serve as a kind of filter. In the respiratory tract, the cilia work to remove dust and other material from inhaled air before it is moved into the lungs. Ciliary beating (the process of movement) is normally coordinated by an intricate interaction of numerous proteins contained within each cilium. Movement is characteristically uncoordinated (dyskinetic) or absent in dogs affected with ciliary dyskinesia; the affected cilia will often have structural lesions. Clinical signs predominate in ciliated organs: a lack of mucociliary (interaction of mucus and cilia) clearance in the respiratory tract can lead to recurrent bacterial rhinosinusitis, bronchopneumonia and auditory canal (ear) infection, as well as chronic inflammation and obstruction of the airways. It can also lead to male infertility (live sperm that are incapable of movement). Hydrocephalus (fluid in the brain), and situs inversus (organs on opposite side than normal) are common albeit variable features of ciliary dyskinesia. Diagnosis is confirmed by demonstrating the absence of tracheal mucociliary clearance and the presence of a specific lesion in respiratory cilia or sperm flagella. It is established in patients without ciliary lesions by analysis of ciliary function. Dogs with chronic respiratory tract disease and situs inversus will in all probability have primary ciliary dyskinesia and do not warrant an extensive workup. This is a genetic disease with a probable autosomal recessive mode of inheritance. Signs typically develop at an early age, from a few days old to five weeks of age. Some dogs, however, will remain asymptomatic for prolonged periods; from six months to ten years. Ciliary dyskinesia, in particular, has been reported only in purebred dogs - bichon frises, border collies, bull mastiffs, Chihuahuas, shar peis, chow chows, Dalmatians, Doberman pinschers, English cocker spaniels, English pointers, English setters, English springer spaniels, golden retrievers, Gordon setters, long-haired dachshunds, miniature poodles, Old English sheepdogs, Newfoundlands, rottweilers, and Staffordshire bull terriers. Symptoms and Types     Moist, productive cough that may be elicited by exercise    Bilateral nasal discharge with mucous and pus    Rapid breathing, shortness of breath, and pale tissues may be observed    Chronic sneezing and coughing - may produce copious amounts of mucous and pus. Despite dramatic response to antibiotics, patients may have continuous nasal discharge and will relapse after treatment is stopped    Family history: large litters tend to have more than one affected animal; progeny from prior mating of the dam and sire may have been affected    Tends to occur in young purebred dogs    Fertility: females remain fertile, males characteristically do notCauses     Genetic disease    InbreedingDiagnosis There are a number of ailments with the same, or similar, symptoms, so your veterinarian will need to conduct various tests to determine a diagnosis, beginning with a biopsy of the nasal or bronchial mucous. Specific lesions must be found in a high percentage of cilia, and the same defect must be found in cilia from multiple locations (e.g., nasal and bronchial cilia, and sperm flagella), as well as from affected litter-mates before a diagnosis of an inherited defect can be made. An analysis of ciliary beat frequency and synchrony will be used to confirm the diagnosis. An electrocardiogram -- a recording of the electrical activity of the heart -- can be used to confirm situs inversus (organs on opposite sides than normal).  Treatment The sheer force produced by exhalation and coughing can clear airway secretions, so routine exercise may enhance mucus clearance by increasing respiration and inducing coughing. Supplemental oxygen therapy may be needed during acute episodes of life-threatening bronchopneumonia. Antibiotics will be prescribed for respiratory infections on the basis of bacterial culture and sensitivity testing. It may be continued indefinitely, although it may possibly become ineffective because of a buildup of bacterial resistance. Anesthesia is risky with these patients because the ability to breath is impaired. Living and Management High ambient temperature may produce hyperthermia and potential heat stroke because of reduced capacity for evaporative heat loss through the lungs. Cysts in the chest may develop from prolonged air entrapment in the pleural cavity, which can then rupture and produce a pneumonic condition in the lungs. Other aftereffects are also possible. For these reasons, you will need to carefully observe and monitor your pet, and schedule frequent checkups with your veterinarian."}]