[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/m7yo5tog3j", "@type": "VideoObject", "duration": "PT1M52S", "name": "5324820026001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/f3f03e96dc3d106935a594e30cba35b52ddff321.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/m7yo5tog3j", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/edf5301e3a48d97b8f871ceb91c0e2e2793ff07d.m3u8", "transcript": "Heartworm disease is caused when a parasitic nematode commonly referred to as a heartworm infects a dog or a cat. Heart worms affect a pet's heart and the blood vessels in the lungs. The severity of the disease depends on the number of worms present in the animal's body as well as the duration of the infestation. Mosquitoes spread heartworm disease to our pets.\n\nWhen a mosquito that is carrying the heartworm larva bites a dog or a cat the lava migrates from the bite wound through the pet's bloodstream until it reaches the animal's heart and lungs, the larva then matures and the dog or cat's heart pets with mild forms of heartworm disease often show no signs or may just exhibit an occasional cough. More advanced symptoms of heartworm disease may include frequent coughing and exercise intolerance in cats. The symptoms can often be confused with feline asthma in the most severe cases pets may show signs of anemia exercise intolerance labored breathing rapid heartbeat fainting or even anaphylaxis.\n\nTo diagnose heartworm disease, your veterinarian may perform a blood test to detect antibodies against heart worms. They also might do an X-ray or an echocardiogram. Dogs that are diagnosed with the disease may be hospitalized and given an adult aside, which is a medication designed to kill heart worms in the most severe cases. Surgery may be necessary to remove the heart worms themselves from the right heart and the pulmonary artery.\n\nThere is no treatment for heartworm disease in cats, which is why prevention is so very important for our feline friends. Dogs recovering from heartworm treatment should have their physical activity severely restricted for six to eight weeks after the last dose of medication as rest is essential for recovery heartworm disease is preventable with monthly heartworm preventive that are available from your veterinarian and should be considered for all pets, including your indoor only cat.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/conditions/infectious-parasitic/how-treat-heartworms-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Treating Heartworms in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/rottweiler-puppy-picture-id964391922_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/rottweiler-puppy-picture-id964391922_0.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Heartworm, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/how-treat-heartworms-dogs"}, "datePublished": "December 22, 2014", "dateModified": "October 13, 2022", "description": "Not treated properly, heartworms in dogs cause serious health complications. Learn about the symptoms and treatment options for dogs with heartworms.", "articleBody": "Heartworms (Dirofilaria immitis) are parasitic roundworms that can infect both dogs and cats. If your pets are not on pet prescription heartworm prevention program, they may contract the parasite through the bite of an infected mosquito. Heartworm disease is preventable if you diligently use heartworm prevention prescribed by your veterinarian. Dogs are “natural” hosts to heartworms, meaning that once they become infected, the juvenile heartworm parasites can complete their entire life cycle. As the heartworms mature, they work their way into your dog’s heart, lungs and associated blood vessels. Once there, they can grow to be up to a foot long. It is possible for one dog to be infected with hundreds of heartworms. If not treated properly, heartworms in dogs will lead to serious health complications and death. This is why it is so important to keep your dog on continuous heartworm prevention.    What to Expect at the Vet’s Office  If your dog has been diagnosed with heartworm disease via a heartworm antigen test (the most common form of testing), your veterinarian will do a few more diagnostic tests to confirm diagnosis. A test for microfilariae (juvenile heartworms in the blood stream) will be performed. If no microfilariae are found, a confirmatory test for adult heartworms should be run by sending a sample to an outside lab. Complete blood cell count, blood chemistry tests, a urinalysis and chest X-rays to assess your dog’s overall condition and plan the safest way to move forward with treatment. An echocardiogram is recommended for moderate to severe cases. Other tests may also be necessary based on a dog’s individual case. Overview of Heartworm Treatment for Dogs     Medications: Protocols for treating heartworms often call for the use of multiple medications including several injections to kill the adult heartworms, doxycycline and prednisone taken orally to reduce the chances of unwanted side effects, and heartworm preventative to kill the juvenile heartworms and prevent further infection. In some cases, other medications may be prescribed or different protocols recommended. Surgery: Severe cases of heartworms in dogs may require surgery to remove the worms from the heart and vessels within the lungs, but many of these patients die regardless of treatment. Exercise Restriction: Exercise restriction is a vital part of successful treatment for heartworms in dogs. This is required before, during and after treatment for a prolonged period of time. Heartworm Treatment Steps  Treatment protocols for heartworms are determined on a case-by-case basis, but most dogs are treated with some variation of the following, taking place over the course of several months: Begin exercise restriction. If the dog’s condition is especially severe, appropriate stabilization therapy is necessary. Begin treatment with oral prednisone and doxycycline to reduce the chances of a bad reaction to the death of heartworms. Hospitalize the dog for the day and give a heartworm preventative to kill juvenile heartworms in the bloodstream. This is often given in the clinic in case of a reaction. Continue to give heartworm preventatives monthly at home. Give the first injection of melarsomine to kill adult heartworms 30 days after the end of the doxycycline treatment. Restrict exercise and closely monitor for side effects for the next 30 days. Give the second injection of melarsomine 30 days after the first. Give the third injection of melarsomine one day after the second. Continue exercise restriction for another six to eight weeks. Test for microfilariae (juvenile heartworms in the blood stream) 30 days after third melarsomine injection. Test for adult heartworms and microfilariae approximately 9 months after the third melarsomine injection. What to Expect at Home The most important aspect of home care for dogs undergoing treatment for heartworms is exercise restriction. Dogs should be crated when a responsible adult is not able to prevent excess activity. Dogs should only be allowed outside for short on-leash walks to urinate and defecate. Give your dog the full course of any prescription pet medications that have been prescribed, even if he or she appears to be healthy. Questions to Ask Your Veterinarian As with any type of laboratory test, false positive and false negative results on heartworm tests are possible. In particular, dogs who have been bitten by a heartworm-infected mosquito within the last six months will test negative until their heartworms mature. Retesting at an appropriate date will usually reveal that the dog does have heartworms. If you have any doubts as to your dog’s diagnosis, you can ask that your dog be tested for heartworm disease at a later date or using a different type of test. Dogs who have had heartworms are not immune to reinfection. Ask your veterinarian what schedule of testing and preventative administration is required to avoid future heartworm infections. Most dogs benefit from receiving year-round heartworm prevention. Possible Complications With Heartworm Treatment for Dogs Side effects are common with heartworm treatment. Many dogs experience soreness and swelling at the site of melarsomine injections (the muscles on either side of the spine). Abscesses can also form in these locations. Talk to your veterinarian if your dog is very uncomfortable or becomes worse over time. The most severe problems that are seen after heartworm treatment in dogs are related to the sudden death of large numbers of worms. Call your veterinarian immediately if you notice any of the following: Your dog develops a cough or a preexisting cough becomes worse Your dog has difficulty breathing or pants excessively Your dog becomes weak or lethargic or collapses Your dog’s appetite significantly decreases Your dog begins to vomit or drool excessively or develops diarrhea While the treatment of heartworms in dogs can cause serious side effects, heartworms kill dogs if left untreated. Prevention, on the other hand, is easy and well-tolerated by most dogs. By preventing heartworms in the first place, you can save your dog from a long and difficult treatment process. Featured Image: iStock.com/Meagan Jenkins"}]