[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "When Should You Start Heartworm Prevention for Puppies?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/puppy-behing-gate.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/puppy-behing-gate.jpg"}, "author": {"@type": "Person", "name": "Laura Dayton, DVM", "url": "https://www.petmd.com/author/dr-laura-dayton"}, "keywords": "Dog, Heartworm, Medication, Puppy", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/when-should-you-start-heartworm-prevention-puppies"}, "datePublished": "August 11, 2020", "dateModified": "October 13, 2022", "description": "Veterinarian Laura Dayton explains when to start heartworm prevention for puppies and why you need to worry about heartworms in puppies.", "articleBody": "Can puppies get heartworms? Adopting a new puppy means you’ll have plenty of questions and a lot of information take in. It can be overwhelming, but you should understand the risk of heartworms in puppies. Puppy heartworm prevention is an important aspect of new puppy care, alongside flea and tick prevention. Here’s what you need to know about heartworm disease and when to start heartworm prevention for puppies. At What Age Do You Start Puppy Heartworm Prevention? The American Heartworm Society recommends that you start heartworm prevention for puppies at 8 weeks of age and keep them on it year-round. Heartworm disease has been diagnosed in all 50 states, and there is growing concern about resistance to some preventatives—mostly due to inconsistent dosing by owners. Climate change, the expansion of suburban areas, and the persistence of the worm in wildlife all contribute to heartworm&#039;s growing threat. That’s why consistent year-round dosing is very important for keeping your puppy healthy and heartworm-free. Why Is Missing a Dose of Puppy Heartworm Prevention Such an Issue? It’s important to understand at what point the heartworm medication kills heartworms in the heartworm life cycle. You may assume that it stops your puppy from being infected by the heartworms in the first place. But heartworm preventatives (such as ivermectin, milbemycin, moxidectin, selamectin) can only kill the later larvae stages of heartworms. So when you give your puppy their heartworm prevention, you are essentially deworming them of any heartworm larvae they have already contracted within the last 30 days. Missing a single dose, or even giving a dose one or two weeks late, may mean that those larvae have matured into adults that can no longer be killed by the puppy heartworm prevention. Call your veterinarian if this happens, because if you wait and your puppy gets heartworm disease, it can have serious consequences. When Can Puppies Be Tested for Heartworms? Most veterinarians test puppies for the first time anywhere between 6-10 months of age. Heartworm testing is typically done once a year unless you’ve missed a dose or gave the pill a week or two late. If this happens, simply contact your veterinarian to see if your puppy needs a heartworm test sooner. When your puppy is at least 6 months old, you could opt for the ProHeart 6 shot that lasts six months, so you don’t need to remember to give a monthly pill. Ask your veterinarian about this option. What Happens if a Puppy Gets Heartworm Disease? Heartworm disease in puppies can have life-altering and long-lasting effects. Changes start in the puppy’s heart and lungs as soon as adult worms are present—a whole two months before they can even be detected. The heartworms cause inflammation of the vessels in the heart and lungs. Inflammatory proteins called globulins can clog the very fine and intricate apparatus of the kidney, causing damage and failure. Damage can also occur to the liver and heart muscle itself. Sadly, if you wait until your puppy is showing signs of heartworm disease, treatment is much more complicated, dangerous, or altogether impossible. Even if the heartworm infection is found and treated early, the damage to the arteries in the lungs, the lungs themselves, the heart muscle, and the kidneys can be irreversible. This means that even if your puppy is treated and cleared of their heartworm infection, they may have a shortened life span because of it. Puppy Heartworm Prevention Has Other Benefits Many options for heartworm prevention for puppies also act as monthly dewormers for a host of other intestinal parasites, some of which can be contagious to people. Depending on how much your puppy may have been dewormed, they may still come home with some number intestinal worms, which heartworm preventatives can help to control. Some puppy heartworm prevention products also include flea prevention, which is another important part of keeping your puppy healthy throughout the year. Featured Image: iStock.com/CiydemImages"}]