[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Stomach Worm Infection (Physalopterosis) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/stomach-worm-infection-physalopterosis-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/stomach-worm-infection-physalopterosis-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Worms", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_physalopterosis"}, "datePublished": "November 7, 2008", "dateModified": "August 16, 2022", "description": "Physalopterosis is an infection of the gastrointestinal tract, caused by the parasitic organism Physaloptera spp. Typically, only a few worms are present; in fact, single worm infections are common.", "articleBody": "Physalopterosis in Dogs Physalopterosis is an infection of the gastrointestinal tract, caused by the parasitic organism Physaloptera spp. Typically, only a few worms are present; in fact, single worm infections are common. There is no age, breed, or gender that is more susceptible to acquiring this condition than others. If you would like to learn more about this disease affects cats, please visit this page in the petMD health library. Symptoms and Types An infection of stomach worms caused by Physaloptera spp. can be asymptomatic, meaning that no obvious outward signs are present, or the infection may be apparent by the presence of gastric symptoms. The primary symptom is vomiting, which can be of the chronic or acute form. In some cases, a worm, or multiple worms, will be found in the vomit contents. Causes Stomach worms are caused by the parasitic organism Physaloptera spp. The worms are typically transmitted when an animal ingests the infective larvae that are residing in an intermediate host. Intermediate hosts, such as grubs, beetles, cockroaches, and crickets, are commonly coprophagous -- meaning they eat feces, thereby propagating the life cycle of the Physaloptera parasite. The worm can also be transmitted through ingestion of a transport host, such as a bird, rodent, frog, snake, or lizard. Outdoor exposure increases access to these intermediate or small vertebrate transport hosts, increasing the odds of contracting stomach worms. Dogs kept indoors without access to these hosts are less susceptible to infection. Diagnosis The primary method for identifying and diagnosing worms is through endoscopic gastroscopy, in which a small thin tube with a tiny light and camera at the end is inserted through the dog&#039;s mouth and into the stomach in order to visually examine the interior of the stomach. Worms will usually attach to the stomach lining, or to the mucus-covered lining of the intestines. A careful and thorough exam is necessary for detecting worms because there are generally not many present, and they can be hidden by mucus and stomach contents. Also, at 2.5 to 5 cm long, the worms are quite small. An examination of the dog&#039;s vomit and feces may also reveal an infection of stomach worms if worm eggs are found to be present in the contents.  Treatment The worms do not necessarily have to be removed from the dog&#039;s body; treatment of stomach worms can be done at home with prescribed drugs. An adulticide designed to kill the adult worms can be prescribed, as well as other medications for the reduction of gastric symptoms.   Living and Management Treatment with an adulticide, and any other prescribed medications, will need to be followed as per your veterinarian&#039;s instructions. Your doctor will schedule a follow-up visit with your dog so that treatment efficacy can be assessed. Any clinical signs, or the shedding of eggs in feces, should be resolved within two weeks of treatment. If the initial treatment is unsuccessful, re-treatment may be necessary. Prevention Limiting your dog’s access to areas where intermediate hosts, or small rodent transport hosts can be found may prevent stomach worms. Outdoor exposure will increase the odds of contracting stomach worms."}]