[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can you see whipworms in dog feces?", "acceptedAnswer": {"@type": "Answer", "text": "It is possible to see whipworms in your dog’s feces; however, they are not seen very often. They would look like thin pieces of thread."}}, {"@type": "Question", "name": "How long does it take to get rid of whipworms in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "It takes three months to get rid of whipworms in dogs."}}, {"@type": "Question", "name": "Can humans get whipworms from dogs?", "acceptedAnswer": {"@type": "Answer", "text": " Humans are not able to catch whipworms from dogs."}}, {"@type": "Question", "name": "Can whipworms spread from dog to dog?", "acceptedAnswer": {"@type": "Answer", "text": "Whipworms are not spread directly from dog to dog, but if your dog comes into an environment where another pet has released infective eggs (in their feces), then your dog can potentially become infected."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Whipworms in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Infectious-Parasitic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/iStock-1339998610.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/iStock-1339998610.jpg"}, "author": {"@type": "Person", "name": "Christina Hawkins, DVM", "url": "https://www.petmd.com/author/dr-christina-hawkins"}, "keywords": "Dog, Parasite, Worms", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/infectious-parasitic/c_multi_trichuriasis"}, "datePublished": "April 21, 2022", "dateModified": "March 16, 2023", "description": "Christina Hawkins, DVM, discusses whipworms in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Whipworm in Dogs?  Trichuris Vulpis, also known as whipworm, is a type of intestinal parasite that can infect dogs. The time between infection with the parasite and production of whipworm eggs by female worms is between 74 to 90 days. The duration between infection with parasite, and actual production of whipworm eggs, impacts how this parasite is treated. If treatment does not cover the reproductive cycle of the parasite, it will make it difficult to clear the infection. There are three stages in the life cycle of the whipworms, including the eggs, larvae and mature adult whipworms. Stage 1 Eggs: Whipworms eggs are released in the stool of an infected dog out into the environment. Over a period of 9 to 21 days, the eggs mature into an infective stage. This maturation process is impacted by the temperature and moisture of the soil, and eggs can survive in the environment for years. Stage 2 Larvae: Once the eggs are ingested by your dog, the larvae hatch from the eggs and attach to the mucosa (walls of the intestines). They remain there for a period of 2 to 10 days and continue to develop before moving on to a different part of the intestinal tract (cecum or sometimes colon area). Stage 3 Adult: The adult worms mainly reside in the cecum or colon areas of the large intestine where they consume blood, tissue, fluids and mucosal lining. After 70 to 90 days, the female adult worms produce eggs. Female worms can produce more than 2,000 eggs per day. The immature eggs are released in the dog&#039;s feces, and the life cycle continues. If a dog ingests infective whipworms eggs from the soil, it can become infected with the parasite. Symptoms of Whipworm in Dogs Some pets with whipworms may not show any clinical signs. The infection can be asymptomatic with low numbers of worms present. As the worm burden increases, there is more potential for inflammation and even hemorrhage into the cecum and colon. Clinical signs of whipworm include: Diarrhea, often with frank (bright red blood) or mucus presentWeight lossDehydrationAnemiaElectrolyte imbalances (increased potassium K+ and decreased sodium Na+), mimicking Addison’s diseasePet parents typically do not see whipworms in the stool, but if they were present, they would look like small pieces of thread with one end enlarged. Causes of Whipworm in Dogs Dogs become infected with whipworms by being in contact with infected soil. Whipworm eggs thrive in moist, warm soil but over time are susceptible to desiccation (drying out). The eggs can remain in the environment for several years. Unlike other intestinal parasites that can be transmitted by the placenta, breast milk or from an intermediate host, your dog would have to ingest the infective eggs from the soil to become infected. How Veterinarians Diagnose Whipworm in Dogs To diagnose this condition, your veterinarian will test your pet&#039;s fecal sample for the presence of whipworm eggs. The eggs, viewed under a microscope, will look like football-shaped eggs with caps on both ends. Whipworm eggs can be difficult to find in fecal samples because of the long reproductive cycle and the eggs are shed into the stool intermittently. They are heavier than other parasite eggs so different laboratory techniques may be needed. If none of the eggs are found in your dog’s fecal sample, but your veterinarian is still suspicious about possible whipworm infection, then a parasite antigen test can be performed. This is a test usually performed at an outside laboratory where the feces is tested for the presence of a protein associated with whipworms. The Companion Animal Parasite Council recommends fecal testing puppies at least four times per year, and adult dogs twice yearly to check for whipworms. Treatment of Whipworm in Dogs There are various anthelmintic (deworming) medications available for treating whipworms. The most used is Fenbendazole. The medication is given once daily for three days and then repeated in three weeks and finally once again in three months. This is to make sure medications cover the long 70- to 94- day reproductive cycle of the whipworms. The other options for treatment include several of the monthly heartworm prevention medications that will treat and help prevent future whipworm infections Recovery and Management of Whipworm in Dogs After three months of treatment, your pet should be recovered from whipworms. Monthly prevention medications are important as they can help prevent and even treat whipworm infections. It is better for your pet’s health to try to prevent intestinal parasites than to have to treat these infections and have your pet deal with the underlying clinical signs. Common preventative medications include: InterceptorInterceptor PlusSentinelSpectrumAdvantage MultiTrifexisIf you are not able to keep your pet on a monthly preventive, it’s best to treat adult pets four times a year with a broad-spectrum dewormer."}]