[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does kennel cough sound like?", "acceptedAnswer": {"@type": "Answer", "text": "Kennel cough typically causes a dry, hacking or even goose honking-type cough. Often, pet parents mistake this for something caught in the throat or think their pet is trying to cough something up. "}}, {"@type": "Question", "name": "How long does kennel cough last?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with mild kennel cough are usually sick for about one or two weeks and recover well. These dogs usually only experience mild clinical signs and quickly recover from kennel cough, which translates to a good prognosis. Dogs that have complicated cases of kennel cough can be sick for three to six weeks, with a long road to recovery. If dogs are severely affected by kennel cough and develop pneumonia, they could possibly die."}}, {"@type": "Question", "name": "How do you treat kennel cough at home?", "acceptedAnswer": {"@type": "Answer", "text": "Holistic antioxidants for dogs, such as dimethylglycine (DMG), can be used to help modulate and boost the immune system to fight off the virus faster.  Nebulization can be performed under veterinarian supervision using either a nebulizer from a human or canine pharmacy, or you can use a steamy bathroom. Run a hot shower and allow the bathroom to fill with steam. Then have your dog stay in the bathroom (not in the shower) for 5–15 minutes a few times daily. This helps to moisten the airways and decrease irritation.  A room humidifier can also be used in the room that your dog sleeps in at night to decrease irritation in the respiratory tract. Keep your pet rested during recovery. Avoid any heavy play or exercise and allow your dog to get plenty of rest. Avoid anything that may irritate your dog’s respiratory tract during recovery, such as aerosol sprays, household cleaners, incense, and cigarette smoke."}}, {"@type": "Question", "name": "Is sneezing a sign of kennel cough?", "acceptedAnswer": {"@type": "Answer", "text": "Sneezing can be a sign of kennel cough and often shows up as a “reverse sneeze.” Usually this is secondary to irritation of the throat or nasopharynx, but it can also be caused by postnasal drip. "}}, {"@type": "Question", "name": "How long is kennel cough contagious for?", "acceptedAnswer": {"@type": "Answer", "text": "Shedding of the virus can go on for one to three weeks after infection with kennel cough. It is best to keep your dog away from other dogs during this time to avoid transmission. Your veterinarian will instruct you when it is safe to allow your dog to interact with other dogs again."}}, {"@type": "Question", "name": "What can I give my dog for kennel cough over the counter?", "acceptedAnswer": {"@type": "Answer", "text": "Never give your dog human medications. Holistic antioxidants for dogs, such as dimethylglycine (DMG) can be used to help modulate and boost your dog’s immune system to fight off the virus faster. This can be found as a supplement through most pet retailers. Ask your veterinarian for a recommendation for your pet. Featured Image: Adobe/kerkezz"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Kennel Cough in Dogs: Symptoms and Treatments", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/kennel-cough-in-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/kennel-cough-in-dogs.jpg"}, "author": {"@type": "Person", "name": "Sara Bledsoe, DVM, CVA, CHPV", "url": "https://www.petmd.com/author/dr-sara-bledsoe"}, "keywords": "Dog, Condition, Respiratory health, Symptom Checker, Kennel Cough", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/kennel-cough-dogs-symptoms-and-treatments"}, "datePublished": "June 30, 2020", "dateModified": "September 14, 2023", "description": "Kennel cough in dogs is a highly contagious respiratory disease. Learn the symptoms of kennel cough and the proper kennel cough treatment here.", "articleBody": "What Is Kennel Cough? If you notice your dog coughing, kennel cough might be the culprit. Kennel cough—also known as canine infectious respiratory disease (CIRD) or infectious tracheobronchitis—is a highly contagious respiratory disease in dogs. Kennel cough in a dog sounds like a dry, hacking cough that sometimes sounds like your pup has something stuck in their throat. Kennel cough can cause mild symptoms in some dogs, but it can progress to a life-threatening pneumonia in other dogs. This is why it’s important to recognize the symptoms of kennel cough and seek treatment immediately. There is also a kennel cough vaccination that can prevent your dog from getting kennel cough. Here’s everything you need to know about kennel cough in dogs—from what it is and its symptoms to kennel cough treatment and prevention. Kennel Cough Symptoms Symptoms of kennel cough include: A persistent dry, hacking cough Coughing during the night that keeps you and your dog awake Retching with the production of white foam Tracheal sensitivity (your dog coughs when you apply gentle pressure to their trachea) While often self-limiting (meaning it can resolve without treatment), kennel cough can progress to more severe symptoms, especially in neonate or geriatric dogs. Severe symptoms of kennel cough include: Lethargy Loss of appetite Fever Labored breathing Dogs with severe symptoms need to see their veterinarian immediately for diagnosis and treatment. Causes of Kennel Cough Kennel cough can be caused by multiple bacteria and viruses, including: Bordatella bronchiseptica bacteria Canine adenovirus Parainfluenza virus Mycoplasma Kennel cough is typically spread when a healthy dog is exposed to the respiratory secretions of an infected dog. This can be through coughing or sneezing, and dogs can also contract kennel cough from infected objects (such as toys, food bowls, or water bowls). Dogs are typically exposed to kennel cough when they are in crowded areas that have poor airflow and warm, moist air, such as: Animal shelters Boarding kennels Dog daycare facilities Grooming facilities Dog parks Dogs can develop kennel cough approximately three to four days after exposure. Kennel cough in a dog sounds like a dry, hacking cough that sometimes sounds like your pup has something stuck in their throat.How Vets Diagnose Kennel Cough in Dogs In most cases, a presumptive kennel cough diagnosis can be made based on the dog’s clinical signs, history, and response to therapy. Identifying the underlying bacteria or virus is often not required. However, diagnostic testing is recommended for: Dogs where pneumonia is suspected Dogs that do not respond to supportive care Dogs with signs of systemic disease If an outbreak is occurring in multiple dogs To rule out other infectious respiratory conditions, such as dog flu (canine influenza) Blood work Blood work (specifically complete blood count) can sometimes reveal an elevated white blood cell count in those dogs with pneumonia as a complicating factor. Chest X-rays Chest radiographs are usually unremarkable in patients with mild to moderate cases of kennel cough. But X-rays are helpful in ruling out pneumonia, collapsing trachea, congestive heart failure, bronchitis, or other causes of coughing in dogs. Polymerase Chain Reaction (PCR) Assay Polymerase Chain Reaction (PCR) Assay are commonly used tests for viral and bacterial detection. Samples for this test are obtained by nasal or throat swabs. False negative and positive results are possible.  Other testing may include transtracheal washing and bacterial culture in cases of persistent or recurrent coughing.  Kennel Cough Treatment The treatment for kennel cough will depend on your dog and the severity of the condition. Mild Cases of Kennel Cough in Dogs For mild cases of kennel cough, treatment may only include supportive care, which focuses on rest, nutrition, and hydration. A cough suppressant may be prescribed by your dog’s veterinarian to help reduce the frequency of the cough. For mild cases of kennel cough, treatment may only include supportive care, which focuses on rest, nutrition, and hydration.It should take about one to two weeks for a dog to recover from a mild case of kennel cough. Some dogs can completely recover on their own with no treatment required. Severe Cases of Kennel Cough in Dogs Complicated cases of kennel cough can cause your dog to become very sick. A dog with severe kennel cough will most likely be coughing, acting very lethargic, and not wanting to eat or drink. If a dog has developed pneumonia, then treatment can involve: Hospitalization Intravenous fluids Antibiotics Possibly oxygen therapy Are There Home Remedies for Kennel Cough in Dogs? For mild cases of kennel cough, there are a few at-home remedy options. However, keep an eye out for signs that your dog’s kennel cough is getting worse or not getting better. Add Honey to Warm Water Honey can be a great home remedy for kennel cough as it can help soothe your dog&#039;s throat and minimize coughing. You can give your dog 1/2 tablespoon to 1 tablespoon of honey mixed with a little warm water in a bowl. This can be offered up to three times a day depending on how often your dog is coughing. Use a Humidifier A small humidifier can be placed near your dog while they are resting. The humidifier will moisten the air that your dog breathes, which can help with irritation of the respiratory tract. Use Your Shower to Do Steam Therapy If you’re taking a hot shower or bath, let your coughing dog stay in the closed bathroom with you (but not in the shower or bath!). The hot shower can provide steam therapy and also help to decrease irritation. Try Holistic Antioxidants Made for Dogs Holistic antioxidants for dogs, such as dimethylglycine (DMG), can be used to help modulate and boost the immune system to fight off the virus faster.  Make Sure Your Dog Is Getting Plenty of Rest Rest is very important for your dog while recovering from kennel cough. Try to reduce the amount of exercise your dog gets on a daily basis while they are recovering from kennel cough—this can help with healing and reduce coughing spells. Is Kennel Cough Fatal? Most dogs with kennel cough can recover without complication. However, some dogs can become very sick with life-threatening pneumonia. Dogs that are more susceptible to complications from kennel cough include: Puppies that have immature immune systems (especially young puppies that have not been fully vaccinated) Older dogs that have a decreased immune defense or other serious diseases (heart failure, diabetes, or cancer) Pregnant dogs that may have a lower immunity Dogs that have pre-existing respiratory diseases (tracheal collapse, chronic bronchitis, severe respiratory allergies) Recovery and Management of Kennel Cough in Dogs While your dog is home recovering from kennel cough, make sure to avoid irritants such as household cleaners, cigarette smoke, and dust. These things can cause more irritation and prolong your dog’s recovery. Do not use a collar and leash if your dog has kennel cough or is recovering. Change to using harnesses during walks, as collars with leashes place extra pressure on the trachea, which induces coughing. Preventing Kennel Cough in Dogs To help minimize the risk of your pet getting kennel cough, vaccination against one of the common causes (Bordetella bronchiseptica) is generally recommended.  When looking for grooming facilities, daycare facilities, or general doggy play date partners, ask about their vaccine requirements to ensure the dogs your pup will be in contact with are also vaccinated. While fully vaccinated dogs can still get kennel cough, this preventative measure may help keep your pet protected. "}]