[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Key-Gaskell Syndrome in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/border-collie-at-the-vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/border-collie-at-the-vet.jpg"}, "author": {"@type": "Person", "name": "Gina Phillips, DVM", "url": "https://www.petmd.com/author/dr-gina-phillips"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/key-gaskell-syndrome-dogs"}, "datePublished": "August 11, 2023", "dateModified": "October 6, 2023", "description": "Dr. Georginia Phillips explains Key-Gaskell Syndrome in dogs, including symptoms, diagnosis, and managing the condition in your dog.", "articleBody": "What Is Key-Gaskell Syndrome in Dogs? Key-Gaskell syndrome, also known as canine dysautonomia, is a neurological disorder that affects the autonomic nervous system in dogs. The autonomic nervous system controls many of your dog’s bodily functions, such as: DroolingEye pupil sizeHeart rateBreathingDigestionIntestinal movementBlood pressureUrinationBody temperatureDysautonomia causes dysfunction within the nerves of the autonomic system. It can affect a dog’s eyes, digestive system, or urinary tract. While this condition is typically fatal, it is relatively rare in dogs. Symptoms of Key-Gaskell Syndrome in Dogs Symptoms may come on quickly, within a few hours, or over several weeks. Signs of dysautonomia can vary but often include: Loss of appetite and weight lossDry heaving and gaggingVomiting and diarrheaConstipationDifficulty swallowingDilated (enlarged) pupils and decreased tear productionFear/avoidance of lightProtrusion of third eyelidsKeratoconjunctivitis sicca (dry eye)Changes in heart rate and blood pressureDry nose and mouthCoughingDifficulty breathingDifficulty urinatingPoor control of bladder and bowel movementsOverall weaknessSymptoms such as difficulty urinating and having trouble breathing warrant an immediate trip to the veterinarian. Causes of Key-Gaskell Syndrome in Dogs The exact cause of dysautonomia in dogs is not fully understood. Key-Gaskell syndrome may be triggered by exposure to certain environmental factors. The intake of plants, toxins, or contaminated food or water may contribute to the development of the condition. However, specific agents have not yet been determined. How Veterinarians Diagnose Key-Gaskell Syndrome in Dogs Diagnosing Key-Gaskell syndrome typically involves your vet performing a physical exam on your dog, identifying their symptoms, and taking diagnostic tests. Your vet will ask you several questions to get a thorough history of your dog&#039;s health, a timeline of their symptoms, and possible incidents that might have led to dysautonomia. This history may provide clues as to which organs are being affected. While there is no specific test for dysautonomia, the following procedures may be used: Eye Exam Findings Your vet will perform a Schirmer tear test on your dog. This painless test is used to see if your dog is producing enough tears. Your vet will place a strip of special paper in your dog’s lower eyelid. Moisture and tears from your dog’s eye will drip onto the paper for 60 seconds, and your vet will analyze the results. Imaging X-rays can show evidence of aspiration pneumonia (food or liquid in the lungs), a dilated (enlarged) esophagus, enlarged intestines, and a swollen bladder. Esophageal dysfunction can be confirmed with fluoroscopy (an imaging procedure that shows real-time moving images of your dog’s esophagus). An abdominal ultrasound allows your vet to see your dog’s organs. If the symptom is present, this test can confirm the slow movement of your dog’s intestines. An echocardiogram, or an ultrasound of the heart, can reveal enlargement of the left atrium (upper cavity) and ventricle (main chamber). Enlargement can lead to decreased functions of the heart. This may cause weakness, inability to exercise, a heart murmur (a swishing or whooshing sound found in the heartbeat), or an abnormal heart rhythm. Most dogs only experience some of the symptoms. Pharmacologic tests Key-Gaskell syndrome may cause loss of control of the eye’s iris. This can make your dog sensitive to certain medications. Pilocarpine is a medication used in pets with eye disease. When it’s applied to the eye of a dog with dysautonomia, it will cause the pupil to become narrow within 45 to 60 minutes. In a healthy dog, there won’t be a change in pupil size. Your vet may also perform an Atropine challenge test, which will check your dog’s heart health. If you give atropine to a healthy dog, their heart rate will rise. However, when a dog has Key-Gaskell syndrome, their rate will stay the same. Biopsy/Necropsy/Histopathology To diagnose this condition, veterinary pathologists can examine tissue samples from the intestines and assess the condition of the mesenteric plexus, a complex network of nerves found in the gut. In some cases, Key-Gaskell syndrome can only be confirmed after death by analyzing the nerve cells of the spinal cord and the base of the brain. In acute cases, there is notable degeneration of nerve cells, while in chronic cases, there is both loss of nerve cells and an increase in a specific type of supporting cells. Treatment of Key-Gaskell Syndrome in Dogs Unfortunately, there’s no cure for dysautonomia. Your vet will focus on supportive care, symptom management, and keeping your dog comfortable. This may include: Replenishing your dog’s water intake, also known as fluid therapyMedicationsThe placement of a nasogastric feeding tube (a tube that carries food and medication to your dog’s stomach through their nose)These treatments aim to ease your dog’s symptoms and improve your dog’s quality of life. Some dogs may be able to live with the condition, while others may not. Dogs with symptoms like KCS (dry eye) and constipation tend to live longer with this disease because they are easier to manage with medications like eye drops and stool softeners. Dogs that develop aspiration pneumonia or suffer heart abnormalities have a shorter survival time. The following are the most common therapies offered to dogs with Key-Gaskell syndrome: Fluid therapy—Dysautonomia can cause dehydration due to decreased creation of saliva and tears. Intravenous (in the vein) or subcutaneous (under the skin) fluid therapy may be recommended to keep your dog hydrated. Nutritional support—Some dogs may have a hard time eating, which might require a feeding tube. Your vet may also recommend food that is easily digestible such as Hill’s® Science Diet a/d. These treatments may be used until your dog is no longer gagging and their weight loss has stopped. Gastrointestinal support—Your vet may prescribe medication to ease vomiting, nausea, and other gastrointestinal (GI) symptoms. Medication that helps with your dog’s GI movement can help lessen any issues. Stool softeners can also be given to stop constipation. Eye and nose support—Eye drops such as Optimmune® can help treat dry eyes. Humidifying the air and using artificial tears and lubricants can also keep your dog’s eyes and nose moist. Products include Optixcare® Eye Lube, Bag Balm, or Dermoscent® BioBalm. Urinary support—Your vet may also suggest medication or placing a urinary catheter in your dog’s bladder at the start of treatment. Treatment for infection—Antibiotics may be given to treat or prevent secondary bacterial infections in your dog. Recovery and Management of Key-Gaskell Syndrome in Dogs The course of dysautonomia can vary and the condition cannot be cured, only managed. If a dog is provided treatment for their symptoms, improvement may be seen as early as 24 hours or as late as three to four weeks. The severity of symptoms, disease progression, and response to treatment all play a role in determining your dog’s quality of life. Dogs managing Key-Gaskell syndrome should be watched closely. Your vet will regularly monitor their vital signs (temperature, breathing, and heart rate), water intake, urination, body weight, and bowel movements. Featured Image: iStock.com/Antonio_Diaz"}]