[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can liver disease be fatal for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Chronic or severe liver disease can be fatal in dogs. However, with early and aggressive therapy, liver disease can be successfully treated. The liver can then repair itself. "}}, {"@type": "Question", "name": "How long does a dog live with liver disease?", "acceptedAnswer": {"@type": "Answer", "text": "Depending on the underlying cause of the liver disease and severity, dogs may be able to live for years with liver disease, but it can also be acutely fatal. If your pet has elevated liver values on bloodwork, talk to your vet about the possible causes and prognosis for your pet.  "}}, {"@type": "Question", "name": "Are dogs with liver disease in pain?", "acceptedAnswer": {"@type": "Answer", "text": "Liver disease can be painful and can also lead to nausea and lack of hunger in dogs. If your pet has liver disease, talk to your vet about the appropriate medications to keep your pup comfortable and happy for as long as possible.  Featured Image: iStock.com/Thicha Satapitanon"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Liver Disease in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/dog-examined-at-the-vet_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/dog-examined-at-the-vet_0.jpg"}, "author": {"@type": "Person", "name": "Jennifer Kvamme, DVM", "url": "https://www.petmd.com/author/dr-jennifer-kvamme"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/liver-disease-dogs"}, "datePublished": "July 27, 2016", "dateModified": "October 25, 2023", "description": "A dog’s liver plays a central role in their body. However, the liver is also vulnerable to many issues that can threaten a dog’s health. It’s important for pet parents to understand the causes and symptoms of liver disease to keep their pup happy and healthy.", "articleBody": "A dog’s liver plays a central role in their body. However, the liver is also vulnerable to many issues that can threaten a dog’s health. It’s important for pet parents to understand the causes and symptoms of liver disease to keep their pup happy and healthy. What Is Liver Disease in Dogs? Liver disease is a blanket term applied to many conditions that cause the liver to malfunction or stop working properly. These conditions typically cause inflammation and/or damage to the liver. This can be a primary problem with the liver itself or secondary to other medical conditions.  Symptoms of Liver Disease in Dogs A dog’s liver has many functions. It removes toxic substances from the blood, helps break down medications, processes energy, stores vitamins and glycogen (stored form of glucose), makes bile to aid in digestion, and creates important proteins needed for blood clotting. Because the liver has many purposes, liver disease can present different symptoms depending on the function affected. This condition often impacts other systems in the body. One of the most common symptoms of liver disease is jaundice, which causes a yellowish coloring to appear in a dog&#039;s eyes, gums, skin, and ears. The liver is responsible for discharging bilirubin, a by-product from the breakdown of red blood cells. When the liver isn’t functioning normally, this bilirubin builds up in the blood and leads to jaundice in dogs. Hepatic encephalopathy is a secondary condition to liver disease. This condition encompasses a group of neurologic (related to the nervous system) symptoms that occur in dogs with liver disease. These symptoms include seizures, disorientation, depression, head pressing, blindness, or behavioral changes. Other common symptoms of liver disease include gastrointestinal signs, such as: Decreased appetite Vomiting Diarrhea Weight loss Increased drinking Increased urination Changes in stool color, such as gray or yellow stool Fluid retention in the abdomen (ascites) Your vet will recommend diagnostic tests to look at your dog’s liver function and determine the cause of their liver disease. Commonly recommended tests are blood work, abdominal ultrasounds, X-rays, and urinalysis (a urine test that looks for a wide range of illnesses). Types of Dog Liver Diseases There are many different conditions or illnesses that can result in liver disease in dogs. These can be primary (due to an issue with the liver itself) or secondary (another condition or disease which is affecting the liver). These conditions often result in inflammation or damage to the liver.  Vessel Abnormalities In young pups, one of the most common liver disorders is a birth defect called congenital portosystemic shunt or “liver shunt”. When this occurs, a blood vessel bypasses the liver, causing a buildup of toxins. Congenital portosystemic shunts are often found in young dogs who have stunted growth, developed seizures, or are disoriented. Acquired shunts is more common in older dogs, which develop when there’s a blood pressure backup in the liver due to high blood pressure (hypertension) or cirrhosis. To get around the blocked section, new vessels grow to bypass the area. A dog’s treatment depends on the size and location of the shunt(s). If it consists of one large vessel outside of the liver (this is more common with congenital shunts in small breed dogs), surgery may be successful. Shunts inside the liver or those with many vessels may not be fixed with surgery. If this happens and the liver disease can’t be cured, your vet will focus on managing the condition. Your dog must be given a low protein diet and medications to help decrease the toxins in their blood. Endocrine Diseases Certain diseases that affect the endocrine glands—which control the body’s hormones—can lead to liver issues. Diabetes mellitus, hyperadrenocorticism (Cushing’s disease), and hyperthyroidism can all cause impaired liver function. If your pup is impacted by one of these diseases, your vet will focus on treating the underlying endocrine disease. This is the most important part of improving liver function. Infectious Diseases Because all blood passes through the liver, it’s vulnerable to infectious (contagious) diseases caused by bacteria, viruses, parasites, or fungi. The most common viral disease associated with dogs’ liver is canine hepatitis, an infectious condition that can cause inflammation and scarring of the organ. This is a vaccine-preventable disease. Leptospirosis is a bacterial infection that can lead to liver disease, though many associate it with kidney disease. Dogs are infected with leptospirosis through contaminated water sources, and the disease can be spread to humans. Leptospirosis can be difficult to diagnosis and even with treatment may result in permanent secondary liver and kidney damage.  Coccidioidomycosis and histoplasmosis are the most common fungal causes of liver disease. Dogs are exposed through inhaling or ingesting the spores in the environment, such as when hiking in areas with these fungi. These infections can be difficult to cure and often need to be treated with anti-fungal medications for months. Because of the difficulty in treating fungal disease of the liver, the long-term prognosis is guarded. Liver Masses Dogs are prone to several types of liver masses.  Liver cysts can be present from birth, though some dogs may get them as they age. While cysts are often benign (non-cancerous), large or growing cysts can cause symptoms of liver disease. The surgical removal of these large cysts typically cures a pup’s liver issues. Liver Cancer Cancer of the liver comes in two main forms—the less common primary tumors, originating in in the liver, and metastatic (secondary) tumors, which spread from another area in the body. Primary tumors are less common than metastatic ones. Depending on the type of cancer, location, and number of masses, treatments may include surgery, chemotherapy, radiation, or a combination of treatments. Breed-Specific Liver Diseases in Dogs Certain breeds of dogs are predisposed to specific liver conditions. Copper storage disease is a known problem in Bedlington Terriers, Doberman Pinschers, Skye Terriers, and West Highland White Terriers. These breeds may have a metabolic defect that causes copper to remain in the liver, leading to chronic hepatitis. Amyloidosis, caused by a abnormally-formed protein that builds up in the cells, is a disease of Shar-Peis. How Veterinarians Diagnose Liver Disease in Dogs If your pet is experiencing any of the clinical signs above or is jaundice, your vet will likely want to start with bloodwork.  A serum chemistry panel will help assess your dog’s liver values and guide the veterinarian if liver disease is a concern.  Additional testing may include advanced blood tests such as liver function tests or screening tests for Cushing’s or hyperthyroidism. Your vet may also recommend abdominal X-rays or an abdominal ultrasound to better visualize the liver and check for abnormalities. Your pup may potentially need a sampling or biopsy of their liver.  Treatment of Liver Disease in Dogs Depending on the severity of the disease and whether the underlying cause can be treated or cured, the outcome of liver disease in dogs can vary. If treatment starts before long-term damage occurs, a dog’s prognosis can be successful. The liver can regenerate and repair itself, which often means acute or mild to moderate liver disease has a good prognosis.  Chronic or severe liver disease, however, has a poorer prognosis. If a pup is diagnosed with these conditions, treatment is limited to managing the progression of the disease and minimizing symptoms. The most common medical management of liver disease may include: A higher carbohydrate (carb) and low-protein diet to decrease the amount of ammonia (a waste product) in the bloodstream Vitamin supplements Lactulose, to bind toxins in the gut Antibiotics Vitamin K, if a dog has bleeding issues Your vet should monitor your pup regularly if they have liver disease, as they can help manage your dog’s symptoms. This can extend the length and quality of their life. When liver disease is chronic or severe, your vet may discuss with you if your pet has a good quality of life and if they are likely to improve, even with intensive treatment. Liver disease can be fatal in those cases.  Prevention of Liver Disease in Dogs Not all cases of liver disease can be prevented, but certain precautions can reduce the risk of specific diseases. Discuss with your vet which diseases (such as Leptospirosis) your pet should be vaccinated for and if you live in an area with high risk of fungal or other types of infections.    It’s important to understand and recognize the signs of liver disease. If you notice anything concerning about your pup, see your vet as soon as possible. Early diagnosis and treatment is one of the key factors in curing liver disease and preventing serious illness in your furry companion."}]