[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are there home remedies for lockjaw in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Because lockjaw has many different causes and treatments, there is no home remedy to treat it. Your dog may have something stuck in the back of its mouth, so it is worth checking if you can do so without injuring yourself or the dog. However, once a diagnosis has been reached, your veterinarian may be able to show you physical therapy exercises to help your dog at home."}}, {"@type": "Question", "name": "Are certain breeds predisposed to lockjaw?", "acceptedAnswer": {"@type": "Answer", "text": "There is not a specific breed disposition to lockjaw, but dogs that frequently carry items in their mouth—particularly heavy items‚ are more likely to injure themselves or wedge something into the back of the mouth in the process. Some breeds are more prone to masticatory myositis, which can lead to lockjaw. This includes the German Shepherd, Labrador Retriever, Golden Retriever, Weimaraner, King Charles Cavalier Spaniel, as well as several other large-breed dogs. Featured Image: iStock.com/Konoplytska"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lockjaw in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/german.shepherd.chewing.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/german.shepherd.chewing.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/lockjaw-dogs"}, "datePublished": "February 18, 2022", "dateModified": "August 12, 2022", "description": "Dr. Sandra Mitchell discusses lockjaw in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What is Lockjaw in Dogs? Lockjaw in dogs is a rare condition that refers to the animal’s inability to either open or close their mouth. When most people refer to a dog having lockjaw, they are typically referring to tetanus, since one of the most well-known symptoms of tetanus is jaw stiffness or lockjaw.   However, there are other conditions that can result in lockjaw. Many of these conditions are connected to the function of the temporomandibular joint (TMJ). The TMJ acts like a hinge where the lower and upper jaws meet, so trauma or disease in the TMJ can also affect your dog’s ability to open her mouth. Lockjaw may also be caused by conditions affecting the muscles and nerves surrounding the mouth. Lockjaw in Dogs Symptoms In its simplest form, lockjaw occurs when a dog is unable to open or close its mouth.    Depending on the underlying reason for the lockjaw, there may be additional signs such as:  Drooling   Muscle atrophy  Swelling  Noticeable pain/discomfort from dog   A deep wound near the jaw  An ear infection  Eye swelling  Causes of Lockjaw in Dogs The condition that is most referred to as lockjaw is tetanus, a nerve disorder caused by infection from the Clostridium tetani bacteria. Tetanus is a condition in which the toxins produced by a bacterial infection, typically located deep in a puncture-type wound, make their way through the tissues to the nearest nerve. Clinical signs often start in this location, but can then spread through the nervous system to affect the entire body.    However, the jaw can be locked open or closed for a variety of reasons, including:   Fractures or disorders of the TMJ  Diseases of the muscles around the TMJ    Nerve disorders  Non-tetanus infections  Birth defects  Cancers  Inflammatory conditions like masticatory myositis  Perhaps the simplest cause of lockjaw is when the dog bites down on something that wedges between its molars (like a stick), preventing the dog from closing its mouth. This is particularly common among large-breed dogs that like to carry heavy objects in their mouths.  How Veterinarians Diagnose Tetanus in Dogs Diagnosis of lockjaw depends on the underlying condition causing it. When a dog comes into a veterinarian office with its mouth open and drooling heavily, most vets will immediately look in the back of the mouth for a stick or an item lodged in the dog’s mouth.  Some conditions, such as tetanus and masticatory myositis, may be diagnosed based on a physical examination alone.   Problems involving the TMJ joint such as malformation, trauma, and injury will likely need an exam under sedation as well as radiographs (x-rays).   When infections, inflammation, or cancer are suspected—or when the overall health status of the dog is in question—a complete blood count and biochemistry panel are usually ordered.  The complexity of the testing will vary based on the underlying diagnosis and may range from a diagnosis based on a physical examination to one based on lab results. Treatment of Lockjaw in Dogs The treatment of lockjaw varies depending on the dog’s diagnosis. Some conditions involving the TMJ can be addressed surgically, while simple inflammatory problems may respond to anti-inflammatory medications.     Recovery and Management of Lockjaw in Dogs Time and physical therapy can help resolve lockjaw in some cases. In other more serious cases such as tetanus, an extended hospital stay might be required.    Whatever the underlying cause, the quicker a dog receives an accurate diagnosis, the better the chance at a simpler resolution. "}]