[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can humans get mange from dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Humans can get sarcoptic mange from dogs but cannot get demodectic mange from dogs."}}, {"@type": "Question", "name": "Can you treat mange at home?", "acceptedAnswer": {"@type": "Answer", "text": "Mange should not be treated at home if the clinical signs are moderate to severe. If your dog has a small patch of hair loss that she is not bothered by, you may wait 1-2 months to see if there is resolution. If the hair loss persists past this time; skin lesions are noted; or your dog is itchy, becomes lethargic, stops eating, or seems depressed, it is important to bring her to a veterinarian for assessment."}}, {"@type": "Question", "name": "What are the early signs of mange in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The early signs of mange include alopecia (hair loss); scaling or crusting of the skin; papules or bumps on the skin; mild, moderate, or severe itching; and self-induced excoriations (wounds). Featured Image: iStock.com/Fricka"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mange in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/a.dog_.with_.mange_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/a.dog_.with_.mange_.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Mange, Skin health, Symptom Checker, Mange", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/mange-dogs"}, "datePublished": "March 8, 2022", "dateModified": "September 12, 2023", "description": "Dr. Katie Grzyb discusses mange in dogs, including types of mange, symptoms, and treatment options.", "articleBody": "What Is Mange in Dogs? Mange is a skin disease caused by mites found at the hair follicles. It is caused by two different types of mites and can be contagious and zoonotic (transmitted from animals to humans).   The two types of mange include sarcoptic mange and demodectic mange.  Sarcoptic mange, which is also known as scabies, is caused by Sarcoptes scabiei. This type of mange is less common than demodectic mange, and typically affects homeless dogs, who are suffering and neglected. It is also more common in dogs with compromised immune systems.   Demodectic mange, or red mange, is caused by Demodex canis, Demodex injai, or Demodex cornei. This type of mange is transmitted between a mother and puppy during the feeding process. It is not contagious between other dogs and is not contagious to humans.   Symptoms of Mange in Dogs Clinical signs of mange include:  Severe itching  Alopecia (hair loss)  Excoriations (self-inflicted superficial or deep wounds)   Raised bumps (papules) most commonly on the chest.   Thick crusted skin typically found on the margins of the ears, the ankles (hocks), armpits, and elbows  Often, secondary skin infections occur because of the skin lesions. Weight loss, depression, decreased appetite, and lethargy can be caused by the severe itching and uncomfortable skin issues. Enlarged lymph nodes may be found too. A subtype of scabies called Norwegian scabies is characterized by severe skin crusting and is thought to be worsened by a compromised immune system.  Causes of Mange in Dogs Sarcoptic mites are often transmitted through close contact between dogs. This type of mite does not survive for long periods of time in the environment and needs a host to continue its life cycle. Scabies is not a direct cause of bad hygiene, but it can worsen through neglect or immunosuppression.    Demodectic mites normally live on the skin of a dog and benefit from the host, without causing harm. Typically, this mite is only passed between dogs when they are puppies and is most often passed from mother to puppy. This mite becomes mange when the mite overgrows the hair follicle.  How Veterinarians Diagnose Mange in Dogs Mange is typically diagnosed through a skin scrap test, a hair sample, or cytology.   The use of a scalpel blade is non-invasive and allows the vet to scrap the skim deep enough for some irritation but allows for a removal of the hair follicle at the root. It’s important for the entire hair follicle to be removed, since demodex is often buried deep in the root.  Other common tests that a vet may recommend include fecal testing, a polymerase chain reaction (PCR) test, or in some severe cases, a skin biopsy. Treatment of Mange in Dogs Treatment of mange includes topical medications, shampoos, and often antiparasitic medications.  Sometimes antibiotics are warranted. Treatment is tailored for the different types of mange and the severity of the infection. Recovery and Prevention of Mange in Dogs For scabies, any dog that has come into contact with the infected dog must be treated and the environment they live in, disinfected. This includes kennels, crates, collars, bedding, toys, etc. It’s important for dogs in the environment to remain on monthly or tri-monthly preventatives to avoid infection.  Demodectic mange does not require environmental cleaning as it does not often transmit between dogs, though a monthly or tri-monthly miticidal preventative is still recommended.   Most dogs with mange can expect a full recovery with appropriate therapy. For chronic cases, it’s typically due to an underlying systemic illness or secondary infections. Mange is fatal when dogs receive the wrong therapy, or their underlying medical conditions are not managed correctly."}]