[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does a dog live with megaesophagus?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs can live normal life spans, but in most cases the condition will require lifelong management."}}, {"@type": "Question", "name": "Can a dog survive megaesophagus?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, dogs with megaesophagus can live happy lives with regular veterinary care and pet parent dedication. "}}, {"@type": "Question", "name": "What are the signs of megaesophagus in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The most common sign of megaesophagus is regurgitation. "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Megaesophagus in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1284689001.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1284689001.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Megaesophagus, Symptom Checker", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/megaesophagus-dogs"}, "datePublished": "August 29, 2022", "dateModified": "September 12, 2023", "description": "Dr. Lauren Jones discusses megaesophagus in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What is Megaesophagus in Dogs? Megaesophagus is a condition that decreases mobility in the muscles of the esophagus, the tube that connects the mouth and stomach.  This decreased muscle function leads to esophageal dilation, or enlargement. Normally, when dogs swallow the food stimulates the muscle in the esophagus to contract, pushing the food from the mouth into the stomach.  In dogs with megaesophagus, the muscles in the esophagus cannot properly coordinate this swallowing movement. As a result, food, and liquid accumulate in the esophagus, stretching it and preventing nutrients from being properly absorbed in the stomach.  While dogs affected by megaesophagus may have an excellent quality of life, they can be difficult to manage and keep healthy. A close relationship with a veterinarian, time, patience, and understanding of the condition are needed.  Symptoms of Megaesophagus in Dogs The hallmark sign of megaesophagus is regurgitation. Keep in mind that regurgitation is different from vomiting. Vomiting is an active process that involves gagging, retching, and the body actively, often forcibly, ejecting the contents of the stomach.  Regurgitation, in contrast, is a passive process. Typically, dogs will open their mouth and food or liquid appears to fall out without any heaving or stomach contractions. Regurgitation frequently occurs many hours after a meal and typically does not have bile, because it was never in the stomach. Dogs with megaesophagus may have a difficult time swallowing and show excessive salivating. Often, during the regurgitation process, the esophageal contents may be expelled through the nose and even accidentally breathed into the lungs, causing aspiration pneumonia. These dogs can become very sick with fever, difficulty breathing, lethargy, and coughing.  Dogs with megaesophagus typically have ravenous appetites, but they develop poor, thin, weak body conditions due to the inability to get nutrients into their stomach for processing. Sometimes, pet parents and veterinarians may notice a small bulge in the neck when the esophagus is distended.  Causes of Megaesophagus in Dogs In rare cases, megaesophagus can be reversed. However, most cases are permanent and require life-long care. Primary megaesophagus (present at birth) is not well understood by veterinarians, but most cases of primary megaesophagus might occur due to incomplete nerve development in the esophagus. Some breeds have a known genetic marker causing congenital megaesophagus, including:  Wire-Haired and Smooth Haired Fox Terrier Miniature Schnauzer Chinese Shar-Pei German Shepherd A congenital form of myasthenia gravis (a neuromuscular condition) causes megaesophagus and is reported in the following breeds:  Jack Russell Terriers Springer Spaniels Long-Haired Miniature Dachshunds Golden Retrievers Labrador Retrievers Samoyed  Secondary, or acquired megaesophagus is more common and may occur at any age. Acquired myasthenia gravis is the most common causes for secondary megaesophagus, but any other disease that affects the function of the esophagus may cause this condition. Acquired myasthenia gravis is a neuromuscular autoimmune disease that destroys the connection between nerves and muscle, including the esophagus, and causes general skeletal muscle weakness.  Approximately 25% of dogs with acquired megaesophagus have myasthenia gravis. While the symptoms are like congenital myasthenia gravis, the cause, testing, and treatment are different.  Obstructive disorders may cause megaesophagus by physically blocking the esophagus from functioning normally.  In these cases, the muscle and nerves of the esophagus are normal, but chronic distention directly in front of the obstruction causes muscle dysfunction. Examples of obstructive secondary megaesophagus include: Some medications can cause a narrowing of the esophagus, and food cannot adequately pass. Foreign bodies stuck in the esophagus can prevent normal swallowing. Cancer in or around the esophagus can also partially block the esophagus.  Vascular ring anomalies are caused by abnormal development of vessels near the heart. Fetal vessels that should disappear by birth remain intact, encircling and constricting the esophagus.  Disorders (many of them autoimmune) that affect the body’s muscles can also lead to megaesophagus, including: Polymyositis Systemic lupus erythematosus Dermatomyositis   There are many other causes of megaesophagus, including:  Central nervous system neoplasia  Botulism and tetanus Endocrine disease, like Addison’s disease and possibly hypothyroidism Toxicosis  Esophagitis, or esophageal irritation and inflammation Nerve issues  Some breeds, especially large breed dogs, are also more likely to acquire megaesophagus. These include:  German Shepherd Great Dane Labrador Retriever Pug Chinese Shar-Pei How Veterinarians Diagnose Megaesophagus in Dogs Veterinarians often suspect megaesophagus based on clinical signs and history alone. To confirm the diagnosis, multiple tests may be recommended.  Radiology: Megaesophagus is routinely diagnosed through x-rays. The esophagus is not normally seen on x-rays, but the mass of food and/or air can be detected, which may lead to a diagnosis. X-rays can diagnose megaesophagus but do not always determine the cause.  Fluoroscopy: This test is similar to an x-ray but is performed in real-time during swallowing to assess the esophagus’ ability to contract.  Other tests: Esophagoscopy (video scope into the esophagus), blood tests, tests for various neuromuscular and endocrine diseases, and muscle biopsies may all be used to determine the underlying cause of megaesophagus.  Treatment of Megaesophagus in Dogs Treating the underlying condition is most important when treating megaesophagus. Some forms of megaesophagus can be reversed or cured, but there is no guarantee. Especially depending on severity and length of time, even if the underlying disorder is treated, the damage done may be irreversible.  For dogs with this condition, management centers on making sure they get their nutritional needs met, as well as receiving any supportive therapy. This means monitoring closely for serious side effects like aspiration pneumonia. This type of pneumonia is the most common complication of megaesophagus, upwards of 40% of dogs have pneumonia at the time of their diagnosis.  Supportive therapy for dogs with megaesophagus includes: Raising food and water bowls to let gravity help the eating process.  Food bowls should be at head height Bailey Chairs are used to keep the dog in an upright position for at least 10 minutes, preferably 20-30 minutes, preventing most of the food and liquid from accumulating in the esophagus. These chairs look like highchairs for dogs and can be custom-built for growing puppies and all sizes of adult dogs.  Changing the form of food based on the dog’s specific needs. This may mean changing their diet to gruel, meat balls, canned food, or even liquid.  Providing smaller, more frequent meals throughout the day.  Encouraging dogs to sleep with their front end slightly elevated.  Medications can be prescribed to treat specific side effects or complications, as required: To treat irritation of the esophagus Sildenafil may help the number of regurgitation episodes and has been associated with weight gain. Antibiotics may be prescribed to treat aspiration pneumonia. Recovery and Management of Megaesophagus in Dogs Fortunately, although this condition requires management, dogs can lead happy and relatively normal lives.  Dogs typically have better outcomes the sooner megaesophagus is diagnosed. Prognosis also improves if a dog has not experienced aspiration pneumonia. Pet parent dedication, patience, and close monitoring with a veterinarian are key to managing megaesophagus dogs successfully. Veterinarians will want to frequently examine these dogs to monitor weight and body condition and bloodwork parameters, in addition to screening for signs of aspiration pneumonia.  "}]