[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Will swelling of the salivary gland in dogs go away?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. The swelling will resolve after surgery and typically no further treatment is required. Without surgery, swelling will usually reoccur until the affected salivary gland is surgically removed.   Featured Image: iStock.com/RapidEye"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Swelling of the Salivary Gland in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/Swelling%20of%20the%20Salivary%20Gland%20in%20Dogs_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/Swelling%20of%20the%20Salivary%20Gland%20in%20Dogs_0.jpg"}, "author": {"@type": "Person", "name": "Katherine Smith, DVM, CVA, CVSMT", "url": "https://www.petmd.com/author/dr-katherine-smith"}, "keywords": "Dog, Condition, Oral health, Symptom Checker, Salivary Gland Issues", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_multi_salivary_mucocele"}, "datePublished": "November 24, 2021", "dateModified": "September 12, 2023", "description": "Dr. Katie Smith explains what may cause swelling of the salivary gland in dogs, plus how it’s treated and when you should see a vet.", "articleBody": "What is Swelling of the Salivary Gland in Dogs? Dogs have several salivary glands located in the neck and area around the jaw. Swelling of the salivary glands (sialocele) occurs when one (or more) of these glands leaks saliva into the tissue surrounding the gland. When a leak occurs, the body forms a capsule called a sialocele around it to prevent the saliva from spreading to nearby tissue. Swelling of the salivary gland most commonly occurs in glands in the upper neck or between the bones of the lower jaw. Other types of salivary gland swelling occur in glands under the tongue, in the upper throat, or under the eyes.  Symptoms of Swelling of the Salivary Gland in Dogs Swelling is the most common symptom of salivary gland swelling. The swelling typically occurs in the area nearby the affected gland. The swollen area will feel soft and is usually not painful to the dog. Swelling may occur in a dog’s upper neck or mouth. Although the swelling may be extensive, your dog may not show any signs of experiencing pain related to the swelling.   Swelling of the neck that causes trouble swallowing or breathing can also occur. This can be serious as it can result in respiratory distress. If your dog is unable to swallow or breathe normally, they should receive immediate care from a veterinarian. Your dog may also have trouble eating or may have blood in their saliva. This occurs because the siaocele can be disrupted during eating, causing blood to leak and mix with your dog’s saliva. Enlargement of the area underneath the eye and/or protrusion of the eye itself may also occur alongside salivary gland swelling.   Causes of Swelling of the Salivary Gland in Dogs There is no known cause for swelling of the salivary glands, but some type of trauma is usually suspected. Choke collars, bite wounds, and chewing on foreign items (like sticks, etc.) are typical suspects, but the swelling may have a range of causes.  How Veterinarians Diagnose Swelling of the Salivary Gland in Dogs If your dog has swollen salivary glands, your veterinarian will perform a thorough physical examination and will feel the swollen area, to determine a possible cause.      Your veterinarian may also perform other tests to determine the cause of the swelling, including: X-ray Blood chemistry  Cytology exam: Your vet will collect a small sample of the swollen area with a very fine needle (a fine needle aspiration). The sample will be examined under a microscope to confirm the diagnosis Treatment for Swelling of the Salivary Gland in Dogs Surgery to remove the affected gland is the most common treatment of a sialocele. Removing the gland decreases the flow of saliva into the swollen area and typically prevents similar capsules of saliva forming in the area.   After surgery, at-home care will be provided as the area continues to heal. Your veterinarian may insert a drain that will remain in place for a few days. They will also provide instructions tailored to your dog’s specific needs and severity of surgery. This may include using a cone or other barrier to prevent your dog from scratching and accidentally removing the drain.  You may also need to remove and reapply clean bandages, per your vet’s instructions. Recovery and Management of Swelling of the Salivary Gland in Dogs Most dogs make a complete recovery after surgery on salivary glands. Some owners worry that their dog will have a dry mouth after surgery, but currently there is no evidence to support this concern."}]