[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Stained, Discolored Teeth in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/stainedteeth.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/stainedteeth.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_dg_discolored_teeth"}, "datePublished": "January 28, 2010", "dateModified": "August 16, 2022", "description": "Any variation from normal tooth color is discoloration. The normal color of teeth varies, dependent on the shade, thickness and translucency of the enamel covering the tooth.", "articleBody": "Stained Tooth and Teeth in Dogs Teeth discoloration is any variation from normal tooth color. However, the normal color of teeth varies, dependent on the shade, thickness, and translucency of the enamel covering the tooth. Any variation from normal tooth color is discoloration. The normal color of teeth varies, dependent on the shade, thickness and translucency of the enamel covering the tooth. Extrinsic discoloration occurs when exogenous pigment accumulates on the surface of teeth. That is, the cause of the discoloration is from an external source, rather than from a physical condition. Intrinsic discoloration is characterized by secondary factors that are happening inside the tooth, discoloring the underlying dentin. Symptoms and Types Intrinsic discoloration is characterized by secondary factors that are happening inside the tooth, discoloring the underlying dentin. Extrinsic discoloration, meanwhile, occurs when exogenous pigment accumulates on the surface of teeth. That is, the cause of the discoloration is from an external source, rather than from a physical condition. Common symptoms associated with both discoloration types include: Abnormal coloration of one or more teethFractured toothPitted enamel (the glossy covering of the tooth) with stainingRings or lines of discoloration around one or more teethCauses  Extrinsic discoloration Bacterial stains from plaque (mucin, debris, bacteria and a thin film of food) and calculusFoodsBleeding gumsDental restorative materialsMedicationsMetalIntrinsic discoloration Internal (trauma, injury)Localized red blood cell destruction in the tooth (trauma)Systemic infectionsMedications (tetracycline)Exposure to too much fluorine (ingestion of toothpaste containing fluoride)High levels of bilirubin in the blood (from bile, the liquid in the gallbladder that helps to dissolve food in the intestines)Amelogenesis imperfecta (a condition in which dental enamel does not calcify enough)Dentinogenesis imperfecta. (a condition in which the dentin does not develop correctly)Diagnosis A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, and a urinalysis. You will need to give a thorough history of your dog&#039;s health, onset of symptoms, and possible conditions that might have caused this condition, such as diet, injury, recent illnesses, etc. The history you provide may give your veterinarian clues to the origin of the dental condition. An oral exam is part of a thorough physical exam. Your veterinarian will need to x-ray your dog&#039;s teeth in order to identify internal or external resorption, and whether restorative materials or bacterial stain from bacteria are entering the crown of the teeth. Your veterinarian may also use a strong fiber optic light that is focused on the teeth to determine vital from dead dental pulp (the nerves and blood vessels in the tooth). If the tooth (or teeth) need to be removed, your veterinarian will most likely need to subdue your dog with general anesthetize in order to extract it.  Treatment Extrinsic stain removal can be performed for cosmetic reasons. These procedures often involve internal and/or external treatments such as bleaching, veneers and crowns. Intrinsic stain removal may be done to improve the function of the teeth and to relieve pain for your dog. This often involves using endodontic treatment (endodontics treat the interior of the tooth, pulp and surrounding tissue of the teeth). Crowns and veneers may be used to protect the teeth and the pulp in the teeth. Living and Management Any discolored teeth should be treated to prevent plaque and calculus buildup and to prevent further periodontal disease. Discolored teeth are more prone to fracture, which could result in tooth abscessation (formation of an abscess, usually in response to bacterial infection). Discoloration may be prevented in future litters by avoiding giving certain medications to the pregnant bitch. With proper attention, discoloration of teeth can be prevented in puppies."}]