[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tooth Fracture in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/tooth-fracture-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/tooth-fracture-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_multi_tooth_fracture"}, "datePublished": "July 16, 2008", "dateModified": "August 16, 2022", "description": "Tooth fractures refer to tooth injuries involving damage to the enamel, dentin and cement. These injuries occur either on the enamel-covered top portion of the tooth (the crown) or the part below the gum line (the root).", "articleBody": "Traumatic Tooth Injury in Dogs Tooth fractures refer to tooth injuries involving damage to the enamel, dentin and cement. These injuries occur either on the enamel-covered top portion of the tooth (the crown) or the part below the gum line (the root). Both dogs and cats are susceptible to traumatic tooth injuries. If you would like to learn more about how this condition affects cats, please visit this page in the PetMD health library. Symptoms and Types The most common complication involving a tooth fracture is inflammation and infection. In some instances, the tooth&#039;s crown may be missing; blood or pink tissue may also be present on or around the affected area. Otherwise, dogs with root fractures display constant discomfort and pain. Causes The most common cause of a tooth fracture is a traumatic event or injury. A tooth may be broken, for instance, by chewing on a hard object, a blunt force trauma to the face, or a minor automobile collision. Diagnosis To review the full extent of the tooth fracture, your veterinarian will take X-rays of the dog&#039;s mouth. A full oral examination will be completed, as well, to review the overall oral health of your dog.  Treatment The treatment will depend on the extent and severity of dog&#039;s trauma. Crowns and other additive dental work can be applied to repair the damaged tooth, including the use of surgery when the damage is severe. Extraction may be recommended if the tooth or root cannot be repaired, followed by a sealing of the affected area with a restorative material or lining. In many cases, restricting the dog&#039;s activities is recommended until it is fully recovered. During this time, the dog&#039;s diet should mainly consist of moist food items. Living and Management It is important to monitor your dog&#039;s progress following treatment, and to continue with regular tooth care and cleaning. Any damage or irritation to the gums can be detected during routine brushing or cleaning of the teeth. The most common complications are infection or the need for a follow-up root canal. Prevention Prevent your dog from chewing on extremely hard substances, such as rocks, as this can damage the structure of the tooth or cause tooth breakage. Also, dogs that are allowed to roam freely are at a higher risk than those who are in a contained, safe environment."}]