[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tooth Enamel Malformation in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_dg_malformed_tooth_enamel"}, "datePublished": "January 28, 2010", "dateModified": "August 16, 2022", "description": "Normally developed enamel will have a smooth, white appearance. However, when conditions in the environment interfere with the development of tooth enamel, teeth can take on a discolored, pitted or otherwise unusual appearance.", "articleBody": "Enamel Hypoplasia/Hypocalcification in Dogs The outer coating of the tooth, the enamel, develops according to a specific set of physical and environmental circumstances. Normally developed enamel will have a smooth, white appearance. However, when conditions in the environment interfere with the development of tooth enamel, teeth can  take on a discolored, pitted or otherwise unusual appearance. Bodily influences, like canine distemper virus (in young puppies that are not vaccinated) or a fever over an extended period of time, may cause pitting and discolored enamel surfaces. Local influences, like injury (even from baby tooth extraction) over a short period of time can cause specific patterns or bands to appear on the developing teeth. These types of traumas can result in less than normal deposits of enamel, medically termed hypocalcification. The lack of sufficient enamel may cause the teeth to be more sensitive, with exposed dentin (which is normally hidden underneath the enamel), and occasionally fractures of severely compromised teeth. The teeth usually remain fully functional. Symptoms and Types     Irregular, pitted enamel tooth surface with discoloration of diseased enamel and potential exposure of underlying dentin (light brown appearance)    Early or rapid accumulation of plaque (bacteria, food film, dead skin cells and mucin) and calculus (calcium phosphate and calcium carbonate mixed with organic matter) on roughened tooth surface    Possible gingivitis and/or accelerated periodontal/gum diseaseCauses     Injury during enamel formation on the teeth    Canine distemper virus, fever, trauma (e.g., accidents, excessive force used during deciduous/baby tooth extraction)Diagnosis Discolored teeth may be found by your veterinarian during a routine physical exam, which normally includes a complete oral exam. Intraoral radiographs (X-rays) can then be taken by your veterinarian to determine if the roots of the teeth are still alive.  Treatment Treatment of your dog&#039;s teeth will depend upon the extent of abnormalities and the equipment and materials that are available. Your veterinarian will try to create the smoothest surface possible on the cat&#039;s teeth. Prior to receiving any dental work, your dog will be given pre-operative antibiotics and oral pain medication. Your veterinarian will try to gently remove the diseased enamel by scrubbing the enamel with special dental instruments, while taking care not to remove too much enamel and/or dentin or to overheat the insides of the teeth. If the insides of the teeth have become exposed as the result of the hypocalcification, they will be sealed with a bonding agent that is made to protect the inside of the tooth along with its surface. A strong fluoride treatment that is applied to the teeth can be used in tandem with the other treatments to decrease sensitivity and enhance the enamel’s strength. It must be applied to a dry tooth surface using a varnish or strong sodium fluoride paste. This treatment will be performed under medical guidance in-hospital. Using fluoride on your dog at home without consulting a veterinarian is not advisable, since fluoride can be toxic, and can itself cause damage to the enamel if not applied properly. Living and Management If your dog has been diagnosed with hypocalcemia, your veterinarian will recommend regular professional dental cleaning, about once or twice a year, but possibly more depending on the condition of the teeth. Routine home-care, with a regular brushing program, will also need to be undertaken. If you are unfamiliar with tooth brushing for dogs, ask your veterinarian to demonstrate the proper techniques for you. Weekly application of stannous fluoride can be done at home, but caution is important. You will need to prevent your dog from having access to the fluoride, or from swallowing it (though a minute amount being swallowed cannot be helped), since stannous fluoride can be toxic in large doses. Excessively chewing on hard objects should also be discouraged."}]