[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tooth Root Abscess in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1424019152.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1424019152.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Condition, Oral health, Symptom Checker, Tooth Root Abscess", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/tooth-root-abscess-dogs"}, "datePublished": "February 6, 2023", "dateModified": "September 12, 2023", "description": "Dr. Veronica Higgs explains a tooth root abscess in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is a Tooth Root Abscess in Dogs?  A tooth root abscess is a pocket of infection around the root of a tooth under the gumline.  Abscessed teeth are painful and may cause a dog to stop eating or to not want to chew on toys.  In some cases, swelling can appear below the eye or along the jaw.  Due to the pain and infection, a tooth root abscess can be a medical emergency.  If you suspect your pet may have a tooth root abscess, you should take them to the veterinarian immediately.  In most cases, surgery will be needed to remove the tooth.  However, even if that cannot be done immediately, the pet should be seen as soon as possible to start treatment, likely with pain medication and antibiotics, until the procedure can be scheduled.  Symptoms of Tooth Root Abscess in Dogs  Not all dogs with a tooth root abscess will show clinical signs, but when they do some common ones are: Decreased appetite Bad breath (halitosis) Trouble eating, including only eating soft food and chewing on one side of the mouth Trouble chewing on toys Oral pain Pawing at the face or mouth Facial swelling—often below the eyes or of the lower jaw Draining wound on face or in the mouth Swelling or redness of the gums Drooling Presence of a broken or discolored tooth Fever Causes of Tooth Root Abscess in Dogs  Tooth root abscesses are an infection at the tip of the tooth root.  The infection often occurs as a result of bacteria entering a chip, crack, or fracture in the tooth and traveling down the tooth, causing swelling and inflammation at the tip of the root.  Another way the infection can occur is through the gums themselves in cases of severe dental disease.  Inflammation of the gum starts out as gingivitis but can progress to severe inflammation and infection (periodontal disease) with large tartar buildup that houses bacteria.  This causes bad breath and can also lead to bacteria surrounding the root and resulting in a tooth root abscess.  Any tooth is susceptible to tooth root abscess, but the most commonly fractured teeth, and therefore most common teeth to have tooth root abscesses, are the carnassial teeth.  There are four carnassial teeth in a dog’s mouth.  They are the fourth upper premolars (large premolars on both sides of the top jaw) and the lower first molars (largest molars on both sides of the bottom jaw).  Any dog can get a tooth root abscess, but enthusiastic chewing dogs may be at higher risk.  A common type of tooth fracture, called a slab fracture, can occur when a dog bites down on a hard object at a slightly oblique angle, causing a chip to break off.  This type of broken tooth is common in carnassial teeth and can be a source of tooth root abscesses.   How Veterinarians Diagnose Tooth Root Abscess in Dogs  Your veterinarian will collect a thorough history to determine if your dog is having any trouble eating or chewing.  Next, they will perform a detailed physical examination to assess for evidence of facial swelling or draining wounds, fractured or discolored teeth, or fever.  Based on your pet’s history and a physical examination, your vet may suspect a tooth root abscess, but dental x-rays are needed for a  diagnosis.  Dental x-rays must be performed under general anesthesia and are usually performed at the same time as a dental cleaning, called a prophylaxis.  A tooth root abscess will show up on the dental x-ray as a dark area in the bone around the affected root.  Before anesthesia, a complete blood count, serum blood chemistry, and urinalysis will all likely be recommended for a baseline evaluation.  Treatment of Tooth Root Abscess in Dogs  Many times, when dogs present for suspected tooth root abscess, it is not possible for them to have anesthesia for further evaluation and treatment. That’s because the veterinarian needs to schedule an appropriate time for such a procedure and ensure that the pet has not eaten since the night before any anesthesia.  Because of this delay, dogs may be started on pain medications, anti-inflammatory medications, and antibiotics.  While the clinical signs of a tooth root abscess, such as facial swelling or pain when eating, may improve with medical management, it is important to remember that antibiotics will not eliminate the abscess.  These are pockets of pus that cause tooth decay and kill tissue.  Even with antibiotic therapy, the bacteria will remain trapped in the root and inside the tooth where antibiotics cannot penetrate.  So even though your dog may appear to improve, without further care, the swelling, pain, and other clinical signs will likely return after you finish the antibiotics.  The only two treatment options for a tooth root abscess are root canal and extraction.  A root canal can preserve the structure of the tooth while removing the infection by hollowing out the internal structure of the tooth that would otherwise retain the infection.  There are many criteria to determine if a dog is a suitable candidate for a root canal, including damage or trauma to the tooth and surrounding teeth, degree of periodontal disease, and health of your dog&#039;s jaw bones. If you are interested in root canal, your veterinarian will likely refer you to a dental specialist for further assessment.  The more common treatment option is extraction or removal of the affected tooth.  This can be performed by most general practice veterinarians and may involve a nerve block and post-extraction x-ray to confirm that the entire tooth was removed.  Sometimes a gingival flap is made and sutured in place with oral stitches, which are typically left to dissolve on their own and do not need to be removed.  Dogs are typically discharged the same day with antibiotics, pain medications, and anti-inflammatory medication. How much does dental surgery cost in dogs? The cost for extraction of teeth in dogs can vary depending on many factors including geographic location, type of tooth, and how extensive the procedure is.  However, according to CareCredit, pet owners can expect to pay anywhere between $800 and $3,000 for a dental cleaning and extractions.  After evaluation of your dog, your veterinarian is the best resource for the appropriate diagnostic and treatment plan for your pet and the associated costs.  Ask your vet for a detailed estimate of your specific pet’s needs. Recovery and Management of Tooth Root Abscess in Dogs  An early diagnosis and treatment of tooth root abscesses is important for good outcomes and to minimize complications such as spread of infection to the jawbone, soft tissues of the face and neck, and in rare cases to the heart (endocarditis) or brain (bacterial meningitis). Ifyou suspect that your pet has a tooth root abscess, have them evaluated by a veterinarian as soon as possible.  Most dogs will be discharged the same day as their anesthetic procedure for dental cleaning and extraction. They may be sleepy for the rest of the day, but will likely be back to their normal selves by the next day.  Typically, they will need to eat a canned or softened diet for 5-7 days after discharge. Kibble can be softened by adding warm water and allowing it to soak for 5 minutes prior to feeding it to the dog. Additionally, no hard treats or toys should be given to the dog for a week so the gums can heal.  With appropriate care, most dogs with a tooth root abscess make a complete recovery and go back to their normal lives. Remember to follow all discharge instructions from your veterinarian regarding your pet’s care.  Prevention of Tooth Root Abscess in Dogs The best way to prevent tooth root abscesses is to practice proactive dental healthcare. The mainstay of dental care in veterinary medicine is prophylactic dental cleanings, which are typically recommended every 12 months to maintain your dog’s teeth and oral health. Speak to your veterinarian about scheduling one of these cleanings.  Toothbrushing is another helpful way to keep your dog’s teeth healthy. To be considered effective, it is recommended that you brush your pet’s teeth at home at least two to three times a week, in addition to their annual dental cleaning with their veterinarian.  Additionally, the Veterinary Oral Health Council (VOHC) is a group of veterinary dentists and scientists that help set standards in the care of dog’s and cat’s teeth.  They have compiled a helpful list of approved dog products including treats, chews, and kibble that are designed to reduce tartar accumulation and help keep your pet’s breath fresh and clean.  Featured Image: iStock.com/BONDART"}]