[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can stomatitis in dogs be cured?", "acceptedAnswer": {"@type": "Answer", "text": "No, but with regular and aggressive dental care, it can be controlled. The goal with control is to ensure that the dog lives as comfortably as possible, as long as possible, and with as many teeth intact."}}, {"@type": "Question", "name": "What happens if stomatitis goes untreated?", "acceptedAnswer": {"@type": "Answer", "text": "Stomatitis is extremely painful and can create an environment that leads to the loss of teeth. It can cause the dog to stop eating and/or drinking in addition to loss of teeth."}}, {"@type": "Question", "name": "Is there a home remedy for stomatitis in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Unfortunately, no, but there are things that can be done at home to reduce the frequency and severity of flare-ups, such as regular brushing and the use of anti-plaque products."}}, {"@type": "Question", "name": "Is stomatitis in dogs fatal?", "acceptedAnswer": {"@type": "Answer", "text": "No, the disease itself is not fatal. However, a dog will not eat or drink when the mouth is painful, which is vital to the health and well-being of a dog."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Stomatitis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Mouth", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/dog.at_.park_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/dog.at_.park_.jpg"}, "author": {"@type": "Person", "name": "Autumn Madden, DVM", "url": "https://www.petmd.com/author/dr-autumn-madden"}, "keywords": "Dog, Condition, Oral health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/mouth/c_multi_stomatitis"}, "datePublished": "February 23, 2022", "dateModified": "August 12, 2022", "description": "Dr. Autumn Madden discusses stomatitis in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What is Stomatitis in Dogs? Stomatitis, also known as canine chronic ulcerative stomatitis (CCUS), affects a dog’s gums, oral mucosa, tongue, and pharynx. It is known as a paradental disease because it does not attack the tissues that attach the tooth to the socket, it attacks the tissues that surround the teeth. It is believed that 5-10% of dogs with stomatitis also have other immune mediated diseases.   Symptoms of Stomatitis in Dogs Stomatitis can cause the following symptoms:  Drooling  Severe bad breath  Pus-like oral discharge  Decreased appetite  Ulceration of parts of the tongue   Calculus (tartar) on the teeth, ranging from mild to severe  Gingivitis, ranging from mild to severe  Ulcerations on the areas of the cheek that contact teeth (otherwise known as “kissing lesions”)  If a dog had previous dental cleanings that did not improve clinical signs, a veterinarian will determine whether stomatitis is a possible diagnosis.  Causes of Stomatitis in Dogs The exact cause of stomatitis is unknown. We do know that stomatitis is an immune system response to calculus and plaque on the teeth. How Veterinarians Diagnose Stomatitis in Dogs A diagnosis of stomatitis is determined by taking a biopsy (a piece of tissue removed from the body for further evaluation) and histology (the study of microscopic structures of tissues).   Diagnostic testing is also used to rule out diseases that look similar to stomatitis before an appropriate treatment plan can occur. Similar diseases include:  Bullous pemphigoid  Pemphigus vulgaris  Discoid lupus  Erythematosus  Systemic lupus erythematosus  Erythema multiforme  Treatment of Stomatitis in Dogs Treatment of stomatitis starts with a professional dental cleaning. The cleaning schedule for a dog with stomatitis should be every 3-4 months to help reduce the chances of a flare-up. This type of cleaning requires a dog to be sedated to allow for proper examination of the teeth and cleaning under the gum, as well as dental radiographs so that the health of each individual tooth can be assessed.  If it is determined that a tooth is no longer viable, the tooth will be extracted. The vet may then place a sealant on the remaining teeth to slow down the decaying process. The patient is then sent home with anti-inflammatories, pain medication, and a rigorous at-home dental care schedule.   Recovery and Prevention of Stomatitis in Dogs At-home care is very intensive to keep the disease from progressing and allow the dog to live as comfortably as possible for as long as possible. This includes twice-daily removal of plaque on the teeth using a chlorhexidine-based product.  If a flare-up occurs, dental wipes can be helpful until the pain subsides, as brushing is painful at this point. Once the pain is under control, routine daily or twice-a-day brushing can occur.  In addition to rigorous at-home dental care, there are medications and supplements that may be helpful in slowing down the disease process.   Your veterinarian will be able to determine the best treatment plan, including necessary medications, depending on your dog’s needs.  "}]