[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Spinal and Vertebral Birth Defects in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/spinal-vertebral-birth-defects-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/spinal-vertebral-birth-defects-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_dg_spinal_malformations"}, "datePublished": "January 25, 2010", "dateModified": "August 16, 2022", "description": "Dogs most often genetically inherit congenital spinal and vertebral malformations (as opposed to adverse conditions during fetal development).", "articleBody": "Congenital Spinal and Vertebral Malformations in Dogs Dogs most often genetically inherit congenital spinal and vertebral malformations (as opposed to adverse conditions during fetal development). Specifically, sacrococcygeal dysgenesis (defective development) is a dominant trait, while thoracic hemivertebra (chest half-vertebra) of German shorthaired pointers is a recessive trait. Spinal malformations are usually evident at birth or in the first few weeks of life. On the other hand, vertebral malformations can be latent until the dog undergoes a growth spurt around five to nine months of age. Visible signs of a distorted spinal column are lordosis (curvature of the spine at the lower back) and kyphosis (a posterior curvature of the spine). Scoliosis (a lateral curvature of the spine) is also an easily visible form of vertebral malformation. If the malformations lead to secondary spinal cord compression and trauma, the affected dog will display ataxia and paresis. Medicine often does not resolve neurological manifestations of spinal and vertebral malformations. If the condition is severe and untreatable, euthanasia should be considered. Symptoms and Types Malformation of the occipital bones – atlas and axis (the first and second cervical vertebrae at the base of the skull):Causes compression of the upper spinal cord, which can lead to paralysis, sudden deathMore common in small-breed dogsHemivertebra (half a vertebra)Kyphosis, scoliosis, lordosisWedge shaped vertebrae, causes angle in the spineMost likely to affect the neurological systemRear limb weakness (paraparesis), paralysisMay remain without symptomsAffects breeds with a short skull, and “screw-tailed” breeds (may be desired in some breeds)Pugs, Boston terriers, French and English bulldogsTransitional vertebraHas characteristics of two types of vertebraeMay result in cord compression, disc changesBlock vertebraFused vertebrae due to improper segmentation of vertebraeAnimal may live normally without symptomsButterfly vertebra (vertebra with a cleft through the body and a funnel shape at the ends):Vertebra with a cleft through the body and a funnel shape at the ends (giving appearance of butterfly on X-ray examination)Causes instability of the vertebral canal, and rarely, compression of the spinal cord with paralysisSacrococcygeal dysgenesisDefective formation of lowest vertebrae in the spineAssociated with spina bifida (lack of vertebral arches in the spinal column)Spina bifidaVariable spinal dysplasia (abnormal development); dysraphism (defective spinal fusion); syringomyelia (cyst in the spinal cord); hydromyelia (enlarged central canal in the spinal cord where excess cerebrospinal fluid builds up); and myelodysplasia (defective development of the bone marrow)Dog may not show symptomsBulldogs, pugs, Boston terriersMyelodysplasiaDefective development of the bone marrowWeimaranersCongenital spinal stenosis (narrowing of the spinal canal - malformation from birth, hereditary)Chondrodystrophic (dwarf) breedsBasset hound, beagle, dachshunds, lhasa apso, shih tzu, PekingeseDoberman pinschers are also genetically disposedCauses Genetic inheritancePossibly, exposure of pregnant bitches to:Compounds causing birth defects during fetal developmentToxinsNutritional deficienciesStressDiagnosis You will need to give your veterinarian a thorough history of your dog&#039;s health and onset of symptoms. A full physical exam will be performed. X-rays of the spinal column (including all vertebrae) can often reveal the exact malformation. If neurological signs (paralysis) are present, a myelography can be used to indicate with precision at which level the spinal cord is compressed. This imaging technique uses a radiopaque substance that is injected into the spine, or into the membranous space that surrounds the spinal cord so that the defects in the spine will be visible on X-ray projections. Computed tomography (CT) and magnetic resonance imaging (MRI) may also be helpful, and are in some cases much more sensitive than X-rays. However, myelography is generally the diagnostic imaging technique of choice.  Treatment Surgery can be helpful for cases involving narrowing of the spinal canal and decompression of the spinal cord. Secondary damage due to spinal compression may be avoided if surgical intervention takes place early on. If the spinal compression is diffuse or long-term, your dog may not respond to surgery. If your dog is showing neurological signs such as dizziness, seizures or paralysis postoperatively, restricted activity combined with physical therapy may be helpful."}]