[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is the life expectancy of a dog with spina bifida?", "acceptedAnswer": {"@type": "Answer", "text": "Depending on the severity of symptoms experienced, some dogs can have a relatively normal life.  However, many dogs with spina bifida have little to no control over their hind limbs or control of their urinary and fecal habits. In these cases, euthanasia is often chosen.  "}}, {"@type": "Question", "name": "Can spina bifida in dogs be cured?", "acceptedAnswer": {"@type": "Answer", "text": "There is no cure for this condition and dogs usually require some form of life-long extensive management. Depending on severity, however, some dogs can have a functional life and committed pet parents can ensure their lives are filled with joy and dignity. Featured Image: Adobe Stock/zinkevych"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Spina Bifida in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/AdobeStock_93280016.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/AdobeStock_93280016.jpeg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/spina-bifida-dogs"}, "datePublished": "July 11, 2023", "dateModified": "July 11, 2023", "description": "Dr. Michael Kearley explains spina bifida in dogs, including symptoms, diagnosis, and treatment options depending on the severity of the condition.", "articleBody": "What Is Spina Bifida in Dogs? A dog’s backbone (spinal column) is made up of many smaller bones called vertebrae, which are connected by spongy intervertebral discs. Together, they allow movement and protect the spinal cord.  Spina bifida is a congenital defect (present at birth) that occurs when the upper portions of these vertebrae fail to close. This leaves the membranes that cover the spinal cord, or the spinal cord itself, exposed. This defect can cause a wide range of neurological problems ranging in severity such as the inability to walk, urinate, or defecate. Fortunately, this condition is relatively rare in dogs. When it occurs, it usually affects the lower lumbar spine. Spina bifida often occurs with other neurological conditions and most often is apparent in the first few weeks of life when puppies learn to walk. Sadly, because most of these puppies have a poor prognosis of a functional life, many of them are humanely euthanized. For the few that are not significantly impacted by the defect or have minor symptoms, they can go on to live a relatively normal life with minor inconveniences to the pet parent.  Symptoms of Spina Bifida in Dogs Symptoms of this condition include: Weakness of the rear limbs Urinary and/or fecal incontinence Poor muscle tone Poor use of the tail (lack of wagging or weakness in tail movements) Abnormal reflexes Lack of pain perception Knuckling of the toes Bunny hopping or abnormal gait Hyperesthesia (increased sensation) and pain Additionally, dogs may have a dimple (a small external visible depression) along the spine, which often is painful when touched.  Some dogs, depending on the severity of spina bifida, may have few symptoms or neurological deficits that aren’t detrimental to their long-term well-being. Causes of Spina Bifida in Dogs Spina bifida occurs when tissues do not form properly within the womb. The exact reason this happens is unknown, but it could be associated with several factors such as exposure to toxins or certain environmental conditions while the mother is pregnant.  Other congenital defects often occur with spina bifida, such as: Meningomyelocele (protrusion of the meninges and/or spinal cord with or without fluid pockets) Hemi or block vertebrae (abnormally shaped vertebrae) Hydrocephalus (excess fluid in the skull, causing brain swelling) Dermoid sinus (tubular sac arising from the skin and extending to deeper tissues) The English Bulldog is the breed most affected by this condition, but it has also been seen in Collies, English Cocker Spaniels, French Bulldogs, Boston Terriers, Miniature Poodles, Chihuahuas, and Dobermans. Males seem to be affected more than females. How Veterinarians Diagnose Spina Bifida in Dogs Your veterinarian may recommend basic blood work like a complete blood cell count (CBC), internal organ function screening, and a urinalysis. The results from these tests provide a baseline and can also help rule out other conditions. X-rays are often recommended as a next step and can help identify related conditions. Pet parents most likely will be referred to a veterinary neurologist for an MRI, which is the standard test for this condition. A CT scan and a CSF (cerebrospinal fluid) tap may also be recommended and performed with this specialist.   If unable to perform these tests due to no MRI available or the cost, your veterinarian may perform a myelogram, in which contrast dye is injected into the fluid surrounding the spinal cord. This test is not without risks for dogs with certain health conditions and requires anesthesia. Treatment of Spina Bifida in Dogs Unfortunately, this condition is lifelong and carries a heavy burden on the pet parent, with limited quality of life for the dog. Euthanasia is often chosen. Surgery cannot cure spina bifida in dogs, but it can alleviate some symptoms and make a dog more comfortable. Surgery will be pursued if symptoms are mild and the dog is in good health. Dogs with less severe symptoms are often more prone to urinary tract infections, skin infections, and muscle atrophy, so frequent follow-up visits and rechecks are still necessary. Dogs often require medication to help with manual expression of the bladder. The three goals of treatment for this condition are: improvement in neurologic deficits, enhanced bladder and bowel function, and better movement. Consistent grooming habits, bathing, and hygiene care are needed and even a doggy wheelchair or similar device may be required for improved mobility.   Recovery and Management of Spina Bifida in Dogs When surgery is an option for a dog, the recovery is often lengthy and requires rehabilitation and physical therapy. Several days of hospitalization are needed and physical therapy can last several weeks to months. Partnering with your veterinarian, particularly if they are a member of the American Association of Rehabilitation Veterinarians, to get an individualized treatment plan is advised. Acupuncture, laser therapy, and massage could be additional post-surgical therapies.  Long-term care depends on the symptoms, and many dogs require some form of nursing care.  Again, physical therapy coupled with pain medications or NSAIDs when needed will be vital to improve your dog’s strength and mobility while limiting or preventing muscle atrophy. Toe-grips for traction, rugs, a harness, or a wheelchair are all tools that can help your dog remain mobile and enjoy a better quality of life.  Joint supplements such as Cosequin®, Dasuquin®, and Welactin®, among others, as well as feeding your dog a well-balanced high-quality food, can reduce inflammation and support joint health.  Maintaining proper grooming habits and the use of doggie diapers and pads can be helpful if they are changed frequently, and the skin should be inspected for signs of infection and urine scalding. "}]