[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Soft Tissue Cancer (Rhabdomyosarcoma) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_dg_rhabdomyosarcoma"}, "datePublished": "January 20, 2009", "dateModified": "August 16, 2022", "description": "Rhabdomyosarcomas are malignant, aggressive, easily metastasizing (spreading) tumors. They arise from striated muscles (banded - not smooth, muscles of the skeletal and cardiac musculature) in adults, and from embryonic stem cells in juveniles.", "articleBody": "Rhabdomyosarcoma in Dogs Rhabdomyosarcomas are malignant, aggressive, easily metastasizing (spreading) tumors. They arise from striated muscles (banded - not smooth, muscles of the skeletal and cardiac musculature) in adults, and from embryonic stem cells in juveniles. These tumors are often found in the larynx (voice box), the tongue, and in the heart. Aggressive and widespread metastasizing can occur in the lungs, the liver, the spleen, the kidneys, and the adrenal glands. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats please visit this page in the PetMD pet health library. Symptoms and Types     Large, diffuse, soft tissue mass, generally of the skeletal muscle    May spread into the primary muscle (forming multiple nodules)    If tumor is in the heart there may be signs of right-sided congestive heart failureCauses     Idiopathic (unknown)Diagnosis Your veterinarian will perform a complete physical exam, including a chemical blood profile, a complete blood count, a urinalysis, and an electrolyte panel. You will need to provide a thorough history of your dog&#039;s health leading up to the onset of symptoms. While a cytologic (microscopic) examination of a fine-needle aspirate sample may reveal cancer, a definitive diagnosis can only be made with a surgical biopsy (tissue sample).  Treatment Surgical removal of the tumors, or nodules, should be performed if a cure is desired, but because of the invasive and expansive nature of this tumor, it may not be removable by surgery. If one limb is primarily affected, amputation of the affected limb should be considered. Radiotherapy may be helpful, particularly if the tumor was not entirely removable. Living and Management Your veterinarian will schedule a follow-up appointment once a month for the first three months following the initial treatment. Subsequent appointments can then be scheduled every three to six months. If your dog undergoes surgery to have a tumor removed, you will need to closely observe the surgical site every day until it has healed entirely. Your doctor will instruct you in the proper cleaning and dressing techniques for the sutured site. You will need to contact your veterinarian immediately if you see oozing, drainage, swelling, or redness from the surgical site. If you have any questions, contact your veterinarian immediately."}]