[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Umbilical Hernia in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Musculoskeletal", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/umbilical-hernia-dogs.png", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/umbilical-hernia-dogs.png"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/musculoskeletal/c_dg_umbilical_hernia_in_dogs"}, "datePublished": "November 19, 2012", "dateModified": "August 16, 2022", "description": "An umbilical hernia is an opening in the muscle wall where the belly button is located. If left untreated, it can be serious.", "articleBody": "Umbilical Dog Hernia An umbilical hernia is an opening in the muscle wall where the umbilicus (belly button) is located. The hernia allows the abdominal contents to pass through the opening. Symptoms and Types Umbilical hernias may be complicated or uncomplicated. A complicated hernia is one in which contents of the abdominal cavity, such as a loop of intestine, have passed through the opening and become entrapped. An uncomplicated umbilical hernia is associated with a soft swelling in the umbilical area. This swelling may be variable in size and may come and go. Otherwise, the dog will appear health. Symptoms seen with a complicated umbilical hernia may include: Pain and warmth, especially at the site of the umbilical swellingVomitingLack of appetiteDepressionCauses Most umbilical hernias in dogs are probably inherited although trauma can also be a cause. Some breeds of dogs, including Airedales, Pekingese, and basenji are predisposed to umbilical hernias. Diagnosis Umbilical hernias can usually be diagnosed by finding the swelling caused by the hernia on a physical examination. However, sometimes contrast radiographs (x-rays) or an abdominal ultrasound are needed to determine which abdominal contents, if any, are entrapped.  Treatment Treatment of an umbilical hernia involves surgical correction of the opening and replacement of abdominal contents if necessary. Some umbilical hernias will, however, close spontaneously, usually by 6 months of age. Small umbilical hernias may not need surgical correction but larger hernias should be repaired to remove the risk of complications. Prevention Because many umbilical hernias are hereditary, pets with these hernias should not be bred."}]