[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "My Pet is Moving Less - What&#039;s Up?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_275330150.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_275330150.jpg"}, "author": {"@type": "Person", "name": "Ashley Gallagher, DVM", "url": "https://www.petmd.com/author/dr-ashley-gallagher"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/my-pet-moving-less-whats"}, "datePublished": "May 4, 2016", "dateModified": "August 12, 2022", "description": "By keeping an eye out for subtle changes we can address issues early which give us the best chance to provide our pets with a healthy and happy life free of pain.", "articleBody": "What to Watch For As our pets age there are many clinical signs that we need to be on the lookout for to make sure they don’t need medical attention.  By keeping an eye out for subtle changes we can address issues early which give us the best chance to provide our pets with a healthy and happy life free of pain.  Underlying diseases that may affect your pet’s mobility include arthritis, injury, degenerative neurologic diseases, certain types of cancer, diabetic neuropathy in cats, and hearing loss. Arthritis is the most common cause of decreased mobility in both dogs and cats.  Technically called degenerative joint disease (DJD) it occurs when abnormal movements in the joints cause erosion of cartilage.  This will progress to bone rubbing on bone which itself is very painful and leads to inflammation.  The inflammatory process creates a vicious cycle resulting in chronic pain for your pet.  Factors such as obesity, overly active lifestyle, joint conformation and genetic factors can contribute to this process. The most obvious sign of joint disease is when a dog or cat starts limping, usually right after they have been resting or lying down. However, there are numerous other subtle signs that may indicate your pet is uncomfortable.  Perhaps your dog doesn’t charge up the stairs like he used to. Maybe your older pet seems to be “slowing down.”  Cats may start urinating or defecating out of the litter box because it is too painful for them to jump into it.  These are just a few examples. Bottom line: if you notice any changes in your pet’s behavior, talk with your veterinarian immediately. Treatment Early treatment for arthritis can be as simple as switching to a prescription diet or starting supplements.  The omega-3 fatty acids found in fish oil act as a strong anti-inflammatory for the joints.  There are several glucosamine and chondroitin supplements on the market that help repair cartilage damage.  I recommend looking for a glucosamine and chondroitin supplement that also contains avocado/soybean unsaponifiables, Boswellia and green-lipped muscle. For your pet’s safety, consult your veterinarian for guidance in selecting and dosing over the counter supplements. For more advanced disease you should speak with your veterinarian about starting pain medication, acupuncture or physical therapy. Traumatic injury resulting in a muscle strain or ligament tear can result in pain with decreased activity.  These types of injury usually present suddenly and resolve with pain medication and rest.  If it is something more involved like a cruciate ligament tear the pet will usually need surgical correction for full return to function and to avoid developing secondary arthritis.  Your veterinarian can help determine the extent of your pet’s injury. Non-Arthritic Conditions Neurologic conditions such as intervertebral disk disease, inflammatory conditions in the brain and spinal fluid or tumors of the spine can affect mobility in a variety of ways.  The most common clinical sign in these diseases is weakness or paralysis in one or multiple limbs.  You can also see neck or back pain, decreased appetite, lethargy and fever.  If you are concerned that your pet is experiencing these signs, please seek veterinary care immediately. Certain cancers of the bones and cartilage can cause limping and decreased mobility.  These cancers are very painful and readily diagnosed with x-rays.  Pets are so adept at hiding their pain from us that we often don’t see any clinical signs until they stop putting any weight on the affected limb or develop a pathologic fracture.  Again early detection is essential for managing and treating these conditions as well as helping keep your pet from experiencing chronic discomfort.  Cats and rarely dogs can develop neurologic disease secondary to diabetes.  This is usually seen as weakness in the hind limbs called a “plantigrade stance” where the pet’s hocks are dropped almost touching the ground.  If you notice this in your pet speak with your veterinarian about testing them for diabetes.  If caught early and insulin therapy is started, diabetic neuropathy can be reversible. Hearing can Affect Mobility Finally decreased hearing can result in your dog or cat not leaping off the sofa to greet you when you walk in the door.  Unfortunately there isn’t much we can do to test or treat for this, but it is good information to discuss with your veterinarian to make sure there isn’t something more serious going on. A dog or cat’s activity level and mobility can tell us a lot of important information about their overall health, especially as they age.  Any changes, either subtle or drastic, should be discussed with your veterinarian.  Treatment could be as simple as adding in a supplement or additional tests may be necessary to make sure your pet is healthy and pain free."}]