[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How do I know if my dog has narcolepsy?", "acceptedAnswer": {"@type": "Answer", "text": "Narcolepsy is a sudden loss of consciousness, usually during excitement or activity, when the dog will act as if asleep. Unconscious dogs can often be woken from these episodes. If you are concerned that your dog is showing these symptoms, schedule an appointment with your veterinarian immediately."}}, {"@type": "Question", "name": "Can dogs outgrow narcolepsy?", "acceptedAnswer": {"@type": "Answer", "text": "Narcolepsy is a lifelong condition, and it cannot currently be cured. It can, however, be managed in a way that maintains a good quality of life for your dog and your family. Featured Image: iStock.com/Capuski"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Narcolepsy in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1452547966.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1452547966.jpg"}, "author": {"@type": "Person", "name": "Jamie Lovejoy, DVM", "url": "https://www.petmd.com/author/dr-jamie-lovejoy"}, "keywords": "Dog, Adult, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/narcolepsy-dogs"}, "datePublished": "March 3, 2023", "dateModified": "March 3, 2023", "description": "Dr. Jamie Lovejoy discusses narcolepsy in dogs, including diagnosis and how to manage the condition if you dog is diagnosed with narcolepsy.", "articleBody": "What Is Narcolepsy in Dogs? Narcolepsy is a rare cause of sudden collapse or fainting in dogs. It can be scary to witness, but is usually not life threatening. Certain medications and lifestyle changes can be used to lessen the severity of the disease, but management is lifelong as narcolepsy is not curable. Symptoms of Narcolepsy in Dogs Signs of narcolepsy include: Sudden fainting/paralysis and loss of consciousness, usually during activity or excitement Muscle tone and reflex loss (cataplexy) Rapid eye movements (REM) Episodes usually only last a few seconds, but some dogs can take a few minutes to recover. Many dogs can be brought out of the event if you try to wake them up, as if they had been sleeping. If your dog is not rousable and the event is lasting longer than a few minutes, contact your nearest emergency veterinarian to make sure nothing else is going on. Even if your dog wakes quickly and easily, if you have not established a diagnosis or plan with your primary veterinarian, it is worth contacting them after an event to ensure no further steps need to be taken. Causes of Narcolepsy in Dogs Narcolepsy is most commonly an inherited disorder, which is why it is usually first seen and diagnosed in young dogs. A recessive gene linked to narcolepsy has been found in Doberman Pinschers, Labrador Retrievers, and Dachshunds. But any breed can be prone to the condition. Multiple gene mutations that cause similar clinical signs have also been determined. There have also been rare cases where a severe inflammatory event (meningitis, pneumonia, etc.) has led to narcolepsy in dogs who were not genetically predisposed. This is called acquired narcolepsy and is likely due to a dysfunction of the immune system, though research around this is not well understood.  How Veterinarians Diagnose Narcolepsy in Dogs There are multiple causes of collapse in dogs, so a full exam and blood workup is important to rule out cardiac, muscle, or different neurologic dysfunctions in dogs showing signs of narcolepsy. Often the complete blood count, blood chemistry, urinalysis, and baseline imaging (x-rays and ultrasound) are all normal in these dogs. Most cases of narcolepsy are diagnosed by symptoms and ruling out other causes. Scheduling a visit with a neurologist for advanced diagnostics such as an MRI and cerebrospinal fluid analysis can help rule out physical changes in the brain. Though this will not apply to all cases, if the affected dog has narcolepsy due to a shortage of hypocretin (a neurotransmitter), this can be measured. Treatment of Narcolepsy in Dogs The most important part of treatment is learning to recognize patterns that lead to episodes. Many narcoleptic pets have these events most often when they are excited or during high-exertion activities. If these situations can be identified and avoided, that may reduce how often there are episodes. Sharing videos with your vet may help isolate potential triggers. Some pets will have frequent enough events that additional therapy is needed. Tricyclic antidepressants like imipramine have been used with success in some patients to help calm them. In acquired epilepsy, steroids and other immune system modifying drugs may be beneficial. Unlike seizures, the narcoleptic episodes themselves are unlikely to cause harm in a safe environment. They are not painful, and most body functions remain normal. Recovery and Management of Narcolepsy in Dogs Complete remission (or cure) of narcolepsy is unusual, even with medications, but dogs can live relatively normal lives with this disease. Environmental management is very important for long-term success. Play and physical activity are necessary to maintaining good quality of life, but care must be taken in choosing locations so that your dog is unlikely to injure themselves if they have a narcoleptic event. Swimming, running, and hiking steep mountains are riskier activities for narcoleptic dogs. Keep in mind that other dogs may not understand your dog’s condition. Fear and reactive aggression can be seen from companions when a narcoleptic dog has this sudden, abnormal behavior and body language. Activities with other dogs should be watched closely, and large groups of dogs/dog parks should likely be avoided."}]