[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Neuroaxonal Dystrophy (NAD) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/Dog-at-the-vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/Dog-at-the-vet.jpg"}, "author": {"@type": "Person", "name": "Rhiannon Koehler, DVM", "url": "https://www.petmd.com/author/dr-rhiannon-koehler"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/neuroaxonal-dystrophy-nad-dogs"}, "datePublished": "September 22, 2023", "dateModified": "September 22, 2023", "description": "Neuroaxonal dystrophy (NAD) in dogs is a hereditary condition that affects a pup’s nervous system. While some dogs may have it at birth, it can also develop later in a dog’s life.", "articleBody": "What Is Neuroaxonal Dystrophy (NAD) in Dogs? Neuroaxonal dystrophy (NAD) in dogs is an inherited condition that affects the nervous system. It’s present in some dogs at birth, but it may also develop later in a dog’s life. A dog’s nervous system sends signals between their brain and other parts of their body, allowing for movement, thoughts, and essential body functions like breathing. The nerve cells that make up the nervous system comprise three main parts: the cell body, dendrites, and axon. The cell body is the command center of the cell. The dendrites extend from the cell body, receiving signals from other cells. The axon carries nerve impulses away from the cell body, transmitting these signals to other cells. Neuroaxonal dystrophy is the severe swelling of axons throughout the nervous system. These swollen areas on the axons are called spheroids. Changes to the axons affect the ability for cells to send signals to each other, which can cause neurological dysfunction. NAD is considered a very rare disorder in dogs. If your dog is having symptoms of a neurologic disease, other causes like granulomatous meningoencephalitis (GME) or distemper are more common. Your veterinarian will rule out other health conditions to determine a diagnosis. NAD is a progressive disease, but it’s typically not a medical emergency when first noticed. If you’re concerned that your pet may be developing symptoms of NAD, contact your vet for an appointment. If you’re noticing paralysis, sudden blindness, or an inability to walk, these are cases in which you should seek emergency care. Symptoms of Neuroaxonal Dystrophy (NAD) in Dogs  Symptoms of NAD in dogs are often mild at first, but they progress. ending with paralysis and blindness. The speed of symptom progression varies. In some cases, particularly with dogs who are diagnosed as puppies, symptoms usually progress quickly over weeks or months. Dogs that are diagnosed as young adults sometimes have a slower progression that can last more than a year. Signs may include: Scuffing or dragging of the pawsWeakness in the hind limbs, which may cause difficulty standing or jumpingDrunken gait (ataxia) and lack of coordinationHigh-stepping gaitTremorsDeafnessRigid extension of limbsParalysisNystagmus (unintentional eye movement)BlindnessCauses of Neuroaxonal Dystrophy (NAD) in Dogs NAD in dogs is caused by a gene mutation and is an autosomal recessive condition— meaning a puppy must inherit a copy of the mutated gene from both of their parents to develop the disease. In some breeds, the underlying genetic cause has yet to be determined. Dogs that inherit the mutated gene from one parent will be carriers of the condition but won’t develop signs of NAD. However, if they were to breed with another dog that was a carrier of the mutated gene, they could pass on the disease to their pups. If you are intending to breed your dog, it’s highly recommended that you get your dog genetically tested for conditions they could pass on to their puppies. In some breeds, symptoms begin to show within a few months of birth. However, in some cases, NAD onset occurs when the dog is over a year old, which has been reported in Rottweilers. Many cases that begin early in life are rapidly progressive over the course of weeks to months, while slightly older dogs may have a slower progression lasting months to years. Even in breeds with known cases of NAD, the condition is rare. These breeds include: Jack Russell Terriers Chihuahuas German Shepherds Papillons Dachshunds Rottweilers Giant Schnauzers Border Collies Boxers Spanish Water Dogs How Veterinarians Diagnose Neuroaxonal Dystrophy (NAD) in Dogs NAD is an extremely rare condition in dogs. Your veterinarian will likely start by ruling out other conditions before testing for NAD. Much of this testing is performed at a specialty clinic. Recommended tests may include: Urinalysis Blood tests Magnetic resonance imaging (MRI) of the brain and spinal cord Computed tomography (CT) of the brain and spinal cord Analysis of cerebrospinal fluid (CSF), which is the fluid around the brain and spinal cord, for evidence of inflammation or infection Infectious disease testing, to determine if the dog has distemper virus If your dog is a breed with a higher chance of being predisposed to NAD; your veterinarian may want to discuss genetic testing if it’s an option. These tests usually require a blood or cheek swab. Treatment of Neuroaxonal Dystrophy (NAD) in Dogs There is no cure for neuroaxonal dystrophy in dogs. Some veterinarians may prescribe anti-inflammatory medications like carprofen or steroids like prednisone to reduce inflammation.  If your pet is experiencing rigidity or muscle spasms, some veterinarians may try muscle relaxants like methocarbamol. However, there is currently no standard medical treatment that reliably improves NAD symptoms. Instead, management of NAD is focused on keeping the pet comfortable in the home. Recovery and Management of Neuroaxonal Dystrophy (NAD) in Dogs Since NAD cannot be cured in dogs, management is focused on supportive care, including altering your home to create a safe environment for your pet. Because your dog may have difficulty walking, running, and jumping, you may consider placing non-slip matts on hard floors to prevent slipping. Using ramps to help your dog with furniture or car rides may also be helpful. Vision is sometimes affected, so try to avoid moving around furniture to ensure your pup can walk safely in their home.   Dogs don’t recover from NAD. Dogs diagnosed as puppies usually decline within several weeks to months and are humanely euthanized. Dogs diagnosed as young adults may have a slower progression. Occasionally, these dogs live for over a year, but neurological decline typically results in humane euthanasia. Prevention of NAD in Dogs Since NAD is a genetic condition, pet parents can’t prevent NAD in their pets. Adult dogs over two years old without symptoms are extremely unlikely to develop NAD. To lessen the risk of bringing home a dog with NAD, pet parents can choose to adopt mixed breed dogs from shelters or dogs from reputable breeders. If you’re planning to adopt from a breeder and know the breed has an available test for NAD, ask the breeder if they have tested the dog’s parents for the NAD genetic mutation. If they don’t test for NAD, you could see if they are willing to either get the parents or the pet tested before you bring home your new pet. Featured Image: iStock.com/Ridofranz"}]