[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Why is my dog’s leg spasming?", "acceptedAnswer": {"@type": "Answer", "text": "Electrolyte imbalances, toxin ingestion, neurologic issues (which include dancing Doberman disease), orthopedic issues, and/or neuromuscular issues can all cause muscle spasms in your dog’s rear legs. Your vet will need to rule out possible medical conditions before diagnosing dancing Doberman disease."}}, {"@type": "Question", "name": "Are back leg spasms in dogs painful?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with dancing Doberman disease do not seem to be in any pain. Some experts believe these dogs feel a “pins and needles” or a burning sensation down their legs, which is what causes them to shift their weight (similar to restless leg syndrome in people), but this has not been proven."}}, {"@type": "Question", "name": "Can back leg spasms in dogs be cured?", "acceptedAnswer": {"@type": "Answer", "text": "There is no cure for dancing Doberman disease, and there is no effective treatment. The good news is that there is no obvious pain associated with this condition, so there is little to no change in quality of life. Featured Image: iStock.com/RistoArnaudov"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Spasm of the Rear Legs in Dogs / Dancing Doberman Disease", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-11/dancing%20doberman%20disease.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-11/dancing%20doberman%20disease.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Disease, Brain health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_dg_dancing_doberman_disease"}, "datePublished": "November 24, 2021", "dateModified": "September 8, 2023", "description": "Dr. Katie Grzyb discusses dancing Doberman disease, or spasms in a dog’s rear legs, including what causes the condition and how it can be managed over the long-term.", "articleBody": "What Is Spasm of the Rear Legs in Dogs? Spasm of the rear legs in dogs—also called dancing Doberman syndrome because it mostly affects Doberman Pinschers—is a neuromuscular condition that causes uncontrolled flexing of the hip and of the stifle joint (similar to a human’s knee) while the dog is standing. The disease is not well understood, but it has the following characteristics: In the early stages, a dog can usually walk and run normally but will begin to have spasms when standing. Some affected dogs will prefer sitting or lying down to standing.  The dog will appear to be dancing but is actually alternately flexing and extending his rear legs. Though the spasms may start with one leg, they usually progress to both rear legs within months. The front legs aren’t affected. This condition slowly progresses to muscle weakness, knuckling of the back paws (walking on the knuckles or top of the foot), and wasting (atrophy) of the muscles in the back legs. It affects dogs, both male and female, between the ages of 6 months and 7 years old.  Dancing Doberman disease can resemble many other diseases and conditions, including: Arthritis Hip dysplasia Intervertebral disc disease Wobbler syndrome Other nerve-related medical conditions The major difference is that, with dancing Doberman disease, the dog does not seem to be in any pain. Symptoms of Spasm of the Rear Legs in Dogs Symptoms associated with dancing Doberman may include:  Spasm of the muscles in the rear legs Flexing and extending of one or both of the rear legs Holding up a rear leg Shifting back and forth on rear legs Knuckling over of rear paws Atrophy (muscle wasting) of the affected leg or legs Weakness in the back legs Preference for sitting or lying down instead of standing Collapse of the rear end with advanced weakness Causes of Spasm of the Rear Legs in Dogs Not much is known at this point about the causes of the disease. There may be a genetic connection, but that has not been proven. How Veterinarians Diagnose Spasm of the Rear Legs in Dogs Diagnosing dancing Doberman disease can be difficult and frustrating since most diagnostic tests will have normal results. Vets usually make the diagnosis based on: History Clinical signs Physical examination Ruling out other diseases that may look similar Bloodwork, which can sometimes reveal elevations in such muscle enzymes as aspartate aminotransferase (AST), alanine aminotransferase (ALT), lactate dehydrogenase (LDH), and creatinine kinase (CK) X-rays, MRI, and/or myelogram to rule out similar-looking neurologic and orthopedic conditions Electromyography (EMG) and histopathology (biopsy) of the muscle and nerves. During an EMG, electrical currents are sent to the muscles, and returning signals from the nerves are recorded. Treatment for Spasm of the Rear Legs in Dogs Unfortunately, there is no effective treatment or cure for dancing Doberman disease. Physical therapy may be attempted to maintain muscle mass, flexibility, and range of motion. The therapy may include: Massage Swimming Hydrotherapy Passive range of motion (PROM) exercises Laser therapy (cold and hot) Acupuncture The last two are currently being tested in the treatment of this condition, and the results are not yet in. Management of Spasm of the Rear Legs in Dogs The disease progresses slowly, but quality of life and life expectancy are not usually affected. Physical therapy and joint supplements should be considered for the rest of the dog’s life to avoid other bone- and joint-related issues."}]