[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tick Medicine Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/c_dg_Amitraz_Toxicosis"}, "datePublished": "November 24, 2009", "dateModified": "August 16, 2022", "description": "Amitraz toxicosis (or poisoning) occurs when a dog is overexposed to the pharmaceutical drug Amitraz, which is commonly used in dog collars and in topical solutions for the prevention and eradication of ticks and to control demodex mite infections.", "articleBody": "Amitraz Toxicosis in Dogs  Amitraz toxicosis (or poisoning) occurs when a dog is overexposed to the pharmaceutical drug Amitraz (formamidine acaricide), which is commonly used in dog collars and in topical solutions for the prevention and eradication of ticks and to control demodex mite infections. Toxic levels of this drug will affect the dog’s nervous, endocrine/metabolic, and gastrointestinal systems. Amitraz topical solutions usually contain 19.9 percent of the pharmaceutical in 10.6 ml bottles, while impregnated collars contain 9 percent of it in a 25-inch, 27.5 gram collar. Symptoms and Types The symptoms of Amitraz toxicosis develop acutely after the overexposure occurs — usually within two to six hours after the incidence. The most common symptoms include:     Vomiting    Diarrhea    Lethargy    Weakness    Staggering    Disorientation    Hypothermia    Abdominal pain    Light or severe depressionIn severe cases where the correct treatment is not administered, Amitraz toxicosis may result in a comatose state or death. Causes Amitraz toxicosis can be caused in a number of ways. The most common cause of the condition is when a dog chews or ingests its own tick collar. It may also occur if an inadequately diluted Amitraz-containing solution is topically applied on the dog’s skin, or if the dog ingests the undiluted solution directly. If a diluted solution is topically applied in the proper way, Amitraz toxicosis occurs quite rarely. Elderly, sick, diabetic or debilitated dogs and toy breeds are particularly vulnerable to this condition. Curious puppies are probably the most frequently affected victims. Diagnosis If there has been a recent incidence of access or exposure to an Amitraz-containing solution or tick collar and your dog is displaying any of the symptoms of an overdose, your veterinarian will base the diagnosis on a physical exam. An abdominal X-ray will typically show that there is a collar buckle in the gastrointestinal tract. The results of an exam may reveal traces of Amitraz on the hair or in the gastrointestinal contents, and a biochemical and urine analysis will often reveal hyperglycaemia (high blood sugar). Additionally, these tests may reveal an elevated level of liver enzymes when Amitraz toxicosis has occurred, although only rarely.     Treatment In the less severe cases of Amitraz toxicosis resulting from topical application, mild sedation after the application of properly applied solutions, or a gloved scrubbing with a dish-washing detergent and large amounts of water may be sufficient as a treatment. More severe cases may require one to two days of inpatient care and supportive therapy consisting of intravenous fluids, nutritional support, and the maintenance of normal body temperature. If the condition was caused by the ingestion of a collar, then the larger pieces have to be removed from the stomach with an endoscopic retrieval. In the case of a collar ingestion during which the dog is not yet exhibiting any of the symptoms of Amitraz toxicosis, a 3 percent emetic and USP hydrogen peroxide (2.2 ml per kilo of body weight, maximum 45 ml) is orally administered after a moist meal has been fed. Activated charcoal (2 g per kilo of body weight) that contains sorbitol may also be administered through a stomach tube every four hours until the pieces of the collar bone appear in the dog&#039;s stool. If the dog is exhibiting marked depression, there are several medications available that can be used until the dog starts showing signs of improvement. An elderly, sick, or debilitated dog may need more time to recover from the symptoms. Living and Management After successful treatment, the dog must be closely observed for 24 to 72 hours and its body temperature, blood pressure, serum glucose and heart rate must constantly be monitored. In extremely severe cases, medications may need to be re-administered. There are usually no long-term adverse effects after the condition has been successfully treated. Prevention The best prevention for Amitraz toxicosis is to follow the instructions that come with the topical solutions and tick collars accurately, and to keep dogs in the same household from licking each others’ collars. Also, owners must keep Amitraz-containing solutions and unused tick collars in a place that is not accessible to their dogs."}]