[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog live with pemphigus?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs with milder forms of pemphigus—such as pemphigus foliaceus or pemphigus erythematosus—can live normal lives with good management of their condition. Dogs that don’t respond sufficiently to treatment are often humanely euthanized due to their condition within a year of diagnosis."}}, {"@type": "Question", "name": "What makes pemphigus worse in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Some forms of pemphigus are naturally worse, such as pemphigus vulgaris. Pemphigus can be exacerbated by secondary issues (skin infection), sun exposure, or an ineffective treatment plan. Featured Image: iStock.com/Maksym Belchenko"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pemphigus in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/dog-being-examined-by-a-vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/dog-being-examined-by-a-vet.jpg"}, "author": {"@type": "Person", "name": "Rhiannon Koehler, DVM", "url": "https://www.petmd.com/author/dr-rhiannon-koehler"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/pemphigus-dogs"}, "datePublished": "September 22, 2023", "dateModified": "September 22, 2023", "description": "Pemphigus in dogs is an autoimmune condition of the skin. Pemphigus causes the connections between a dog’s skin cells to break down. The destruction of these connections leads to blistering, lesions, hair loss, and redness of the skin.", "articleBody": "What Is Pemphigus in Dogs? Pemphigus in dogs is an autoimmune condition of the skin. When a dog has pemphigus, the connections (desmosomes) between skin cells break down. The destruction of these connections leads to blistering, lesions, hair loss, and redness of the skin. Autoimmune skin diseases are rare in dogs, but of all these conditions, pemphigus is the most seen. However, most pups won’t ever experience pemphigus. While a dog with pemphigus may be uncomfortable, in most cases they don’t need to be brought to the emergency room. If your pet doesn’t seem too bothered by their skin condition, call your veterinarian for an appointment. If your pet is unable to rest due to itchiness or pain, their sores are rapidly worsening, or your pet is lethargic, seek care from an urgent-care veterinarian. Types of Pemphigus in Dogs There are five types of pemphigus conditions in dogs, the most common being pemphigus foliaceus and pemphigus vulgaris. The three rare variants are pemphigus erythematosus, pemphigus vegetans, and paraneoplastic pemphigus. These conditions all have certain characteristics: Pemphigus foliaceus usually appears on the head, face, and ears with symmetrical lesions on both sides of the head. A dog’s footpads are often affected as well. The trunk of their body is sometimes affected, but it’s not always obvious unless the fur is shaved. Lesions typically look like pustules. Pemphigus vulgaris is the more severe version of the condition. This form usually affects the mouth and areas where mucous membranes meet the skin, such as the lips, genitals, and anus. Footpads and clawbeds may also be affected. Lesions usually start as blisters and quickly become painful open sores. The lesions of pemphigus vulgaris affect deeper skin layers than pemphigus foliaceus. This type of pemphigus is difficult to resolve. If it does improve, a pup may still have scarring. Pemphigus erythematosus is considered a crossover between pemphigus foliaceus and another autoimmune skin condition called discoid lupus erythematosus. Commonly affected areas include a dog’s nose, face, and ears, with sores developing in these areas.  Pemphigus erythematosus may be worsened by exposure to the sun. Pemphigus vegetans in dogs is very rare. The key characteristic of this form of pemphigus is that lesions develop into wart-like growths. Paraneoplastic pemphigus occurs as a secondary condition when there’s cancer elsewhere in the body. It’s extremely rare and usually results in a poor outcome for a pup. Symptoms of Pemphigus Condition A dog&#039;s symptoms depend on the type of pemphigus they have. Signs to watch for include: Hair loss on the nose, ears, and around the eyes. Blistering, lesions, or crusting on the face, paw pads, within the mouth, or around the genitals. Blistering, lesions, or crusting on a dog’s body, usually becoming more apparent after shaving. Itchiness that causes a dog to scratch, lick, or bite themselves. Lameness, limping, or gait changes (if footpads are affected). Excessive salivation and bad breath (if lesions are in the mouth). Fever Loss of appetite, especially with lesions in the mouth. Causes of Pemphigus Condition Most cases of pemphigus in dogs are considered idiopathic, meaning there isn’t a known cause. Other cases of pemphigus are thought to have been triggered by reactions to medications the dog takes, topical parasite preventives (like the spot-on you might put between your dog’s shoulder blades to keep fleas and ticks away), or chronic skin diseases like skin allergies (atopy).   Cancers that have been associated with paraneoplastic pemphigus include lymphoma, thymoma, and a splenic tumor (sarcoma). Certain breeds are more likely to develop the condition. Pemphigus usually begins in middle-aged to older dogs but it can affect pups of any age. Any breed can develop pemphigus foliaceous, but the two most at-risk breeds are: Akitas Chow Chows Breeds at-risk for pemphigus erythematosus include: Collies German Shepherds How Veterinarians Diagnose Pemphigus in Dogs Diagnosis of pemphigus usually involves cytology (examination of cells under a microscope) and biopsy (examination of tissue sample under a microscope) of an active lesion. Cytology can help determine if there is infection, which frequently occurs as a secondary condition. Many veterinarians perform cytology tests at their offices, but some may send the sample to a pathologist, a scientist who interprets laboratory samples. Your veterinarian may take a culture (a test to find germs) from a lesion on your pup to ensure that the antibiotics given are working. Cultures are usually performed by an off-site laboratory and it may take several days to get results. Biopsy samples are then sent to a pathology lab for a final diagnosis. Some vets will perform a biopsy under general anesthesia while others may do light sedation and local anesthesia. This may also depend on the severity of a dog’s condition and where the lesions are located on their body. Before any medications are given to your dog, your vet will perform routine bloodwork. Be sure to disclose this information to your vet before treatment begins: Any medications your pet is currently taking Changes to parasite preventives or diet Any history of skin conditions Treatment of Pemphigus in Dogs  Because pemphigus is considered an autoimmune condition, the goal of treatment is to suppress the immune system. Your dog may be referred to a veterinary dermatologist to continue their care. The most common medication used to treat pemphigus is a steroid given by mouth, usually prednisone or prednisolone. Steroids are typically tapered to the lowest effective dose. Some vets may give injectable steroids like dexamethasone at the start of your pup’s treatment. If steroids aren’t effective, an immunosuppressant called azathioprine is usually added to treatment. Like steroids, azathioprine is tapered over time. Chlorambucil and cyclosporine are two alternative immunosuppressants that may be used instead of azathioprine.   A topical steroid like triamcinolone can be placed on lesions when treating pemphigus foliaceus or pemphigus erythematosus. Once effective control is achieved, treatment may be changed to a topical hydrocortisone. If your pup develops a skin infection, they will receive oral antibiotics such as cephalexin or cefpodoxime. If your vet has taken a culture of one of your dog’s lesions, antibiotics will be based on culture results. Recovery and Management of Pemphigus in Dogs Pemphigus can be put into remission (signs and symptoms will disappear) but isn’t usually cured, and many patients require lifelong medical management to remain in remission. Treatment is usually effective for pemphigus foliaceus, even in severe cases. Most dogs with less severe pemphigus improve within two to six weeks of starting treatment. However, most patients with pemphigus vulgaris are humanely euthanized due to their condition, even with aggressive treatment. Suppression of the immune system isn’t without side effects. Dogs on lifelong steroids can develop Cushing’s disease or get urinary tract infections. Dogs being treated for pemphigus should have checkups at least every six months with their vet. For dogs with pemphigus, avoid sunlight, especially during warmer months. Pet-safe sunscreens may be helpful, though care should be taken to avoid getting the sunscreen into their eyes. Most dogs with pemphigus should continue year-round parasite prevention. Fleas can significantly worsen your dog’s discomfort by causing itchiness, secondary infections, and allergic reactions. Speak with your vet about the preventative you are using for your dog.  Prevention of Pemphigus in Dogs Pemphigus isn’t a preventable condition."}]