[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long do dogs live with pemphigus foliaceus?", "acceptedAnswer": {"@type": "Answer", "text": "Pemphigus foliaceus has a varied prognosis, with some studies reporting a 53% success rate for long-term follow-up (seven years from diagnosis). However, life expectancy with any autoimmune disease can fluctuate depending on remission, recurrence, and comorbidities (additional medical conditions that occur simultaneously). It’s estimated that euthanasia may be needed in about 13% of cases, especially for those patients with poor quality of life, those who have not responded to appropriate treatment, or those who developed adverse side effects from treatment itself."}}, {"@type": "Question", "name": "What triggers pemphigus foliaceus in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Pemphigus foliaceus primarily results from an overactive immune response wherein the body triggers self-destruction of the proteins that keep skin cells together. Many cases occur spontaneously, but in some instances, the condition is triggered as an adverse reaction to certain medications, such as antibiotics."}}, {"@type": "Question", "name": "Is pemphigus foliaceus in dogs contagious?", "acceptedAnswer": {"@type": "Answer", "text": "Pemphigus foliaceus is an autoimmune disease and is not contagious to other dogs or people. Featured Image: AzmanJaka/E+ via Getty Images"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pemphigus Foliaceus in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Immune", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/pup%20at%20the%20vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/pup%20at%20the%20vet.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dogs, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/immune/pemphigus-foliaceus-dogs"}, "datePublished": "October 27, 2023", "dateModified": "October 27, 2023", "description": "Pemphigus foliaceus is the most common autoimmune skin disease in dogs, although it remains rare. In this article, Dr. Michael Kearley discusses the causes, symptoms, diagnosis, and treatment options for pemphigus foliaceus in dogs.", "articleBody": "What Is Pemphigus Foliaceus in Dogs? Pemphigus foliaceus is the most common autoimmune skin disease in dogs, although it remains rare. An autoimmune disease occurs when the immune system—responsible for protecting the body and defending against foreign invaders like bacteria or viruses—becomes dysfunctional. Instead of fighting off foreign invaders, it starts to attack itself, targeting specific proteins or cells.  In the case of pemphigus foliaceus, the body targets desmosomes, which are proteins that hold skin cells together.  This leads to the development of cracks, fissures, pustules (pimples filled with pus), scaling, and infection. Although it’s not considered a medical emergency, untreated cases of pemphigus foliaceus can result in serious infections, leading to pain and a poor quality of life. Therefore, treatment should be given as soon as possible.  Symptoms of Pemphigus Foliaceus in Dogs Pemphigus foliaceus primarily affects the skin, resulting in a range of skin-related symptoms. The hallmark symptom is the presence of pustules, which are reddish, yellow, or brown raised lesions, like pimples. These pustules can occur as single or multiple clusters, which can become much larger, deeper, and more painful with time. These sores typically appear on the face first and can spread to the head, ears, neck, trunk, groin, and feet. This condition usually has a symmetrical distribution, occurring on both sides of the body. Other symptoms associated with pemphigus foliaceus in dogs may include: Scales and crusts on the skin Hair loss Itching and scratching (pruritus) Depigmentation of the nose or lips Fever Lethargy Decreased appetite Weight loss Pain Causes of Pemphigus Foliaceus in Dogs  While dogs of any breed and age can develop pemphigus foliaceus, it seems to be more prevalent in middle-aged dogs of certain breeds, suggesting a possible genetic component to the disease. These breeds include: Akitas Chow Chows Cocker Spaniels Collies Dachshunds Dobermans Newfoundlands Shar-Pei Pemphigus foliaceus also occurs more frequently in dogs with a history of chronic skin disease, such as allergies and other environmental factors, as well as in dogs with concurrent illness or autoimmune disease.  Pemphigus foliaceus is primarily classified as an autoimmune disease, and in many cases its cause is idiopathic (unknown). Some cases have been linked to the use of certain medications, such as antibiotics, and are classified as an adverse drug reaction. How Veterinarians Diagnose Pemphigus Foliaceus in Dogs Because symptoms and skin lesions can often be caused by other diseases, your vet will most likely recommend a few basic bedside tests. These may include: A skin impression to look for abnormal skin cells and a secondary bacterial and/or yeast infection (pyoderma) Skin scraping to look for external parasites such as mites Some type of fungal test (culture/PCR/Wood’s lamp) to look for ringworm Your vet may also recommend testing your dog’s blood to rule out other conditions and establish a baseline prior to initiating drug therapy. This may be recommended because the medications prescribed often cause elevated organ values.  Ultimately, diagnosis of pemphigus foliaceus requires a biopsy with histopathology. This means that your vet may remove several skin samples, often under local sedation or general anesthesia, and submit them for analysis to look for evidence of acantholytic skin cells (skin cells not connected to one another). Your vet may recommend treatment of the secondary skin infection first for a few days prior to obtaining a biopsy, as pyoderma can complicate the diagnostic process. Treatment of Pemphigus Foliaceus There are two treatment goals for all patients with pemphigus foliaceus: Control the disease. Induce remission as soon as possible. Because pemphigus foliaceus occurs due to a dysfunctional immune system, treatment consists of suppressing the immune functions with prescription medications called immunosuppressants. Steroids, at high doses, are the most prescribed drug and the most effective, but they possess many negative and unappealing side effects, such as: An increased thirst and urination Gastrointestinal upset and ulceration Lethargy Increased risk of infection Increased risk of developing certain endocrinopathies (hormone-related disorders) Toxicity to the liver Bone marrow suppression To minimize or avoid these side effects, other immunosuppressive drugs like azathioprine, chlorambucil, mycophenolate, or cyclosporine are used in conjunction with steroids.  Additionally, steroids and the other drugs are slowly decreased over time, usually after several months, to the lowest effective dose where symptoms are controlled and side effects have ceased.  It’s important not to discontinue or alter the tapering regimen without speaking with your veterinarian, as symptoms will return, and medical emergencies can appear. Many dogs with pemphigus foliaceus also suffer from secondary bacterial and fungal infections and will often be prescribed antibiotics such as cephalexin, Clavamox®, or clindamycin, or antifungals such as fluconazole or miconazole.   Topical therapies, consisting of ointments, shampoos, or conditioners, are often prescribed, containing antibacterial, antifungal, and/or steroidal properties. Bathing your pet, under the direction of your vet, can improve symptoms and help make your dog more comfortable and less itchy. Fatty acids may improve your pup&#039;s skin coat quality, maintain their skin barrier, and reduce inflammation. A few helpful products may include:  Additionally, diets aimed at strengthening the skin barrier, soothing, and nourishing the skin, and helping to support the immune system, such as Hill’s Derm Defense, could be helpful to your dog.  Speak with your veterinarian to determine the best topicals, supplements, and diet for your dog based on their specific medical and nutritional needs. Recovery and Management of Pemphigus Foliaceus The overall prognosis for dogs with pemphigus foliaceus is fair to good, with improvement generally seen within the first few months of treatment and complete remission of symptoms within about five months.  Dogs will often need to return for a follow-up visit and stitches removal within the first month. Monthly (if not more frequent) follow-ups are needed thereafter to ensure that your pup is responding to treatment. Their vet will also need to monitor their drug levels, check your dog’s blood and organ levels, and consider tapering of medications when needed.  Unfortunately, not all dogs will fully recover from their symptoms and will require medication for life. Dogs that respond more quickly to the initial treatment may have a better chance of achieving long-term remission. It’s important not to discontinue or alter the course of your dog’s medications without speaking with your veterinarian. If this occurs, this can have significant side effects when not discontinued properly. Additionally, dogs who do go into remission can relapse at any time.  Because treatment is not without risks and side effects, pay close attention to your dog’s behavior and appetite. Changes can signal the need for medical attention, resulting in a quicker and safer recovery for your pup. Prevention of Pemphigus Foliaceus  Pemphigus foliaceus can’t be prevented, but adhering to the follow-up recommendations and guidelines of your veterinarian can help prevent recurrences or flare-ups in the future.  Medications, including vaccinations, should be given with caution, or avoided altogether, as they have the potential to worsen the condition by triggering the immune system."}]