[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long do dogs live with perianal adenoma?", "acceptedAnswer": {"@type": "Answer", "text": "Tumor removal and castration offer a good prognosis. Tumors recur in less than 10% of cases. Perianal adenomas are noncancerous tumors, so survival times are typically not associated with the presence or absence of these tumors."}}, {"@type": "Question", "name": "How does perianal adenoma look versus a malignant tumor?", "acceptedAnswer": {"@type": "Answer", "text": "Perianal adenocarcinomas are cancerous tumors that arise from the same cell type as perianal adenomas and occur in the same region of the body. Biopsy and histopathology are recommended to differentiate between these two tumor types. Perianal adenocarcinomas typically grow more quickly than perianal adenomas."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Perianal Adenoma in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-01/dog.tennisball.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-01/dog.tennisball.jpg"}, "author": {"@type": "Person", "name": "Virginia LaMon, DVM", "url": "https://www.petmd.com/author/dr-virginia-lamon"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/perianal-adenoma-dogs"}, "datePublished": "January 10, 2022", "dateModified": "August 12, 2022", "description": "Dr. Virginia LaMon explains what perianal adenomas are in dogs, including symptoms, diagnosis, and treatments.", "articleBody": "What Is Perianal Adenoma in Dogs? Perianal adenomas are a common type of tumor that occur in the perianal region (area around the anus). They often occur in the sebaceous glands (sweat glands) located in this region. These tumors may also be found on the prepuce (foreskin), base of the tail, and groin. Perianal adenomas are also referred to as hepatoid or circumanal adenomas.  Perianal adenomas are relatively uncommon and non-cancerous. They pose the greatest risk to male dogs that are not neutered. Surgical removal of a male dog’s testicles (castration) is recommended because castration removes the influence of testosterone which typically stops the progression of this tumor.  While most perianal bumps are benign, meaning the bumps are non-cancerous, there are some perianal bumps that are cancerous. Cancerous bumps are called perianal adenocarcinomas. If a mass is found in this region, it’s important to schedule an appointment with your veterinarian so a formal diagnosis can be determined.   Causes of Perianal Adenoma in Dogs The exact cause of perianal adenomas is unknown, but testosterone is thought to encourage excessive production of these cells. Male dogs that are not neutered are at the highest risk of developing perianal tumors, but these tumors can also be seen in spayed females. Female dogs that have not been spayed produce estrogen, which is thought to inhibit the growth of these tumors.  Perianal adenomas have also been associated with hyperadrenocorticism (Cushing’s Disease), testosterone-producing adrenal tumors, and testicular tumors.  These tumors are most commonly seen in breeds such as the Cocker Spaniel, Fox Terrier, and Siberian Husky.  Symptoms of Perianal Adenoma in Dogs Perianal adenomas are typically pink, hairless, slow-growing tumors located around the anus, prepuce, or under the tail. They are usually less than one inch in diameter and can become ulcerated (when skin breaks) or infected. Perianal adenomas can look similar to cancerous tumors when viewed by the naked eye, however perianal adenomas are benign tumors.    Some types of perianal adenomas become locally invasive. A surgical biopsy is recommended to confirm the type of tumor and determine the best treatment course. How Vets Diagnose Perianal Adenoma in Dogs A biopsy and histopathology are typically the diagnostics of choice for this type of tumor. A biopsy is a common procedure to collect a sample of tissue from the affected area. Histopathology examines the collected sample to determine the type of tumor and to make a formal diagnosis. Treatment of Perianal Adenoma in Dogs For small, non-ulcerated perianal adenomas (tumors where the skin is not broken), the recommended treatment is castration or surgical removal of the male dog’s testicles to prevent progression. Recovery and Management of Perianal Adenoma in Dogs In most cases the tumors will regress or stop growing after castration. For ulcerated or bleeding tumors, surgical removal is recommended. If male dogs are not castrated, more perianal adenomas can develop."}]