[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pleural Effusion in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1140842348.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1140842348.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Adult, Condition, Respiratory health, Symptom Checker, Pleural Effusion", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/pleural-effusion-dogs"}, "datePublished": "May 10, 2023", "dateModified": "September 12, 2023", "description": "Dr. Katie Grzyb explains what pleural effusion is in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Pleural Effusion in Dogs Pleural effusion—fluid accumulation around the lungs—is a rare condition in dogs that is considered a medical emergency, especially if it becomes severe enough to cause trouble breathing.   Pleural effusion is an accumulation of fluid in the pleural space, which is abnormal. The pleural space is a body cavity that extends between the lungs and the chest wall on both sides of the chest, and from the mediastinum in the upper chest to the diaphragm. This cavity is lined with pleura—a thin membrane that consists of mesothelial cells, connective tissue, blood vessels, and lymphatics. Pleural effusion occurs when either too much fluid is being produced by the body or dumped into the pleural space, or when too little fluid is reabsorbed by the pleura itself, leading to fluid accumulation. The pleura normally produces a small amount of fluid that acts as a lubricant to keep the chest wall from sticking to the lungs during breathing. Respiratory distress is ALWAYS a medical emergency in dogs. If your dog is having trouble breathing, contact a veterinarian immediately. Symptoms of Pleural Effusion in Dogs Clinical signs of pleural effusion in dogs can range from unnoticeable to severe. Sometimes, when effusion is minimal, your dog will show no symptoms at home. As fluid continues to accumulate, however, you may notice some of the following signs: Increased respiratory rate: A normal respiratory rate in a dog at rest (or sleeping) should be less than 30 breaths per minute (one inspiration and one expiration = one full breath). When this progressively increases above 30 breaths per minute or is paired with other signs of respiratory distress, it is considered a medical emergency. Difficulty breathing: This includes panting, an outstretched neck, increased effort on inspiration, an abdominal component to respirations, and/or gasping. Coughing: Due to pressure placed by fluid accumulation on the lungs and airways, coughing is a frequent side effect. If your dog is coughing frequently, violently, or if the cough is paired with any increased respiratory rate or trouble breathing, contact a vet immediately. Restlessness: Often dogs with moderate to severe pleural effusion will pace or have trouble getting comfortable due to fluid accumulation. They may lay in a certain position that allows the neck to be outstretched and the chest to expand. Usually, they will have trouble sleeping. Exercise intolerance: If your dog is used to daily 2-mile walks but is suddenly sitting after walking a block to catch his breath, or starts coughing during his walks, this can be an indicator of underlying lung, heart, or airway issues. Cyanotic gums: This blue to purple discoloration of the gums occurs secondary to decreased oxygenation in the body and is considered a medical emergency, unless your dog is a breed that normally has pigmentation to their gums. Lethargy: General tiredness is a vague clinical sign, but is often linked to pleural effusion. Decreased appetite: This is a general clinical sign of pleural effusion, and can be noted in early or late stages. Vomiting: This is a vague clinical sign of pleural effusion, and can be noted in early or late stages. Weight loss: Fat and muscle loss can be noticed in chronic cases of pleural effusion. Causes of Pleural Effusion in Dogs Pleural effusion has many causes in dogs. Medical conditions that cause changes in pressures in the body, protein content in the body, and a leaky lymphatic system can lead to fluid collection in the pleural space. Fluid buildup within this space causes problems, as it impedes the lungs from filling with air due to pressure; this in turn leads to trouble breathing. Pleural effusion differs from pulmonary edema—the term for fluid within the lungs, not around the lungs. Pulmonary edema can also lead to trouble breathing but for different reasons, and is often caused by congestive heart failure, pulmonary thromboembolism, choking, drowning, or electric shock. Treatment for pleural effusion and pulmonary edema differ greatly, which is why it is important to distinguish between the two conditions. How Veterinarians Diagnose Pleural Effusion in Dogs Your veterinarian will obtain a thorough history of your dog’s clinical signs, previous medical conditions, current medications, when the symptoms started, and how they have progressed. Your veterinarian will then perform a complete physical examination and may suggest diagnostic testing based on what they discover. They may suspect pleural effusion based solely on examination alone. Bloodwork—including a complete blood count, biochemistry profile, heartworm status, and electrolyte panel—is often evaluated to investigate for systemic disease. Chest radiographs are typically obtained as well, which illuminates fluid within the chest cavity and can range from scant (minimal changes to the lungs on x-rays) to severe (complete blocking of the heart silhouette on X-rays). Treatment of Pleural Effusion in Dogs Treatment of pleural effusion in dogs depends on the cause of the fluid accumulation. Thoracentesis is the mainstay of therapy for most dogs with effusion, and is considered both a diagnostic and therapeutic procedure. This technique provides immediate relief by removing the fluid from the pleural space, thus allowing the lungs to expand more effectively. Usually, breathing improves instantly once the procedure is started. Supplemental oxygen is often considered and given, but it is not going to help the lungs expand—which is why thoracocentesis is so important in therapy.   Recovery and Management of Pleural Effusion in Dogs Most causes of pleural effusion in dogs require lifelong management to lessen the risk of fluid accumulation around the lungs.  Antibiotics are used to treat effusion caused by bacterial infection (Pyothorax). Diuretics are often used in cases of effusion secondary to congestive heart failure. Sometimes steroids and/or chemotherapy medications are necessary if the fluid buildup is secondary to cancer. It is important to note that for all causes of pleural effusion, if the fluid causes any breathing issues (increased respiratory rate/effort), the fluid must be drained to give relief and to see improvement. Medications can be helpful to lessen fluid re-accumulation around the lungs, but they only help to reduce small amounts of fluid.  Featured Image: iStock.com/filadendron"}]