[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take pododermatitis in dogs to heal?", "acceptedAnswer": {"@type": "Answer", "text": "Depending upon the underlying cause of pododermatitis, it can take days to weeks to months to heal. Some causes of pododermatitis can be cured and others can be managed with appropriate treatment."}}, {"@type": "Question", "name": "Can pododermatitis in dogs go away on its own?", "acceptedAnswer": {"@type": "Answer", "text": "Pododermatitis requires medical attention and treatment to heal. If your dog has been licking and biting their paws with subsequent symptoms, contact your veterinarian."}}, {"@type": "Question", "name": "Can dogs get pododermatitis from food allergies?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, pododermatitis can be caused by food allergies in dogs. While licking and chewing the paws are common signs of food allergies in young to middle-aged dogs, this can also be from environmental allergies or other causes. Featured Image: iStock.com/gollykim"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pododermatitis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/french-bulldog-licking-their-paws.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/french-bulldog-licking-their-paws.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Adult, Condition, Symptom Checker, Pododermatitis", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/pododermatitis-dogs"}, "datePublished": "July 28, 2023", "dateModified": "October 6, 2023", "description": "It’s normal for your pup to lick their paws, but excessive licking could mean an underlying disease such as pododermatitis. We share the most common causes of pododermatitis, including symptoms, treatment options, and more.", "articleBody": "What Is Pododermatitis in Dogs? Most dogs lick their paws, but when licking becomes excessive, problems can arise. Pododermatitis is a common condition in dogs that constantly lick or chew their paws. It starts with inflammation and can result in an infection of the skin, nails, nail folds, or foot pads. Pododermatitis most commonly occurs between a dog’s toes. Pododermatitis is typically caused by a wide variety of conditions, rather than an actual disease itself. It can affect only one or all four paws  and can occur in any age, gender, or breed of dog. While pododermatitis only affects the paws (podo means foot; dermatitis means infection or inflammation of the skin), it does often happen with other symptoms, such as itchy skin on the body and/or skin infections. If left untreated, pododermatitis can become painful and lead to limping or lameness. If you suspect your dog might have pododermatitis, or if they are licking their paws excessively, contact your veterinarian to determine the cause and start a treatment plan. Symptoms of Pododermatitis in Dogs Licking, chewing on the pawReddening of the skin on the pawRed or brown stainingHair loss on pawSwollen pawPainful pawItchy pawLameness, limpingSwollen skin around the nailClear or opaque discharge, waxy or oily debris especially within the toe foldsLocalized swelling or small nodules, often between toesCan leak pus or bloody dischargeAbnormal odor from pawScar tissue formationBreeds that are more impacted by pododermatitis include: BoxersBulldogsBull TerriersGerman Shorthaired PointerGerman ShepherdsGolden RetrieversIrish SettersCauses of Pododermatitis in Dogs Pododermatitis has many possible causes, and more than one factor can contribute to it. Allergies (atopic dermatitis, contact allergies, and food allergies) are the most common cause of pododermatitis in dogs. Allergies in dogs often cause them to have itchy paws, which leads to pododermatitis.Interdigital furunculosis occurs when there is a deep bacterial infection between a dog’s toes.Foreign bodies can also cause licking and irritated paws, leading to pododermatitis. Foxtail plants, parts of other plants, and grass seeds are common foreign bodies that embed themselves between a dog’s paws, leading to discomfort and infection.Trauma or insect bites on the paws can cause secondary bacterial and/or fungal infections from the excessive licking due to pain, discomfort, or itch your dog may feel. Trauma can also cause interdigital furunculosis, which in turn causes pododermatitis.InfectionsDemodex, also known as demodectic mange, is a skin parasite caused by overgrowth of mites on the skin. Mange causes itchiness and hair loss as well as red, scaly scab-like lesions on a dog’s skin and paws.Bacteria and Fungus/yeast: Malassezia is a common fungus and Staphylococcus is a common bacteria, both found normally on a dog’s skin/paws. When dogs lick their paws or they become itchy, the normal bacteria/yeast overpopulate and causes pododermatitis.Ringworm is a fungal infection of the skin, hair, or claws in dogs that can lead to pododermatitis.Tumors of the skin such as histiocytomas, squamous cell carcinoma of the nail bed, and lymphoma can cause pododermatitis in dogs.Hypothyroidism and Hyperadrenocorticism/Cushing&#039;s disease are both hormonal diseases that can involve pododermatitis, since they cause a dog’s immune system to be less functional.Autoimmune skin disease such as pemphigus foliaceus can cause pododermatitis, although this is uncommon in dogs.There are certain factors that increase a dog’s risk of getting pododermatitis, such as: Obesity, or large/giant breed dogs have an increased amount of weight put on their paws.Dog breeds with short, wiry hair around their feet. (Boxers, English Bulldogs, German Short-haired Pointers, German Shepherds, and Golden Retrievers are breeds prone to pododermatitis).Abnormal weight bearing on limb due to congenital defects, arthritis, or torn ligaments.How Veterinarians Diagnose Pododermatitis in Dogs Your veterinarian will take a complete medical history, as well as perform a physical exam to determine the extent of your dog’s condition. Pododermatitis itself can be diagnosed visually by looking for symptoms and lesions on your dog’s paws. Your veterinarian will recommend the best skin diagnostic tests to help determine the underlying cause of pododermatitis to come up with the most effective treatment plan. If nodules are present on your dog’s feet, removing fluid from the center of the lesion can help with a diagnosis. For more advanced chronic case, or those where a foreign body or tumor is suspected, a local or surgical biopsy and paw X-rays may be necessary. Blood tests will help diagnose any deficiencies in your dog’s hormones, such as thyroid hormone and cortisol levels. Allergies are often diagnosed once the secondary infections have healed; it often takes longer to eliminate possible allergens from causing them. It’s important to inform your veterinarian about anything you have done (or seen) that might help them diagnose the cause of pododermatitis. Flea prevention status, use of topical therapies, new foods/treats, lifestyle, and environmental changes are things that will help your veterinarian determine the cause. Treatment of Pododermatitis in Dogs Once your veterinarian has determined the underlying cause of your dog’s pododermatitis, they can start them on a specific treatment plan. Small lesions that are not causing your dog discomfort, such as those involving one paw or between a few toes, might be treated at home with medicated wipes, mousse, and shampoos such as Duoxo ® S3 (wipes or shampoo) and Dechra ® products. If your dog develops pain or the lesions on the paws become extensive or last more than a few days, contact your vet immediately. Antibiotics commonly used for skin infections include: Cephalexin, Cefpodoxime, and Convenia®. Mange is treated differently, depending on the extent of the lesions. Topical creams and shampoos containing benzoyl peroxide are often used for small, localized lesions. Insect repellent and flea/tick prevention can also help with a demodex infection. Depending on the cause of your dog’s pododermatitis, anti-inflammatory or steroid medications might be prescribed as well. Recovery and Management of Pododermatitis in Dogs Depending on the cause of your dog’s pododermatitis, there may not be a cure. However, medical management to keep your dog pain-and-itch free is still possible. Most infectious causes of pododermatitis, such as those caused by bacteria, fungus, ringworm, and mange, can be cured with the right medications. Hormonal causes can be successfully managed with medication to make up for the low volume of hormones produced by the body. The prognosis can be anywhere from good to guarded, depending on whether the underlying cause can be diagnosed and successfully treated. Pododermatitis can be a very long and complicated process to diagnose and treat, and it can be quite frustrating to pet parents. Continued follow-up exams and diagnostics will help your vet get to the bottom of the issue as soon as possible, but it can take weeks to months. You may be able to prevent pododermatitis. If you notice your dog licking right away, use a recovery collar and take them to the veterinarian for treatment of their underlying condition."}]