[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tobacco (Nicotine) Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.sniffing.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.sniffing.jpg"}, "author": {"@type": "Person", "name": "Jamie Lovejoy, DVM", "url": "https://www.petmd.com/author/dr-jamie-lovejoy"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/poisoning/tobacco-nicotine-poisoning-dogs"}, "datePublished": "September 12, 2022", "dateModified": "September 12, 2022", "description": "Dr. Lovejoy discusses how nicotine is poisonous to dogs, including symptoms, ways dogs can ingest nicotine, and treatment options.", "articleBody": "What is Tobacco (Nicotine) Poisoning in Dogs? Nicotine exposure can be very dangerous for your dog. Traditionally found in tobacco products such as cigarettes, cigars, and chewing tobacco, nicotine is now also found in e-cigarettes, patches, gum, and other products formulated to help users reduce their tobacco dependency. Often these newer products are flavored, making ingestion more common for our canine companions. Though secondhand smoke has other negative health effects for your dog, nicotine toxicity by inhalation is very rare. Nicotine is a stimulant that targets specific receptors in mammalian nerves normally used by acetylcholine to activate them. As toxicity results in activation of an abnormal number of receptors, affected nerves become overstimulated and fire rapidly. Larger amounts can overwhelm the entire nervous system. Nicotine ingestion by your dog should be treated as an emergency and decontamination should be attempted as soon as possible. Symptoms usually begin within an hour of ingestion. Managing symptoms of toxicity once they appear often requires hospitalization and intensive care. Symptoms of Nicotine Poisoning in Dogs The signs of nicotine toxicity in dogs vary significantly, depending on the concentration of nicotine in the product and how much of the product is ingested. Overstimulated nerves can cause gastrointestinal symptoms such as diarrhea, drooling, and vomiting, as well as agitation, excitement, and constricted pupils. Higher doses can cause seizures, confusion, difficulty walking, and an elevated heart rate. Ingestion of more than 9-12 mg/kg of nicotine without decontamination will likely result in death. In general, patches contain the largest concentration of nicotine and are the most dangerous to dogs. But even a cigarette butt can contain enough nicotine to cause illness. Careful attention must also be paid to nicotine gums. These often have lower concentrations of nicotine but may also contain xylitol, which is also toxic for dogs. Causes of Nicotine Poisoning in Dogs Ingestion of nicotine products is more common now with the flavored products available, though young dogs and puppies may still find ash trays or e-cigarettes a tempting target, despite the foul flavors. It is important to keep these products out of reach of your dog, and to pay attention to where discarded products and mostly empty cartridges end up.  Diagnosis of Nicotine Poisoning in Dogs Diagnosis of nicotine toxicity is highly dependent on known exposure or evidence of tobacco products in a dog’s vomit. Clinical signs can be very similar to those of other stimulant poisonings, such as with chocolate, but there are no specific tests to confirm it. Notify your veterinarian immediately of any access to these products if you see symptoms of toxicity. Treatment of Nicotine Poisoning in Dogs If exposure is noted promptly, within an hour, the usual treatment is decontamination. Luckily, nicotine is not well-absorbed through the stomach lining, so if vomiting can be induced before the products make it to the small intestine, toxicity may be avoided. Do not induce vomiting at home, as your vet will have safer medications for this process. It is important that your dog receive care as soon as possible to manage any potential complications. After vomiting, activated charcoal may be given to your dog to bind any nicotine still left in the stomach. Your veterinarian may also choose to sedate your dog and wash its stomach through a tube passed down the throat. Hospitalization will often be recommended, even in mild cases of toxicity, to support your dog through the breakdown and excretion of any remaining toxin. Nicotine is broken down in the liver and then released in the urine. A urine acidifier may help speed this process. Dogs with tremors, seizures, or cardiovascular symptoms may need additional medications to lessen these symptoms while the toxin is eliminated. Often these medications will need to be given by injection. Severe cases may require that your dog to be put on a ventilator. Recovery and Management of Nicotine Poisoning in Dogs Nicotine toxicity and recovery follows a fairly rapid timeline. Clinical signs are usually noted within the hour. If a dog can be supported successfully through the first four hours after onset of symptoms, they are very likely to recover. It is rare for a dog to be hospitalized longer than 24-48 hours. Prognosis for nicotine ingestion varies significantly, depending on dose. Low-dose exposures managed appropriately have an excellent prognosis, with a low likelihood of long-term effects. Dogs that experience prolonged seizure activity or significant cardiac changes may suffer permanent brain or other organ damage, but even high-dose exposures that are managed promptly and are successfully stabilized can result in a complete recovery. Featured Image: iStock.com/Capuski"}]