[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Progressive Retinal Atrophy (PRA) In Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/progressive-retinal-atrophy-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/progressive-retinal-atrophy-dog.jpg"}, "author": {"@type": "Person", "name": "Jamie Case, DVM", "url": "https://www.petmd.com/author/dr-jamie-case"}, "keywords": "Dog, Condition, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/condition/progressive-retinal-atrophy-in-dogs"}, "datePublished": "January 3, 2023", "dateModified": "January 3, 2023", "description": "Dr. Jamie Case explains PRA in dogs, breeds most commonly affected by PRA, and how the disease progresses over time.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. What Is Progressive Retinal Atrophy (PRA) In Dogs? Progressive Retinal Atrophy (PRA) is a term used to describe a group of genetic disorders that eventually result in loss of vision for dogs. Although the time period can vary, many dogs will lose their sight entirely within 1-2 years of symptoms. PRA occurs when the rods and cones in the eye’s retina fail to develop shortly after birth (early onset PRA) or begin to atrophy when they are adults (late onset PRA). The retina is a thin layer of cells that lines the back of the eye; it converts light that enters the eye into a signal that can be transmitted to and interpreted by the brain. The cells that detect light in the retina are called photoreceptors. Rods are photoreceptors for black and white vision and help process movement. They work well in low light, which dogs rely on for night vision. Cones are photoreceptors for color vision and are important during well-lit conditions.  Dogs have many rods and fewer number of cones as compared to humans. This is why dogs can detect movement and see better in the dark but have poorer color vision than people. When PRA occurs, rods are often the first affected, followed by the cones. Pet parents often note the signs of PRA when their dogs seem to have trouble seeing in the dark. Although PRA can affect any breed or age of dog, several breeds have a higher risk. More is being learned about how genetic mutations affect different breeds. Losing vision is distressing, but PRA itself is not a painful process compared to other disorders that result in blindness.  Two Forms of PRA in Dogs Early-onset PRA is often referred to as retinal dysplasia and occurs in puppies around the time they are weaned (8-12 weeks of age). In these puppies, the rods and cones did not form properly, and they will quickly lose the ability to see.  Late-onset PRA occurs in adult dogs that are 3-9 years old and is a “true” atrophy—the rods and cones lose their ability to function and vision is lost.  Symptoms of PRA in Dogs  Symptoms vary depending on the dog and how quickly the disease progresses. Some changes pet parents may notice include:  Reluctance to go outside at night or to enter a dark room.  Clumsiness and bumping into things (especially in dark rooms, new environments, or after furniture has been rearranged). Dilated pupils that slowly constrict in response to light. Eyes that are more reflective in the dark (the eyes may glow more than they used to when a picture is taken using flash). Cataracts, which may be the first sign pet parents notice. Causes of PRA in Dogs  PRA is an inherited disorder in dogs with no successful treatment options. In most dogs, PRA is caused by an autosomal recessive trait, meaning that if a dog would have inherited a defective copy of the gene from both their mother and father.  In a few breeds of dogs, PRA is a dominant gene, meaning it occurs if they receive one defective copy of the gene. There are also some breeds with a gender-linked version of PRA in which male dogs are more commonly affected than females.  Several genetic disorders that lead to PRA have been identified and can be detected using genetic testing. However, some versions are not yet identified, so genetic testing with no evidence of PRA does not mean a dog will not be affected.  In dogs with PRA, typically the rods will start to atrophy and lose their ability to function first.  This will result in decreased ability to see in dark or dimly lit light.  Eventually, the cones will also atrophy. Once all the rods and cones have atrophied, vision is lost.  The time to onset of atrophy and how quickly atrophy occurs varies based on the genetic mutation, but most pets that are affected will be blind within 1-2 years after the onset of clinical signs.  Breeds at higher risk for early onset Progressive Retinal Atrophy/Retinal Dysplasia: American Staffordshire Terrier Bedlington Terrier Pit Bull Terrier Sealyham Terrier Belgian Malinois (Shepherd) Briard Cardigan Welsh Corgi Collie Irish Setter Mastiff Miniature Schnauzer Norwegian Elkhound Breeds at higher risk for late/adult-onset Progressive Retinal Atrophy:  Akita American Cocker Spaniel Australian Cattle Dog Australian Shepherd Basenji Bedlington Terriers Border Collie Briard Chesapeake Bay Retriever Dachshund English Cocker Spaniel French Bulldog Golden Retriever Labrador Retriever Nova Scotia Duck Tolling Retriever Italian Greyhound Mastiff Miniature Poodle Samoyed (more common in males) Shetland Sheepdog Siberian Husky (more common in males) Silky Terrier Tibetan Terrier Toy Poodle   How Veterinarians Diagnose PRA in Dogs  Diagnosing PRA often involves examining the retina, using a tool called an indirect ophthalmoscope. This is an optical tool worn on the veterinarian’s head (or attached to eyeglasses) and used to view the back of the eye. The vet will look for changes in the retina and optic nerve. They may see increased reflection in the part of the eye that “glows” in photos when light hits the eyes. These changes can be subtle in some dogs and may require referral to a board-certified veterinary ophthalmologist. Both eyes will be equally affected. Cataracts or other issues may prevent a vet from viewing the retina. In these cases, a special diagnostic procedure called an electroretinogram (ERG) can be used to evaluate the retinas’ ability to perceive light. Genetic tests using a blood sample may be performed to detect the presence of genetic mutations.  Treatment of PRA in Dogs  Sadly, PRA cannot be treated, and dogs with this condition will eventually lose their sight.  For this reason, dogs with PRA (and their parents and siblings) should not be bred.  Some veterinarians may recommend antioxidants or a supplement called Ocu-Glo when PRA is first diagnosed, although there are few studies to support their use.  If a dog develops cataracts, the cataracts are generally not treated because vision will not improve. In some instances, cataracts can lead to inflammation within the eye or glaucoma—these can be painful and special eyedrops may be prescribed.  Recovery and Management of PRA   Loss of vision in dogs will require some adjustments, but dogs rely heavily on other senses like their superior sense of smell and keen sense of hearing, and they can have an excellent quality of life despite being blind. Some things that may help dogs with decreased vision or blindness include:  Providing a safe, familiar area where furniture and objects are seldom moved. Try to keep beds, food dishes, and water dishes in the same area. Consider using a fountain or bubbler as their water dish, so they can hear where their water is located.Blocking off stairs and other hazardous areas using baby gates. Also, pet parents can put protective covers on sharp corners and objects. Get down to your dog’s level to see what needs to be covered.  Training that relies on verbal cues or even gentle touches. You can learn to use verbal cues to help dogs navigate their environment, using simple directional words such as left, right, up, down, stop, go, slow.  Taking steps to help them feel safe and secure. Try to stick to a routine as much as possible. Consider leaving the TV or radio playing around them to provide background noise. Playing with them and modifying some of their favorite activities. Use toys that make noise, or consider toys that are filled with treats with a strong scent so they can seek them out.Using a leash and harness to help dogs navigate the house, yard, and new or unfamiliar areas. If they are often bumping into things, consider looking into a special harness with a halo that helps dogs better detect their surroundings: Informing people that meet them that your dog is blind, and discussing what helps them feel most secure when being approached. Explain how you typically approach them, such as the verbal command you use to let them know you are there, and how you typically touch them. Featured Image: iStock/Morsa Images"}]