[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is it OK to breed a dog with a mild case of pulmonary stenosis?", "acceptedAnswer": {"@type": "Answer", "text": "Since there could be a hereditary component, breeding is generally not recommended."}}, {"@type": "Question", "name": "What is the life expectancy of a dog diagnosed with pulmonary stenosis?", "acceptedAnswer": {"@type": "Answer", "text": "Prognosis is variable depending on the severity. In dogs that have developed right-sided congestive heart failure or an irregular heartbeat, such as atrial fibrillation, prognosis is guarded to poor. However, in mild or moderate stenosis, some dogs can live a normal life without treatment, while others may need treatment and/or beta blockers."}}, {"@type": "Question", "name": "What is the average cost of balloon valvuloplasty?", "acceptedAnswer": {"@type": "Answer", "text": "In general, the price for this procedure can range from $4,000–$7,000. Featured Image: iStock.com/Jose carlos Cerdeno"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pulmonic Stenosis In Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1392711741.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1392711741.jpg"}, "author": {"@type": "Person", "name": "Dr. Shawna Abrams", "url": "https://www.petmd.com/author/dr-shawna-abrams"}, "keywords": "Dog, Adult, Condition, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/pulmonic-stenosis-dogs"}, "datePublished": "June 1, 2023", "dateModified": "October 3, 2023", "description": "Dr. Shawna Abrams explains pulmonic stenosis in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Pulmonary Stenosis in Dogs? Pulmonic stenosis is a congenital heart defect in dogs. Stenosis means a narrowing, so pulmonic stenosis refers to narrowing of the valve between the right ventricle (a chamber of the heart) and the pulmonic artery (the major blood vessel that carries blood from the heart to the lungs).  The valve may be narrowed due to thickening of the leaflets and/or partially fused together.  This condition is congenital (present at birth) and likely has a genetic and hereditary component.  Pulmonic stenosis results in increased pressures in the right side of the heart, which can lead to thickening of the heart muscle, heart failure, arrhythmias, and even sudden death.  Puppies with pulmonic stenosis often have other congenital heart defects such as aortic stenosis and ventricular septal defect.    Symptoms of Pulmonic Stenosis in Dogs In some dogs with mild narrowing, there are no clinical signs, and they never experience symptoms of disease. However, in dogs with more severe narrowing, the fast and turbulent movement of blood and thickening of the right ventricle result in: Murmur (ranging from mild to severe) Exercise intolerance Fainting (syncope)/collapse Arrhythmias: Right-sided congestive heart failure (CHF) Ascites (fluid buildup) Causes of Pulmonary Stenosis in Dogs Pulmonary stenosis is congenital; dogs are born with the defect and there could be an inherited component in some breeds. The breeds most affected by the condition are: English and French Bulldogs Terriers (Jack Russell Terriers) Labrador Retrievers Miniature Schnauzers American Cocker Spaniels Samoyeds Keeshonden Mastiffs Beagles How Veterinarians Diagnose Pulmonary Stenosis in Dogs Most cases of pulmonary stenosis in dogs are detected during a routine puppy examination, first with detection of a heart murmur, an arrhythmia (irregular heartbeat), or other signs of heart failure such as fluid buildup. A heart murmur is heard by listening to the heart and lungs with a stethoscope, and refers to turbulence in the blood flow, regardless of cause. Because there are other causes of blood turbulence, a heart murmur alone doesn’t necessarily indicate pulmonary stenosis. Once a murmur is heard, additional diagnostic tests may be needed, including: Radiographs   Electrocardiography (ECG) Echocardiography Treatment of Pulmonary Stenosis in Dogs Cardiac catheterization using balloon valvuloplasty is typically the treatment of choice. Balloon valvuloplasty, a minimally invasive procedure that opens the narrowed heart valve, is the treatment of choice for pulmonic stenosis in dogs. This procedure is only performed at specialized veterinary cardiology referral centers, and involves threading a catheter with a balloon into the heart and then dilating the balloon. The goal is to open the narrowed pulmonic valve and improve blood flow. There is no cure for pulmonic stenosis, but balloon valvuloplasty can help manage and improve the condition.  Some dogs may also be treated with beta blockers (such as atenolol).  Recovery and Management of Pulmonary Stenosis in Dogs Prognosis is largely dependent on the severity of the obstructions. Dogs with mild or moderate stenosis may not need treatment and can have a normal lifespan. Dogs with moderate stenosis will likely need balloon dilation and may show signs of exercise intolerance and fainting. In severe cases, even after treatment, some dogs will need to be on medication for the rest of their life. Moderate exercise restriction is very important. Follow all instructions given by your veterinarian and veterinary cardiologist."}]