[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How can you tell if a dog has eaten rat poison?", "acceptedAnswer": {"@type": "Answer", "text": "Sometimes it can be very difficult to determine if your dog ingested rat poison if you did not witness them eating it. However, rodenticides contain dyes (red, pink, green, blue, and tan) that can often be seen after the fact in your dog’s stool.  Other times there are no indications until your dog becomes sick. If your pet has any of the symptoms listed above, take them to an emergency veterinary hospital immediately.  "}}, {"@type": "Question", "name": "How much rat poison is lethal to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "There are four main active ingredients in rat poisons—anticoagulant rodenticide, cholecalciferol, bromethalin, and zinc and aluminum phosphides. The amount of rat poison that is lethal to dogs will depend on the size of the dog and the active ingredient. However, since rat poisons are considered highly toxic and deadly, any ingestion of rat poison means your dog should be seen immediately by a veterinarian.  Featured Image: iStock.com/SeventyFour"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rat Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.sofa_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/dog.sofa_.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Poisoning, Symptom Checker, Rat Poison", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/poisoning/rat-poisoning-dogs"}, "datePublished": "September 12, 2022", "dateModified": "September 12, 2023", "description": "Dr. Veronica Higgs discusses rat poisoning in dogs, including the most common ingredients that can cause poisoning, symptoms, diagnosis, and treatment options.", "articleBody": "What is Rat Poisoning in Dogs? The ingredients in rodenticides, or rat poison, are extremely dangerous for dogs, and accidental ingestion is one of the most common forms of pet poisoning. Rat poisons come in a variety of colors—such as green, blue, tan, pink, and red—and formulations, including pellets, bait blocks, powders, pastes, cereal, and soft baits. Each of the four most common active ingredients in rat poisons have different mechanisms for poisoning and treatment for toxicity. Unfortunately, the active ingredient cannot be identified based on the appearance of the product or bait. If your dog eats rat poison, it is important that you bring any remaining bait or packaging to the vet with you to aid in identification of the active ingredient.  The four most common active ingredients are:   Cholecalciferol (Vitamin D3) is one of the most powerful rat poisons on the market and is highly toxic to dogs. It can produce life-threatening increases of calcium in the blood, resulting in hardening of soft tissues throughout the body, particularly in the heart, kidneys, gastrointestinal tract, and muscles. This damage can lead to multiple organ failure and death. This ingredient in commonly found in products like d-CON. Anticoagulants such as brodifacoum, bromadiolone, difenacoum, difethialone, and warfarin interfere with the ability for blood to clot, resulting in internal bleeding. They were once the main active ingredient in rodenticides, including the popular brand d-CON. However, in 2018, due to EPA regulatory changes, d-CON shifted from anticoagulant rodenticide to cholecalciferol. Anticoagulating ingredients are much less common now but still deadly. Products include JT Eaton Bait Block. Bromethalin causes swelling of the brain and may result in neurological symptoms such as lack of coordination, tremors, seizures, paralysis, and death. Bromethalin can be very toxic, even in small amounts. Products using it include Tomcat brands. Zinc and aluminum phosphides are typically used in mole or gopher baits but can occasionally be found in mouse or rat baits, especially on farms. Deadly phosphine gas is produced when the poison mixes with stomach acid. Unfortunately, food in the stomach increases the amount of gas produced, so do not feed your dog if they have ingested this type of rat poisoning. Products include ZP Mouse Pelleted Rodenticide.If your dog eats rat poison (regardless of amount or active ingredient), take them immediately to a local veterinary hospital for evaluation and treatment.  Symptoms of Rat Poisoning in Dogs Clinical signs will vary depending on the active ingredient in the rat poison and the amount ingested. Unfortunately, symptoms often take 1-7 days to show after ingestion of a toxic dose. Many rodenticides contain dyes (red, green, blue, pink, and tan) that may stand out in your dog’s stool.  Any time you see foreign material in your pet’s stool, contact your veterinarian immediately. Clinical signs of anticoagulant rodenticides are based on signs of internal bleeding and may include: Lethargy Pale gums Trouble breathing/increased breathing rate Weakness/collapse Decreased appetite Less common signs can include bloody diarrhea, nose bleeds, bruising, bloody urine, swollen joints, bleeding from gums, vaginal bleeding (if pregnant), pharyngeal swelling, and even seizures (from bleeding in the brain) Clinical signs of cholecalciferol rodenticides are related to the hardening of soft tissues, with the kidneys being most susceptible, and may include: Weakness Anorexia/vomiting Increased thirst and increased urination (which may be a sign of acute kidney failure) Clinical signs of bromethalin rodenticides are related to the effects on the brain, and can include: Lack of coordination/stumbling Tremors/seizures Paralysis Clinical signs of zinc and aluminum phosphides will be related to the toxic phosphine gas that is produced. The gas itself is corrosive and can damage multiple organs. Clinical signs with this active ingredient can occur within minutes, and in severe cases death can occur in as little as 5 hours after exposure. Clinical signs may include: Lethargy Vomiting (may be bloody) Diarrhea (may be bloody) Lack of coordination/weakness Tremor/seizures            Trouble breathing Stomach bloating/abdominal pain Phosphine gas has an odor of decaying fish or garlic and is extremely toxic to humans as well as pets.  If your pet vomits on the way to the veterinarian, be sure to roll down the windows (safely) for maximum ventilation. Any symptomatic person should seek advice from human poison control or medical professionals. Causes of Rat Poisoning in Dogs Most rat poison cases in dogs are the result of unintentional ingestion of bait. In rare cases, poisoning may be due to malicious intent. When you and your dog are visiting a friend or family member or leaving a dog with a sitter, ask about potential poisons around the home. Poisoning in dogs can theoretically occur as a secondary or “relay toxicity” if a dog eats a rat who died from rat poison ingestion. This type of poisoning has never been documented in research, so while it is possible, it is considered highly unlikely. How Veterinarians Diagnose Rat Poisoning in Dogs  If you see your dog eat any type of rat poison or suspect that they may have ingested rat poisoning, take them immediately to your local veterinary emergency hospital.  An emergency vet will collect a thorough medical history to help their assessment. If possible, bring the bait packaging, because determining the active ingredient is crucial to treatment. Calling the pet poison hotlines may also be beneficial, as they can look up packaging information on the product. If possible, call the hotline while en route to your emergency veterinary hospital; time is of the essence in ensuring that your dog reaches medical care immediately. The veterinarian will start with a physical examination to assess your dog’s mental and neurological status and check for any bleeding, bruising, or abdominal pain.  A complete blood count, serum blood chemistry with electrolytes, and urinalysis will likely be recommended for a baseline evaluation.  Depending on the active ingredient, coagulation panels (PT/PTT) may also be recommended to check your dog’s ability to clot. Often at the time of your visit, bloodwork will appear to be normal and will need to be monitored over the next 1-7 days. Other tests such as chest or abdominal x-rays may be recommended, depending on your pet’s clinical signs. Treatment of Rat Poisoning in Dogs Dogs should be treated as soon as possible for rat poisoning. Treatment will vary based on the active ingredient involved, so it is extremely important to determine the type of rat poison. For most active ingredients, the vet will likely induce vomiting. (If the active ingredients include zinc and aluminum phosphides, the vet may induce vomiting in a well-ventilated area because of the risk to people. Activated charcoal may be given to treat other toxins. After vomiting, treatment will depend on the specific active ingredient ingested: For anticoagulant rodenticide, treatment will include at least 4 weeks of oral vitamin K as well as hospitalization for IV fluids, plasma and/or blood transfusions, and additional supportive care (such as oxygen therapy, gastrointestinal support, and antiemetics to reduce nausea and vomiting).  There is no antidote if a dog has swallowed rat poison with either cholecalciferol or bromethalin. Hospitalization is likely in both cases with IV treatment. Dogs that have swallowed cholecalciferol will also be treated to reduce calcium levels. Dogs swallowing bromethalin will be treated to decrease brain swelling. Poisoning by zinc and aluminum phosphide rodenticides includes antacids and similar medications to decrease the production and effects of the deadly phosphine gas. Additionally, liver protectant medicine and medications to treat tremors or seizures may be needed. Recovery and Management of Rat Poisoning in Dogs  Early diagnosis and aggressive treatment are crucial in treating rat poisoning in dogs. All rat poisons, regardless of the active ingredient, can be fatal, and dogs have their best chances of survival if seen quickly by a veterinarian. Overall, the prognosis is very good for dogs who receive prompt treatment upon ingesting a rodenticide.  Most dogs will remain hospitalized for observation and treatment for 2-6 days, depending on the active ingredient and how much rat poison was ingested. Typically, blood tests will be performed several times. Prevention of Rat Poisoning in Dogs Prevention is key! Keep all rat poisons away from your dog and in a secure place. Consider an alternative form of pest control, such as live traps that do not include poisons. If you must put out rat poison: Keep a detailed record of how much was placed Know what kind of product (including the active ingredient) Take a picture of the ingredients in case you need to refer to it later for veterinarian treatment Mark where you dispensed the rat poison If your pet is going to visit a friend, family member, or sitter, be sure to ask if they have rat poison out and keep the dog away from those areas Never let dogs eat unidentified objects on walks, as these can include toxins and poisons and be hard to determine after the fact. Finally, remember to monitor your pet’s stool carefully, as many rodenticides contain dyes (red, green, blue, pink, and tan) that may be noticeable before severe symptoms begin.   "}]