[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vaginal Discharge in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/vaginal-discharge-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/vaginal-discharge-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_multi_vaginal_discharge"}, "datePublished": "July 17, 2008", "dateModified": "August 16, 2022", "description": "Vaginal discharge refers to any substance coming from the animal&#039;s vagina. Types of discharge can include mucus, blood, or pus.", "articleBody": "Vaginal discharge refers to any substance coming from the animal&#039;s vagina. Types of discharge can include mucus, blood, or pus. Since there are so many causes for this medical condition, consulting with a veterinarian is highly recommended. Symptoms Symptoms can include discharge from the animal&#039;s vagina, spotting of blood, scooting the hindquarters, attracting males. Causes Reasons for why an animal would experience discharge include: Urinary tract infectionForeign bodyVaginal traumaAbnormal cells in the vaginal areaFetal deathRetained placenta following a birthingVaginal infectionSome antibiotics can cause vaginal discharge. Estrogen medications given during some phases of the animal&#039;s heat or estrous cycle, medications containing male hormones, and certain antibiotics can alter the vaginal cells, leading to excess discharge. Diagnosis Upon examination, the veterinarian may find blood, pus, urine or feces in abnormal quantities. The veterinarian will need to review the animal&#039;s medical history and make a risk assessment. Radiograph or injection imaging may be used to examine the body for any more underlying medical conditions that would cause the vaginal discharge so that proper treatment can be prescribed.  Treatment Outpatient treatment is sufficient under most circumstances. Medications in the form of vaginal douches and antibiotics will be used to treat the infected area. Living and Management The entire round of antibiotic treatment must be completed to ensure a full recovery. Prevention Spaying can help to reduce the likelihood of vaginal infections. For birthing animals, make sure that all of the uterine contents have left the animals body, and be observant of excess blood or discharge after the birth."}]