[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tumor of the Uterus in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_uterine_tumor"}, "datePublished": "March 20, 2010", "dateModified": "August 16, 2022", "description": "Uterine tumors in dogs are usually benign (non-spreading) and non-cancerous.", "articleBody": "Uterine Tumor in Dogs Uterine tumors in dogs are usually benign (non-spreading) and non-cancerous. Uterine tumors are rare occurrences, usually affecting middle-aged to older female dogs that have not been spayed. These tumors arise from the uterine smooth muscle and epithelial tissues -- the tissues that line the internal organs and cavities. Dogs are most affected with leiomyomas, a benign smooth muscle mass of tissue (neoplasm); 85 to 90 percent of uterine tumors are this type. Fortunately, only 10 percent of dogs have the malignant form of leiomyosarcoma. Symptoms and Types Although there is often no sign of the disease, dogs with these type of tumors may display:     Vaginal discharge    Pyometra      (infection, pus in the uterus)    InfertilityCauses This type of tumor tends to affect female dogs that have not been spayed. Diagnosis You will need to give a thorough history of your dog&#039;s health and onset of symptoms. Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible conditions that might have led to this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, a urinalysis and an electrolyte panel to rule out other diseases. Thoracic (chest) X-rays will be taken of the chest to check for cancer spread, and X-rays of the abdomen should also be taken to check for a possible abdominal mass. An ultrasound provides even greater visual sensitivity, and may be used to reveal a uterine mass during an abdominal examination. A computed tomography (CT) and/or magnetic resonance imaging (MRI) can further detail a mass and enable the most sensitive detection of the cancer’s spread in the body. If there is abdominal fluid buildup, a fluid sample should be tapped and sent to the laboratory for analysis. A cellular examination of a biopsy taken from the tumor is required for a definitive diagnosis.  Treatment The ideal treatment is to spay the dog. However, doxorubicin, cisplatin, carboplatin, and epirubicin are the most rational chemotherapeutic choices for treating cancerous uterine tumors and their spread of disease. If your dog has a uterine infection, such as pyometra, your doctor will prescribe the appropriate medications for treating the infection. Often, the treatment for pyometra is surgical removal of the uterus, or spaying. Living and Management If the uterine tumor is malignant, your veterinarian will schedule follow-up appointments every three months to check for cancer spread and adjust the therapy as needed.  Before each chemotherapy treatment, complete bloodwork will be done. If the uterine tumor is benign, surgery (spaying) is generally curative. Your veterinarian will schedule health checkups in accordance with your dog&#039;s overall health condition, but unless there was an underlying condition, your dog should be able to go about living normally. "}]