[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Testicular Swelling in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/testicular-swelling-dogs.png", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/testicular-swelling-dogs.png"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_multi_epididymitis_orchitis"}, "datePublished": "August 14, 2008", "dateModified": "August 16, 2022", "description": "Epididymitis is inflammation of the testicular tube where sperm is stored, while orchitis is inflammation of the testes themselves. While the condition can be chronic, acute forms caused by direct trauma to the scrotum are more common.", "articleBody": "Epididymitis/Orchitis in Dogs Epididymitis is inflammation of the testicular tube where sperm is stored, while orchitis is inflammation of the testes themselves. While the condition can be chronic, acute forms caused by direct trauma to the scrotum are more common. Epididymitis is commonly diagnosed in dogs, generally striking in the adult years; the average age of dogs affected with this condition is four years old. Breed does not indicate the probability of a dog being affected. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types The symptoms of epididymitis and orchitis can be localized in the area of the scrotum. These include: Swollen testiclesLicking of the scrotum and scrotal skin irritation (dermatitis)Non-localized symptoms include pain and feverUnwillingness to walk and general lethargyOpen wound may be foundRefusal to eat is not uncommonInfertility is commonly seen in dogs with this conditionCauses Acute forms of this condition are most often caused by trauma to the scrotum. Epididymitis and orchitis can also be triggered by infectious organisms, as well as by other conditions, including viral causes (i.e., distemper), infections associated with inflammation of the prostate (prostatitis) and inflammation of the bladder (cystitis). Bite wounds on any area of the body can also lead to the development of epididymitis or orchitis. Diagnosis Your veterinarian will perform a thorough physical examination on your dog, taking into account the background history of symptoms and any possible incidents that might have played a role in its onset. Other potential causes of the above mentioned symptoms include hernia of the scrotum, scrotal dermatitis, twisting of the spermatic cord, sperm-filled mass of inflamed tissue (granuloma), fluid-filled sacks on the spermatic cord (hydrocele), prostatitis, cystitis, and abnormal cell growth (neoplasia). Before treatment can begin, all of these condtions must first be ruled out. White blood cell counts may be high in cases of infectious orchitis. If the root cause is prostatitis or cystitis, a urinalysis will likely reveal blood, pus, or excess proteins in the urine. Antibody testing should determine if an infectious organism is at the root of the problem. Ultrasounds of the prostate, testes, and epididymis may also be performed to rule out other causes. If an open wound is present, it should be checked for bacterial infection. A bacterial culture may also be taken of the prostate, as well as of the fluid in the testes. Semen should also be collected and tested.  Treatment and Care Treatment depends on whether or not your dog is used for breeding. If it is, and the problem only affects one side of the testes (unilateral), partial castration may be an option. However, if the condition affects both sides, or if your dog is not intended for breeding, full castration is generally recommended. In addition to this, your dog should be treated with antibiotics for at least three weeks. However, antibiotic treatment alone will not always lead to improvement. Living and Management The condition itself, or castration (even if unilateral), can result in permanent infertility. Your dog&#039;s semen should be checked for viability three months after the treatment. Prevention Prompt treatment of wounds and preventing infections are the best weapons against epididymitis and orchitis. It is also best to keep your dog in good health, while visiting your veterinarian regularly for progress checks."}]