[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sperm Ducts Cysts in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Reproductive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_sperm_duct_cyst"}, "datePublished": "February 27, 2010", "dateModified": "August 16, 2022", "description": "A spermatocele is a cyst in the ducts or epididymis that conduct sperm, and is usually associated with a blockage. Meanwhile, sperm granuloma (or cyst epididymis) is a chronic inflammatory condition in which a cyst has grown in the epididymis, part of the spermatic duct system, resulting in swelling of the duct or ducts.", "articleBody": "Spermatocele and Sperm Granuloma in Dogs A spermatocele is a cyst in the ducts or epididymis that conduct sperm, and is usually associated with a blockage. Meanwhile, sperm granuloma (or cyst epididymis) is a chronic inflammatory condition in which a cyst has grown in the epididymis, part of the spermatic duct system, resulting in swelling of the duct or ducts. When sperm escape from these ducts into the surrounding tissue, chronic inflammation occurs. This becomes clinically important when bilateral (both sides) obstruction of the duct system leads to no live sperm in the seminal fluid. Symptoms and Types It is suspected in dogs that have no live sperm yet have normal-sized testes. In addition, it is rarely associated with pain or visible or palpable lesions. Causes     Trauma causing a break in the epididymal duct, where sperm are transported, stored, and matured, which releases sperm antigens into the surrounding tissue    Adenomyosis - invasion of the epithelial lining cells of the epididymis into the muscular layers may be a factor; it is associated with excess estrogen production    Overproliferation of cells of the epididymis may be a precursor of adenomyosis; not often seen in dogs younger than 2.5 years old, but is noted to some degree in 75 percent of dogs older than 7.75 years; risk increases with age.    Complication of vasectomy or partial neuter, especially when surgical technique was not meticulous    Congenital occlusion (blockage) of the epididymal duct (i.e., the dog was born with this disorder)Diagnosis In making a determination about why your dog’s sperm is deficient, your veterinarian will look at several possibilities, such a testicular degeneration, underdevelopment of the organs, insufficient ejaculation, and incomplete ejaculation. A physical examination will be conducted to look for pain or lesions in the reproductive organs. A urinalysis and possibly a blood test will also be standard for laboratory analysis. It may also be necessary to conduct a surgical testicular biopsy and a biopsy of affected the epididymal tissue to differentiate a benign from a malignant mass.  Treatment Dogs with insufficient sperm counts rarely spontaneously recover. A bilateral blockage of the epididymis is generally not treatable except by surgical intervention."}]