[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tumors of the Vagina in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/tumors-vagina-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/tumors-vagina-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_vaginal_tumor"}, "datePublished": "March 20, 2010", "dateModified": "August 16, 2022", "description": "Vaginal tumors are the second most common reproductive tumor in dogs, comprising 2.4–3 percent of all tumors in dogs.", "articleBody": "Vaginal Tumors in Dogs Vaginal tumors are the second most common reproductive tumor in dogs, comprising 2.4–3 percent of all tumors in dogs. In dogs 86 percent of vaginal tumors are benign smooth muscle tumors, often with fingerlike extensions (e.g., leiomyoma, a type of smooth muscle tumor; fibroleiomyoma, a fibrous tissue and smooth muscle tissue tumor; and fibroma, a fibrous tissue tumor). In dogs, a vaginal tumor may never bother the animal (and thus never be diagnosed), or it may cause complications that are not a direct result of the tumor, but a result of its presence in the body, such as with uterine leiomyomatas, which can cause excessive menstrual bleeding. Other complications can include painful urination, and difficult birthings. Symptoms and Types Outside the vagina Slow-growing around the anusDischarge from the vaginaDifficulty urinatingFrequent urination (polyuria)Licking the vulvaDifficulty giving birthInside the vagina (intraluminal) Mass protruding from the vulva (often at estrus/heat)Vulvar dischargeStraining to urinateDifficulty urinating (painful)Straining to defecateCauses Female dogs that are unspayed are most commonly affeted with vaginal tumors, especially those that have never given birth. Diagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have led to this condition. Your veterinarian will order a blood chemical profile, a complete blood count, a urinalysis and an electrolyte panel. A vaginoscopy will be performed. This method uses a tiny instrument that is equipped with a camera for inspecting the inside of the vagina, and which is capable of cutting and gathering tissue for biopsy. The biopsy, along with a cytologic examination of an aspirate taken from the vaginal tissue may help to determine the vaginal tumor’s cell type. An examination of vaginal cells and tissue is necessary for a definitive diagnosis to be made. Chest X-rays should also be taken to check for spread of the cancer. Abdominal X-rays may show the vaginal tumor, while ultrasonography, vaginography, and urethrocystography may help to visualize a mass. Computed tomography (CT) and/or magnetic resonance imaging (MRI) will give a clearly outlined image of a  tumor, allowing your doctor to assess for surgical feasibility, and to assess for possible degree of cancerous spread.  Treatment Surgical removal of the vaginal tumor with a concurrent spaying of the patient is the treatment of choice. For sarcomas and mast cell tumors (which are malignant), or for benign tumors which can not be completely removed, post-operative radiotherapy is indicated. Living and Management Your veterinarian will schedule follow-up appointments with you for your dog&#039;s X-rays as frequently as every three months if the tumor was malignant (aggressive and spreading). Bloodwork will be done before each chemotherapy treatment to check on your dog&#039;s health status and progress."}]