[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vaginal Abnormalities in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/c_dg_vaginal_abnormalities"}, "datePublished": "March 20, 2010", "dateModified": "August 16, 2022", "description": "Vaginal malformations are recognized as altered anatomic architecture, which can be due to congenital anomalies, such as an imperforate hymen", "articleBody": "Vaginal Malformations and Acquired Lesions in Dogs Vaginal malformations are recognized as altered anatomic architecture, which can be due to congenital anomalies such as an imperforate hymen (where the hymen is solid, not allowing fluids through the vaginal canal from the uterus, or normal penetration [such as for breeding]; generally a congenital anomaly); dorsoventral septum (or septae, where the vagina has a vertical dividing membranous wall/partition); hymenal tightening; cysts (a sac with liquid inside); or to acquired conditions, such as vaginal overgrowth, foreign bodies, strictures (tightenings), adhesions (abnormal fibrous tissue sticking to the structures), and cancer. Symptoms and Types     Vulvar discharge    Excessive licking      of the vulva    Frequent or      inappropriate urination    Straining to      urinate or defecate    Wetting in the      house, in the bed, etc.    Attractive to      males    Refuses mating    Mass at lips of      the vulva    Skin disorder      around the vulva    Abnormally small      vulvaCauses     Congenital    Inflammatory    Hormonal    Traumatic    CancerousDiagnosis Your veterinarian will perform a thorough physical exam on your dog, taking into account the background history of symptoms and possible incidents that might have led to this condition. A complete blood profile will be conducted, including a chemical blood profile, a complete blood count, a urinalysis and an electrolyte panel to rule out other diseases. The urinalysis may show evidence of a secondary urinary tract infection. After the initial examination, your veterinarian will perform a gynecological examination as well. The order in which the procedures are performed is important. They are listed here in the recommended order:     Vaginal culture      to identify secondary infections     Vaginal cytology      (cell examination) to identify stage of the estrous cycle; reveal      inflammatory or cancerous cells    Digital      examination (with a finger) of the vaginal canal    Vaginoscopy: an      examination of the internal structure of the vagina using a small camera    Vaginography:      X-rays performed after special dyes have been placed in the vaginal canal,      so that the shape and structure of the vagina can be better viewed as the      dye fills the vaginal space    Ultrasonography      will be done when the results of the previous procedures suggest an      anatomic abnormalityPositive-contrast Vaginography     Defines the      structural boundaries of the vagina    Defines the      structural boundaries of the cervix    Identifies strictures      (narrowings), septae (partitions), persistent hymens, masses, rectum to      vagina or urethra to vagina fistulas (abnormal connecting passageways      between two normally separate canals), vaginal rupture, and diverticula      (outpouching of hollow or fluid filled sac like structure)    Urinary      incontinence may require excretory urography (X-rays of urination with      dyes) to rule out ectopic (abnormally positioned) ureters (the tubes      running from the kidneys down to the bladder), or a bladder  with its neck positioned in the pelvisAbdominal ultrasonography     Cranial vaginal      masses may occasionally be imaged    Fluid buildup in      the vagina (hydrocolpos) or uterus (hydrometra) may be seen in cases of      imperforate hymen, due to solid structure of hymen blocking the flow of      fluids from the uterus Treatment Manual dilation of closed hymens or of a mild vaginal narrowing may be performed over a course of several treatments while using an anesthetic on the dog. It usually reduces the medical issue, although it does not resolve clinical signs. Surgery can be used to correct many minor congenital and acquired lesions. Spaying to resolve clinical signs  -- typically exhibited during estrus (heat) -- can be performed in patients with no breeding value. Removal of the vagina and ovariohysterectomy can be performed in patients with no breeding value to resolve concurrent severe vaginitis (at all stages of the estrous cycle). Living and Management Although it is very rare, there are occasionally cases in which an animal is diagnosed with a vaginal malformation that has been passed on as a genetic trait. If several dogs in a familial line show similar clinical signs of vaginal malformations, they should all be spayed to prevent the trait from being passed on to the next litter. Some animals with vaginal malformations that are not familial may be bred by artificial insemination. They may then give birth via a planned cesarean section."}]