[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Valley Fever in Dogs: Everything You Need to Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/valley-fever-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/valley-fever-dogs.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Condition, Fungi", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/valley-fever-dogs-everything-you-need-know"}, "datePublished": "January 18, 2018", "dateModified": "July 5, 2023", "description": "If you live in the southwestern United States, you’ve probably heard of Valley Fever. But are you familiar with how common and severe the disease can be in dogs? If you live in a place where Valley Fever is a risk, or if you’re considering a trip to this part of the country, you need to learn about this disease to protect your canine family members. Here is your guide to Valley Fever in dogs.", "articleBody": "If you live in the southwestern United States, you’ve probably heard of Valley Fever. But are you familiar with how common and severe the disease can be in dogs? If you live in a place where Valley Fever is a risk, or if you’re considering a trip to this part of the country, you need to learn about this disease to protect your canine family members. Here is your guide to Valley Fever in dogs. What Is Valley Fever? Valley Fever is a disease caused by infection with a type of fungus called Coccidiodes immitis. The condition may also be called coccidioidomycosis, California disease, desert rheumatism, or San Joaquin Valley Fever. The disease is extremely common in south-central Arizona, but it’s also frequently diagnosed in other parts of Arizona and in the desert regions of New Mexico, southwestern Texas, California, Nevada, and Utah. Parts of Mexico and Central and South America are affected, too.  People and dogs are most commonly diagnosed with Valley Fever, but it can also infect most mammals, including cats. What Causes Valley Fever in Dogs? Coccidiodes organisms live in desert soils and produce long filaments of mold that contain infectious spores. When the soil is disturbed, such as by a digging dog, by construction, or during a windstorm, the spores become airborne and can be inhaled. Once inhaled, the spores transform into a yeast-like organism that infects the lungs.  Between 6–10% of dogs living in Pima, Pinal, and Maricopa counties in Arizona are diagnosed with Valley Fever every year. It’s thought that dogs are so frequently diagnosed with Valley Fever because they commonly disturb and sniff dirt in their normal, daily activities. Is Valley Fever Contagious? Should your dog develop Valley Fever, you do not have to worry about them passing the disease on to you or to other pets. Valley Fever is not contagious. Rather, it’s transmitted by inhaling spores contained in dirt and dust—not through contact with a sick animal or person.  Between 6–10% of dogs living in Pima, Pinal, and Maricopa counties in Arizona are diagnosed with Valley Fever every year.Symptoms of Valley Fever in Dogs Many dogs who are exposed to Coccidiodes immitis do not develop symptoms of illness. In these cases, the dog’s immune system is able to contain and destroy the organisms before they can reproduce and cause Valley Fever. But when a dog is exposed to a large number of spores or has a weakened immune system, Valley Fever can take hold. Typical symptoms of an infection that is limited to the lungs include: Coughing Lethargy Fever Poor appetite Weight loss Additional symptoms are seen when the infection spreads outside of the lungs. Other possible symptoms include: Back or neck pain Lameness Seizures Abscesses Skin wounds that don’t heal as expected Swollen lymph nodes Eye abnormalities Heart failure Blindness In Arizona, it appears the highest risk of exposure to Coccidiodes immitis occurs during the drier months of June, July, October, and November, but this may not be the case in other parts of the country. Symptoms of infection may occur weeks, months, or even years after exposure. Diagnosing Valley Fever in Dogs Veterinarians who practice in areas where Valley Fever is widespread are very familiar with the disease and will commonly test for it in dogs with typical symptoms. If you have recently traveled to or moved from a region where Valley Fever is commonly diagnosed and your dog is unwell, you MUST tell your veterinarian about your dog’s travel history and/or specifically ask whether a Valley Fever test should be administered. The most common way to test for Valley Fever is with a titer—a test that measures the level of antibodies against Coccidiodes within a blood sample. In other words, a titer test determines whether or not a dog has been exposed to Coccidiodes. Veterinarians combine the results of a dog’s titer with other diagnostic tests (complete blood cell counts, blood chemistry panels, X-rays, etc.) and a dog’s symptoms and history to make the final determination as to whether or not a dog has Valley Fever. Additional types of tests are available and can be used to help diagnose complicated cases. Treating Valley Fever in Dogs Dogs diagnosed with Valley Fever will be given anti-fungal medications that inhibit the growth of Coccidiodes organisms and allow the dog’s immune system to control—and hopefully eliminate—the infection. Commonly used medications include:  Fluconazole  Itraconazole Ketoconazole Other options are available for dogs with severe infections or those that don’t respond to traditional treatments. Veterinarians may also prescribe anti-inflammatory medications, pain relievers, nutritional support, fluid therapy, and other treatments based on the specifics of a dog’s case. Valley Fever requires long-term treatment. Dogs are typically given anti-fungal medications for at least six months to a year, but some may need extended or even life-long treatment to prevent relapses. Veterinarians determine the best time to discontinue anti-fungal medications based on a dog’s response to treatment and follow-up testing, and then they will closely monitor for relapses. Valley Fever requires long-term treatment. Dogs are typically given anti-fungal medications for at least six months to a year.Survival Rate for Dogs With Valley Fever More than 90% of dogs treated for Valley Fever will survive, according to the University of Arizona. Dogs with symptoms involving several parts of the body (particularly the brain) or that do not respond well to anti-fungal medication have a worse prognosis. Unfortunately, relapses are common even with appropriate treatment, so it’s very important to monitor dogs closely. In general, dogs that relapse respond well again to treatment but may need to stay on an antifungal medication for the rest of their lives. How To Prevent Valley Fever in Dogs If you live in or visit a Valley Fever endemic area, take steps to protect your dog’s health. Do what you can to reduce his exposure to soils and airborne dust. For example, keep your dog indoors as much as is practical. When outside with your dog, keep them on a leash and walk them on paved sidewalks.  Featured Image: Adobe/adogslifephoto"}]