[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Staph Infection in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/staph-infection-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/staph-infection-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/respiratory/c_multi_staphylococcal_infections"}, "datePublished": "July 16, 2008", "dateModified": "August 16, 2022", "description": "The Staphylococcus bacteria can live free in the environment, on the skin of a host as a parasite, and in the upper respiratory tract of animals. The bacteria can be transmitted easily from animal to animal and in some cases from animal to human.", "articleBody": "Staphylococcal Infections in Dogs The Staphylococcus bacteria can live free in the environment, on the skin of a host as a parasite, and in the upper respiratory tract of animals. The bacteria can be transmitted easily from animal to animal and in some cases from animal to human. This infection can be found in any breed of dog, and at any age. Symptoms and Types FeverPainLoss of appetite (anorexia)Skin abscessesInfections of the eyes, skin, ears, eyes or respiratory systemItching (pruritus)Inflammation marked by pus filled lesions (pyoderma)For dogs, other common indicators can include wound infections, toxic shock syndrome, abscesses on the skin or mouth, and arthritis. Causes Younger dogs are most prone to developing this infection, as their immune systems have not fully developed. Old dogs are also more susceptible, as their immune systems have become worn down. Other causes can include bacterial or fungal infections (pathogens) of the blood, chronic debilitating diseases that wear down the immune system, allergies, and other secondary infections. Diagnosis Your veterinarian will conduct a complete blood profile, including a chemical blood profile, a complete blood count, and a urinalysis. Proper diagnosis will often involve skin testing to determine if the condition is caused by allergies or other immune related causes. It is also important to rule out abnormal cell development as an underlying cause of the condition.  Treatment A variety of medications are available to treat this medical condition, but some strains are resistant to medications. In some cases, standard antibiotics are not effective at curing this condition and a different course will need to be prescribed. Living and Management It is important to dispose of any potentially infected materials or contaminated objects. Also, external (topical) cleansing of the wound(s) and the infected area of skin is essential for healing the skin and preventing the bacteria from spreading. Because this type of bacteria is opportunistic, and can be passed to both animals and humans, special care must be taken when handling your dog and cleaning its wounds. Prevention There are currently no known preventative measures for this infection."}]