[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sepsis in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Systemic", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-645495562.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-645495562.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Condition, Emergency", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/systemic/sepsis-dogs"}, "datePublished": "March 16, 2023", "dateModified": "March 16, 2023", "description": "Dr. Veronica Higgs explains sepsis in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Sepsis in Dogs?  Sepsis is the body’s extreme reaction to an infection. Sepsis is a twofold condition—first, the infection, and then the body’s systemic (whole-body) response to the infection. The infection triggers a chain reaction throughout the body, leading to sepsis. The most common cause is bacterial infection. However, sepsis can also be caused by viruses, parasites, or fungal infections.  Sepsis is a spectrum of infection. The sequence of severity starts as an uncomplicated bacterial infection in the bloodstream (bacteremia), which can lead to inflammation in the body (systemic inflammatory response syndrome, or SIRS). As organ damage and failure starts to occur (severe sepsis), blood pressure falls, decreasing blood flow and oxygen to the organs, leading to septic shock. Septic shock may continue to the point that the body begins to shut down, resulting in multiple organ dysfunction syndrome (MODS) and death.   Sepsis is a medical emergency and should be treated immediately, as it can quickly become life-threatening. You should take your dog immediately to the local emergency veterinary hospital if sepsis is suspected. Symptoms of Sepsis in Dogs  Clinical signs may vary based on the type and location of the initial infection, but general symptoms seen with sepsis include: Vomiting Diarrhea Lack of appetite (anorexia) Weakness/lethargy Fever Confusion/disorientation Increased heart rate (tachycardia) Rapid breathing (tachypnea) Low blood pressure (hypotension) Causes of Sepsis in Dogs  Sepsis is initially caused by an infection that reaches the bloodstream. The most common originating sites of the infection are: Gastrointestinal (GI) tract, including the stomach and intestines: Bacteria and viruses can move from the GI tract into the bloodstream. Viruses such as parvovirus can move from the intestines into the bloodstream. Other possible causes include peritonitis and stomach or intestinal rupture from ulcers, trauma, or a foreign body causing blockage.    Respiratory tract: Bacterial, viral, or fungal pneumonia can trigger sepsis.  Oral cavity: Severe dental and periodontal disease can result in significant amounts of bacteria trapped in tartar, which can enter the bloodstream, leading to sepsis.  Urinary tract: Severe or chronic kidney infection (pyelonephritis) or bladder infection (UTI) can enter the bloodstream and result in sepsis. Wounds: Skin wounds can become severely infected and serve as the source of sepsis.  Reproductive tract: Infections in the uterus (pyometra) can result in rupture of the uterus or translocation into the bloodstream.  While the above-listed locations are the most common sources of sepsis, any infection from bacteria, virus, parasite, or fungus in any location can result in sepsis and trigger the cascade of bodily responses leading to bacteremia, systemic inflammatory response syndrome (SIRS), severe sepsis, septic shock, multiple organ dysfunction syndrome (MODS), and death.  How Veterinarians Diagnose Sepsis in Dogs  A complete medical history, including any recent wounds, trauma, or surgical procedures as well as current medications (especially non-steroidal anti-inflammatory medications, or NSAIDs), may provide clues as to the source of possible sepsis. Next, your veterinarian will perform a thorough physical examination to assess for abdominal pain, trouble breathing, or fever.  Any possible source of infection will be investigated. A complete blood count, serum blood chemistry, and urinalysis will likely be recommended as a starting point. Sepsis can cause changes in your pet’s bloodwork that will aid your veterinarian in the diagnosis. Additional tests such as chest x-rays and an abdominal ultrasound may be recommended to search for the source of infection. Once it is identified, cultures will likely be submitted to determine the exact bacteria or other organism causing the infection, and which antibiotic it is most susceptible to.  Treatment of Sepsis in Dogs  Based on your dog’s history, physical examination, and diagnostic results, your veterinarian will determine a course of treatment. It is extremely likely that your pet will be hospitalized with IV fluids to keep them hydrated, and will be given medications to help maintain blood pressure as well as treat any vomiting, diarrhea, or pain. Antibiotics will also likely be an important part of your pet’s care. Oxygen therapy may be needed if they are having trouble breathing.   Depending on the source of the infection, some pets diagnosed with sepsis will require emergency surgery to correct the problem underlying the condition. In these cases, exploratory surgery and correction of the underlying problem (such as ruptured intestines or uterus) is crucial to successful treatment of sepsis. Removing the source of the infection, if possible, is an important step before continuing medical management.  Recovery and Management of Sepsis in Dogs  Early diagnosis and treatment of sepsis are vital for a successful outcome and survival. Typically, a dog with sepsis will require three to five days in the hospital, sometimes more, with IV fluids, antibiotics, and nutritional support that may include a feeding tube. Even with intensive care, the survival rate is typically around 50%.     Most dogs can be discharged when they are fever-free and have normal heart rate and blood pressure. They may be on antibiotics for two to six weeks depending on the source and type of infection. If surgery was performed, a restricted-activity recovery period of 10-–14 days will likely be recommended. Sepsis is a severe, life-threatening condition that should be treated as soon as possible because it can have deadly consequences. Most dogs that survive tend to make a full recovery and go on to live normal lives. "}]