[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skin Ulcers and Depigmentation (Immune-Related) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_dg_cutaneous_lupus_erythematosus"}, "datePublished": "April 10, 2010", "dateModified": "August 16, 2022", "description": "Cutaneous (dicoid) lupus erythematosus is one of the most common immune-mediated skin diseases in dogs. Like other immune-mediated diseases, it is brought on by the abnormal activity of the immune system, whereby it attacks its own body.", "articleBody": "Cutaneous Lupus Erythematosus in Dogs Cutaneous (dicoid) lupus erythematosus is one of the most common immune-mediated skin diseases in dogs. Like other immune-mediated diseases, it is brought on by the abnormal activity of the immune system, whereby it attacks its own body. Cutaneous lupus erythematosus affects dogs of all ages, with a predisposition in the following breeds: Collies, German shepherds, Siberian huskies, Shetland sheepdogs, Alaskan malamutes, chow chows, and their crosses. It is considered a benign variant of Systemic Lupus Erythematosus (SLE), which is also an immune mediated disease. Symptoms and Types Symptoms of cutaneous lupus erythematosus depend on where the immune system is attacking the body, and may appear or disappear and vary in intensity. The following are a few of the more common symptoms seen in dogs:     Skin depigmentation (loss of pigment) on the lip and tip of the nose    Formation of erosions and ulcers (following depigmentation)    Loss of tissue and scar formation to fill in the lost tissue    Chronic, fragile lesions (may bleed spontaneously)Lesions associated with this disease may also involve the outer ear area and more rarely, the feet and genitalia. Causes Although the disease is brought on by abnormal activity of the immune system, the exact cause of the overactivity is unknown. Factors that are suspected to bring on the disease include drug reactions, viruses, and ultraviolet (UV) light exposure. Diagnosis You will need to give a thorough history of your dog’s health, including the onset and nature of the symptoms, to your veterinarian. He or she will then perform a complete physical examination as well a biochemistry profile, urinalysis, and complete blood count -- the results of which are typically normal. A small tissue sample may also be taken from the affected area for further evaluation.  Treatment This disease is not life-threatening and symptomatic treatment is often sufficient in most animals. Antibiotics, vitamin supplementation, and topical medications are commonly used. Severe lesions, on the other hand, may be disfiguring in nature and may require a more aggressive therapy. In some dogs, drugs to suppress the immune system are also employed to counter the over-reactivity of the immune system. Living and Management Follow your veterinarian&#039;s guidelines regarding care of skin lesions; these lesions may bleed spontaneously and need proper attention during the treatment period. The dog should be protected from direct sun exposure (i.e., UV light) and may require sunblock. You may be asked to bring in your dog every 14 days after initiation of treatment to evaluate clinical response. Laboratory testing, meanwhile, is conducted every three to six months to evaluate the disease and the effectiveness of the treatment. This disease is progressive in nature and remission is seen in the majority of patients. However, if immunosuppressive therapy is required on a long-term basis, prognosis is not good. In addition, because of the genetic nature of the disease, your veterinarian will recommend against breeding a dog with cutaneous lupus erythematosus."}]