[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skin Rash Due to Contact with Irritants in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/skin-rash-due-contact-irritants-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/skin-rash-due-contact-irritants-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/c_multi_contact_dermatitis"}, "datePublished": "October 10, 2008", "dateModified": "August 16, 2022", "description": "Contact dermatitis may be caused by an allergy, or it may simply mean that your pet has touched something that has irritated its skin, such as the sap in poison ivy, or salt on a road.", "articleBody": "Contact Dermatitis in Dogs Contact dermatitis may be caused by an allergy, or it may simply mean that your pet has touched something that has irritated its skin, such as the sap in poison ivy, or salt on a road. It is difficult to distinguish one from the other because the symptoms usually appear the same. Allergic reactions require a previous, sensitizing experience with the irritant. The next contact with the irritant is when symptoms occur. Both dogs and cats can suffer from allergic contact dermatitis and irritant contact dermatitis. It can occur at any age, and is a direct result of the irritating nature of the offending compound. There is an increased risk of allergic reaction in German Shepherds, French Poodles, Wire-haired Fox Terriers, Scottish Terriers, West Highland White Terriers, and Golden Retrievers. Some dogs have reactive dermatitis from medications. An overall reaction, as from shampoo, is uncommon. If it seems to occur at certain seasons, it indicates that the offending source is a plant or outdoor compound. The condition or disease described in this medical article can affect both dogs and cats. If you would like to learn more about how this disease affects cats, please visit this page in the PetMD health library. Symptoms and Types Dogs suffering from contact dermatitis will most likely suffer from rashes and/or bumps which occur on the skin that has come in contact with the ground (i.e., the chin, neck, chest, abdomen, groin, anal area, scrotum, tail, and between the toes). These rashes may stop abruptly at the hairline. Other common symptoms include itching, which is usually severe, and swelling. Causes Factors and/or substances that have been reported to be skin irritants are: PlantsMulch/Cedar chipsHerbicidesFertilizersFabricsPlasticsRubberLeatherRugsCarpetsConcreteMetalRough surfacesSoapsDetergentsFloor waxesCarpet and litter deodorizersSensitivity to the sun/heatTopical agentsMedicationsFood allergyInsect bitesBacterial infectionFungal infection (e.g., ringworm)LupusDandruffFlea collarsParasitic hypersensitivity or infestation (e.g., mites, fleas)Insecticides, including newer topical flea treatmentsDiagnosis Your veterinarian&#039;s first task will be to find out what the offending irritant is. The symptoms cannot be treated until tests are completed, to avoid aggravating the condition. There are several ways to approach tracking down the triggers. One is to do what is called a patch test: the suspected substance is placed on a patch and taped to the skin for 48 hours. Any reaction is then assessed. The second is to remove the pet from the offending environment for a period of time and then return it to the environment, monitoring what happens and whether it has had any impact one way or the other. Your veterinarian will also want to perform bacterial cultures. A clip of hair may be taken from a patch in an area that is not affected, applied to a sample of the suspected antigen, and observed for possible reaction. Skin biopsies are also sometimes required.  Treatment Eliminate the offending substance(s)Bathe with hypoallergenic shampoos to remove antigen from the skinCreate mechanical barriers, if possible, to restrict your pet from the offending environmentLiving and Management The most important, yet difficult thing to do is to remove your pet from the environment that brought on the condition. If the dermatitis resulted form an irritant and not an allergy, recovery will be quick once the irritant is identified. If the dermatitis is the result of an allergy, it may have developed over months or years. If your pet is exposed again, symptoms will be apparent from three to five days following exposure. The symptoms may persist for weeks. If the antigen can be identified and removed, your pet will probably be back to normal health after a few weeks. If you are unable to identify the allergen, there is a possibility that you will have to treat the symptoms with medications for the rest of your pet’s life.  See Also"}]