[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do dogs eat more as they get older?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Sometimes this is due to underlying health conditions, such as diabetes mellitus or Cushing’s disease, or a medication they’re taking, like prednisone."}}, {"@type": "Question", "name": "Why does my dog eat like he’s starving?", "acceptedAnswer": {"@type": "Answer", "text": "Many conditions can trigger increased appetite in dogs. A dog may have learned the behavior because they were not properly fed or became anxious about food. Or, they may have developed a metabolic condition or infection or have parasites. Your vet will need to do an exam, ask questions, and do some tests to rule out certain causes."}}, {"@type": "Question", "name": "When is overeating a concern for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "You should call your vet if you notice a sudden and dramatic change in your dog’s dietary habits."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Always Hungry?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-06/hungry-dog-with-food-bowl-picture-id690179250.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-06/hungry-dog-with-food-bowl-picture-id690179250.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Eating More, Symptom Checker, Eating More", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/why-my-dog-always-hungry"}, "datePublished": "June 17, 2022", "dateModified": "September 12, 2023", "description": "If your dog’s always hungry, it could be a sign of a health issue. Find out what to look for and possible reasons why your dog is eating more than usual.", "articleBody": "Although dogs may seem perpetually interested in food, an excessive appetite (called polyphagia or hyperphagia) may signal a more serious issue that should be examined by a veterinarian. If your dog is always hungry, they could have a problem with their metabolism, leaving them abnormally hungry, and they may be begging or whining even after eating. So how can you tell if your dog is just very interested in food or has an underlying problem? Here’s what to look for, possible causes, and when to see a vet. What to Check For if Your Dog Is Always Hungry If your dog doesn’t have any other symptoms and appears to be fine other than wanting to eat all the time, schedule a vet visit within 1-2 weeks or at the earliest time available. Dogs that are suddenly hungrier than usual often have other symptoms. As a rule of thumb, any change in eating or bathroom habits should prompt a visit to the veterinarian. Call your vet if you see any of the following: Increased thirst and urination Vomiting or diarrhea Changes in weight (gain or loss) Changes in body shape, such as a growing potbelly and shrinkage of muscle Eating non-food items Causes of Increased Appetite in Dogs There’s no clear-cut cause for why a dog might be obsessed with eating. It could stem from a psychological issue, such as stress or learned behavior, or a medical issue, such as not getting the right nutrients or an underlying health condition. That’s why you’ll need your vet’s help in getting the root of the problem. They can perform tests and ask questions to rule out certain causes. Here are some of the most common causes of increased appetite in dogs: Psychological issues, such as anxiety or stress Learned behavior, due to poor nutrition (either fed too much or too little) Aging process (as dogs age, some will begin to crave food more) Medication, such as prednisone Metabolic disorders, such as diabetes mellitus and hypoglycemia Cushing’s disease (hyperadrenocorticism) Gastrointestinal disorders that interfere with nutrient absorption, which can include: Inflammatory bowel syndrome Cancer Exocrine pancreatic insufficiency Parasites/infections that interfere with nutrient absorption How Vets Find the Cause for Increased Appetite in Dogs Your veterinarian may want to run a range of tests to determine the underlying cause for the sudden increase in appetite. They will usually start with the least invasive tests to try to rule things out. Here are some diagnostics your vet may want to do: Complete medical history and physical examination Blood panels, such as a complete blood count Urinalysis Tests for parasites, such as fecal flotation and Giardia tests Adrenocorticotropic hormone (ACTH) stimulation test or low-dose dexamethasone suppression test (LDDS) to check for Cushing’s disease Imaging tests such as ultrasound Serum trypsin-like immunoreactivity test (TLI) to check for exocrine pancreatic insufficiency Endoscopy examination (may be considered after additional testing is completed) Treatment of Increased Appetite in Dogs Don’t delay in getting your dog examined by a veterinarian if they appear to be suffering from constant hunger. Treatment will include giving your dog supportive care for the symptom of polyphagia as well as dealing with any underlying conditions: Behavioral-related causes may be addressed by feeding smaller portions more frequently and carefully supervising your dog’s food consumption. A metabolic issue, such as diabetes mellitus, may be treated with daily insulin injections and dietary changes. If Cushing’s disease is diagnosed, medication may be prescribed. Infection or parasites will be treated with medication and/or deworming. For exocrine pancreatic insufficiency, your vet will recommend dietary changes and medications. Treatment for cancer can include chemotherapy, surgery, and radiation treatments."}]