[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do Dogs Drool When They’re Nervous?", "acceptedAnswer": {"@type": "Answer", "text": "Yes.  Panting, pacing, and drooling excessively can be signs of anxiety and stress in dogs. "}}, {"@type": "Question", "name": "Why Does My Dog Drool in the Car?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs will often drool in the car because of motion sickness. Riding in the car can cause vertigo-like feelings for your pet, which causes nausea and drooling. Also, some dogs get stressed on car rides, and if dogs get nervous, they are more prone to drool. "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Your Dog Is Excessively Drooling", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Respiratory", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-06/dog-drooling.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-06/dog-drooling.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Drooling, Symptom Checker, Drooling", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/why-your-dog-excessively-drooling"}, "datePublished": "June 22, 2022", "dateModified": "September 12, 2023", "description": "A lot of dogs drool, but what if yours drools too much? Find out what to look for, some common causes of excessive drooling in dogs, and when to see a vet.", "articleBody": "  Drooling is normal for many dogs. But if your dog starts drooling a lot more than usual, or if your dog never drools but suddenly starts, it’s cause for concern. Excessive drooling in dogs can have a lot of different causes. Here’s some insight on what to check for, what might be causing it, and when to seek veterinary help. Why Do Dogs Drool? When a dog eats, the salivary glands in their neck and jaw area produce saliva to help with digestion. Drooling occurs when saliva escapes the mouth. It may happen if your dog sees a treat or when you’re opening a can of dog food. Drooling is not an issue in most dog breeds. Breeds with large upper lips, such as the Mastiff and St. Bernard, will usually drool more than others. Why Is My Dog Drooling a Lot? Excessive drooling in dogs (also known as hypersalivation) can indicate a serious or even life-threatening situation, especially if your dog has other symptoms. What is considered to be excessive drooling? It depends on how much your dog normally drools. Some breeds drool more than others, so you should compare your dog’s drooling with the amount that’s normal for your dog. Many conditions can cause dogs to suddenly drool excessively. Here are some common reasons: Gastrointestinal disorders: Conditions involving the gastrointestinal tract, such as esophagitis, gastritis, enteritis, pancreatitis, foreign body obstruction, gastric ulceration, inflammatory bowel disease, and gastrointestinal cancers can cause drooling in dogs. Usually this is secondary to nausea induced by these medical conditions. Gum (periodontal) disease or other oral issue: Drooling can be caused by periodontal disease such as gingivitis or stomatitis, or other oral problems such as a sialocele, tumor, or infection. Look for other signs such as a mass, blood, pus, or bad breath.   Mouth injury: Blunt force trauma, chewing on a sharp object, or foreign material that’s lodged in the mouth (splinter or piece of bone) may all be to blame. Chemical or electrical burn: Many caustic chemicals, such as battery acid, and any electrical burn (for example, from chewing an electrical cord) can cause bleeding and sometimes drooling. Chemical burns are often accompanied by pain and lesions, and your pet may paw at their mouth. Call your vet right away if you suspect these types of injury. Toxins and Venoms: Consuming a poisonous plant, food, or drug can cause anything from drooling and pawing at the mouth to life-threatening side effects. Animal venom or secretions, such as a bite from a black widow spider or licking a toad, can also cause your dog to drool. Many plants are irritating or poisonous to dogs when chewed on or eaten. Some common plants that are dangerous for pets are peace lilies and mother-in-law’s tongue. If a plant is toxic enough to cause excessive salivation, it could have other serious effects, so always contact your vet in this case. Anxiety: You might notice excessive salivation as the result of anxiety caused by going to the vet, moving to a new home, or even riding in a car. Your dog may also be restless, pant, or have diarrhea along with the drooling. Pain in the abdomen: Abdominal pain often appears together with other signs, such as restlessness, diarrhea, loss of appetite, or even abdominal distention. Some dogs will guard their abdomen to avoid being touched where it hurts. Neurological conditions: Dog drooling could indicate damage to the nerve that connects to the salivary gland, damage to the salivary gland, or damage to the brain. You may also see uneven pupils, lethargy, and weakness. Some neurological conditions can also make it hard for your dog to swallow their saliva. If your dog has difficulty swallowing, call your vet right away.  Viral or bacterial infection: Rabies and tetanus can both cause drooling in dogs. Congenital defects: These are conditions that dogs are born with. A few examples include a hiatal hernia (when the upper section of the abdomen pushes into the chest) or portosystemic shunt, a circulatory abnormality. When to See a Vet if Your Dog Is Drooling Excessively Seek immediate veterinary help if your dog shows other signs and symptoms, such as: Vomiting or regurgitation Diarrhea Bleeding Lethargy or weakness Loss of appetite or other changes in eating behavior Changes in behavior, such as aggressiveness or whining, which can indicate pain Dizziness, head-tilting, or trouble with balance Difficulty swallowing Uneven pupils Restlessness or panting Abdominal distention Pawing at the mouth How Vets Find the Cause of Excessive Drooling in Dogs First, your vet will do a physical exam and will check your dog’s mouth and neck. They will take a full medical history if it’s not on file, including vaccinations, medications, exposure to potential poisons, and foreign objects that your dog could have eaten. Your vet may recommend certain diagnostic tests, depending on the most likely suspected cause. They may include: X-rays, CT scan, MRI, or ultrasound to examine internal organs or possible tumors Tissue biopsy to check for immune issues or tumors Treatment of Excessive Drooling in Dogs You can’t treat your dog’s excessive drooling at home. First, see your vet to determine the underlying cause. The vet can recommend the proper treatment, which could include: Dental treatment if the cause is due to periodontal disease (this may require removing teeth) Medication such as antibiotics if the cause is bacterial Surgical intervention in some cases of trauma and congenital defects Surgery, radiation, or chemotherapy may be suggested to treat tumors Pain medication and anti-inflammatory medications Medicated mouthwash (with diluted chlorhexidine or benzoyl peroxide)"}]