[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is Your Pet’s Excessive Shedding a Sign of Illness?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog%20excess%20shedding%20425509267.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog%20excess%20shedding%20425509267.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Condition, Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/your-pets-excessive-shedding-sign-illness"}, "datePublished": "February 2, 2018", "dateModified": "August 12, 2022", "description": "Like your own daily hair loss, some shedding is natural in pets. But excess shedding can be a sign of disease or illness. Learn when to seek veterinary care for your pet’s hair loss.", "articleBody": "This article was verified and edited for accuracy by Dr. Katie Grzyb, DVM on February 2, 2018. Eyes may be the windows to the soul, but skin is truly the window to the health of your pet. Our furred pets rely on hair to protect their skin, help regulate body temperature, and insulate the internal organs from cold and heat. Like your own daily hair loss, some shedding is natural in pets. Some breeds of dogs and cats naturally shed more than others, especially during seasonal changes when they are exposed to less light. But excess shedding can be a sign of disease or illness that requires veterinary care. That’s why it’s important to determine the normal shedding pattern of your dog or cat and monitor it for changes. What is Regular Shedding? The amount of shedding that is “normal” for your pet depends on many variables, including its breed, anatomy, physiology, and genetics, said Roy Cruzen, DVM, of Phoenix, AZ. The amount of shedding that is “normal” depends on the breed of dog or cat and an array of variables including anatomy, physiology and genetics, he said. Ideally an owner should determine a pet’s baseline shedding as soon as it is adopted. “It’s vital to pay close attention to our pet’s health when it is young,” said Jeff Levy, DVM, of New York, NY. “Allergies and other issues can be detected early and some preventative treatments may be available.” The notion that longhaired dogs and cats shed the most is a fallacy, said Megan Mouser. Mouser is a certified groomer and Andis Co. animal education manager in Milwaukee, WI. Shorthaired animals have denser coats and generally shed more, but the length of their hair makes it less noticeable, she said. Of course, there are no hard and fast rules, but some dogs and cats are just naturally heavy shedders, explained Cruzen. “Labrador Retrievers are shedding machines,” said Cruzen. “When a lab comes in the vet clinic for 20 minutes, we have to immediately go in and vacuum. The floor is covered with hair.” Akitas, Chow Chows, Siberian Huskys, and German Shepherds match the Lab in terms of shedding. Cat breeds that are generally heavy shedders include Persians, Russian Blues, Maine Coons, and American shorthairs. Ideally, owners should brush their dogs and cats once a day, but even once a week is helpful to remove excess hair, increase circulation to the skin and bond with the pet, said Mouser. The Causes Behind Excessive Shedding There are myriad reasons why a dog or cat sheds excessively. One of the first things to do if it occurs is to look at the animal’s hair. Does it have a healthy sheen? Does the skin beneath the fur appear normal, or is it flaky, dry, or discolored? Feeding an Imbalanced Diet “The number one reason for excessive shedding is a poor diet,” said Cruzen. “People go to discount stores, by a 40-pound bag of cheap food, and then see their pets’ shedding increase. Even though the food meets the minimum quality requirements, it may not have enough protein or nutrients for your pet.” Although you shouldn’t buy the cheapest pet food, you also don’t need to spend $8 a pound, said Cruzen. A quality pet food generally costs about $4 a pound, he estimated. “Besides the quality of food, the number one pet peeve I have is giving pets gluten-free diets,” said Pete Lands, DVM, of Plymouth Meeting, Pennsylvania. A grain-free diet may actually cause health issues in the pet, said Lands. “There are very few breeds that are gluten [i.e., grain] intolerant.” Using the Wrong Shampoo If the pet sheds excessively but you don’t believe food quality, intolerance, or allergies are to blame, consider grooming. “I cringe when people tell me they use their own shampoo on animals,” said Mouser. It’s too harsh on their skin and coats.” “Rinsing is very important,” Mouser went on to explain. “I can’t tell you the number of times I’ve wet a dog’s coat and it lathers [from leftover soap]. I tell people rinse, rinse, rinse, and when you think you’re done, rinse again.” Stress at Home All of the doctors who spoke on this agree that excessive shedding can also be caused by stress. If the pet has a major change in routine, has welcomed a new person or pet into the home, or otherwise had change in its routine, the stress from the changes can cause extra shedding. If eliminating or lessening the stress does not help, a veterinarian will consider the judicious use of drugs, supplements, and even acupuncture, said Cruzen. Something to keep in mind, however, is that for pets, a visit to the vet is a highly stressful event, said Katie Grzyb, DVM, of One Love Animal Hospital in Brooklyn, NY “Stress is the underlying cause to excessive shedding in the veterinarian’s office. Nine times out of ten an owner will note that their pet is shedding excessively during a visit to the vet.” Skin Parasites If your pet is shedding and excessively scratching, it may have fleas, ticks, or mange mites. Those parasites and the itching and scratching they cause can lead to more serious health issues, including inflammation of the skin and secondary skin infections. “If kittens have fleas, they can actually cause anemia and kill the kitten,” said Joan Vokes, a veterinary technician in Green Acres, FL. “But if your pet has fleas, check with your vet before you use any products.” Vokes recounted pet owners using over-the-counter products to kill parasites in their pets, only to cause the pet to be violently ill, in some cases with seizures. Because these parasites can hitch a ride on our clothing or come through screened windows and doors, even indoor cats and dogs can acquire skin parasites, so it’s important to talk to your vet about preventive strategies for all of your pets. Hormonal Imbalances, Tumors, and Other Underlying Diseases Excessive shedding may also be a sign of hormonal imbalances. Some breeds shed excessively after giving birth or after spaying or neutering, especially if the surgery occurs when they are older, said Levy. Shedding on various parts of the body, clumps of shedding, and skin discoloration may also be signs of an array of serious issues, including bacterial infections, ringworm and other fungal infections, thyroid disease, Cushing’s disease, skin allergies, inflammatory bowel disease, and genetically related skin problems. If the skin of the animal is dark or discolored it could be related to an endocrine imbalance, allergies, or even tumors, said Lands. He advised owners to report any loss of appetite, lethargy, or poor mental state to their veterinarians. As well as loss of appetite and excessive tiredness, Dr. Grzyb adds that other signs to look for are sudden increase in appetite, including a ravenous appetite, vomiting, or a significant increase in thirst and urination. “None of this is easy stuff to determine,” said Levy. “The most important thing to do if you suspect your pet has excessive shedding, scratching, or changes in behavior is to consult your veterinarian so we can help you determine the cause and treatment.” Read More 5 Common Dog Skin Problems 7 Common Skin Problems in Cats"}]