[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a cat and dog stay on chlorambucil?", "acceptedAnswer": {"@type": "Answer", "text": "Chlorambucil can be given in several different ways. It can be given daily for several weeks at a time, or it may be recommended to give one dose every few weeks. Your veterinarian or veterinary oncologist (veterinarian who specializes in the treatment of cancer) will advise you on what frequency and length of administration is best for your pet."}}, {"@type": "Question", "name": "How long does it take for chlorambucil to work in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Chlorambucil is rapidly absorbed into the system after only an hour. It does take time to affect the cells that they are targeting. Depending on the reason your pet is on this medication, it can take a long period of time to achieve the desired results. Your veterinarian or veterinary oncologist will advise you on what frequency and length of administration is best for your pet."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chlorambucil", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1186557870_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1186557870_0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/chlorambucil"}, "datePublished": "October 21, 2022", "dateModified": "October 21, 2022", "description": "Chlorambucil is an anti-cancer prescription medication used to treat certain types of cancers in pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Chlorambucil? Chlorambucil is a type of oral chemotherapy or anti-cancer (anti-neoplastic) drug that can be used alone or in combination with other medications to treat certain types of cancers. It treats leukemia in dogs and cats, as well as lymphoma in dogs, cats, horses and ferrets. Chlorambucil is also used as an immunosuppressant to treat certain immune mediated diseases such as inflammatory bowel disease, immune mediate hemolytic anemia, and lupus. Chlorambucil is FDA-approved for human use under the brand name Leukeran®. Chlorambucil is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. How Chlorambucil Works Chlorambucil works against cancerous cells as an alkylating agent. Alkylating agents bind to the DNA of cancerous cells and prevent them from replicating, which eventually causes death of those cells. Chlorambucil, like other types of antineoplastic agents, can affect more than just the cancer cells they are meant to target. In immune-mediated diseases, chlorambucil can also target an overactive immune system from attacking the body’s own tissues and organs. Chlorambucil Directions Follow the directions on the drug label or as provided by your veterinarian. Since this is a chemotherapeutic agent, it should not be crushed or split and is best given with food. Your veterinarian will determine the appropriate dosage for your pet. Depending on your pet’s condition, your veterinarian may provide instructions to administer this medication once every 24-72 hours, or even once every few. Missed a Dose? If you forget to give a dose of chlorambucil, contact your veterinarian to determine when you should resume your dosing schedule. Do not give extra or double doses. If it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. Chlorambucil Possible Side Effects The most common side effect of chlorambucil is suppression of the bone marrow (where new blood cells are made) which can cause low blood cell counts. Certain breeds of dogs (Poodles and Kerry Blues) may experience fur loss while on this medication. In addition, the following symptoms may occur: Vomiting Diarrhea or bloody diarrhea Loss of appetite Lack of energy Shortness of breath Abnormal bleeding Bruising Seizures If you believe your pet may be experiencing any side effects of azithromycin, consult your veterinarian. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of chlorambucil Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. Pregnant individuals should avoid contact with this medication. Wear gloves when handling this mediation and when cleaning any bodily fluids or defecations produced by your pet while they are on this medication. Discard gloves after each use. If you accidentally ingest a pet medication, immediately seek medical attention, or call the national Poison Control Center hotline at 800-222-1222. Monitoring Your veterinarian may recommend routine testing and monitoring of your pet’s blood cell counts based on your pet’s individual needs, other medications they may be prescribed, and/or the issue that initially caused your pet to be placed on this medication. Chlorambucil Overdose Information Reports of overdose of this medication are not common. Seizures and bone marrow suppression are commonly seen after an overdose in humans. Overdoses in pets may be life threatening– it is important to contact your veterinarian, immediately seek emergency veterinary care, or call animal poison control center if you suspect an overdose. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Chlorambucil Storage Chlorambucil should be stored at controlled refrigerated temperatures between 36 F to 46 F. Brief exposure to temperatures up to 86 F is acceptable. Keep the container tightly closed to protect from moisture and light. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]