[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is ciprofloxacin used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Ciprofloxacin is an antibiotic occasionally used for susceptible bacterial infections in dogs, such as skin infections and bladder infections."}}, {"@type": "Question", "name": "Do you need a prescription from your veterinarian for ciprofloxacin?", "acceptedAnswer": {"@type": "Answer", "text": "Ciprofloxacin is only available by prescription from your veterinarian."}}, {"@type": "Question", "name": "Should you give ciprofloxacin to dogs with food?", "acceptedAnswer": {"@type": "Answer", "text": "Ciprofloxacin is best given on an empty stomach. If your pet experiences signs of an upset stomach (such as vomiting and refusing to eat) after taking ciprofloxacin, subsequent doses may be given with a small amount of food. Your veterinarian will determine the appropriate dosing instructions for this medication. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/AzmanJaka"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ciprofloxacin for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1451147220.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1451147220.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ciprofloxacin-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "October 7, 2023", "description": "Ciprofloxacin is a medication often prescribed by veterinarians to treat bacterial infections in dogs and cats. Learn how ciprofloxacin works, including side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Ciprofloxacin? Ciprofloxacin is a prescription antibiotic occasionally used in animals for susceptible bacterial infections. In dogs, it may be used for skin infections or bladder infections. In cats, it may be used for bladder infections or other susceptible infections. It may also be used in fish, birds, ferrets, rabbits, rodents, and other small animals for susceptible infections. It is important to note that ciprofloxacin and other fluoroquinolone antibiotics can cause abnormal cartilage development in young, growing animals. Compared to other antibiotics in its class, ciprofloxacin is poorly absorbed. Due to these considerations, veterinarians may opt for another fluoroquinolone antibiotic that is FDA-approved for veterinary use. Ciprofloxacin is FDA-approved for human use under the brand names Cipro®, Ciloxan® (eye drops), Cetraxal® (ear drops), and the generic ciprofloxacin. Ciprofloxacin is currently not FDA-approved as a veterinary medication, and the FDA prohibits the use of ciprofloxacin in food-producing animals. However, it is occasionally utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This practice is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of ciprofloxacin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Ciprofloxacin Works Ciprofloxacin is a fluoroquinolone antibiotic, which works by disrupting DNA formation in susceptible bacteria during the replication process, thereby preventing them from growing and multiplying. Ciprofloxacin Directions Follow the directions on the drug label or per instructions provided by your veterinarian. Generally, your veterinarian will recommend providing your pet with plenty of water when they are taking ciprofloxacin. Ciprofloxacin is best given on an empty stomach. If your pet experiences signs of an upset stomach such as vomiting or refusing to eat after taking ciprofloxacin, subsequent doses may be given with a small amount of food. Before administering aquarium-safe versions of this medication to your aquatic pet, it is best to speak to your vet to identify the type of infection your fish has and assess whether this antibiotic is an appropriate treatment. Consult with your veterinarian regarding the procedures for administration of this medication.   Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of ciprofloxacin. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Ciprofloxacin Possible Side Effects Like all other antibiotics, ciprofloxacin can cause gastrointestinal side effects:  Vomiting Diarrhea Loss of appetite Lethargy Rarely, more severe side effects may occur: Urinary crystals Bladder stones Neurological symptoms such as seizures Anaphylaxis (allergic reaction) Human Side Effects Ciprofloxacin is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Due to possible side effects, pets should not be given any medicine prescribed for humans. Call Your Vet If: Severe side effects are seen (see above)You see or suspect an overdoseYour pet’s condition worsens or does not improve with treatment.You have additional questions or concerns about the use of ciprofloxacinCiprofloxacin should not be given to horses, as severe side effects can occur. Ciprofloxacin Overdose Information Since ciprofloxacin is not commonly prescribed in animals, there is not enough data available on ciprofloxacin overdoses. In general, an overdose of a medication depends on the species, the amount ingested, and for how long it was given. Symptoms of a fluoroquinolone overdose may vary and may include gastrointestinal upset and neurological symptoms such as seizures. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Ciprofloxacin Storage Ciprofloxacin should be stored at controlled room temperatures between 68-77 F with brief exposure permitted from 59-86 F. Always confirm storage requirements by reading the prescription label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]