[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for lufenuron to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Lufenuron starts working to block flea egg development within a few hours of your dog ingesting the medication, which eventually eliminates new generations of fleas in your environment. It is important to note that lufenuron does not kill adult fleas, so if you are having an active flea infestation, it is best to ask your veterinarian about the best way to control fleas for your dog."}}, {"@type": "Question", "name": "Do you need a prescription for lufenuron for your dog?", "acceptedAnswer": {"@type": "Answer", "text": "Products containing lufenuron including Sentinel® and Sentinel Spectrum® require a prescription by a licensed veterinarian. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/MelkiNimages"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lufenuron (Program®) for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1495427635.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1495427635.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/lufenuron-program-dogs-and-cats"}, "datePublished": "August 30, 2023", "dateModified": "August 30, 2023", "description": "Lufenuron is a prescription flea prevention medication for dogs and cats. Learn how lufenuron works, common medications that have lufenuron as the active ingredient, and possible side effects.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Lufenuron? Lufenuron (Program®) is a prescription FDA-approved flea prevention medication for dogs and cats. Lufenuron prevents future fleas from hatching, which eliminates new generations of fleas in the environment. In dogs, lufenuron is the active ingredient for prevention and control of flea populations in these combination products—Sentinel® Flavor Tabs (lufenuron and milbemycin oxime) and Sentinel Spectrum® (lufenuron, milbemycin oxime, and praziquantel)—which are approved for the prevention of heartworms and control of intestinal parasites. Lufenuron is effective at controlling flea populations, but it does not kill adult fleas. In the case of an active flea infestation, your veterinarian may recommend combining lufenuron with other flea-control medications that kill adult fleas. Lufenuron as a single agent is also approved for use in cats, but the over-the-counter oral products, Program® Flavor Tab and Program® oral liquid suspension, as well as the prescription veterinary injection (Program® 6 Month for Cats), are no longer available on the market. Check with your veterinarian to make sure that the medication is correct for your pet’s life stage—puppy or adulthood—and that it is within the correct weight range for your pet at the time of usage. Lufenuron combination medications are intended for puppies at a certain age, and for dogs and puppies weighing more than 2 pounds. Lufenuron Considerations It is important to note that dogs with existing heartworm infections should undergo heartworm treatment before starting Sentinel® or Sentinel Spectrum® because some dogs with heartworms can have a serious reaction to the milbemycin oxime ingredient. Speak with your veterinarian about testing your dog for heartworm infection prior to taking Sentinel® or Sentinel Spectrum®. How Lufenuron Works Lufenuron is classified as an insect growth regulator (IGR), which prevents flea eggs from developing and maturing into adult fleas. When a female flea bites a lufenuron-treated dog, it ingests the lufenuron, which targets flea eggs and prevents them from developing and hatching. Since it does not directly kill adult fleas, it is typically used in combination with other medications to treat active flea infestations. Lufenuron Directions Follow the directions on the drug label or as provided by your veterinarian. All lufenuron medications should be given with or immediately after a meal (within 30 minutes), preferably on the same date each month. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of your dog’s lufenuron combination medication. Generally, they may instruct you to give it when you remember. Ask your veterinarian about having your dog tested for heartworm infection 6 months later, as your dog may have become infected during the time the medication was not given. Lufenuron combination medications are given once a month, as close to every 30 days as possible. Do not give extra or double doses. Lufenuron Possible Side Effects Side effects are uncommon, but may include: Gastrointestinal upset – vomiting, diarrhea, anorexia Grogginess Itchy, red skin Hives Trouble breathing Seizures Allergic shock-like syndrome (anaphylaxis) in some dogs with heartworm infections Human Side Effects This medication is not intended for use in humans. If you accidentally ingest this medication, immediately seek medical attention/call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You have additional questions or concerns about the use of lufenuron Lufenuron Overdose Information Lufenuron and the combination medications that contain lufenuron have a wide margin of safety. The severity of a lufenuron overdose depends on the amount given by weight and for how long it was given. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Lufenuron Storage Lufenuron combination products such as Sentinel® and Sentinel Spectrum® should be stored at controlled temperatures of 59–77 F. Keep the medication in the provided blister pack until ready for administration in order to protect from moisture and light. Keep out of reach of children and pets."}]