[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog stay on Galliprant®?", "acceptedAnswer": {"@type": "Answer", "text": "Osteoarthritis is a chronic disease, so Galliprant® may need to be given for extended periods of time. Galliprant® should be used at the lowest does that provides adequate pain relief. It is best to speak with your veterinarian about long-term management of osteoarthritis."}}, {"@type": "Question", "name": "How long does it take for Galliprant® to work for a dog?", "acceptedAnswer": {"@type": "Answer", "text": "A noticeable improvement in your pet’s pain and inflammation is usually observed in the first few days to a week, and sometimes even up to a month after starting Galliprant®. Once the pain and inflammation has subsided, your veterinarian may recommend continuous long-term use of Galliprant® to help maintain your pet’s pain relief."}}, {"@type": "Question", "name": "Does Galliprant® make a dog sleepy?", "acceptedAnswer": {"@type": "Answer", "text": "Galliprant® does not typically make dogs sleepy, but they may experience more tiredness and seem less energetic than usual. If you notice your pet sleeping a lot more while taking this medication, please let your veterinarian know right away. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.   Featured Image: iStock.com/Brothers91    "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Galliprant® (grapiprant)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/woman-feeding-chocolate-lab-from-food-bowl.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/woman-feeding-chocolate-lab-from-food-bowl.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/galliprant-grapiprant"}, "datePublished": "July 6, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Howe explains the purpose, ingredients, and possible side effects of Galliprant® medication for dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Galliprant®? Galliprant® is a nonsteroidal anti-inflammatory drug (NSAID) used in the management of pain and inflammation associated with osteoarthritis in dogs. How Galliprant® Works Traditional NSAIDs work by suppressing prostaglandin. Prostaglandins are a group of chemicals that the body releases at sites of inflammation, tissue damage and infection. However, the effects of prostaglandins can cause several side effects including constriction of blood vessels, contraction of smooth muscles in the digestive system, and the formation of blood clots. Galliprant® does not suppress prostaglandins, but instead blocks a prostaglandin receptor which is involved in generating pain and inflammation. By not suppressing prostaglandins, blood clotting, constriction of blood vessels, and contraction muscles of the digestive system are not impacted. Galliprant® Directions Check instructions on the label and from your veterinarian. Galliprant® is usually given once a day. The lowest effective dose is recommended to be given over the shortest period of time and is dependent on your pet’s response to the medication. Avoid giving Galliprant® with food because it is best absorbed on an empty stomach. Missed a Dose? If you forget to give a dose of Galliprant®, give it when you remember and resume daily administration from that time. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Galliprant® Possible Side Effects Vomiting and DiarrheaLack of appetiteLethargySoft stool with mucusWatery or bloody stoolsHuman Side Effects This medication is not approved for use in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring Your veterinarian may recommend a complete blood count and blood chemistry panel periodically while on this medication, especially with long term use. Your veterinarian may also recommend additional routine testing depending on your pet’s individual needs and other medications they may be on. Call Your Vet If severe side effects are seen (see above) or you see or suspect an overdoseCall your vet or pharmacist if you have additional questions or concerns about the use of Galliprant®  Galliprant® Overdose Information The most common signs of overdose of Galliprant® are vomiting, loss of appetite, and changes in stool (diarrhea, soft stool, or mucus stool). Decreased levels of blood protein levels and elevations of liver related enzymes are noted especially with chronic overdosing. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Galliprant® Storage Galliprant® should be stored at controlled room temperatures at or below 86°F. Keep the container tightly closed to protect from moisture and light. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]