[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "K9 Advantix", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Flea, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/k9-advantix"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "K9Advantix is a drug used on dogs that will kill fleas, ticks, lice and sandflies, preventing many diseases in dogs. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "GENERAL DESCRIPTION Advantix is a drug used on dogs that will kill fleas, ticks, and sandflies, preventing many diseases. It contains imidacloprid and permethrin. Imidacloprid is used to control flea infestations on pets. It damages a key receptor in the central nervous system of the flea, leading to death. It is not effective against ticks. The permethrin is a manmade version of pyrethrin, which is derived from crysanthemum plants. It is used to repel and kill ticks and mosquitoes in dogs. It is unsafe to use in cats. K9 Advantix is applied to the back of the neck and quickly spreads over your pet’s body within 24 hours via the oil glands. K9 Advantix is to be applied every 30 days, preferably on the same day every month to treat and prevent fleas and other parasites. Do not give your pet Imidacloprid by mouth! To administer K9 Advantix topical solution, you want to puncture the seal on the tube using the cap. Then, spread the hair on the back of your pet’s neck above the shoulder blades to expose the skin. Squeeze and drag the entire contents of the tube onto the skin. Do not massage into skin, and do not apply to wet or broken skin. How It Works Imidacloprid penetrates the pest by direct contact or ingestion. It works by causing the degradation of the acetylcholine receptor in the flea’s nervous system. Acetylcholine is an essential neurotransmitter, and disruption of the receptor leads to impairment of the insect’s central nervous system. Most of the fleas on your pet will die within 12 hours. Permethrin works to kill ticks and other insects by binding to their nerve endings and paralyzing their central nervous system Storage Information Store at room temperature. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose or you have missed many doses, skip the missed ones and continue with the regular monthly schedule. Do not give your pet two doses at once. Notify your veterinarian that you missed a dose. Side Effects and Drug Reactions DO NOT GIVE IMIDACLOPRID TO PREGNANT OR LACTATING PETSUSE CAUTION WHEN ADMINISTERING THIS DRUG TO PETS WITH LIVER DISEASE, KIDNEY DISEASE, OR HEART DISEASEDO NOT GIVE PERMETHRIN TO CATSK9 Advantix is safe for use in dogs over 7 weeks of age.Use caution when administering this drug to aging or debilitated pets.Do not bathe or shampoo your pet for 48 hours after application.Please avoid human contact with this drug after application on your pet.K9 Advantix may result in these side effects: DroolingIrritation at application siteVomitingLethargy"}]