[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does acepromazine last in a dog or cat?", "acceptedAnswer": {"@type": "Answer", "text": "When the oral version of acepromazine is used for sedation or other stressful events, it is estimated to last approximately 1-4 hours. However, this medication can last for up to 24 hours after administration in some pets."}}, {"@type": "Question", "name": "Is acepromazine the same as Xanax®?", "acceptedAnswer": {"@type": "Answer", "text": "Xanax® is a brand-name version of the generic alprazolam, which is a benzodiazepine sedative that is often prescribed off-label to pets with anxiety or stress. Acepromazine belongs to a different class of sedatives called phenothiazines."}}, {"@type": "Question", "name": "What dogs cannot be prescribed acepromazine?", "acceptedAnswer": {"@type": "Answer", "text": "Speak with your veterinarian about the use of acepromazine in brachycephalic breeds like boxers, giant breeds, and greyhounds. In addition, your veterinarian may instruct you to avoid this medication in older pets, and those with underlying medical issues (including but not limited to liver or heart disease, epilepsy, dehydration, anemia). Your veterinarian will be able to advise on the best medication options for your pet depending on their health. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/RyanJLane"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Acepromazine Maleate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-168324806.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-168324806.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/acepromazine-maleate"}, "datePublished": "February 10, 2023", "dateModified": "May 9, 2023", "description": "Acepromazine is commonly prescribed for pets who suffer from motion sickness. Acepromazine works as a sedative to help prevent dogs from vomiting due to motion sickness.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Acepromazine Maleate? Acepromazine maleate is a prescription veterinary sedative and tranquilizer medication. The tablet form is FDA-approved for use in dogs and cats whereas the injectable form is FDA- approved for use in cats, dogs, and horses. It is most commonly used in preparation for anesthesia, because it may lower the amount of general anesthesia your pet may need. The medication should not be used in food-producing animals. The use of acepromazine in animals other than horses, dogs, and cats is considered off-label.  For example, veterinarians often prescribe acepromazine off-label as a secondary treatment for urinary blockages in cats and for laminitis in horses. The term off- or extra- label use means that a medication is used in a way or in a particular species that is not specified on the medication label.  While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether acepromazine is right for your pet. How Acepromazine Works Acepromazine has a rapid depressant effect on the central nervous system and causes sedation, muscular relaxation, and a reduction in spontaneous activity.  Generally, your veterinarian will consistently monitor your pet when receiving sedation and anesthesia. It does not provide any pain relief. Acepromazine can also help horses with laminitis by treating vasospasms through its ability to dilate small blood vessels and improve blood circulation. Certain dogs and breeds of dogs with the MDR1 gene mutation are more sensitive than other pets to this medication. Speak with your veterinarian about alternative medications or a lower dose of acepromazine if your dog has this genetic mutation. Acepromazine Directions Follow the directions on the drug label or as provided by your veterinarian. Acepromazine is most often given as an injection in a hospital setting. Speak with your veterinarian regarding specific dosage instructions when providing  acepromazine tablets, which are  generally given 45 minutes to an hour before sedation. Please contact your veterinarian if you are considering this medication as a sedative for traveling or grooming in a dog or cat, as your veterinarian may discuss alternative medications. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of acepromazine. Generally, they may instruct you give it when you remember. Do not give extra or double doses. Acepromazine Possible Side Effects Acepromazine is very effective at suppressing the nervous system and should be used only when your pet can be carefully monitored. Possible side effects include: Lethargy Weakness Low blood pressure Increased heart rate Confusion Aggression Hyperactivity Chewing Decreased tear production Reverse sneezing Seizures Protrusion of and/or the inability to retract the penis (Paraphimosis) in horses Certain dogs and breeds of dogs with the MDR1 gene mutation are more sensitive than other dogs to this medication. Alternative medications or lower doses of acepromazine should be utilized in dogs with this genetic mutation. Additional breeds and pets with underlying diseases may also benefit from alternative medications. Human Side Effects While once used in human medicine, this medication is most commonly used now in veterinary medicine. If you accidentally ingest a pet medication, call your physician, seek emergency care, or contact the national Poison Control Center hotline at 800-222-1222.  Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You pet’s condition worsens or does not improve with treatment. You have additional questions or concerns about the use of acepromazine Acepromazine Overdose Information Overdoses of acepromazine can cause depression of the nervous system, which can present as excessive sedation/lethargy, severe weakness, pale gums, incoordination, changes in pupil size, agitation, shallow breathing, collapse, or seizures. Accidental intracarotid injection in horses can cause clinical signs ranging from disorientation to convulsive seizures and death. If you suspect an overdose or an accidental intracarotid injection, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Acepromazine Storage Acepromazine should be stored at controlled temperatures between 68-77 F. Brief exposure to temperatures between 59-86 F is acceptable.  Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect it from moisture and light.  The injectable form should be used within six months of first puncture. Keep out of reach of children and pets."}]