[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is etodolac safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Etodolac can be used safely in dogs, depending on the dosage and form, but under very specific circumstances and only under direct supervision by their veterinarian. Etodolac has a narrow margin of safety, meaning that only a small amount given over the prescribed dose can result in toxic effects or poisoning. Etodolac should not be used in dogs with certain medical conditions and it can interact with some types of prescription medications. Speak with your vet first to ensure this medication is appropriate for your dog."}}, {"@type": "Question", "name": "How quickly does etodolac work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Etodolac starts working within one or two hours of administration. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/SeventyFour"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Etodolac for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1409885450.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1409885450.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Medication, Dogs, Arthritis", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/etodolac-dogs"}, "datePublished": "October 22, 2023", "dateModified": "October 23, 2023", "description": "Etodolac is a medication often prescribed by veterinarians to treat pain and inflammation associated with osteoarthritis in dogs. Learn how etodolac works in dogs, including possible side effects, how it works, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Etodolac? Etodolac is an FDA-approved prescription non-steroidal anti-inflammatory drug (NSAID) for use in dogs to relieve pain and inflammation associated with osteoarthritis. Etodolac is FDA-approved for veterinary use in dogs under the brand name EtoGesic® as an oral and injectable formulation. However, both EtoGesic® formulations have been discontinued by the manufacturer and are no longer commercially available. Etodolac is also FDA-approved for human use under the brand name Lodine® and generic etodolac, but it is important to note that the human-labeled products have a higher strength, including extended-release forms, which may not be safe for your dog. Speak with your vet first to ensure this medication is appropriate for your dog. In certain circumstances, your vet may recommend a compounded formulation of etodolac. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Etodolac Considerations Etodolac should not be used in pets who are hypersensitive to it. Etodolac should be used with caution in pets with certain medical conditions including dehydration, gastrointestinal disease, liver disease, kidney disease, heart disease, and blood clotting conditions. Giving etodolac with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. Treatment with etodolac requires monitoring and supervision by your veterinarian. Before and during your pet’s treatment, your vet will perform blood tests to evaluate the effects of the medication on the liver and kidneys, as well as eye tests to screen for dry eye disease. It is important to note that etodolac can cause toxicity in cats. Safe use of this medication has not been established or conducted at this time in dogs less than 12 months of age or in breeding, pregnant, or lactating dogs. How Etodolac Works Etodolac is classified as a non-steroidal anti-inflammatory drug (NSAID). Like other NSAIDs, it blocks the natural chemicals involved in inflammation, which offers pain relief, lessens inflammation, and reduces fever. Etodolac Directions Follow the directions on the drug label or as provided by your veterinarian. Etodolac can be given with or without food, but giving it with food can decrease the risk of digestive upset. Safety studies have not been performed in dogs less than 12 months of age or in breeding, pregnant, or lactating dogs. Do not use etodolac in cats. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of etodolac. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Etodolac Possible Side Effects Etodolac is generally well tolerated, but in rare cases serious side effects may occur, including: Gastrointestinal upset (decreased appetite, vomiting, diarrhea) Low energy (lethargy) Eye discharge and redness associated with dry eye disease (keratoconjunctivitis sicca, or KCS) Excessive bleeding during surgery Low protein levels Serious adverse reactions associated with this drug class can occur without warning and in rare situations result in death. It is important to stop therapy and contact your veterinarian immediately if you think your dog has a medical problem or side effect from etodolac. Human Side Effects Etodolac is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine that was dispensed for a human’s use. If you accidentally ingest this medication, immediately call your physician, seek medical attention, or call the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of etodolac Etodolac Overdose Information Etodolac has a narrow margin of safety, meaning that only a small amount given over the prescribed dose can result in poisoning. Overdoses of etodolac can be life-threatening and require hospitalization. Symptoms of an overdose may include nausea, vomiting, kidney failure, or liver toxicity. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Etodolac Storage Etodolac should be stored at controlled room temperatures from 68 F to 77 F. Brief exposures to temperatures from 59 F to 86 F are permitted. Keep the container tightly closed to protect this medication from moisture and light. Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]