[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is cyproheptadine used for in dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "Cyproheptadine is a human prescription antihistamine used in veterinary medicine as an appetite stimulant in cats, and sometimes as part of a treatment for a specific toxicity called serotonin syndrome in dogs and cats."}}, {"@type": "Question", "name": "Is cyproheptadine safe for dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "Cyproheptadine can be used safely in dogs and cats, but under very specific circumstances and only under direct supervision by a veterinarian. Always discuss your pet’s medications and medical conditions with your veterinarian before giving cyproheptadine, as there may be health risks to your pet if they have certain medical conditions and are taking certain medications. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/humonia"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cyproheptadine for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-523971153.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-523971153.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cyproheptadine-dogs-and-cats"}, "datePublished": "August 14, 2023", "dateModified": "October 6, 2023", "description": "Cyproheptadine is a prescription medication used by veterinarians to increase appetite in dogs and cats. Learn how cyproheptadine works, including possible side effects in dogs and cats", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Cyproheptadine? Cyproheptadine is a prescription antihistamine used as an appetite stimulant in dogs and cats as part of the treatment for a toxicity called serotonin syndrome. It is not the type of antihistamine that can provide relief for itching associated with allergies in dogs and cats or for management of asthma in cats. Cyproheptadine is FDA-approved for human use as a generic medication. It is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of cyproheptadine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Cyproheptadine Considerations Cyproheptadine should not be used in pets with certain medical conditions, such as urinary obstruction, gastrointestinal obstruction, or glaucoma (elevated eye pressure). Giving cyproheptadine with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian first. How Cyproheptadine Works When a part of the brain called the hypothalamus is exposed to serotonin, a chemical messenger, appetite is suppressed. Cyproheptadine works to block serotonin from binding to receptors of the hypothalamus, thereby causing appetite stimulation. Its serotonin blocking properties are also useful in treating serotonin syndrome, a condition where there is a buildup of excess serotonin in the brain. Cyproheptadine Directions Follow the directions on the drug label or as provided by your veterinarian. Generally, your veterinarian will recommend that cyproheptadine can be given with or without food, but providing it with food can decrease the risk of digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of cyproheptadine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Cyproheptadine Possible Side Effects Drowsiness, which tends to lessen with time Hyperexcitability (cats) Dry mouth Abnormally high heart rate Reduced ability to urinate, associated with urinary retention Human Side Effects Cyproheptadine is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of cyproheptadine Cyproheptadine Overdose Information Signs of an overdose of cyproheptadine may include sedation, hyperexcitability, seizures, dry mouth, abnormally high heart rate, reduced ability to urinate, fever, or low blood pressure. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Cyproheptadine Storage Cyproheptadine should be stored at controlled temperatures of 68–77 F. Keep the container tightly closed in order to protect the medication from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]