[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Temaril P", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/temaril-p"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Temaril-P is used to treat to dogs with bacterial infections that are already being treated with antibiotics. Come to petMD for a complete list of pet medications.", "articleBody": "General Description Trimeprazine acts as an anti-itch and cough suppressant, while prednisolone acts as an anti-inflammatory agent. Temaril-P® may be used to treat to animals with acute or chronic bacterial infections that are already being treated with antibiotics or chemotherapy. This drug is also often used to treat skin disorders of dogs. It often relieves itchiness that other drugs have been unsuccessful against. Temaril-P® is also used to treat various cough conditions of dogs including kennel cough, tracheobronchitis bronchitis including all allergic bronchitis, and coughs of nonspecific origin. How It Works Trimeprazine is an antihistamine with a sedative. Antihistamines counteract histamine, which is a chemical released to cause inflammation and itchiness as part of an allergic reaction. Prednisolone is a corticosteroid. Corticosteroids are meant to resemble a naturally occurring hormone produced in the adrenal cortex, cortisol. Corticosteroids act on the immune system by blocking the production of substances that trigger inflammatory and immune responses. Storage Information Store in a cool, dry place at room temperature. Missed Dose? Give the missed dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Trimeprazine with predisolone may result in these side effects: SedationDepressionWeaknessRestlessnessTremorsCushing’s syndrome with long-term useTrimeprazine with prednisolone may react with these drugs: DeramaxxRimadylAspirinAnti-diarrhealsAntacidsQuinidineFurosemidePhenobarbitalPlease consult your veterinarian before giving these or any other drug or herbal supplement to your pet while on Trimeprazine. Do not stop use of this drug without first consulting your veterinarian. There needs to be a gradual reduction in dosage to wean your pet off steroids. Insulin requirements in diabetic animals may need to be increased with use of this product. Consult your veterinarian before changing any insulin dosage or before giving a diabetic pet this drug. USE CAUTION WHEN ADMINISTERING THIS DRUG TO PREGNANT PETS"}]