[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What happens if my dog accidentally licks tacrolimus?", "acceptedAnswer": {"@type": "Answer", "text": "Tacrolimus can may cause issues if your pet licks or ingests tacrolimus. As a rule, don’t allow your pet to lick the area for at least 20-30 minutes after tacrolimus has been applied to avoid ingestion of the medication. If your pet has ingested tacrolimus, please contact your veterinarian or pet poison control. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tacrolimus", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-518175327.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-518175327.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/tacrolimus"}, "datePublished": "February 8, 2023", "dateModified": "February 9, 2023", "description": "Tacrolimus is often prescribed by veterinarians in dogs and cats as either a topical skin ointment or an ophthalmic eye drop.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.   What is Tacrolimus? Tacrolimus is a medication used to suppress the immune system. Veterinarians typically use tacrolimus in dogs and cats as either a topical skin ointment or an ophthalmic eye drop. Topical tacrolimus is used to treat skin diseases that arise from an overactive immune system such as lupus, pemphigus in dogs or cats, pinnal vascular disease, and perianal fistulas. Ophthalmic tacrolimus is available as an eye drop to treat keratoconjunctivitis sicca (KCS), also known as dry eye in dogs and cats. It can also be used to treat other immune eye conditions such as chronic superficial keratitis (pannus).   How Tacrolimus Works Tacrolimus suppresses T-cells of the immune system, which inhibit inflammation by preventing inflammatory signals from being communicated to the rest of the body. T-cells also play an important role in regulating tear gland function, thereby allowing for improved tear production in the treatment of dry eye. Tacrolimus is FDA-approved for human use under the brand names Protopic® and Prograf®. Tacrolimus is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of tacrolimus. A compounded ophthalmic preparation of tacrolimus is also available. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Tacrolimus Directions Follow the directions on the drug label or as provided by your veterinarian. When Tacrolimus is used as an eye medication, make sure to wash your hands before administering this medication. It is important to not touch the tip ointment tube or eye dropper to the surface of the eye, your pets&#039; eyelids, or face. If your pet is using more than one eye medication, it’s recommended to wait at least 5 minutes between medications. Always consult your veterinarian for the best order in which to use your pet’s medicines.  When tacrolimus is used as a topical ointment, it should only be applied to the appropriate skin areas as directed. Topical tacrolimus should not be used in the eyes. Pet parents should wear gloves when applying this medication. Don’t allow your pet to lick the area for at least 20-30 minutes after tacrolimus has been applied to avoid ingestion of the medication. Missed a Dose? If you forget to give a dose of tacrolimus, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Tacrolimus Possible Side Effects Potential side effects of topical Tacrolimus: Itching Irritation of the skin where the medication was applied Potential side effects of ophthalmic Tacrolimus: Irritation or itching of the eye Hair loss around the eye Twitching or spasms of the eyelids Rarely, allergic reactions to tacrolimus may occur. If you notice any vomiting, diarrhea, hives, swelling of the face or seizures while your pet is on this medication contact your veterinarian immediately. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. Pregnant women should not handle this medication. Please wear gloves when using this medication and wash your hands immediately after administering. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You have additional questions or concerns about the use of tacrolimus Tacrolimus Overdose Information Since tacrolimus is typically used in pets as a topical and medication and eye drop medication, overdoses on these formulations are rare. Symptoms of an overdose may include vomiting, lethargy, loss of appetite, diarrhea, and stomach pain. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Tacrolimus Storage Tacrolimus topical should be stored at controlled room temperature around 77 F and brief exposure to temperatures 59-86 F are acceptable. Keep the container tightly closed in order to protect it from moisture and light. Do not use this medication with your pet if the eye drops are cloudy or change color. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]