[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does GastroGard® require a prescription?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, GastroGard® requires a prescription from your veterinarian."}}, {"@type": "Question", "name": "How long can a horse stay on GastroGard®?", "acceptedAnswer": {"@type": "Answer", "text": "Your veterinarian may prescribe GastroGard® for a short period of time to treat a sudden illness, but they may also recommend that your horse be on omeprazole long term to prevent digestive tract ulceration."}}, {"@type": "Question", "name": "Is omeprazole better than Pepcid® for pets?", "acceptedAnswer": {"@type": "Answer", "text": "Omeprazole and Pepcid® (famotidine) are both medications that work to decrease stomach acid, but they do so in different ways. Omeprazole is a proton pump inhibitor (PPI) while famotidine is an H2 blocker. Veterinarians may recommend one product over another, based on what condition your pet is being treated for. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Omeprazole (GastroGard® Ulcergard®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-838016368.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-838016368.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/omeprazole-gastrogard-ulcergard"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Omeprazole is a medication prescribed by veterinarians to prevent and treat ulcers in dogs, cats, and horses.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Omeprazole? Omeprazole is a medication used in the treatment and prevention of ulcers in the stomach and upper portions of the small intestine in dogs, cats, ferrets, and horses. GastroGard® and UlcerGard® are oral paste formulations of omeprazole that are FDA-approved for use in horses and foals 4 weeks of age and older for the treatment and prevention of gastric ulcers in horses. Omeprazole is also used in dogs, cats, and ferrets off-label to treat and prevent stomach ulcers and treat gastritis. It can also be used in combination with other medications to treat Helicobacter infections or inflammatory bowel disease. The term off- or extra- label use means that a medication is prescribed for a certain use, or in a particular species, that is not specified on the medication label.  Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of omeprazole. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created  either by a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Omeprazole Works Omeprazole belongs to a class of medications called proton pump inhibitors (PPIs). Proton pumps are enzymes found in the lining of the stomach. They are responsible for starting the process of food digestion through its ability to make stomach acid. Proton pump inhibitors such as omeprazole treat ulcers and gastritis by binding to these proton pumps and blocking the production of excess stomach acid. Omeprazole Directions Follow the directions on the drug label or as provided by your veterinarian. Omeprazole is generally given by mouth once or twice a day, depending on the species and specific condition this medication is being used to treat. Omeprazole is generally best given before the first meal of the day and on an empty stomach. GastroGard® and UlcerGard® are available as oral pastes packaged in a prefilled syringe. Before administering, turn the ring on the syringe to the left and then slide the ring to the correct body weight or dose, before turning the ring back to the right to lock it. Make sure there is no feed in your horse’s mouth before administering the paste by mouth. Follow the instructions from your veterinarian to ensure you are giving the correct amount. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of omeprazole. Generally, they may instruct you to give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Omeprazole Possible Side Effects Omeprazole side effects are rare. Side effects may include: Loss of appetite Colic Vomiting Gas Diarrhea (especially in dogs) Human Side Effects While omeprazole is also a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve You see or suspect an overdose You have additional questions or concerns about the use of omeprazole Omeprazole Overdose Information Significant overdoses of this medication are unlikely to occur. Signs of an overdose include loss of appetite, vomiting, diarrhea, or colic. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Omeprazole Storage Omeprazole should be stored at controlled room temperature between 68-77 F and brief exposure to temperatures 59-86 F is acceptable. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reading the label. Keep out of reach of children and pets."}]