[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cerumene™ (Squalene)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1041029482.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1041029482.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog, Cat, Ear health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cerumenetm-squalene"}, "datePublished": "July 12, 2022", "dateModified": "August 17, 2022", "description": "Cerumene™ is commonly used to remove earwax during an ear cleaning for dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Cerumene™? Cerumene™ is an over-the-counter (no prescription needed) ear-cleaning liquid for dogs and cats. It softens and loosens earwax buildup in dog and cat ear canals. This product makes it easier to remove earwax with at-home ear cleanings or deep flushes performed by your veterinarian. When used regularly, Cerumene™ can help keep earwax from accumulating. How Cerumene™ Works Cerumene™ contains 25% squalene in a thick liquid base of mineral oil and isopropyl myristate. Squalene helps soften and loosen earwax (also known as cerumen) that has built up in a dog or cat’s ear canals. This makes it easier to remove the earwax, usually with water or another ear cleaner you can buy over the counter. If used routinely (1-2 times per month), Cerumene™ can help prevent the buildup of earwax. Cerumene™ is not an ear medication and does not treat ear infections. However, your veterinarian may recommend Cerumene™ to clean your pet’s ears before treatment with an ear medication. This may make ear medications work better by making it easier for them to reach areas of the ear canal that are blocked by debris. Cerumene™ Directions Follow the directions on the product label or as provided by your veterinarian. Ask your veterinarian to demonstrate how to clean your pet’s ears and follow their directions. Typical directions for Cerumene™ may include: Gently but firmly hold your pet’s ear at the base. Flip up the earflap to expose the opening to the ear canal.Pour a few drops of liquid Cerumene™ into the ear canal. The product is thick; only a small amount is usually necessary.Gently massage the base of the ear for several minutes.  Allow your pet to shake their head. Dislodged earwax and some ear cleaner may come out.Wipe excess ear cleaner or debris with a clean, soft cloth or cotton ball. Do not insert cotton applicators (like Q-tips®) or anything else into the ear canal.Repeat treatment as directed by your veterinarian.Stop using Cerumene™ and contact your veterinarian if your pet’s ears become red, warm, swollen, or otherwise irritated after use. Missed a Dose? If you forget to use Cerumene™, please use it again as soon as you remember and resume the schedule as directed by your veterinarian. Do not use more than directed by your veterinarian. Cerumene™ Possible Side Effects Cerumene™ is usually well tolerated and is unlikely to cause side effects. You might see oily residue from the cleaner around your pet’s ears, but this usually won’t cause a problem. Stop using Cerumene™ and contact your veterinarian if your pet’s ears become irritated, red, warm, or swollen after use. This may be a sign of an ear infection that requires treatment from a veterinarian. Signs of an ear infection include: Head shakingScratching of the ear(s)Redness, swelling, pain, or inflammation of the ear(s)Discharge, debris, or pus forming in the ear(s)Abnormal smell coming from your pet’s ear(s)Human Side Effects This product is not intended for use in humans, hand washing after prolonged contact with this product is recommended. If you accidentally ingest this medication, use this medication in your own ear or if you develop skin irritation after contact with this product, please call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Your pet’s ears become red or inflamed after using Cerumene™You notice any of the side effects listed aboveYou gave Cerumene™ to your pet by mouth, or you see them drink it (considered an overdose)You have additional questions or concerns about the use of Cerumene™Cerumene™ Overdose Information Cerumene™ should only be used in your pet’s ears. If you give it by mouth or if your pet otherwise consumes Cerumene™ contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Cerumene™ Storage Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/Group4 Studio"}]