[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fluid Therapies for Dogs and Cats at Home", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-104629419.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-104629419.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "General health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/fluid-therapies-dogs-and-cats-home"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Dr. Stephanie Howe explains why fluid therapies are prescribed to dogs and cats at home, common fluid therapies prescribed, and conditions fluid therapies can treat.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Are Fluid Therapies for Home Use for Dogs and Cats? When a pet is dehydrated from an illness and cannot sufficiently rehydrate by drinking water, your veterinarian may recommend that you give your dog or cat fluid prescription fluid therapy at home. This is commonly accomplished by administering fluids subcutaneously (under the skin) of your pet so it can be absorbed into the body and treat their dehydration. The most common use for fluid therapy at home is to treat dehydration caused by kidney disease in cats and kidney disease in dogs. Other common reasons your vet may recommend subcutaneous fluids to your pet at home include cancer, chronic constipation, or other diseases that cause chronic vomiting and diarrhea. Types of Fluid Therapies for Pets There are several types of prescription fluids that can be used at home, as prescribed by your veterinarian. The type of fluid used would depend on your pet’s condition and the results of their recent blood work. Lactated Ringer’s (LRS) (Injection, USP) Contains the electrolytes sodium, chloride, potassium, and calcium Also contains lactate (a buffer to prevent the fluids from being too acidic) Most common fluid used for subcutaneous fluid therapy at home Sodium Chloride  (Injection, USP) Contains the electrolytes sodium and chloride May be used if your pet’s potassium levels are high or sodium levels are low Normosol-R (multiple electrolytes injection type 1, USP) Contains the electrolytes sodium, potassium, chloride, and magnesium Also contains acetate and gluconate (a buffer to prevent the fluids from being too acidic) May sting more than LRS when administered to your pet While these drugs are FDA-approved for human use, they are not FDA-approved as a veterinary drug. However, it is common practice for veterinarians to prescribe such drugs for use in dogs and cats. Veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use is not described on the drug label. How Fluid Therapies Work Subcutaneous fluid therapy works by providing fluids into the space under a pet’s skin where it can be slowly absorbed by the body and into the bloodstream. This can prevent or treat mild dehydration. Fluid Therapy Directions The type, amount, and frequency of subcutaneous fluids you can administer to your pet at home will depend on their individual condition. Your veterinarian will decide the best type of fluid for your pet, based on its bloodwork results. Follow your veterinarian’s directions closely regarding how much fluid to administer and how often. Fluids may be administered on an as-needed basis (ranging from weekly to several times daily), depending on your pet’s individual needs. For most pets, subcutaneous fluids can be given under the skin of the back or anywhere from the shoulder blades to the hips. Your veterinarian can give you a demonstration of how to give fluids at home and  you can reference this helpful guide. Administration sets (the flexible tubing line that goes between the bag of fluids and the needle) should not be used for multiple bags of fluids unless directed otherwise by your veterinarian. A new needle should be used each time you administer fluids to your pet. Missed a Dose? Speak with your veterinarian about what to do if you forget to administer a dose of subcutaneous fluids. Generally, they may advise you to give it when you remember, or if it is almost time for your dose, to skip the missed dose and resume your normal administration schedule. Do not give extra or double amounts of fluids. Fluid Therapy Possible Side Effects The following mild side effects are common and typically resolve on their own: Stinging or burning sensation where the fluids were given Fluid buildup under the skin (which should go away within 24 hours) Pets may hide for awhile after their fluids are given Clear or slightly blood tinged fluid may escape from where the fluids were given Side effects that may need follow up care include: Fluid accumulation that doesn’t go away Redness, inflammation, pain, or discolored drainage at the administration site Coughing Difficulty breathing Lethargy Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of subcutaneous fluids Fluid Therapy Possible Overdose Information Overdoses of subcutaneous fluid therapy are uncommon but they can occur, especially in pets with heart disease.  Pets with heart disease are especially sensitive to excess fluids in the bloodstream. If you have accidentally given your pet more fluids than was recommended, especially if more than once, contact your veterinarian or nearest emergency veterinary facility immediately. Monitor your pet for swelling of the limbs, increased respiratory rate, or trouble breathing. If you observe any of these symptoms, contact your veterinarian or nearest emergency veterinary facility immediately. Fluid Therapy Storage Fluids should be stored at controlled room temperatures between 68–77 F. Always confirm storage temperatures by reading the label. Opened fluid bags and the administration sets should be discarded every five to seven days or as directed by your veterinarian. Administration sets should not be used for multiple bags of fluids unless directed otherwise by your veterinarian. A new needle should be used each time you administer fluids to your pet. Keep out of reach of children and pets. Empty fluid bags and lines can be disposed of in the regular trash. Dispose of spent needles in accordance with federal, state, and local environmental regulations. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/breakstock"}]