[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "May I stop fludrocortisone suddenly for my pet?", "acceptedAnswer": {"@type": "Answer", "text": "No, do not abruptly stop giving this medication, as serious side effects may occur. Changes in the dosing of this medication should only be at the direction of your veterinarian."}}, {"@type": "Question", "name": "Are there any other medications that could interact with fludrocortisone?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, there are some medications and treatments that could be affected when your pet is on fludrocortisone. Please discuss any other medications your pet is on with your veterinarian. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fludrocortisone Acetate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_229778970.jpeg.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_229778970.jpeg.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/fludrocortisone-acetate"}, "datePublished": "April 10, 2023", "dateModified": "April 10, 2023", "description": "Fludrocortisone acetate is a prescription medication commonly prescribed by veterinarians to manage Addison&#039;s Disease in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Fludrocortisone Acetate? Fludrocortisone acetate is a mineralocorticoid prescription medication used off-label in the treatment of hypoadrenocorticism, also called adrenal gland insufficiency or Addison’s Disease, in dogs and cats. Fludrocortisone may also be useful in ferrets that have had an adrenal gland removed. How Fludrocortisone Acetate Works The adrenal glands produce several types of chemical messengers and two types of natural steroids: mineralocorticoids and glucocorticoids. Mineralocorticoids are important in directing the kidney to properly regulate electrolytes and water levels in the body. Glucocorticoids are responsible for producing the hormones and steroids the body needs for “fight or flight”-type responses. In pets with hypoadrenocorticism, the adrenal glands do not produce enough of these steroids. Fludrocortisone is a synthetic corticosteroid that replaces some of both of those types but is much stronger at replacing mineralocorticoids. Fludrocortisone is FDA-approved for human use under the brand name Florinef® and the generic fludrocortisone. Fludrocortisone is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals under certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of fludrocortisone. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Fludrocortisone Acetate Directions Follow the directions on the drug label or as provided by your veterinarian. Fludrocortisone is generally given once to twice a day. Fludrocortisone can be given with or without food, but if your pet has digestive upset when taking this medication on an empty stomach, try giving it with a small meal. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of fludrocortisone. Generally, they may advise you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Fludrocortisone Acetate Possible Side Effects Side effects of fludrocortisone are generally related to its effects on the adrenal glands and its ability to help the body to produce its own natural steroids and can include: Increased thirst and urination Increased appetite Weight gain Swelling of the abdomen Thinning of the hair coat If a pet is on a dose of fludrocortisone that is too low, you may see continuing signs of hypoadrenocortism, which may include: Vomiting Weakness Loss of appetite Diarrhea Fludrocortisone should be used with caution in pregnant pets or those with heart failure, kidney disease or swelling. Human Side Effects While fludrocortisone is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest fludrocortisone prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of fludrocortisone Fludrocortisone Acetate Overdose Information Overdoses of this medication can be serious. Life-threatening changes in your pet’s electrolytes are possible. Swelling of the limbs, high blood pressure, and general weakness can be seen. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Fludrocortisone Acetate Storage Fludrocortisone should be stored at controlled room temperatures between 68-77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect it from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]