[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Banamine®( Flunixin meglumine, Prevail®, Vetameg®, Flu-nix®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1020236188.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1020236188.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Horse, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/banamine-flunixin-meglumine-prevail-vetameg-flu-nixr"}, "datePublished": "November 7, 2022", "dateModified": "March 16, 2023", "description": "Banamine® is an FDA approved NSAID prescription medication, helping to alleviate inflammation and pain associated with various disorders in horses.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Banamine®? Banamine® is an FDA approved non-steroidal anti-inflammatory (NSAID) prescription medication. It is available in a paste form or as an injection. In horses, Banamine® is FDA approved for the alleviation of inflammation and pain associated with musculoskeletal disorders, as well as alleviation of visceral pain associated with colic. In cattle, flunixin is FDA approved as indicated for the control of pyrexia associated with bovine respiratory disease, endotoxemia and acute bovine mastitis, as well as for the control of inflammation in endotoxemia. Flunixin is also used off-label in other species (like goats, ferrets, and rabbits) in the treatment of various illnesses. The term off-or extra- label use means that a medication is used in a way, or in a particular species, that are is specified on the medication label. How Banamine® Works Flunixin is a non-selective NSAID. It blocks the body’s COX- 2 pathway, which lowers the production of natural chemicals that trigger inflammation, thereby reducing fever and offer pain relief. Due to its non-selective property, flunixin also blocks the COX-1 pathway which causes the side effects associated with digestion, kidney health, and clotting. Banamine® Directions Follow the directions on the drug label or as provided by your veterinarian. Dosing varies greatly by species and the disease process for which the medication is being used. Directions will also vary based on the route you have been instructed to give this medication. While the injectable version of Banamine® is labeled for intravenous (IV) or intramuscular usage (IM), IM usage can cause clostridial myositis (see side effects section for more information) and is not recommended despite this route being on the drug label. In horses, the paste form of flunixin, such as Banamine® paste, is generally given orally once daily or the total dose can be divided and given twice daily. The dose is based on a horse&#039;s weight and is generally recommended for a maximum of 5 days in a row. When using Banamine® in dairy cows or beef cows a withdrawal period is needed after use of this medication. The withdrawal period for milk is 36 hours and for slaughter is four days. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of flunixin. Generally, they will advise you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Banamine® Possible Side Effects Most animals tolerate the use of flunixin well. If your animal has been given an injection of this medication into the muscle, monitor the injection site for: Swelling Redness Stiffness Wound formation A rare side effects in horses include a condition called clostridial myositis. This occurs when a type of bacteria called Clostridia grow on damaged muscle caused by the injection. Intramuscular administration of flunixin is not typically preferred in horses because a Clostridia infection can cause muscle inflammation and release toxins into the body, which can be life threatening. Intramuscular administration of flunixin is not permitted for use in animals intended for human consumption. Patients treated with this medication for long periods of time are at an increased risk for: Stomach ulcers Colonic ulcers Kidney damage This medication should not be given into an artery. Injection into an artery may cause: Incoordination Difficulty walking/stumbling Increased breathing rate Muscle weakness Hysteria Seizure or death if a horse has a traumatic backward flip or fall It is important to note that if your animal does not respond to the first dose of flunixin, then it is not likely to control their pain or symptoms. Speak with your veterinarian to discuss other options if your animal is not showing improvement on this medication. If you believe your animal may be experiencing any side effects, consult your veterinarian.  Human Side Effects Banamine® is not intended for use in humans. If you are administering the transdermal version of this medication, ensure that you are using gloves and eye protection. Wash your hands after administration. If you get this medication in your eyes, immediately flush them with water and seek medical attention. If you accidentally ingest a pet medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for Banamine® but your veterinarian may recommend routine testing depending on your animal’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your animal&#039;s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of flunixin Your animal is not responding to this medication Banamine® Overdose Information A Banamine® overdose can increase the risk for stomach ulcers, colonic ulcers, and kidney damage. Fresh blood in the stool or signs of colic may be a sign of an overdose. If you suspect an overdose or a small animal got into this medication, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Banamine® Storage Please see individual packaging for product-specific storage recommendations. Flunixin Paste should be stored at controlled temperatures less than 77 F. Do not freeze. Carefully dispose of used needles in accordance with all federal, state, and local environmental laws. Keep out of reach of children and pets."}]