[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for leflunomide to work in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Speak with your veterinarian regarding the use of leflunomide for your pet. Generally, leflunomide starts working in your pet within a few hours, but it can take several weeks to see a response in your pet’s symptoms. Generally, you may see improvements in 1-3 weeks, but initial dosing usually continues for at least 6 weeks. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Leflunomide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1291555222.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1291555222.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/leflunomide"}, "datePublished": "February 27, 2023", "dateModified": "February 27, 2023", "description": "Leflunomide is an immunosuppressant that is often prescribed by veterinarians to treat certain conditions in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Leflunomide? Leflunomide is a prescription immunosuppressant—a medication that suppresses the immune system. In dogs, it is sometimes used to treat immune mediated hemolytic anemia (IMHA), polyarthritis, or rheumatoid arthritis. It can also be used in combination with other medications to treat polyarthritis or rheumatoid arthritis in cats. Leflunomide is also used as an alternate or additional immunosuppressant in cats or dogs that are not responding to or are experiencing side effects from other immunosuppressant medications. How Leflunomide Works Leflunomide works by breaking down teriflunomide into its active form in the body. Teriflunomide addresses the overproduction of immune cells by specifically blocking the formation of DNA and RNA in replicating lymphocytes of the immune system that are responsible for swelling and inflammation. While leflunomide is FDA-approved for human use under the brand name Arava® and its generic name, leflunomide, it is currently not FDA-approved as a veterinary medication.  However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of leflunomide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Leflunomide Directions Follow the directions on the drug label or as provided by your veterinarian. Generally, leflunomide is given by mouth once daily with or without food. If digestive upset occurs when giving this medication on an empty stomach, speak with your veterinarian. They may recommend giving it with a small meal. Speak with your veterinarian regarding specific dosage instructions for your pet, as they may reduce the dose over time based on your pet&#039;s response to this medication. Pregnant women and those who may become pregnant should avoid contact with this medication due to the risk of birth defects. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of leflunomide. Generally, they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Leflunomide Possible Side Effects Side effects are rare with this medication but may include: Diarrhea Lethargy Unexplained bleeding or bruising Blood in urine Liver irritation Vomiting Lack of appetite Difficulty breathing Coughing Rectal bleeding By suppressing the immune system, leflunomide can make your pet more susceptible to infections. Immediately contact your veterinarian or seek emergency care if your pet is lethargic, has a fever, or experiences any vomiting or diarrhea, as these can be symptoms of an infection. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest medication prescribed for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Generally, your veterinarian may recommend bloodwork and liver monitoring while your pet is on this medication. Your veterinarian may also recommend other forms of monitoring and tests depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of leflunomide Leflunomide Overdose Information Since this medication is rarely used in veterinary medicine, exact overdose signs are unknown. Signs may include vomiting, diarrhea, lethargy, lack of appetite, difficulty breathing, and unexplained bleeding or bruising. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Leflunomide Storage Leflunomide should be stored at controlled room temperatures up to 77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]