[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What are the side effects of phenoxybenzamine in cats?", "acceptedAnswer": {"@type": "Answer", "text": "Side effects of phenoxybenzamine in cats include gastrointestinal upset (nausea, vomiting), weakness due to low blood pressure (hypotension), high blood pressure (rebound hypertension), abnormally small pupils of the eyes (miosis), increased eye (intraocular) pressure, fast heart rate, sinus congestion, and loss of balance (ataxia). No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Kateryna Kukota"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Phenoxybenzamine for Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1154784657.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1154784657.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/phenoxybenzamine-cats"}, "datePublished": "September 15, 2023", "dateModified": "September 15, 2023", "description": "Phenoxybenzamine is a prescription medication used to help relax muscles during urinary obstructions in cats. Learn how phenoxybenzamine works, common side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Phenoxybenzamine? Phenoxybenzamine is a prescription medication used in cats as a urethral muscle relaxer (antispasmodic) to treat urethral obstruction—a life-threatening medical emergency where a cat cannot empty their bladder due to blockage of the urethra. Phenoxybenzamine can take several days to take effect, so it is often used in combination with other antispasmodics such as prazosin. Phenoxybenzamine is FDA-approved for human use under the brand name Dibenzyline® and generic phenoxybenzamine. Phenoxybenzamine is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of phenoxybenzamine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Phenoxybenzamine Considerations Phenoxybenzamine should not be used in pets with certain medical conditions, such as low blood pressure (hypotension) or increased eye pressure (glaucoma), or in pets who are hypersensitive to it. Phenoxybenzamine should be used with caution in pets with heart disease, heart failure, and kidney disease. Giving phenoxybenzamine with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian, who will determine whether this medication is right for your pet. How Phenoxybenzamine Works Phenoxybenzamine is categorized as an alpha-1 antagonist. It blocks the alpha-1 receptors in the muscles of the urethra, causing them to dilate (relax). Cats with urethral obstruction experience harmful urethral muscle spasms and constriction (narrowing). By relaxing the constricted muscles in the urethra, phenoxybenzamine makes it easier for the urine to pass through and be excreted out. Phenoxybenzamine Directions Follow the directions on the drug label or as provided by your veterinarian. Phenoxybenzamine can be given with or without food, but giving it with food can decrease the risk of digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of phenoxybenzamine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Phenoxybenzamine Possible Side Effects Possible side effects of this medication include: Nausea Vomiting Weakness due to low blood pressure (hypotension) High blood pressure (rebound hypertension) Abnormally small pupils of the eyes (miosis) Increased eye (intraocular) pressure Fast heart rate Nasal congestion Loss of balance (ataxia)   Phenoxybenzamine has a moderate duration, so its side effects may last for several days, even after you have stopped administering this medication to your pet. Side effects may last for a longer time in animals with liver or kidney disease Human Side Effects If you are allergic to phenoxybenzamine, talk to your veterinarian about using another medication or ensure that you wear gloves while in contact with this medication. Phenoxybenzamine is also a prescription medication for humans, frequently with dosages that differ from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human’s use. If you accidentally ingest this medication, immediately seek medical attention, call your physician, or call the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of phenoxybenzamine Phenoxybenzamine Overdose Information Signs of an overdose of phenoxybenzamine may include low blood pressure, loss of balance, fainting, abnormally fast heartbeat, vomiting, and lethargy. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Phenoxybenzamine Storage Phenoxybenzamine should be stored at controlled room temperature of 77 F.  Brief exposure to temperatures from 59 F to 86 F are permitted. Keep the container tightly closed in order to protect its contents from moisture and light. Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]