[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sulfamethoxazole/Trimethoprim (Bactrim®, Bactrim DS®, Sulfatrim®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1280731587.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1280731587.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/smz-tmp"}, "datePublished": "August 23, 2022", "dateModified": "October 11, 2023", "description": "SMZ-TMP can be used in animals to treat urinary tract infections, respiratory tract infections, infected wounds, abscesses, and other bacterial infections.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Sulfamethoxazole/Trimethoprim (SMZ-TMP)? Some antibiotics contain more than one drug because the combined product works better than the individual drugs alone. Sulfamethoxazole/trimethoprim (also known as SMX-TMP or SMZ-TMP) is a combination of two antibiotics: sulfamethoxazole and trimethoprim. SMZ-TMP is FDA-approved for human use under the brand names Bactrim®, Bactrim DS®, and Sulfatrim®. SMZ-TMP is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label SMZ-TMP can be used in animals to treat urinary tract infections, respiratory tract infections, infected wounds, abscesses, or other bacterial infections. It also treats certain parasitic and fungal diseases in animals such as neosporosis, toxoplasmosis, pneumocystis, and American canine hepatozoonosis. Certain forms of TMS are FDA approved for use in horses, while other versions are only FDA approved for use in humans but are very commonly used in horses, dogs, and cats in an off-label capacity SMZ-TMP has the potential to cause serious side effects, especially in Doberman Pinschers, Samoyeds, and miniature schnauzers. Your veterinarian will weigh the risk of side effects against the benefits of treatment before prescribing this drug. How Sulfamethoxazole/Trimethoprim (SMZ-TMP) Works SMZ-TMP is a type of medication called a potentiated sulfonamide. This class of drugs treats many types of bacteria and some parasites by interfering with the production of folic acid in bacteria. Since folic acid is necessary to make DNA, and without it bacterial cells cannot multiply, SMZ-TMP treats infections by eliminating the ability of those bacteria and parasites to multiply.    Sulfamethoxazole/Trimethoprim (SMZ-TMP) Directions Follow the directions provided by your veterinarian. Your veterinarian will prescribe a dosage based on your pet’s weight and the type of infection and may need to perform certain laboratory tests to determine if SMZ-TMP is appropriate for your pet. If using the liquid formulation, shake the bottle well before use. The liquid suspension usually does not need to be refrigerated but follow the label directions for storage. You may give SMZ-TMP with or without food. However, giving it with a small amount of food may help reduce digestive upset, including vomiting. Contact your veterinarian if you have difficulty giving SMZ-TMP to your pet. They can give you tips on how to make administration easier and less stressful. Cats usually do not like the taste of sulfamethoxazole/trimethoprim, so hiding the medication in a small amount of food may help cats take the medication without tasting it. If they taste the medication, they may drool excessively. Make sure that your pet always has access to water. It is important that your pet does not become dehydrated while taking SMZ-TMP. Do not skip doses or give less medication than is prescribed. Give SMZ-TMP for the full treatment period prescribed by your veterinarian. In most cases, the signs of infection will be absent for the last few days of treatment. It is still important to finish the treatment course even if your pet looks like it has recovered from the infection. Giving antibiotics at smaller doses or for a shorter period than prescribed can result in recurrent infections and antibiotic-resistant bacteria. Missed a Dose? As with any type of antibiotic, it is important to not to miss a dose of sulfamethoxazole/trimethoprim. However, if you forget a dose, give one when you remember and resume your dosing schedule. If it is within six hours of the next dose, skip the missed dose and resume your regular schedule. Do not give extra or double doses. Sulfamethoxazole/Trimethoprim (SMZ-TMP) Possible Side Effects Although SMZ-TMP is usually well tolerated, but there are several potential side effects. Your veterinarian will weigh the risk of these side effects against the benefits of using this drug. Some of these side effects can be severe or irreversible. Side effects of SMZ-TMP in dogs may include: Dry eye (keratoconjunctivitis sicca or KCS). Signs may include discharge, squinting, or redness of the eyesAllergic reactions (including anaphylaxis) and hypersensitivitiesHives (small, raised lumps that suddenly pop up on the skin)Facial swellingTrouble breathingLiver or gall bladder diseaseYellowing of the gums, skin, and the whites of the eyesVomitingDecreased appetiteDiarrheaFeverDestruction of red blood cells (hemolytic anemia)Decreased energy level or weaknessPale gum colorJoint pain and inflammationIncreased thirst or urinationMicroscopic crystals, stones, or blood in the urineLow thyroid hormone (hypothyroidism)Low blood cell numbers (rare)Cats may also have side effects from SMZ-TMP. Side effects in cats may include: Decreased appetiteExcessive droolingMicroscopic crystals, stones, or blood in the urineLow blood cells numbersContact your veterinarian if your pet develops any new or worsening signs after starting sulfamethoxazole/trimethoprim. Call Your Vet If Side effects are seen (see above) or if you see or suspect an overdoseCall your vet or pharmacist if you have you have additional questions or concerns about the use of sulfamethoxazole/trimethoprimSulfamethoxazole/Trimethoprim (SMZ-TMP) Overdose Information Overdosage of sulfamethoxazole/trimethoprim can cause serious complications. Emergency treatment is often necessary. Signs can include decreased activity, depression, vomiting, diarrhea, facial swelling, and low blood cell levels. If you suspect an overdose, immediately contact your veterinarian, a 24-hour emergency veterinarian, or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Sulfamethoxazole/Trimethoprim (SMZ-TMP) Storage There are a variety of formulations of sulfamethoxazole/trimethoprim available. Check the label for storage instructions for your medication. Most products should be stored at room temperature between 59°-77°F (15°-25°C). Keep lid tightly closed and protect from freezing. The liquid suspensions typically do not need to be refrigerated, but review the label for storage instructions. Shake liquid well before use. Follow the directions provided on the label. Keep all products out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/fotografixx"}]