[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does Onsior® pain relief last?", "acceptedAnswer": {"@type": "Answer", "text": "Onsior® is designed to be given every 24 hours and should provide pain relief to your pet for that timeframe. If your pet seems to still be in pain while on this medication, please contact your veterinarian to explore additional pain control options or alternatives."}}, {"@type": "Question", "name": "Does Onsior® make pets drowsy?", "acceptedAnswer": {"@type": "Answer", "text": "Onsior® should not make your pet drowsy. A side effect of this medication can be lethargy but not sleepiness. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/DOUGBERRY"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Onsior® (robenacoxib)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-827788132.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-827788132.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/onsior-robenacoxib"}, "datePublished": "February 10, 2023", "dateModified": "February 10, 2023", "description": "Onsior® is commonly prescribed by veterinarians for pain relief post surgery in dogs and cats", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Onsior®? Onsior® (robenacoxib) is a non-narcotic, non-steroidal anti-inflammatory (NSAID) prescription medication, available in tablet form or as an injection. Onsior® is FDA-approved for use in cats to control postoperative pain and inflammation associated with orthopedic surgery, ovariohysterectomy, and castration in cats 4 months and older (and greater than 5.5 pounds if using tablets), for a maximum of three days. In dogs, Onsior® is FDA-approved for the control of postoperative pain and inflammation associated with soft tissue surgery in dogs greater that 4 months of age, for up to a maximum of three days. Onsior® is also utilized off-label for the treatment of pain and inflammation that occurs with osteoarthritis in dogs and cats. This is called extra-label or off-label use because this use isn’t described on the drug label. Note, the doses of Onsior® tablets and injection are different. How Onsior® Works Onsior® is a selective NSAID that is subcategorized as a COX-2 inhibitor. Like other NSAIDs, it blocks the body’s COX-2 pathway, which lowers the production of natural chemicals that trigger inflammation, thereby offering pain relief. Due to its selectivity for the COX-2 pathway, Onsior® typically spares the COX-1 pathway, which is associated with digestion, kidney health and blood clotting. This selectivity is beneficial because it causes fewer side effects compared to traditional NSAIDs. However, it’s important to note that at high doses, Onsior® can still partially block these beneficial chemicals, so it’s important to follow your veterinarian’s directions exactly. Onsior® Directions Follow the directions on the drug label or as provided by your veterinarian. Onsior® may initially be administered to your dog or cat as an injection in the hospital. Future doses can be given as an oral tablet or injection, with or without food. It is important to remember that Onsior® can be given for a maximum of three (3) days. Further, subject to your veterinarian’s instructions, do not administer Onsior® in conjunction with any other oral or injectable NSAID or corticosteroid. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Onsior®. Generally, they may advise you to give it when you remember. However, because this medication is only supposed to be administered once a day for a maximum of three (3) days, your vet may instruct you to wait if it is almost time for the next dose, or to give the dose when you remember a full day before administering the next dose. Do not give extra or double doses. Onsior® Possible Side Effects Like other NSAIDs, side effects with Onsior® may include: Vomiting Diarrhea Decreased appetite Blood in the stool or vomit Dark or tarry stool Weight loss Kidney injury When Onsior® is given to a pet after a surgery, additional symptoms may include: Bleeding from the incision site Irritation or infection at the incision site Increased bruising Human Side Effects This medication is not for use in humans. If you accidentally ingest or inject this medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Onsior® Onsior® Overdose Information Overdoses of Onsior® can cause toxicity in the digestive system, kidneys, and liver like other NSAIDs. Symptoms may include vomiting, lethargy, diarrhea, loss of appetite, blood in the vomit or feces, dark or coffee ground stool, increased thirst or urination, or bloody urine. If you suspect an overdose, stop administration of Onsior® and immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Onsior® Storage Onsior® tablets should be stored at controlled room temperatures between 59-77 F. Onsior® injection should be stored in the refrigerator between (36 F-46 F) in its original packaging. Use within 12 weeks of first puncture. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect from moisture and light. Keep out of reach of children and pets."}]