[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take voriconazole to work in a dog and cat?", "acceptedAnswer": {"@type": "Answer", "text": "Voriconazole starts working in a dog’s system within the first three hours, but it can take much longer before improvements in their condition can be observed.  Voriconazole is rarely used in cats due to the possibility of severe side effects. When used, it starts to work within the body within the first two hours, but in general, improvement from fungal or yeast infections can take longer. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Snizhana Galytska"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Voriconazole", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1417898883.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1417898883.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Bird, Reptile, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/voriconazole"}, "datePublished": "May 23, 2023", "dateModified": "September 10, 2023", "description": "Voriconazole is a medication prescribed by veterinarians to treat fungal and yeast infections in dogs, horses, birds, and reptiles.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Voriconazole? Voriconazole is an antifungal medication used to treat fungal or yeast infections in dogs, horses, birds, reptiles, and rarely cats. Voriconazole is rarely used for bodywide (systemic) infections from organisms such as Cryptococcus, Valley Fever (coccidioidomycosis), Aspergillus, and blastomycosis. Cats are prone to severe side effects with voriconazole such as liver toxicity, which is why it is not commonly prescribed for cats. Other antifungals, like itraconazole or fluconazole, have fewer side effects and may be recommended as an alternative to voriconazole. How Voriconazole Works Voriconazole works as an antifungal medication by interrupting the fungus’s ability to create an enzyme needed to produce its cell membrane. This blocks its metabolism and growth. Voriconazole is FDA-approved for human use under the brand name Vfend® and the generic voriconazole. Voriconazole is currently not FDA-approved as a veterinary medication. However, while it is infrequently used in the veterinary field, veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your veterinarian may recommend a compounded formulation of voriconazole. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Voriconazole Directions Follow the directions on the drug label or as provided by your veterinarian. Since food may decrease the absorption of voriconazole, it is best given on an empty stomach, at least one hour before or after a meal. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of voriconazole. They may instruct you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Voriconazole Possible Side Effects Since this medication is rarely used in veterinary medicine, not all side effects with this medication are known. Some pets may be more sensitive to this medication than others and experience greater side effects. For example, cats are more prone to experiencing voriconazole’s severe side effects, which is why it is not often prescribed for cats.   Side effects may include: Vomiting Diarrhea Loss of appetite Weight loss Lethargy Incoordination Liver irritation Symptoms of liver irritation may include: Vomiting Loss of interest in food Yellow gums, skin or whites of the eyes Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a medication prescribed for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of voriconazole Voriconazole Overdose Information Since voriconazole is not commonly used in veterinary medicine, not all signs of a possible overdose are known. Signs to monitor may include vomiting, diarrhea, drooling, pupil dilation, light aversion, lethargy, difficulty breathing or seizures. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Voriconazole Storage Voriconazole tablets should be stored at controlled room temperatures between 59–86 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect its contents from moisture and light.   Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]