[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vetsulin® (porcine insulin zinc suspension)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-514405108.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-514405108.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Diabetes", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/vetsulin"}, "datePublished": "January 23, 2023", "dateModified": "January 23, 2023", "description": "Vetsulin® is an FDA approved insulin that is used to treat diabetic dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Vetsulin®? Vetsulin® is an FDA-approved insulin administered to diabetic dogs and diabetic cats for the treatment and prevention of diabetes mellitus (high blood sugar). It is an injectable version of insulin, a hormone normally produced by a pet&#039;s pancreas that helps move glucose (a small sugar molecule) from the bloodstream and into the cells where it can be utilized as energy. How Vetsulin® Works Vetsulin® is made by combining purified porcine insulin and recombinant DNA (crystalline zinc). This combination allows insulin to start acting quickly and last longer than other types of insulin. Vetsulin® has the most impact on blood glucose about 4-8 hours after administration and can last for up to 14-24 hours. This places Vetsulin® in the category of an intermediate-acting insulin. Vetsulin® Directions It is important that you follow the directions on the label or as provided by your veterinarian. Your veterinarian will determine your pet’s initial dose and dosing schedule based on their body weight. In dogs, the initial dose should be given once daily with, or right after, a meal. Twice daily therapy may be needed if the duration of insulin action is determined to be inadequate. In cats, the recommended starting dose is 1 to 2 IU per injection, twice daily at 12-hour intervals. For cats fed twice daily, the injections should be given concurrently with, or right after, each meal. For cats fed ad libitum, no change in feeding schedule is needed. Consistent timing of medications and feeding are key to control your pet’s blood glucose. Your veterinarian should reevaluate your pet at appropriate intervals and adjust the dose as needed. It is very important that your insulin syringes match the concentration of the insulin that you have for your pet. Insulin comes in two concentrations: U-40 (40 units of insulin per mL) or U-100 (100 units of insulin per mL). Vetsulin® only comes as U-40, so it is imperative that the syringes match and are labeled as U-40. Using the incorrect syringe type will cause your pet to receive an incorrect dose of insulin. Unlike other types of insulin, when you remove Vetsulin® from the refrigerator you must shake (not roll) the vial thoroughly until it becomes an even milky color before drawing up the proper dose for administration. Foam on the surface of the suspension formed during shaking should be allowed to disperse before the product is used. Clumps or white particles can form in insulin suspensions: do not use the product if visible clumps or white particles persist after shaking thoroughly. General directions for insulin administration can be found here. Vetsulin® is also available in a pen form called VetPen®. The VetPen® is an insulin pen which allows for exact insulin dosing with each injection without needing to draw out insulin from a vial with a syringe. VetPen utilizes insulin cartridges, which are smaller than an insulin vial and help to prevent waste. According to the manufacturer, Vetsulin® cartridges should be used exclusively with VetPen® and 29G/12 MM pen needles. Missed a Dose? A missed (or inadequate) dose may cause temporary recurrence of signs (such as excess thirst and urination) but is not life-threatening. Contact your veterinarian as soon as possible for advice on your pet’s next dose. If you cannot reach your veterinarian and your pet is eating and acting normal, give your pet the usual dose at the next regularly scheduled injection time. Do not give extra or double doses, as this can cause life-threatening side effects. If you have questions about missed doses, please contact your prescribing veterinarian. If you think you did not inject all the insulin dose into the subcutaneous space under the skin or it seems that some of the insulin came back out, the safest option is to contact your veterinarian to have them advise you on next steps. Vetsulin® Possible Side Effects The most common side effect of this medication is due to low blood sugar (hypoglycemia). Depending on how low your pets’ blood sugar goes, this can be a life-threatening emergency. Mild symptoms of hypoglycemia might include: Weakness/Stumbling/falling down Shaking Head tilt Lethargy Hunger Moderate symptoms may include any of the above, but also: Disorientation Collapse Vomiting Severe symptoms may include any of the above, but also: Seizures Coma Death Additional symptoms related to general symptoms of diabetes are also possible. If your pet is unconscious or having a seizure, seek immediate veterinary care. Human Side Effects Vetsulin® is not intended for use in humans. If you accidentally inject yourself with this medication or get Vetsulin® in your eyes, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Diabetic pets should be closely monitored. This will include monitoring of symptoms, body weight, appetite, thirst, and urination amounts. Periodic monitoring of your pet’s glucose levels is important throughout your diabetic pet’s life to ensure insulin dosing is optimized to effectively control your pet’s hyperglycemia (high blood sugar levels) without causing hypoglycemia (low blood glucose levels). Additional monitoring options for diabetic pets may be recommended by your veterinarian based on each individual patient’s circumstance..  Additional testing may be recommended, including but not limited to complete blood testing, abdominal ultrasound, urinalysis, urine culture, etc. Call Your Vet If: Side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Vetsulin® Vetsulin Overdose Information Signs of an overdose of Vetsulin® are typically from hypoglycemia, or a blood sugar level that has dropped too low. If you notice any of the symptoms of hypoglycemia listed above, please contact your veterinarian or local emergency clinic immediately. Mild hypoglycemia can be treated by having your pet eat an additional meal, but more serious symptoms should be treated in a hospital by a veterinarian. If you suspect an overdose, or you accidentally gave your pet insulin twice, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Vetsulin® Storage Vetsulin®should be stored in the refrigerator, in an upright position, at consistent temperatures between 36 F and 46 F. Do not freeze. Exposure to high temperatures over 77 F or freezing temperatures below 36 F can alter the insulin and lessen its effectiveness. If you have left your insulin out of the refrigerator, contact your veterinarian or pharmacist to determine next steps. Vetsulin® should be used within 6 weeks of first use/puncture. Contact your veterinarian for specific information and before starting your pet’s insulin. Dispose of used needles and syringes in accordance with your state laws. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/RyanJLane"}]