[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dantrolene Sodium", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-838081922.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-838081922.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Horse, Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/dantrolene-sodium"}, "datePublished": "April 21, 2023", "dateModified": "April 21, 2023", "description": "Dantrolene is a prescription medication used to prevent and treat and exertional rhabdomyolysis and PAM in horses.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Dantrolene Sodium? Dantrolene is a muscle relaxant prescribed in horses for the prevention and treatment of exertional rhabdomyolysis and post anesthetic myositis (PAM). It can also be used in dogs and cats to treat functional urethral obstruction. Due to its toxic effects on the liver, other muscle relaxant alternatives such as methocarbamol are generally preferred. Dantrolene, however, is the only medication that can prevent and treat a rare but life-threatening disorder, malignant hyperthermia, which may occur when your pet is under anesthesia. Intravenous dantrolene is FDA-approved for human use under the brand names Dantrium®, Revonto®, and Ryanodex®. Oral dantrolene is FDA-approved for human use under its generic name, dantrolene sodium. Dantrolene is currently not FDA-approved as a veterinary medication. However, it is utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. How Dantrolene Sodium Works Dantrolene blocks certain receptors located on the skeletal muscles, thereby preventing the release of excess calcium that causes the muscles to contract and tense. Dantrolene helps rebalance calcium levels, allowing the muscles to relax. In certain circumstances, your vet may recommend a compounded formulation of dantrolene. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Dantrolene Sodium Directions Follow the directions on the drug label or as provided by your veterinarian. Dantrolene is generally given by mouth either once or up to three times daily, depending on the species and condition your veterinarian has prescribed this medication for. Your veterinarian may also administer it intravenously (IV) to prevent or treat malignant hyperthermia. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of dantrolene. Generally they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Dantrolene Sodium Possible Side Effects Diarrhea Vomiting Loss of appetite Lethargy Increased thirst or urination Liver irritation (yellowing of the whites of the eyes or gums) Dantrolene is also a prescription medication for humans with differing dosages and side effects. Given the possible side effects, pets should not be given any dantrolene prescribed for humans. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest dantrolene that was prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of dantrolene Dantrolene Sodium Overdose Information Use of dantrolene sodium in the veterinary field is uncommon, as such overdoses of this medication are rare. Loose stools or signs of liver damage such as yellowing of the whites of the eyes or gums is possible. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Dantrolene Sodium Storage Dantrolene should be stored at controlled room temperatures from 68 F to 77 F. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}]