[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Codeine for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-870964906.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-870964906.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/codeine-dogs"}, "datePublished": "August 31, 2023", "dateModified": "August 31, 2023", "description": "Codeine is sometimes used to treat pain and stop coughing in dogs. Learn more about when and why a veterinarian may prescribe codeine for dogs due to a health issue.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Codeine? Codeine is a human prescription narcotic that can be used in pets to relieve pain and suppress coughing in dogs. Codeine blocks pain but does not treat the underlying cause of pain in dogs. Compared to other medications for pain relief and cough suppression, codeine’s absorption in the body is less predictable and it is poorly absorbed in dogs. Due to these considerations, many veterinarians choose other FDA-approved medications for veterinary use that work better than codeine. Codeine is never used in cats because many codeine formulations contain acetaminophen, the active ingredient in Tylenol® that is highly toxic to cats. Codeine is FDA-approved for human use in various tablet and syrup formulations, including generic tablets and prescription combination products with acetaminophen (the active ingredient in Tylenol), promethazine, and other medications. Codeine is currently not FDA- approved as a veterinary medication. However, veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Codeine Considerations Codeine should not be used for pets with certain medical conditions, such as severe respiratory disease, hypothyroidism, kidney disease, liver disease, Addison’s disease, head trauma, seizures, and certain gastrointestinal conditions, and it should not be used for pets who are severely debilitated. Giving codeine with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. Codeine is classified by the Drug Enforcement Administration as a controlled substance. As such, this may affect the prescribing, dispensing, and refilling of this medication due to federal and state law. Likewise, it is illegal for you to consume, sell, or give away your pet’s codeine. How Codeine Works Codeine is classified as an opioid narcotic pain reliever. It specifically binds to opioid pain receptors in the nervous system, which blocks pain signals from communicating with the brain, thereby preventing the dog from feeling pain. Codeine also suppresses the cough reflex in the cough center of the brain. Codeine Directions Follow the directions on the drug label or as provided by your veterinarian. Generally, your veterinarian will recommend that codeine be given with food to decrease the risk of digestive upset. If your veterinarian recommends that you discontinue codeine in your dog for any reason, it is important to closely follow your veterinarian’s recommendations on how to wean your dog off this medication. Abruptly stopping codeine after a long period of your dog taking it can cause them to experience withdrawal symptoms. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of codeine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Codeine Possible Side Effects Codeine is typically well-tolerated in most dogs. Possible side effects include: Grogginess Gastrointestinal signs such as constipation, loss of appetite, or vomiting Decreased breathing rate with high doses or repeated use Human Side Effects Codeine is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of codeine Codeine Overdose Information Overdoses of codeine can be life-threatening. Symptoms of an overdose may include sedation, severely decreased breathing rate, collapse, abnormally low body temperature, and muscle weakness. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Codeine Storage Codeine tablets should be stored at controlled temperatures of 68–77 F. Brief exposure to temperatures of 59–86 F are acceptable. Codeine oral liquid should be stored at temperatures of 59–86 F. Keep the container tightly closed in order to protect from moisture and light. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/O_Lypa"}]