[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ephedrine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ephedrine"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Ephedrine is commonly given to pets to help control urinary incontinence and sometimes to treat nasal congestion in dogs and cats. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Ephedrine is commonly given to pets to help control urinary incontinence. It may also be used to treat nasal congestion. It stimulates certain receptors of the nervous system that have many effects on the body. How It Works Ephedrine works by doing a number of things. It stimulates the alpha1 and beta 1 adrenoreceptors and promotes the release of norepinephrine. It also stimulates the sympathetic system part of the nervous system, which — among other things — increases heart rate, opens up the lungs, and contracts the muscles at the beginning of the bladder. Storage Information Store in a tightly sealed container at room temperature away from heat and sunlight. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Ephedrine may result in these side effects:     Loss of appetite    Restlessness    Aggression    Increased heart rate    High blood pressureEphedrine may react with these drugs:     Anesthesia    Beta blockers    Amitraz    Furazolidone    Selegiline    Neuromuscular blockers    Rimadyl (and other NSAIDS)    Sympathomimetic    Tricyclin antidepressants    Urinary alkalinizing agent    DigoxinUSE CAUTION WHEN ADMINISTERING THIS DRUG TO DIABETIC PETS OR PETS WITH HYPERTENSION, HYPERTHYROIDISM, HEART DISEASE, OR HEART RHYTHM ABNORMALITIES USE CAUTION WHEN ADMINISTERING THIS DRUG TO PREGNANT PETS - Ephedrine has not been extensively studied in pregnant pets"}]