[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is amlodipine a diuretic?", "acceptedAnswer": {"@type": "Answer", "text": "Amlodipine is not a diuretic; it is a calcium-channel blocker. It may temporarily act as a mild diuretic for a dog upon receiving their first dose of amlodipine."}}, {"@type": "Question", "name": "How fast does amlodipine work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Amlodipine works quickly in dogs within the first few hours of ingestion, but it may take up to several days for your dog’s blood pressure to improve and stabilize. Speak with your veterinarian about when to schedule your dog’s recheck appointment so the veterinarian can determine whether the medication is effectively lowering your dog’s blood pressure."}}, {"@type": "Question", "name": "Can you crush amlodipine for cats?", "acceptedAnswer": {"@type": "Answer", "text": "Speak with your veterinarian prior to crushing or grinding amlodipine to administer it to your pet. Crushed amlodipine may have an unpleasant taste, so there is a chance your cat may not be willing to ingest the full dose. Your vet can recommend other ways to successfully administer amlodipine to your cat. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/miniseries"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Amlodipine Besylate for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1490713524.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1490713524.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/amlodipine-besylate-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "October 14, 2023", "description": "Amlodipine is a prescription medication used by veterinarians to treat high blood pressure in dogs, cats, and birds. Learn how amlodipine works, side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Amlodipine Besylate? Amlodipine is used for the long-term management of high blood pressure in many species including dogs, cats, and birds. High blood pressure in cats is typically caused by chronic kidney disease and thyroid disease. High blood pressure in dogs can be from various causes, including overactive adrenal gland, chronic kidney disease, diabetes, and a certain type of adrenal gland tumor called pheochromocytoma. It may be used as a sole medication for the treatment of high blood pressure but is generally used in combination with other medications. Your veterinarian will determine which combination is best for your pet, based on its circumstances and symptoms. Amlodipine is FDA-approved for human use under the brand names Norvasc®, Norliqva®, and Katerzia® and the generic amlodipine besylate. Amlodipine is currently not FDA-approved as a veterinary medication. However, it is occasionally utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This practice is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. Amlodipine is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. In certain circumstances, your vet may recommend a compounded formulation of amlodipine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Amlodipine Works Amlodipine is classified as a calcium-channel blocker. Amlodipine lowers blood pressure by blocking the movement of calcium into the smooth muscles of the heart and blood vessels. This causes the blood vessels to relax and dilate (widen), which improves blood flow into the heart. Amlodipine Directions Follow the directions on the drug label or per instructions provided by your veterinarian. Generally, your veterinarian will recommend administering amlodipine either with or without  food, but giving it with food can decrease the risk of digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of amlodipine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Amlodipine Possible Side Effects Side effects of amlodipine may include: Vomiting Diarrhea Decreased appetite Low energy Dehydration Abnormally low blood pressure Abnormally slow heart rate Overgrowth of gums (in dogs) Rarely, more severe side effects may occur: Elevated heart rate Slowed heart rate Collapse Severe weakness Changes in urination Limb swelling Abnormal bleeding Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose Your pet’s condition worsens or does not improve with treatment. You have additional questions or concerns about the use of amlodipine Human Side Effects While this is a human prescription medication there are different dosages and side effects that can occur in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Amlodipine Overdose Information Overdoses of amlodipine can be life-threatening. Symptoms of an overdose may include severely low blood pressure, abnormally fast or slow heart rate, abnormal heart rhythm, severely low energy level, high blood sugar, muscle tremors, or seizures. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Amlodipine Storage Amlodipine should be stored at controlled room temperature between 68-77 F. Always confirm storage requirements by reading the prescription label. Keep the container tightly closed to protect from moisture and light. Keep out of reach of children and pets. Compounded medications should be stored according to the compounding pharmacy’s label."}]