[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is rifampin used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Rifampin is used in dogs to treat complicated skin infections involving specific strains of bacteria that have developed resistance to broad-spectrum antibiotics such as methicillin-resistant Staphylococcus pseudintermedius. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/Alina555"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rifampin for Horses", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-154954455.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-154954455.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Horse, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/rifampin-horses"}, "datePublished": "October 23, 2023", "dateModified": "October 23, 2023", "description": "Rifampin is a prescription medication often used by veterinarians to treat a specific bacterial infection in horses. Learn how rifampin works, including possible side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Rifampin? Rifampin is a prescription human antibiotic used to treat Rhodococcus equi bacterial infections in horses. Its use in dogs is reserved for the treatment of complicated skin infections caused by specific strains of bacteria such as methicillin-resistant Staphylococcus pseudintermedius (MRSP) that have developed resistance to broad-spectrum antibiotics. A bacteria culture should be obtained prior to treatment to determine whether the bacteria is susceptible to rifampin. To help reduce the chances of the bacteria developing resistance to rifampin, it is used in combination with other antibiotics. It is best to consult with a board-certified veterinary specialist about the use of rifampin in your pet. They will determine an optimal dosage for your pet and the most effective regimen, which may include a combination of antibiotics and topical treatments to resolve your pet’s infection. Rifampin is FDA-approved for human use in oral form under the brand names Rifadin® and Rimactane® and as generic rifampin. It is also available as an injection under the same brand name Rifadin® and generic rifampin for certain medical conditions . The injectable formula must be used under direct veterinary supervision in a hospital setting. Rifampin is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of rifampin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Rifampin Considerations Rifampin should not be used in pets with certain medical conditions, such as liver disease, or in pets who are hypersensitive to it, especially cats. Rifampin is rarely used in cats because it can cause serious and potentially irreversible damage to the liver. This medication should be used with caution in pets with liver dysfunction or those taken with certain other medications. Safety studies have not been performed in animals, so it is important to discuss your pet’s medical history and medications with your veterinarian. Giving rifampin with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. Treatment with rifampin in dogs and cats requires intensive monitoring and close supervision by your veterinarian. Before and during your pet’s treatment, your vet will perform blood tests to evaluate the effects of the drug on the liver. How Rifampin Works Rifampin is classified as a rifamycin antibiotic. It works by interrupting the crucial formation of RNA—the genetic code required for bacteria to replicate and grow—and thereby causing the bacteria to die. Rifampin may have antifungal properties when combined with other antifungal medications. Rifampin Directions Follow the directions on the drug label or as provided by your veterinarian. Rifampin is best absorbed on an empty stomach. If gastrointestinal upset occurs, giving with a small amount of food may help, but this can decrease the amount of rifampin absorbed and delay the time needed to become effective. Rifampin is present in maternal milk, so use with caution in nursing pets. Speak with your veterinarian if your pet is pregnant or nursing to determine if this medication is appropriate. Rifampin is not well-tolerated in cats. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of rifampin. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Rifampin Possible Side Effects Side effects may include: Elevated liver levels Liver inflammation (hepatitis) Yellow discoloration of the skin, gums, eyes, and body fluids (jaundice), especially in cats Gastrointestinal upset (vomiting, diarrhea, loss of appetite) Low energy (lethargy) Red/orange urine, tears, saliva, and sweat (harmless but may stain fabrics) Skin rash Human Side Effects Rifampin is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human&#039;s use. If you accidentally ingest a pet medication, seek medical attention or call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of rifampin Rifampin Overdose Information Overdoses of rifampin can be serious and may cause liver damage (hepatotoxicity). Signs of an overdose may include lethargy, vomiting, diarrhea, loss of appetite, and yellow discoloration of the skin, eyes, and body fluids (jaundice). If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Rifampin Storage Always confirm storage requirements by reading the prescription label. Rifampin should be stored at controlled room temperature of 77 F. Brief temperature exposures from 59 F to 86 F are permitted. Avoid excessive heat. Keep the container tightly closed to protect this medication from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]