[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Taurine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/taurine"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Taurine is an amino acid that promotes the intestinal absorption of lipids (fats) as cholesterol in dogs and cats. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Taurine is an amino acid found in meat and fish that promotes the intestinal absorption of lipids (fats) as cholesterol. Most people and animals are able to synthesize Taurine from glycine in their own bodies, but cats, being strict carnivores, never developed this ability. This is the main reason that cats especially should never be fed a 100% vegetarian diet. Dogs may also suffer a deficiency, but it is not found ad often as it is in cats. Taurine deficiency in dogs is usually found in pets eating a rice bran or rice-based diet. Taurine may be supplemented in the case of retinal degradation or cardiomyopathy (swelling of the heart tissue) found in taurine-deficient cats and dogs. It will not correct retinal degradation, but will prevent further degradation. How It Works Taurine is an amino acid containing sulphur. It is a key ingredient in bile that helps lower cholesterol and blood pressure, thus keeping the heart healthy. It is also thought to be useful in the maintenance of urinary tract and eye health. Storage Information Store in a sealed container. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Taurine has very few reports of side effects, but an upset stomach may occur. Taurine may react with these drugs: CisplatinFluorouracilPaclitaxel"}]