[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Methyl Prednisolone", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/methyl-prednisolone"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Methyl prednisolone is a short-acting anti-inflammatory drug used to reduce severe inflammation and suppresses the immune system in dogs and cats. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Methyl prednisolone is a short-acting anti-inflammatory drug related to prednisone. It reduces severe inflammation and suppresses the immune system. It can be beneficial in treating many diseases and disorders, but should be given at low doses for short period of time to reduce any adverse effects. They may also be used to assist in treatment of allergies, arthritis, asthma, colitis, Addison’s disease, auto-immune skin disorders, and certain forms of kidney disease. It may also be used in conjunction with other drugs to treat brain and spinal cord injuries. Unlike prednisone, Methyl Prednisolone comes in a one-time injectable form, Depo-Medrol. This is extremely useful in cats and pets that are difficult to pill. How It Works Methyl prednisolone is a corticosteroid known as a glucocorticoid. Corticosteroids are meant to resemble a naturally occurring hormone produced in the adrenal cortex, cortisol. Corticosteroids act on the immune system by blocking the production of substances that trigger inflammatory and immune responses. Storage Information Store in a tightly sealed container at room temperature. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Methyl Prednisolone may result in these side effects: Increased drinking and urinationWeight gainAltered behaviorInhibited growth in young petsCushing’s disease after prolonged useLoss of motor or muscular functionPantingVomitingDiarrheaUlceration of the digestive tractLethargyAggressionDelayed healing Methyl Prednisolone may react with these drugs: Rimadyl (or any other NSAID)AntacidsAnticoagulantsOther steroidsSome antibioticsDrugs that may cause ulcers in the digestive tractVaccinesUSE CAUTION WHEN ADMINISTERING THIS DRUG TO PETS WITH DIABETES MELLITUS, KIDNEY DISEASE, LIVER DISEASE, HEART DISEASE, OR HIGH BLOOD PRESSURE USE CAUTION WHEN ADMINISTERING THIS DRUG TO PREGNANT OR LACTATING PETS"}]