[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tylosin", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/tylosin"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Tylosin is an antibiotic used to treat certain types of chronic diarrhea in cats and dogs. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Tylosin is an antibiotic typically used to treat bacterial infections in farm animals, but veterinarians often use it to treat certain types of chronic diarrhea in cats and dogs. The powder form is not FDA approved for use in companion animals, but it is common practice for veterinarians to prescribe this medication. It is also given as an injectable. How It Works Tylosin is a bacteriostatic antibiotic, meaning that it does not actually kill the bacteria, but prevents it from growing and reproducing, allowing your pet to cope with the infection more easily using it’s own defenses. Storage Information Store Tylosin capsules in a tight container at room temperature. Protect the oral solution from light. Missed Dose? Give the missed dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Side effects and drug reactions are very rare with the use of Tylosin. Tylosin may result in these side effects:     Pain and local reactions at injection site    Anorexia    DiarrheaDO NOT GIVE TYLOSIN TO HORSES The safety of giving Tylosin to pregnant or lactating animals has not been fully studied. Tylosin is very similar to another antibiotic, erythromycin, and cross resistance has been shown."}]