[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Cytopoint® safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Cytopoint® can be used safely in dogs, but under very specific circumstances and only under direct supervision by your veterinarian. Cytopoint® is considered safe for dogs of any age. It can also be used in dogs who take other medications and have other medical diseases. Very rarely, some dogs may be hypersensitive or allergic to it, so it is important to ask your veterinarian if Cytopoint® is right for your dog."}}, {"@type": "Question", "name": "What does Cytopoint® do for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Cytopoint® is a monoclonal antibody that blocks your dog’s itch receptors. It is used in dogs every 4–8 weeks as needed for relief of itching associated with environmental allergies (allergies triggered by pollen, dust, and grass, among others)."}}, {"@type": "Question", "name": "How much does a Cytopoint® injection cost for a dog?", "acceptedAnswer": {"@type": "Answer", "text": "The cost for a Cytopoint® injection mostly depends on your dog’s weight and can vary slightly depending on your individual veterinary hospital’s prices in the region where you live. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/AnnaStills"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cytopoint® for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1365087928.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1365087928.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication, Allergies", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cytopoint-for-dogs"}, "datePublished": "August 14, 2023", "dateModified": "October 6, 2023", "description": "Cytopoint® is a prescription medication that is available by injection only through your veterinarian. Cytopoint® is the first USDA-approved medication for dogs to relieve itching caused by allergies.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Cytopoint®? Cytopoint® is a prescription injection administered under a dog’s skin by your veterinarian for itching and skin problems. Cytopoint® is the first and only monoclonal antibody injection that is USDA-approved for use in dogs for relief of itching due to atopic dermatitis—a skin condition caused by environmental allergies (seasonal allergies triggered by pollen, dust, and grass, among others). Cytopoint® does not cure your dog’s underlying allergic condition but is a symptomatic treatment to help relieve the itching triggered by it. Cytopoint® is often used in combination with several other allergy management treatments to help improve the health of your dog’s skin. It often takes time and patience, and your veterinarian will determine whether this medication, including which type of medication formula, is right for your pet. Cytopoint® is available by prescription only and must be administered at a veterinary practice. It is not available for administration at home because your vet’s professional expertise is needed to properly diagnose environmental allergies in your dog, administer the injection, and monitor the safe use of Cytopoint®. Cytopoint® is given as an under-the-skin (subcutaneous) injection once every 4-8 weeks, and the dosage is determined by your dog’s weight. Your veterinarian will need to check your dog’s response to Cytopoint® to help determine how often your dog should receive the injection. Cytopoint® is approved for dogs only at this time and should not be used in any other species. How Cytopoint® Works The active ingredient in Cytopoint®, lokivetmab, is a dog-specific monoclonal antibody, which is a type of protein made in the laboratory that binds to certain targets in the body, just like the antibodies in your dog’s own immune system. Cytopoint® specifically binds to interleukin-31 (IL-31), which is one of the main chemical messengers involved in sending itch signals to a dog’s brain, triggering symptoms of scratching, licking, and chewing. When the Cytopoint® antibody binds to IL-31, it blocks the itch signal from reaching a dog’s brain, which provides relief from itching and allows irritated skin to heal. Cytopoint® Directions Your veterinarian will administer the Cytopoint® injection under your dog’s skin. After the injection, you will likely observe a lowering of your dog’s itch level daily over the following 4-8 weeks. It is important to follow up with your veterinarian to determine if Cytopoint® is an effective treatment for your dog and when it is time for your dog’s next injection. Missed a Dose? If you forget to bring your dog in for their injection, please contact your vet. In general, your veterinarian will schedule an appointment for your dog as needed to assess your dog’s response to Cytopoint® and administer the next treatment. Cytopoint® Possible Side Effects Cytopoint® is typically well-tolerated in most dogs. Uncommon side effects that can occur within the first few days after the injection include: Gastrointestinal signs such as vomiting, diarrhea, and loss of appetite Decreased energy level Tenderness or pain at the injection site Limping on the leg where the injection was given Cytopoint® is safe for most dogs, but in rare instances, some may be hypersensitive to it or develop an allergic reaction (anaphylaxis). Symptoms may include severe grogginess, weakness, collapse, trouble breathing, vomiting, facial swelling, or hives. Human Side Effects Cytopoint® is not an approved medication for humans. To be safe, do not participate in any way during the injection. Veterinary staff will hold your dog as the vet administers Cytopoint®. If you accidentally become injected with a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Cytopoint® Cytopoint® Overdose Information An overdose of Cytopoint® is possible. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Cytopoint® Storage Your vet should store Cytopoint® in a refrigerator with a temperature of 36–47 F, according to product insert instructions. Keep out of reach of children and pets."}]