[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is Clomicalm®?", "acceptedAnswer": {"@type": "Answer", "text": "Clomicalm® is the brand name of clomipramine, which is an FDA-approved medication for treatment of canine separation anxiety as part of a behavioral management program."}}, {"@type": "Question", "name": "How long does it take for clomipramine to start working in dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "It generally takes up to two months to determine whether clomipramine is helping a pet. "}}, {"@type": "Question", "name": "Does clomipramine help with dog barking?", "acceptedAnswer": {"@type": "Answer", "text": "Inappropriate barking may be alleviated by the use of clomipramine in conjunction with behavior modification. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Aleksandr Zotov"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Clomipramine HCL (Clomicalm®) for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1210428041.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1210428041.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/clomipramine-hcl-clomicalm-dogs"}, "datePublished": "June 26, 2023", "dateModified": "June 26, 2023", "description": "Clomipramine is often prescribed to help with behavior issues such as separation anxiety in dogs. Learn how this medication works, including side effects, dosing, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Clomipramine? Clomipramine is FDA-approved for use in dogs as part of a behavioral management program for treatment of behavior issues related to separation anxiety in dogs, such as excessive barking, destructive behavior, and house soiling. Clomipramine is available under the brand name Clomicalm® and as the generic name clomipramine. Clomipramine is sometimes prescribed for other types of anxiety, for use in cats for the treatment of urine spraying, and in birds for the treatment of feather-picking. The use of clomipramine for other types of anxiety, or in these animals, is considered off-label use. The term off- or extra-label use means that a medication can be used in a way or in a particular animal that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. Clomipramine is FDA-approved for human use under the brand name Anafranil®. However, due to differences in dosage and possible side effects, pets should not be given clomipramine that was prescribed for humans. In certain circumstances, your vet may recommend a compounded formulation of clomipramine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Clomipramine Works Clomipramine is a tricyclic antidepressant (TCA) medication that works by increasing serotonin and norepinephrine levels in the brain, thereby affecting mood balance.  Clomipramine Directions Follow the directions on the drug label or as provided by your veterinarian. It is best to give clomipramine at the same time of day every day. Clomipramine can be given with or without food, but giving it with food can decrease the risk of digestive upset. If your veterinarian recommends that you discontinue this medication for any reason, it is important to closely follow your veterinarian’s recommendations on how to wean your pet off this medication. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of clomipramine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.   Clomipramine Possible Side Effects Lethargy, or fatigue, is commonly observed in pets when they first start taking this medication. It generally occurs temporarily while their body gets used to it. However, if your pet is severely lethargic, immediately contact your veterinarian. Additional side effects may include, but are not limited to: Vomiting Diarrhea Grogginess Decreased appetite Dry mouth, more often in cats Dilated pupils, more often in cats Constipation Liver irritation Human Side Effects Clomipramine is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Due to possible side effects, pets should not be given any medicine prescribed for humans. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of clomipramine Clomipramine Overdose Information Overdoses of clomipramine can be life-threatening. Symptoms of an overdose may include sedation, dilated pupils, tremors, abnormal heart rhythm, seizures, and collapse.    If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Clomipramine Storage Clomipramine should be stored at controlled room temperatures between 59–86 F. Keep the container tightly closed to protect from moisture and light. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]