[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Reconcile® and fluoxetine same?", "acceptedAnswer": {"@type": "Answer", "text": "Reconcile® is the brand name of fluoxetine that is approved by the FDA for use in dogs for treatment of separation anxiety in conjunction with a behavior modification plan."}}, {"@type": "Question", "name": "Is human fluoxetine the same as fluoxetine prescribed for pets?", "acceptedAnswer": {"@type": "Answer", "text": "Human fluoxetine is the same chemical compound as canine/feline fluoxetine, but they do come in different preparations and concentrations. Your veterinarian may elect to prescribe your pet human fluoxetine if that is what they believe will be most beneficial for your pet."}}, {"@type": "Question", "name": "How long does it take for fluoxetine HCL chewable tablets (Reconcile®) to work?", "acceptedAnswer": {"@type": "Answer", "text": "This medication is recommended to be used for 4-8 weeks before full effect is expected. Some pet parents notice some improvement after 1-2 weeks. Your veterinarian will determine whether your pet should continue treatment with fluoxetine chewable tablets (Reconcile®) beyond 8 weeks. It is important that this medication be used in conjunction with a behavior modification plan that is recommended by your veterinarian. After discontinuing fluoxetine, continued behavioral modification is recommended to prevent recurrence of the clinical signs. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Halfpoint"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fluoxetine HCL (Prozac®, Reconcile®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1082713202.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1082713202.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/fluoxetine-reconcile"}, "datePublished": "August 30, 2022", "dateModified": "August 30, 2022", "description": "Fluoxetine is the active ingredient in canine medication Reconcile®, which is commonly prescribed as a behavior-modifying medication in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Fluoxetine? Fluoxetine is the active ingredient in the human medications Prozac®, Rapiflux®, Sarafem® and Selfemra® and the canine medication Reconcile®. Fluoxetine is used in animals as a behavior-modifying medication and is commonly prescribed to treat separation anxiety in dogs. It is important to note that all behavior-modifying medications are typically best utilized in combination with a behavior modification plan. This can be achieved in partnership with a veterinarian or certified trainer. How Fluoxetine Works Fluoxetine is a selective serotonin reuptake inhibitor (SSRI). Serotonin is a neurotransmitter, a chemical in the brain that sends messages throughout the nervous system. Serotonin is responsible for moderating mood and behavior, and low levels are thought to contribute to stress and anxiety. SSRIs such as fluoxetine block serotonin from being absorbed back into the nervous system. This increases the amount of serotonin between the nerves and helps the brain regulate mood and behavior. Fluoxetine HCL (chewable tablets) (brand name Reconcile®) is FDA approved for use in dogs to treat separation anxiety, in conjunction with behavioral modification, but Reconcile® and generic fluoxetine are also commonly prescribed off-label to treat other behavioral disorders such as anxiety and obsessive-compulsive behaviors in dogs. This is called extra-label or off-label use because this use isn’t described on the drug label. Fluoxetine is also prescribed off-label in cats for inappropriate urination and separation anxiety.  Fluoxetine is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs, like fluoxetine, in animals in certain circumstances. Your veterinarian will determine which dose and route of administration is right for your pet. Never give your pet a human medication unless prescribed by your veterinarian. Tell your veterinarian if your pet has a history of epilepsy or seizures, or if your pet is also taking other medications that lower the seizure threshold (e.g., phenothiazines such as acepromazine or chlorpromazine), as fluoxetine may increase your pet’s risk of seizures. Your veterinarian will also determine whether there are any other contraindications.  Fluoxetine Directions Follow the directions on the drug label or as provided by your veterinarian.  Your veterinarian may give instructions to administer this medication by mouth once or twice daily, with once daily being most common. It can take up to 4-8 weeks for full effect to be observed. If your veterinarian decides to take your pet off this medication, follow their directions carefully on how to appropriately discontinue fluoxetine.  Missed a Dose?Speak with your veterinarian about what to do if you forget to give a dose of fluoxetine. Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses.  Human Side EffectsWhile this is a human medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest this medication, or if skin or eye irritation occurs, immediately seek medical attention or call  the national Poison Control Center hotline at 800-222-1222. MonitoringTypically, beyond monitoring your pet’s response to fluoxetine, no specific monitoring is required for this medication. However, your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. If there is no improvement in your pets&#039; symptoms after 8 weeks on this medication your veterinarian may suggest additional or alternative treatment options. Fluoxetine Possible Side Effects Loss of appetite/weight lossSeizures  Lethargy Gastrointestinal side effects (vomiting and/or diarrhea) Behavior changes (aggression, irritability, hyperactivity, anxiety) Drooling Panting Confusion Incoordination If you believe your pet may be experiencing any side effects of fluoxetine, consult your veterinarian.  Call Your Vet If: Severe side effects are seen (see above), including the first sign of seizures Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of fluoxetine Fluoxetine Overdose Information Large overdoses of fluoxetine may cause seizures. Other signs of an overdose may include lethargy, agitation, incoordination, and excess drooling. If you suspect an overdose, immediately seek emergency veterinary care  or contact an animal poison control center. Consultation fees often apply.Pet Poison Helpline (855) 764-7661ASPCA Animal Poison Control (888) 426-4435 Fluoxetine Storage Fluoxetine tablets and capsules should be stored at controlled room temperatures between 68°-77°F and brief exposure to temperatures 59°-86°F are acceptable.  Keep the container tightly closed in light-resistant containers to protect this medication from moisture and light.  Do not discard the desiccant (e.g., silica gel packet) from the bottle.  Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]