[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do I need a prescription for Sentinel®?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Sentinel® and Sentinel® Spectrum are both available by prescription only. It is important to work with your veterinarian to ensure the best heartworm and flea prevention plan for you and your pet’s specific needs. It is recommended that all pets be tested for heartworms before being placed on this medication. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/mixetto"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sentinel® (milbemycin oxime + lufenuron)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1362263305_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1362263305_0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/sentinel"}, "datePublished": "December 22, 2022", "dateModified": "December 22, 2022", "description": "Sentinel® medications are used to treat and prevent multiple types of parasites in dogs and puppies including heartworm disease.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most frequently asked questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Sentinel®? Sentinel® contains two active ingredients, milbemycin oxime and lufenuron. It is indicated for adult dogs and puppies weighing more than two pounds and older than 4 weeks of age, for the prevention of heartworm disease, for the prevention and control of flea populations, the control of adult hookworms, and the removal and control of adult roundworms and whipworms. What Is Sentinel Spectrum®? Sentinel Spectrum® contains the same active ingredients as Sentinel®, along with the addition of a third ingredient, praziquantel, to provide the additional benefit of preventing and controlling tapeworm infections. Sentinel Spectrum® is intended for dogs and puppies weighing more than two pounds and older than 6 weeks of age. How Sentinel® Works The main active ingredient in both Sentinel® and Sentinel Spectrum® is milbemycin oxime. Milbemycin shifts chloride, a naturally occurring electrolyte, across the cell membrane of certain susceptible worms such as heartworms, roundworms, whipworms and hookworms. By overloading chloride into these worms, it affects the electrical activity within their nervous system, causing muscle paralysis and death. Lufenuron is another active ingredient in Sentinel® and Sentinel Spectrum®. Lufenuron only targets flea eggs and prevents them from developing and hatching. Since lufenuron does not kill adult fleas, it is typically used in combination with other medications to treat active flea infestations. Praziquantel, the third active ingredient in Sentinel Spectrum®, adds protection against tapeworms. The way in which praziquantel works against tapeworms is not entirely known, but it is suspected that it interferes with integrity of the worm&#039;s skin and causes paralysis. Sentinel® and Sentinel Spectrum® Directions Sentinel® and Sentinel Spectrum® is administered by mouth once a month. It may be given with or without food. However, giving this medication with food improves absorption of this medication into a dog’s system. Efforts should be made to ensure that the chewable is chewed and not swallowed whole. If your dog did not consume all the chew, redosing with a new chewable is recommended. Missed a Dose? If you forget to give a dose of Sentinel® or Sentinel Spectrum®, give it when you remember. Sentinel® and Sentinel Spectrum® are given once a month and the schedule should follow as close to every 30 days as possible in between doses. If your veterinarian has directed you to give this medication on a different dosing schedule, please contact them for further instructions if a dose was missed. Do not give extra or double doses. Possible Side Effects of Sentinel® and Sentinel Spectrum® Side effects are uncommon, but may include: Vomiting Diarrhea Loss of appetite Lethargy Generalized itching Hives Lack of coordination Drooling Weakness Convulsions Human Side Effects This medication is not intended for use in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring It is recommended that all pets should be tested for existing heartworm infection prior to starting treatment with Sentinel® or Sentinel Spectrum®. Dogs with existing heartworm infections should be treated to remove the adult heartworms before starting this medication. Placing a dog with an active heartworm infection on this medication can cause a serious allergic reaction. Other specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pet&#039;s individual needs. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Sentinel® or Sentinel Spectrum® Sentinel® Overdose Information The most common symptoms with an overdose of Sentinel® or Sentinel Spectrum® include tremors, lethargy, incoordination, shallow breathing, salivation, loss of appetite and vomiting. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Sentinel® and Sentinel Spectrum® Storage Sentinel® and Sentinel Spectrum® should be stored at controlled temperatures between 59-77 F. Keep the medication in the provided blister pack until ready for administration in order to protect it from moisture and light.  Keep out of reach of children and pets."}]