[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Difloxacin", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/difloxacin"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Difloxacin is an antibiotic used to treat difficult bacterial infections in cats and dogs.", "articleBody": "GENERAL DESCRIPTION: Difloxacin is an antibiotic used to treat difficult bacterial infections in pets. It is effective against most Gram-negative and some Gram-positive bacterias. It is often prescribed to pets with wounds or abcesses, as well as urinary tract infections. HOW IT WORKS: Difloxacin works by preventing bacteria from producing enzymes which are essential for synthesizing DNA. By doing this, Difloxacin disrupts cell replication. STORAGE INFORMATION: Store in a tightly sealed container at room temperature. MISSED DOSE? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. SIDE EFFECTS &amp; DRUG REACTIONS Difloxacin may result in these side effects:* Loss of appetite* Vomiting* DiarrheaDifloxacin may react with these drugs:* Aminoglycoside antibiotics* Antacids* Cephalosporin antibiotics* Penicillin* Aminophylline* Cyclosporine* Nitrourantoin* Sucralfate* TheophyllineDO NOT ADMINISTER THIS DRUG TO PREGNANT PETS - Difloxacin has detrimental effects on growing joints and bones.DO NOT ADMINISTER THIS DRUG TO DOGS UNDER ONE YEAR OF AGE - Difloxacin has detrimental effects on growing joints and bones.USE CAUTION WHEN ADMINISTERING THIS DRUG TO PETS WITH CENTRAL NERVOUS SYSTEM DISORDERSUSE CAUTION WHEN ADMINISTERING THIS DRUG TO CATS - Use with extreme caution and only with the recommendation of an experienced veterinarian when giving this drug to cats, especially those with pre-existing kidney failure. Difloxacin has a tendency to consistently cause loss of appetite and vomiting in cats."}]