[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can dogs have Benadryl® for bee stings? ", "acceptedAnswer": {"@type": "Answer", "text": "The antihistamine effects of Benadryl® can help treat allergic reactions to bee stings. However, if your dog is having a serious allergic reaction, emergency veterinary care and treatment with more powerful medications are often necessary. Signs of a serious allergic reaction include trouble breathing, vomiting, diarrhea, swollen face, hives (multiple raised lumps that suddenly appear along the skin), weakness, collapse, or seizures. Seek emergency treatment immediately if these or any other signs are present.  "}}, {"@type": "Question", "name": "Can dogs take Benadryl® liquid?", "acceptedAnswer": {"@type": "Answer", "text": "Some liquid formulations of Benadryl® contain alcohol or xylitol (a sugar alternative that is toxic to pets) and should not be used in animals. Always check with your vet and be sure to check the label before use to ensure that the medication does not contain alcohol or xylitol. Compounded versions of diphenhydramine are available, as both liquid and chew forms. Please talk to your veterinarian about the best way to medicate your dog. "}}, {"@type": "Question", "name": "Is human Benadryl® ok for dogs? (children’s, cream, spray, etc.)", "acceptedAnswer": {"@type": "Answer", "text": "Some human formulations of Benadryl® are often safe to use in animals. However, dosages for animals usually differ from dosages used by people. Many sprays, liquids and creams can contain additional ingredients like alcohol or xylitol which can make them unsafe for use in pets. Please speak with your veterinarian to get appropriate product recommendations for your pet.  "}}, {"@type": "Question", "name": "Is it possible for a dog to have a Benadryl® allergy?", "acceptedAnswer": {"@type": "Answer", "text": "Drug hypersensitivity can rarely occur with any type of medication. Talk to your veterinarian if your pet displays any side effects after using Benadryl® or any other medication. "}}, {"@type": "Question", "name": "What does Benadryl® do to cats?", "acceptedAnswer": {"@type": "Answer", "text": "Your veterinarian may recommend Benadryl® for a cat to help manage allergies, allergic reactions, or travel anxiety. Benadryl® is typically not very effective for managing motion sickness in cats, so alternative drugs are typically used. See above for information about the side effects of Benadryl®. In particular, the drug can unexpectedly cause over excitement and hyperactivity in cats.  "}}, {"@type": "Question", "name": "Can Benadryl® kill a cat?", "acceptedAnswer": {"@type": "Answer", "text": "Talk to your veterinarian about an appropriate dose of Benadryl® to use for your cat. The doses routinely recommended by veterinarians are considered safe for cats. However, a large overdosage of Benadryl® could potentially kill a cat.  "}}, {"@type": "Question", "name": "How much Benadryl® does it take to sedate a cat?", "acceptedAnswer": {"@type": "Answer", "text": "Talk to your veterinarian if your cat needs to be sedated. Do not use over-the-counter Benadryl® for sedation unless it is recommended by your veterinarian. Alternatively, your veterinarian may recommend a different drug that safely provides more reliable sedation.  "}}, {"@type": "Question", "name": "How long does Benadryl® take to kick in for cats?", "acceptedAnswer": {"@type": "Answer", "text": "Benadryl® typically starts working 30-60 minutes after oral administration.   No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.  "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Diphenhydramine (Benadryl®, Vetadryl®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-637056450.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-637056450.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Anxiety, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/benadryl-vetadryl-diphenhydramine"}, "datePublished": "May 20, 2022", "dateModified": "September 8, 2023", "description": "Diphenhydramine has been prescribed in animals to manage allergic conditions such as hives, allergic reactions to insect bites, stings, and allergic skin disease.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Diphenhydramine (Benadryl®)? Benadryl® is an antihistamine used to manage allergies in people. The active ingredient, diphenhydramine, is also commonly used to treat allergies in dogs, cats, horses, and other animals. It is available in a wide variety of products, ranging from oral to topical medications. Although Benadryl® is the branded version made for humans, Bendryl® is currently not FDA approved as a veterinary medication. However, the active ingredient, diphenhydramine is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label, or sometimes off-label use, because this use isn’t described on the drug label. There are also diphenhydramine products made specifically for animals, such as Vetadryl®. Diphenhydramine has been used for years in animals to manage allergic conditions such as hives, allergic reactions to insect bites and stings, and allergic skin disease. The affordable cost and relative safety of diphenhydramine allow it to be a commonly prescribed medication in animals with allergies, especially in combination with other treatments.  Some pet parents give Benadryl® to calm anxious dogs during thunderstorms or fireworks. However, Benadryl® is not typically an effective treatment for anxiety. Talk to your veterinarian about your dog’s behavior. More effective medications are available to treat anxiety and noise phobias in dogs.   In certain circumstances, your vet may recommend a compounded formulation of diphenhydramine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the  dosage strength  is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Diphenhydramine (Benadryl®) Works  Diphenhydramine (Benadryl®) is an antihistamine that works by blocking histamine receptors. Histamine is a natural chemical that is released in a pet’s body during an allergic reaction. The classic signs of allergies, such as itching, sneezing, swelling, and hives, are due in part to the action of histamine. Diphenhydramine does not block the release of histamines; instead, it blocks some of the body’s ability to respond to it.  Histamine can also trigger vomiting. By blocking histamine receptors, diphenhydramine may also help reduce vomiting triggered by motion sickness in dogs.  Diphenhydramine (Benadryl®) Directions  Follow the directions provided by your veterinarian. Your veterinarian will prescribe a dosage  based on your pet’s weight. This dosing for animals will likely differ from human dosing recommendations found on the label of over-the-counter diphenhydramine.   Missed a Dose?  If you forget a dose, give it when you remember and resume your dosing schedule. (For example, if you are giving diphenhydramine every 12 hours, give the missed dose then wait 12 hours before giving the next dose.) If it is close to the time for the next treatment, you can skip the missed dose to resume your normal schedule. Do not give two doses at once or extra doses unless directed by your veterinarian.  Diphenhydramine (Benadryl®) Possible Side Effects  According to the drug label Vetadryl®, side effects can include: Sedation Decreased energy level (lethargy)  Constipation  Dry mouth  Urinary retention  Diarrhea  Vomiting  Decreased appetite  Excitement, especially in cats Human Side Effects While this medication can also be used in humans, dosing for pets is often different and it may have different side effects. If you accidentally ingest your pets medication, call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If:  Severe side effects are seen (see above)  You see or suspect an overdose  You have additional questions or concerns about the use of diphenhydramine  Call your vet if side effects are seen (see above) or if you see or suspect an overdose. Call your vet or pharmacist if you have you have additional questions or concerns about the use of diphenhydramine.  Diphenhydramine (Benadryl®) Overdose Information  Overdose of diphenhydramine can either excite or depress the nervous system. Signs include hyperactivity, agitation, muscle tremors, fever, incoordination, increased heart rate, decreased energy (lethargy), slowed or difficult breathing, seizures, coma, and death. Emergency treatment is often necessary after an overdose. Always store the medication in a secure location out of reach of all pets and children.  If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Diphenhydramine (Benadryl®) Storage  Storage requirements vary between formulations. Check the product packaging for storage information. Most products are stored at controlled room temperature. Vetadryl® is recommended to be stored between 59-86°F. Keep the container tightly closed in order to protect from moisture and light. Keep out of reach of children and pets."}]