[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How often can buprenorphine be given to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Buprenorphine as an injection can be given to dogs up to every four hours, depending on the dose and the reason your pet is receiving this medication."}}, {"@type": "Question", "name": "How quickly does buprenorphine work in a dog or a cat?", "acceptedAnswer": {"@type": "Answer", "text": "Depending on the type of product utilized, buprenorphine can start working within 30-45 minutes of administration. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/nuttapong punna"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Buprenorphine (Buprenex®, Simbadol®, Zorbium®) for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1491191421.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1491191421.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/buprenorphine-buprenex-simbadol-zorbium-dogs-cats"}, "datePublished": "June 27, 2023", "dateModified": "June 27, 2023", "description": "Buprenorphine is often used by veterinarians to treat pain or before surgical procedures, in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Buprenorphine? Buprenorphine is a controlled substance pain medication used to treat mild to moderate pain in dogs and cats. It may also be utilized as a pre-medication given before surgical procedures in animals. Buprenorphine is FDA-approved in two formulations for control of post-operative pain associated with surgical procedures in cats. It is available in a hospital or veterinary clinic setting as an injectable under the brand name Simbadol® and as a transdermal gel under the brand name Zorbium®. Buprenorphine is readily utilized in veterinary medicine for off-label use in many dogs, large animals, small mammals, and exotics. Injectable versions of buprenorphine that are FDA-approved for humans under the brand name Buprenex® are often used off-label in veterinary medicine, as veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. The term off- or extra-label use means that a medication is prescribed for use in a way or in particular animals that are not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your animal. How Buprenorphine Works Buprenorphine partially activates specific receptors in the brain that are responsible for analgesia (pain relief). Due to its partial activity, its analgesic effects are not as strong as other opioids, which is why it is primarily used to treat mild to moderate pain. At higher doses, the pain relief it offers may last longer.           Buprenorphine is classified as a DEA Schedule III controlled substance. As such, this may affect the prescribing, dispensing, and refilling of this medication due to federal and state law. Likewise, it is illegal for you to consume, transfer, sell, or otherwise give away your pet’s buprenorphine. Buprenorphine is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans.   Buprenorphine Directions Follow the directions on the drug label or as provided by your veterinarian. Buprenorphine is mostly used by your veterinarian for pain relief while your pet is in the hospital. If your pet is sent home on buprenorphine, follow the instructions exactly as provided by your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of buprenorphine. They may instruct you to give the missed dose as soon as you remember and wait the normal amount of time until the next dose. If it is almost time for the next dose, your vet may instruct you to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Buprenorphine Possible Side Effects Excessive drowsiness Slow breathing rate Nausea Vomiting Low heart rate Agitation (panting, purring, pacing, whining, hiding) Loss of appetite Drooling Dilated pupils Constipation Human Side Effects While buprenorphine is also a human prescription medication, there are different dosages for humans and side effects that can occur. Because of the potential for adverse reactions associated with accidental exposure or injection, Simbadol® and Zorbium® should only be administered by veterinarians or veterinary technicians who are trained in the handling of potent opioids.    If you accidentally ingest or inject buprenorphine, Simbadol®, or Zorbium®, seek immediate medical attention or call your physician or the national Poison Control Center hotline at 800-222-1222.  If your skin or mucus membranes come into contact with Simbadol® or Zorbium®, wash the exposed skin with soap and water or flush the membrane with water and contact a physician immediately. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of buprenorphine Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication.  Buprenorphine Overdose Information Buprenorphine overdoses are unlikely to cause life-threatening consequences. Signs of a buprenorphine overdose may include a slow breathing rate, lack of coordination, sedation, drooling, whining or vocalizing, and low body temperature. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Buprenorphine Storage Simbadol® and Zorbium® should be stored at a controlled room temperature up to 77 F and kept away from light. Oral versions of buprenorphine should generally be stored at controlled temperatures between 68–77 F. Store medication in the child-proof container provided and protected from light. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]