[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bexacat (bexagliflozin) For Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_487031737.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_487031737.jpeg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Cat, Medication, Diabetes", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/bexacat-bexagliflozin-cats"}, "datePublished": "April 10, 2023", "dateModified": "April 10, 2023", "description": "Bexacat is a prescription medication prescribed to cats who have recently been diagnosed with diabetes.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Bexacat? BexacatTM is an FDA approved anti-diabetic prescription medication for cats. It is used to treat newly diagnosed diabetes in cats that are otherwise healthy and have never been treated with insulin before. Your veterinarian will need to screen your cat carefully before recommending BexacatTM. BexacatTM should not be started in cats that are ill, not eating, dehydrated, lethargic, or have liver, pancreatic, or kidney disease. Cats that are currently receiving insulin, have previously received insulin, or that need insulin to control their diabetes should not be prescribed BexacatTM. In cats that continue to have poor glucose regulation after eight weeks of treatment with BexacatTM,your veterinarian may recommend discontinuing BexacatTM and starting insulin treatment. How Bexacat Works BexacatTM (bexagliflozin) is a sodium-glucose cotransporter 2 inhibitor, or SGLT2 inhibitor. Bexagliflozin blocks this transporter in the kidneys, which prevents glucose from being reabsorbed back into the body. This allows excess glucose to exit the body in the urine, thereby lowering glucose levels in the blood without stimulating the body to produce more insulin. The goal of using BexacatTM in newly diagnosed diabetic cats is to make the body&#039;s natural insulin more available to keep their blood sugar at a healthy level. With less glucose in the blood stream, there is less demand on the body to produce extra insulin. Bexacat Directions Follow the directions on the drug label or as provided by your veterinarian. BexacatTM is best given orally at approximately the same time each day. BexacatTM can be given with or without food and regardless of blood glucose level. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of BexacatTM. If you miss giving a tablet of BexacatTM, give it as soon as you remember on the same day. Then continue giving BexacatTM on your regular schedule. If you accidentally give your cat more than one tablet of BexacatTM on the same day, contact your veterinarian if you see any side effects. If no side effects are seen, keep giving BexacatTM on your regular schedule. Do not skip a dose. Bexacat Possible Side Effects The most common side effects of this medication include: Vomiting Diarrhea Loss of appetite Kidney irritation Lethargy Dehydration Weight loss Urinary tract infection Ketones in the urine Pancreatitis Stop BexacatTM immediately and contact your veterinarian if you notice any of the following sudden changes or side effects in your cat: Less interest in food or not eating, lack of energy, change in normal activity (for example, hiding or decreased grooming), dehydration, or noticeable weight loss. It is recommended that cats who develop these symptoms, as well as sudden onset of dehydration or weight loss, should be seen immediately by your veterinarian for evaluation. Cats on BexacatTM may be at an increased risk for developing diabetic ketoacidosis. Human Side Effects While bexagliflozin is also approved for use as a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest bexagliflozin prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.    Monitoring Specific monitoring or routine testing while your pet is on BexacatTM may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. The manufacturer of BexacatTM recommends routine monitoring of blood glucose, fructosamine, serum β-hydroxybutyrate (BHBA), serum feline pancreas-specific lipase (fPL), liver parameters, cholesterol and triglycerides, and body weight while your cat is on BexacatTM. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of BexacatTM Bexacat Overdose Information As this is a relatively new medication, side effects of an overdose are currently unknown. In a field study, cats that received five times the normal dose of BexacatTM were observed to have a significant increase in appetite and thirst, diarrhea, and excessive glucose and ketones in the urine. One cat developed significant liver disease. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Bexacat Storage BexacatTM should be stored at controlled room temperatures between 68–77 F. Keep the container tightly closed in order to protect it from moisture and light. Always confirm storage requirements by reading the drug label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}]