[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pepcid", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/pepcid"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Pepcid is a histamine used to prevent and treat stomach and intestinal ulcers. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Famotidine is a histamine (H2) blocker that is used to prevent and treat stomach and intestinal ulcers. It is often prescribed in the cases of parvovirus, irritable bowel syndrome, megaesophagous, and acid reflux to soothe inflammation and assist in healing. It is also used in the prevention of intestinal ulcers in pets with kidney failure. Give this medication without food, as food will decrease its effectiveness. How It Works Histamine is a key component in the allergic reaction, causing inflammation and swelling. It can often cause stomach cramping and diarrhea as well. By inhibiting the H2 receptor, a receptor for histamine, Famotidine reduces the output of stomach acid. This reduces the pH of the digestive system, giving the ulcer in the stomach time and a more favorable environment to rest and heal. Storage Information Store in a tight container at room temperature protected from light and heat. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Famotidine may react with these drugs: DigoxinKetoconazoleAntacidsMetoclopramideSucralfateIt is best to give these medications at least two hours prior or following the use of Famotidine. Famotidine may also react with Azathioprine and other bone marrow suppressing drugs. Please consult your veterinarian before giving these or any other drug or herbal supplement to your pet while on Famotidine. DO NOT GIVE FAMOTIDINE TO LACTATING PETS USE CAUTION WHEN ADMINISTERING THIS DRUG TO OLDER PETS, PREGNANT PETS, OR PETS WITH KIDNEY DISEASE, LIVER DISEASE, OR HEART RHYTHM ABNORMALITIES"}]