[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long should I give my cat Terramycin®?", "acceptedAnswer": {"@type": "Answer", "text": "Give Terramycin® for as long as is directed by your veterinarian. Your veterinarian will determine the treatment length based on your pet’s signs and type of infection. Typically, your veterinarian will have you continue treatment for a few days after the signs of the infection resolve. "}}, {"@type": "Question", "name": "What does Terramycin® treat?", "acceptedAnswer": {"@type": "Answer", "text": "Terramycin® ophthalmic ointment treats pink eye and other infections of the eye. Veterinarians may also prescribe Terramycin® to treat an open sore on the clear surface of the eye (called a corneal ulcer). Terramycin® has also been used to treat eye infections that result from other illnesses, such as distemper in dogs.  "}}, {"@type": "Question", "name": "Can I inject my dog with Terramycin®?", "acceptedAnswer": {"@type": "Answer", "text": "No. Do not inject your dog with any medication, including Terramycin®, unless specifically directed by your veterinarian. The injectable and oral forms of Terramycin® are labeled for use in food animals (such as cattle, sheep, pigs, and poultry). Large animals receive much higher doses of Terramycin®, and products made for them can easily result in an overdose if given to a dog. In addition, only your veterinarian should use injectable Terramycin® because it is typically given intravenously (IV). Inappropriately given IV injections can result in severe side effects.   Featured Image: iStock.com/Vonschonertagen No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.  "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Terramycin® (Oxytetracycline, Polymyxin B) Ophthalmic Ointment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/vet-putting-eye-drops-in-cat-eye.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/vet-putting-eye-drops-in-cat-eye.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/terramycin-oxytetracycline-polymyxin-b-ophthalmic-ointment"}, "datePublished": "May 12, 2022", "dateModified": "August 17, 2022", "description": "Terramycin® is a broad-spectrum antibiotic that treats eye infections in cats and dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Terramycin®?  Terramycin® ophthalmic ointment treats eye infections in dogs, cats, and other animals. It is a broad-spectrum antibiotic, which means that it can kill many types of bacteria.  Terramycin® ophthalmic ointment is an FDA-approved animal OTC drug, which means that it is available without a prescription in most of the United States (a prescription is required in California).    Although it is available without a prescription, it is important to consult your veterinarian before giving it to your pet because what looks like an eye infection may actually be a severe eye condition like eosinophilic keratoconjunctivitis, which is suspected to be caused by a virus and cannot be treated with an antibiotic. Only your veterinarian can rule out these serious conditions and accurately diagnose your pet.    How Terramycin® Works  Terramycin® ophthalmic ointment treats pink eye and other eye infections of the conjunctiva, cornea, or eyelid. In addition, veterinarians may prescribe Terramycin® to treat corneal ulcers (an open sore on the clear surface of the eye). Terramycin® also treats eye infections that result from body-wide infectious diseases, such as distemper in dogs.   The active ingredients in Terramycin® ophthalmic ointment are oxytetracycline and polymyxin B. Oxytetracycline is an antibiotic that kills susceptible bacteria by disrupting their ability to make certain proteins that are required for the bacteria to survive. Oxytetracycline can also help heal corneal ulcers by blocking specific proteins that damage the cornea. Polymyxin B kills organisms by altering their cell membranes. These active ingredients work together to kill a wide range of bacteria.   The misuse of antibiotics, including Terramycin® ophthalmic ointment, can result in the overgrowth of antibiotic-resistant bacteria. Talk to your veterinarian if your pet’s infection does not resolve or worsens.   Terramycin® Directions  Follow the directions on the drug label or as provided by your veterinarian.  Wash your hands before administering Terramycin® or any other eye medication.  To avoid contamination, do not touch the applicator tip with your finger, your pet’s eye, or any other object.  Apply a ¼-inch strip of ointment to the affected eye(s) 2-4 times per day, or as directed by your veterinarian. To apply, gently pull down the lower eyelid and apply the medication into the space between the lid and the eye.   The eyelid will spread the medication over the surface of the eye when your pet blinks.  Gently wipe any remaining medication from your pet’s skin or face with a tissue or damp washcloth.   Wait 5-10 minutes after use before applying any other eye medications.   Contact your veterinarian if you have difficulty administering this medication or have any questions regarding the treatment.  Individuals sensitive to tetracycline class antibiotics and pregnant women should use caution when handling this class of medications (tetracyclines). Missed a Dose?  If you forget a dose, apply the medication when you remember and resume your dosing schedule. If it is almost time for the next dose, skip the missed dose. Do not give extra or double doses.  Terramycin® Possible Side Effects  Life-threatening allergic reactions can occur, especially in cats. Emergency veterinary care is often necessary. Contact your veterinarian immediately if your pet exhibits any of the following signs:    Swelling of the face   Itching  Weakness  Vomiting  Difficulty breathing  Animals typically tolerate Terramycin® ophthalmic ointment very well. However, eye irritation or redness may occur.   Talk to your veterinarian before using Terramycin® in young or pregnant animals. Oral or injectable medications in the same class of Terramycin® (tetracyclines) can impact bone development and cause discoloration of the teeth in young, growing animals. High doses or long-term use can delay growth and healing. Human Side Effects This medication is not approved for use in humans. If you accidentally ingest this medication or use it in your own eye, please call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If:   Side effects are seen (see above)  Your pet eats or ingests the eye ointment  You see or suspect an overdose  If your pet’s infection does not resolve or worsens Call your vet or pharmacist if you have additional questions or concerns about the use of Terramycin® ophthalmic ointment.  Terramycin® Overdose Information  Overdoses can occur if an animal eats or otherwise consumes Terramycin® ophthalmic ointment. If this occurs, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Terramycin® Storage  Store at room temperature between 68-77°F (20-25°C). Brief exposure to temperatures between 59-86°F (15-30°C) are acceptable.   Keep lid tightly closed when not in use.   Keep out of reach of children and pets. "}]