[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is tetracycline used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Tetracycline is used most often in dogs for management of inflammatory diseases of the skin, but it is also used for treatment of susceptible infections."}}, {"@type": "Question", "name": "Is tetracycline available over the counter for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "No. Tetracycline is only available by prescription. Your vet’s professional expertise is needed to properly diagnose your pet’s medical condition and to determine if tetracycline is right for your dog. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/SeventyFour"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tetracycline for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1303833934.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1303833934.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/tetracycline-dogs"}, "datePublished": "September 11, 2023", "dateModified": "October 27, 2023", "description": "Tetracycline is a prescription medication utilized by veterinarians to treat certain bacterial infections in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice from your vet. What Is Tetracycline? Tetracycline is a prescription antibiotic used in small animals and other species for susceptible bacterial infections such as mycoplasma, rickettsia, spirochete, and chlamydia. Tetracycline also helps reduce inflammation and is used in dogs, in combination with other medications, for inflammatory skin conditions including pemphigus, blistering skin diseases (vesiculopustular dermatoses), autoimmune nail disease (lupoid onychodystrophy), cutaneous vasculitis, sebaceous adenitis, and dermatomyositis. Tetracycline is not prescribed as often as other antibiotics in its drug class, such as doxycycline or minocycline, for susceptible infections due to several considerations. Compared to doxycycline and minocycline, tetracycline has more side effects. In addition, tetracycline is less convenient because it must be given more frequently per day on an empty stomach. It is also less effective, as many bacteria have now become resistant to tetracycline. Tetracycline is not used in cats because it is not well tolerated. Tetracycline is FDA-approved for human use under the brand name Achromycin V and as generic tetracycline. Tetracycline is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet In certain circumstances, your vet may recommend a compounded formulation of tetracycline. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Tetracycline Considerations Tetracycline should not be used in pregnancy, in pets with certain medical conditions including kidney disease, and in pets who are sensitive to it, particularly cats. Giving tetracycline with certain medications can result in health risks to your pet. It is important to note that tetracycline and other medications in the class of tetracycline antibiotics can cause problems with teeth and bone development in growing animals. Speak with your veterinarian about whether your pet is still in its growth stage and if tetracycline is right for them. How Tetracycline Works Tetracycline is an antibiotic that prevents susceptible bacteria from making the essential proteins required for growth and survival. Tetracycline can also decrease inflammation and modify the response of several components of the immune system including antibodies, white blood cells, and proteins. In doing so, it can help regulate an overreactive immune system that occurs as a response to certain inflammatory skin diseases in dogs. Tetracycline Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian may instruct you to administer a specific amount of water to your pet immediately after giving the medication to ensure the tetracycline pill moves into the stomach properly to prevent it from becoming stuck in the esophagus. Tetracycline is best absorbed on an empty stomach. If gastrointestinal upset occurs, giving the dose with a small amount food may help, but this can decrease the amount of tetracycline absorbed by up to 50%. Avoid giving tetracycline within 1-2 hours of milk or dairy products, as these can greatly decrease absorption. This medication should not be used in pregnant dogs or growing animals. Tetracycline is not well tolerated in cats. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of tetracycline. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Tetracycline Possible Side Effects Nausea (drooling, licking lips) Low appetite Vomiting Diarrhea If an oral tetracycline capsule or tablet becomes stuck in the esophagus, it can cause painful inflammation and ulcers in the esophagus (esophagitis). In cats, tetracycline can cause abdominal pain, fever, hair loss, and low energy. Long-term tetracycline use can alter the balance of healthy bacteria in the body and increase the risk of fungal infection. Human Side Effects Tetracycline is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human’s use. Tetracycline antibiotics are avoided for use in pregnant women because they can cause permanent growth defects and discoloration in the bones of the developing baby. If you are pregnant, wear disposable gloves when administering the medication and wash your hands after. If you accidentally ingest this medication, immediately seek medical attention. Call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of tetracycline Tetracycline Overdose Information An overdose of tetracycline can cause loss of appetite, vomiting, and diarrhea, sometimes severe enough to cause dehydration and electrolyte imbalances. Large overdoses given over a prolonged period of time may cause birth defects in a pregnant animal and toxicity of the liver and kidneys. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Tetracycline Storage Tetracycline should be stored at controlled room temperatures from 68-77 F. Always confirm storage requirements by reading the prescription label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]