[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does benazepril take to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Benazepril should start working within the first 1-2 hours after administration, but it may take several days to notice a difference. Your veterinarian may recommend testing to confirm if your dog is responding to this medication."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Benazepril", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1219167191.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1219167191.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/benazepril"}, "datePublished": "December 8, 2022", "dateModified": "December 8, 2022", "description": "Benazepril is a frequently prescribed medication used to treat high blood pressure, congested heart failure and other conditions in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Benazepril? Benazepril is an angiotensin-converting enzyme (ACE) inhibitor that is commonly used to treat high blood pressure (hypertension), congestive heart failure, and various types of kidney diseases in dogs and cats.  Benazepril can be given alone but is more often used in conjunction with other medications to treat congestive heart failure, especially when caused by degenerative mitral valve disease and dilated cardiomyopathy in dogs. In horses, it may be used as an additional medication for the treatment of heart valve disease. Benazepril can also be used to treat pets with kidney disease or proteinurea, which is a condition where proteins leak into their urine.   How Benazepril Works Benazepril, an ACE (angiotensin-converting enzyme) inhibitor, minimizes burdens on the heart by lowering blood pressure and widening the blood vessels. By blocking ACE, a naturally occurring protein the body makes to constrict blood vessels, blood vessels stay relaxed, which decreases blood pressure. In pets with kidney disease, benazepril also relaxes the kidney’s blood vessels, which decreases blood pressure in the kidney and reduces protein leakage into the urine.  Benazepril is FDA-approved for human use under the brand name Lotensin® and is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals under certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your veterinarian may recommend a compounded formulation of benazepril. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here Benazepril Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine the appropriate dose. This medication is typically given once to twice daily in dogs and cats and every twelve hours in horses. Do not stop or change the dosage of benazepril without first discussing this with your veterinarian. This medication can be given with or without a meal; giving it with a meal may decrease digestive upset. Treats that contain high levels of sodium (salt) should not be used to give this medication. Your pet should have access to water at all times while on this medication. Missed a Dose? Speak with your veterinarian about what to do If you forget to give a dose of Benazepril. Generally, they may advise you to give it when you remember. However, if it is almost time for your pet’s next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, they may instruct you to not give extra or double doses.   Benazepril Possible Side Effects Benazepril is generally well tolerated, but when side effects are seen, common side effects may include: Low blood pressure (hypotension) Weakness Loss of appetite Fatigue (lethargy) Vomiting Diarrhea Incoordination Changes in thirst and urination If you believe your animal may be experiencing any side effects, consult your veterinarian. Human Side Effects While this is a human prescription medication there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222.   If you accidentally ingest a pet medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222. While Benazepril is a human prescription medication, there are side effects that can occur if a person unknowingly takes a pet dosage.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of benazepril Benazepril Overdose Information The primary concern with an overdose with benazepril is excessively low blood pressure, which may present as weakness, vomiting, high heart rate, collapse, or lethargy. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Benazepril Storage Tablet versions of Benazepril should be stored at controlled room temperature below 86 F. Keep the container tightly closed in order to protect it from moisture and light. Always confirm storage requirements by reviewing the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]