[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Simparica® only available with a prescription?", "acceptedAnswer": {"@type": "Answer", "text": "Simparica® and Simparica Trio® are available by prescription only. It is important to work with your veterinarian to ensure the best flea/tick and heartworm prevention plan for your pet’s specific needs. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Moyo Studio"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Simparica® &amp; SimparicaTrio®", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1355274470.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1355274470.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/simparica-simparicatrio"}, "datePublished": "February 10, 2023", "dateModified": "February 10, 2023", "description": "Simparica® and Simparica Trio® are commonly prescribed to treat and prevent fleas and certain ticks in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Simparica®? Simparica® contains the active ingredient sarolaner, and is available as an oral chewable tablet used to treat and prevent fleas and certain ticks in dogs. It is also labeled for the treatment and prevention of the Gulf Coast tick, American dog tick, black-legged tick, lone star tick, and brown dog tick. Simparica® is approved for dogs and puppies weighing more than 2.8 pounds and over 6 months of age. Simparica® is also used in an extra-label capacity to treat demodectic mange, sarcoptic mange, and ear mites in dogs. The term off-label or extra-label use means that a medication is used in a way or in a particular species that is not specified on the medication label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether Simparica® is right for your pet. What Is Simparica Trio®? Simparica Trio® contains two additional active ingredients, moxidectin and pyrantel. Simparica Trio® works to prevent heartworm disease, treat and prevent flea infestations, treat and control tick infestations, and treat and control roundworms and hookworms. Simparica Trio® is intended for dogs and puppies weighing more than 2.8 pounds and older than 8 weeks of age. How Simparica® &amp; Simparica Trio® Works The active ingredient of Simparica®, sarolaner, belongs to a newer class of flea and tick preventatives called isoxazolines. Sarolaner is ingested by fleas and ticks when they bite, and works by over-exciting their nervous system, causing paralysis and death. This medication works within the first few hours after administration to kill fleas present on your dog, and is dosed by weight, so it is important to use the correct-sized medication for your pet. Weighing your dog regularly will ensure that you are using the correct product size.   Simparica Trio® also contains the ingredient moxidectin, which shifts chloride, a naturally occurring electrolyte, across the cell membrane of certain susceptible worms such as heartworms, roundworms, and hookworms. By overloading chloride into these worms, it affects the electrical activity within their nervous system, causing muscle paralysis and death. The third ingredient in Simparica Trio® is pyrantel. Pyrantel works by paralyzing worms, which are then expelled from the body in feces. Pyrantel only treats parasites found in the gastrointestinal tract because it does not absorb well into the bloodstream. Simparica® &amp; Simparica Trio® Directions Follow the directions on the drug label for Simparica® or Simparica Trio® or as provided by your veterinarian. This medication is given once a month by mouth, with or without food. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Simparica® or Simparica Trio®. Generally, they may instruct you to administer it immediately when you remember and resume monthly dosing. Do not give extra or double doses. If it has been a long period of time since the last dose was given, you may see fleas temporarily during the missed time. Your veterinarian may recommend a heartworm test if you are using Simparica Trio®. Simparica® &amp; Simparica Trio® Possible Side Effects This medication is generally well tolerated in most pets. Side effects are rare and may include: Vomiting Lethargy Diarrhea Loss of appetite Neurologic side effects have been seen after using medications in this class of drugs. Tell your veterinarian if your dog has a history of seizures or other neurologic disease. Neurologic side effects may include: Muscle tremors Lack of coordination Seizures Human Side Effects This medication is not for use in humans. It is recommended to wash your hands after administering this medication. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring It is recommended that all pets be tested for existing heartworm infection prior to starting treatment with Simparica Trio®. Dogs with existing heartworm infections should be treated to remove the adult heartworms before going back on this medication. Simparica Trio® is not effective against adult heartworms. Other specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet&#039;s individual needs. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Simparica® or Simparica Trio® Simparica® &amp; Simparica Trio® Storage Simparica® and Simparica Trio® should be stored at or below 86 F. Brief exposure of Simparica® to temperatures up to 104 F are acceptable. Keep the medication in the blister packs provided until ready to use in order to protect from moisture and light. Always confirm storage temperatures by reading the label. Keep out of reach of children and pets."}]