[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is DL-Methionine made from?", "acceptedAnswer": {"@type": "Answer", "text": "DL-Methionine is an amino acid (building block of protein) chemically engineered in a laboratory."}}, {"@type": "Question", "name": "How long does it take for DL-Methionine to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "When DL-Methionine is used in combination with other treatments, it can take several weeks for the struvite bladder stones to dissolve. The time required to dissolve struvite bladder stones in a dog depends on the number and size of stones present, a dog’s successful transition to a veterinary prescription therapeutic urinary diet, the resolution of the urinary tract infection, and identification and management of the underlying medical cause. Depending on your dog&#039;s individual needs, your veterinarian may recommend follow-up diagnostic testing to assess how well it is working for your dog. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/zeljkosantrac"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "DL-Methionine for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1202768791.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1202768791.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/dl-methionine-dogs-and-cats"}, "datePublished": "August 30, 2023", "dateModified": "August 31, 2023", "description": "DL-methionine is a medication sometimes prescribed by veterinarians to treat urinary health issues in dogs and cats. Learn about the common formulation names DL-Methionine is available under, how the medication works, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is DL-Methionine? DL-Methionine is a supplement used in dogs and cats for urine acidification. It aids in the treatment and prevention of a certain type of bladder stone called struvite. DL-Methionine is currently not FDA-approved as a veterinary medication, but it can be used safely in dogs and cats under the direct supervision of your veterinarian in very specific circumstances. DL-Methionine is available in multiple veterinary formulations, including prescription Methio-Form® chew tablets, prescription Ammonil® tablets, prescription generic DL-Methionine, and over-the-counter Methigel®. Certain nutritional supplements also contain DL-Methionine as an ingredient. Struvite stones form in the bladder when urine is less acidic (alkaline), which is typically a result of an underlying urinary tract infection (bacterial infection of the bladder). Feeding your pet a therapeutic urinary diet prescribed by your veterinarian can help dissolve the stones and acidify the urine, and is the most successful and safe solution to treat and manage struvite bladder stones in pets. Antibiotics are also necessary to treat your pet’s urinary tract infection. Your veterinarian may perform diagnostic testing to further investigate the underlying medical cause of your pet’s bladder stones and perform routine recheck tests to assess how well the treatment is working for your pet. In special circumstances where your vet determines that your pet needs additional urine acidification or if a therapeutic urinary diet is not right for your pet, they may prescribe DL-Methionine. DL-Methionine Considerations It is important to note that the use of DL-Methionine in your pet may cause their body to become too acidic. DL-Methionine should not be used in pets with certain medical conditions where acidification could cause harm, such as kidney disease, pancreatic disease, liver disease. It also should not be used to treat other types of urinary stones (oxalate or urate). Giving DL-Methionine with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. DL-Methionine should not be used in kittens, because it can cause toxicity and stunted growth. In humans, DL-Methionine is available as an over-the-counter supplement that comes in a variety of formulations such as tablets, capsules, powders, and topical ointments and creams. Due to possible side effects, pets should not be given any medications intended for humans, as the dosages differ from those prescribed for your pet by a veterinarian. How DL-Methionine Works DL-Methionine is classified as a urine acidification supplement. When it is ingested and processed in the body, DL-Methionine releases sulfur into the urine as sulfuric acid, which makes the urine more acidic. In doing so, it can prevent and treat the formation of struvite stones that only form in alkaline environments.  DL-Methionine Directions Follow the directions on the drug label or as provided by your veterinarian. Generally, your veterinarian will recommend that DL-Methionine is given with food to decrease the risk of digestive upset. Your veterinarian may advise you to divide your pet’s daily dose into multiple meals. Always provide your pet with plenty of water when they are taking DL-Methionine. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of DL-Methionine. Generally, they may instruct you to give it to your pet with food when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule at your pet’s next meal. Do not give extra or double doses. DL-Methionine Possible Side Effects Side effects may include: Loss of appetite Vomiting Loss of balance Human Side Effects DL-Methionine is also a supplement for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. If you accidentally ingest this medication, immediately seek medical attention/call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of DL-Methionine DL-Methionine Overdose Information Overdoses of DL-Methionine can be serious. Symptoms of an overdose in dogs may include vomiting, loss of balance, weakness, vocalization, tremors, walking stiffly with exaggerated movements, and disorientation. Symptoms of an overdose in cats may include loss of appetite, red-brown urine, anemia (abnormally low numbers of red blood cells), weakness, loss of balance, and low oxygen levels causing a pale or blue color of the gums. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 DL-Methionine Storage DL-Methionine should be stored at controlled temperatures of 68–77 F. Keep the container tightly closed to protect the medicine from moisture and light. Keep out of reach of children and pets."}]