[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How quickly does levetiracetam work?", "acceptedAnswer": {"@type": "Answer", "text": "Upon administering this medication to your pet in accordance with your vet’s instructions, there should be sufficient levels of levetiracetam in your pet’s body to be at least partially effective within 1 to 2 hours."}}, {"@type": "Question", "name": "What does levetiracetam do to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Levetiracetam is an anticonvulsant medication used to treat epilepsy or other causes of seizures. It depresses the excitability of the nerves within the brain which helps to reduce seizure activity."}}, {"@type": "Question", "name": "How much levetiracetam can I give my dog?", "acceptedAnswer": {"@type": "Answer", "text": "The appropriate dose of levetiracetam is highly dependent on the cause of your pet’s seizures and the type of other seizure medications your pet may be on. Please discuss your pet’s individual dosing of levetiracetam with their primary care veterinarian or neurologist.   No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.   Featured Image: iStock/Kalinovskiy"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Levetiracetam (Keppra®, Elepsia XR®, Roweepra®, Spritam®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/cat-sitting-on-lap-of-human.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/cat-sitting-on-lap-of-human.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/levetiracetam-keppra-elepsia-xr-roweepra-spritam"}, "datePublished": "July 6, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Howe discusses how Levetiracetam medication works, including possible side effects and frequently asked questions.", "articleBody": " PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.  What is Levetiracetam? Levetiracetam is a newer anticonvulsant or antiepileptic drug that is used in the treatment of refractory epilepsy in dogs and cats. Refractory in this case means that a pet&#039;s seizures have not responded sufficiently to other anti-seizure medications (like phenobarbital or potassium bromide). This medication is also helpful for pets that have liver disease as other anticonvulsant medications can be hard on the liver. Levetiracetam may also be useful to treat seizures that are due to a certain liver disease called hepatic encephalopathy. Levetiracetam is FDA-approved for human use under the brand names Keppra®, Elepsia XR®, Roweepra®, and Spirtam®. Levetiracetam is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of Levetiracetam. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Levetiracetam Works Levetiracetam is used extensively in human medicine as an effective means of seizure control. The way levetiracetam works in both animals and humans is not fully understood. It appears to stop seizures by interfering with the release of certain neurochemicals that communicate between nerve cells in the brain. If one brain cell misfires, it could potentially cause a cascade of other nerve cells to misfire, which can eventually lead to a seizure. Levetiracetam appears to stop that cascade from occurring. Unlike many of the other anticonvulsant medications available to pets, it does not require the liver to break down the medication into an active compound that is responsible for its anti-seizure effects. Since levetiracetam is metabolized through the kidneys, it is a generally considered a favorable anti-seizure medication in animals with liver disease. Levetiracetam Directions Follow the directions on the drug-label and from your veterinarian. Levetiracetam is typically given once to three times a day depending on your pets&#039; individual needs; check instructions on the label or from your veterinarian. Use of the extended-release tablets would change the dosing requirements. When discontinuing use of this medication a gradual taper is recommended to help off-set any side effects. Missed a Dose? If you forget to give a dose of levetiracetam, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Levetiracetam Possible Side Effects Since this is a newer medication to the veterinary field, the tendency is to look to the human field to note possible side effects. In humans this medication seems to be very well tolerated. The side effects noted most often are: Changes in behavior Sleepiness/drowsiness Digestive upset (lack of appetite, vomiting or diarrhea) Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest this medication, call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call your vet if severe side effects are seen (see above) or you see or suspect an overdose. Call your vet or pharmacist if you have additional questions or concerns about the use of levetiracetam.   Levetiracetam Overdose Information The most common side effects noted with an overdose of this medication are hypersalivation (excessive drooling) and vomiting. However, serious side effects like depression, agitation, aggression, depressed breathing, and decreased consciousness can occur. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Levetiracetam Storage Levetiracetam should be stored at controlled room temperatures between 68-77°F (20°C to 25°C). Brief exposure to temperatures 59°-86°F (15°C to 30°C) are acceptable. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]