[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Potassium Citrate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-669474228.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-669474228.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/potassium-citrate"}, "datePublished": "February 27, 2023", "dateModified": "February 27, 2023", "description": "Potassium citrate can be prescribed for multiple conditions in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Potassium Citrate? Potassium citrate is a prescription medication used to treat hypokalemia (low potassium levels in the blood) and metabolic acidosis in dogs and cats. Potassium citrate can also alkalize urine (make the urine less acidic), which may help prevent the formation of calcium oxalate in the bladder or kidney stones. How Potassium Citrate Works Potassium citrate is converted in the liver to a naturally occurring electrolyte called bicarbonate. Bicarbonate plays a key role in the body as an alkalinizing agent that helps balance the body’s pH (a measure of acidity). If the blood or urine is too acidic, bicarbonate will help normalize the pH by lowering the acidity. The citrate component of this medication may also bind with calcium to prevent the formation of calcium oxalate in the bladder and kidney stones. While potassium citrate is FDA-approved for use in humans, it is currently not FDA-approved as a stand-alone veterinary medication. However, it is readily used in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use is not described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of potassium citrate. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Potassium Citrate Directions Follow the directions on the drug label or as provided by your veterinarian. Potassium citrate can come in many different formulations such as tablets, capsules, liquids, or granules, so be sure to follow your vet’s recommendation for the exact product to use. There are various risk factors associated with this medication, depending on a pet’s underlying condition or if they are already on certain medications. This medication should only be prescribed under the direction of a veterinarian who has a complete history of the pet. Never start or stop a medication without first speaking with your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of potassium citrate. Generally, they may instruct you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Potassium Citrate Possible Side Effects The most common side effect seen with potassium citrate is stomach upset (nausea, vomiting, diarrhea, loss of appetite). Other side effects of this medication may include: Fluid retention Gastrointestinal ulcers Pets with adrenal or kidney disease, diabetes, or dehydration are at risk of experiencing electrolyte changes, particularly hyperkalemia (high potassium levels) while on this medication. Signs of hyperkalemia may include: Weakness Lethargy Muscle paralysis Abnormal heartbeat rhythms Collapse Human Side Effects While this product is used in human medicine, there are different dosages and side effects that can occur in humans.  If you accidentally ingest potassium citrate prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Monitoring of electrolytes and pH may be recommended by your veterinarian while your pet is on this medication. Your veterinarian may also recommend other tests and monitoring depending on your pet’s individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of potassium citrate Potassium Citrate Overdose Information The most common signs of an overdose include GI upset, diarrhea, vomiting, digestive tract ulcers, and lack of appetite. Overdoses can also cause changes in electrolytes; signs of electrolyte disruptions include weakness, lethargy, muscle paralysis, abnormal heartbeat rhythms, and collapse. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Potassium Citrate Storage Potassium citrate is generally stored at a controlled room temperature between 68-77 F. Keep the container tightly closed to protect from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/chendongshan"}]