[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do I need a veterinarian prescription for Drontal®?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, Drontal® and Drontal® Plus are available by prescription only and are not available over the counter. A veterinarian has to confirm the presence of susceptible intestinal parasites by laboratory fecal testing before prescribing Drontal® and Drontal® Plus."}}, {"@type": "Question", "name": "Can I give Drontal® Plus for Dogs to my cat?", "acceptedAnswer": {"@type": "Answer", "text": "No, Drontal® Plus is intended only for use in dogs. Although Drontal® and Drontal® Plus share two of the same active ingredients, these medications contain species-specific formulations and are dosed by weight differently in dogs and cats, so it is important to use the correct medication that matches your pet’s species and size. Likewise, Drontal® Plus for Dogs contains an additional active ingredient, febantel. Using cat medications in dogs or using dog medication in cats can cause serious problems, including lack of efficacy or an overdose. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/PhotoAttractive"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Drontal®", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1142296744.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1142296744.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/drontal"}, "datePublished": "January 23, 2023", "dateModified": "January 23, 2023", "description": "Drontal and Drontal Plus are commonly prescribed to treat and prevent parasite infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Drontal®? Drontal® and Drontal® Plus are prescription deworming medications used to treat and prevent intestinal parasites. Drontal® is intended for use in cats and kittens, while Drontal® Plus is specifically formulated for use in dogs and puppies. These products are available in several formulations and strengths, including Drontal® oral tablets for cats and Drontal® Plus oral tablets or chews for dogs. Drontal® Plus for Dogs Drontal® Plus is used in dogs and puppies ages 3 weeks and older and weighing more than 2 pounds. Drontal® Plus is prescribed for the treatment of multiple species of tapeworms, hookworms, roundworms, and whipworms in dogs. Drontal® for Cats Drontal® is used in cats and kittens ages 8 weeks and older and weighing more than two pounds. Drontal is indicated for the treatment of tapeworms, hookworms, and roundworms in cats. Drontal® and Drontal® Plus are available by prescription only and should be given after the presence of susceptible intestinal parasites has been confirmed by laboratory fecal testing in your dog or cat. It is important to note that tapeworms are transmitted by fleas. Without proper flea prevention measures, tapeworm reinfections can occur. How Drontal® and Drontal® Plus Works Drontal® and Drontal® Plus both contain the ingredients praziquantel and pyrantel. The way in which praziquantel works against intestinal parasites is not entirely known, but it is suspected that it interferes with the worms’ muscle integrity and causes paralysis. The worms then detach and are either destroyed in the digestive tract by the pet’s immune system or passed through to be defecated out. Pyrantel works in a similar way in that it affects the parasites’ nerves and causes paralysis of the worm. The deceased worms will either be defecated out or digested within the pet’s digestive tract. Drontal® Plus contains the additional ingredient febantel. Febantel is converted to fenbendazole in the dog’s body. Fenbendazole blocks the ability of worms to produce energy, which ultimately starves and kills the parasite. This allows for coverage against whipworms in dogs. Drontal® Plus is also available as Drontal® Plus Taste Tabs, which have the same active ingredients but are a tasty alternative to those pets who do not prefer taking pill medications. Drontal® and Drontal® Plus Directions Follow the directions on the drug label or as provided by your veterinarian. Drontal® and Drontal® Plus are typically given as a one-time treatment for intestinal parasites. These medications can be given with or without food. Missed a Dose? Drontal® and Drontal® Plus are generally given as a one-time treatment. However, if your veterinarian has instructed you to give Drontal® or Drontal® Plus on a periodic basis, speak with them about what to do if you forget to give a dose. Generally, do not give extra or double doses. Drontal® Possible Side Effects Side effects with Drontal® and Drontal® Plus are rare, but may include: Diarrhea Vomiting Lethargy Drooling­­­ Decreased appetite Human Side Effects This medication is not intended for use in humans. Wash your hands after applying this product.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication. However, most veterinarians routinely screen for parasites during annual exams.   Other specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet&#039;s individual needs. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Drontal® or Drontal® Plus Drontal® Overdose Information Vomiting and diarrhea are the most common signs of an overdose. Additional symptoms of drooling, lethargy, muscle tremors, and seizures are possible. If you suspect an overdose, immediately seek emergency veterinary care, contact your veterinarian, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Drontal® and Drontal® Plus Storage Drontal® should be stored at controlled temperatures between 68-77 F. Brief exposure to temperatures between 59-86 F are acceptable. Drontal® Plus tablets should be stored at controlled temperatures between 59-86 F. Drontal® Plus Taste Tabs should be stored at controlled temperatures below 77 F. Keep the container tightly closed in order to protect from moisture and light.   Keep out of reach of children and pets."}]