[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does Bravecto® treat sarcoptic mange?", "acceptedAnswer": {"@type": "Answer", "text": "Bravecto® is not FDA-approved to treat sarcoptic mange or other mites. However, your veterinarian may prescribe it “off-label” for this use in some cases. Studies have shown both oral and topical Bravecto® to be effective against sarcoptic mange in dogs."}}, {"@type": "Question", "name": "Can my dog still get ticks with Bravecto®?", "acceptedAnswer": {"@type": "Answer", "text": "Talk to your veterinarian if you are still seeing ticks on your dog after using Bravecto®. Your veterinarian can help you determine if the medication is working properly or if a different treatment is necessary. Ticks may be seen on your pet for a short time while Bravecto® is taking effect. Your veterinarian can also help you determine if your pet has Lone Star ticks. Bravecto® should be used every 8 weeks to control Lone Star ticks."}}, {"@type": "Question", "name": "Can my dog overdose on Bravecto®?", "acceptedAnswer": {"@type": "Answer", "text": "In safety tests, some of the dogs that received 5 times the recommended oral dosage of Bravecto® chews had diarrhea or tremors. In similar safety studies of the topical product, a 5-times overdose of topical Bravecto® did not result in side effects in dogs or cats. However, accidental oral ingestion of the topical product can cause excessive drooling, coughing, diarrhea, and vomiting. If you suspect an overdose of Bravecto® or if you accidentally administer the topical treatment into the mouth, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center."}}, {"@type": "Question", "name": "Can I give my dog Bravecto® and K9 Advantix®?", "acceptedAnswer": {"@type": "Answer", "text": "Bravecto® and K9 Advantix® II both treat fleas and ticks in dogs. K9 Advantix® II also kills lice and repels mosquitoes and biting flies. Because both products treat fleas and ticks, it may not be necessary to use both products at the same time. Talk to your veterinarian to see which flea and tick treatment is appropriate for your dog."}}, {"@type": "Question", "name": "How long does it take for Bravecto® to kill fleas?", "acceptedAnswer": {"@type": "Answer", "text": "Bravecto® chewable tablets for dogs start killing fleas within 2 hours. Bravecto® topical solution for dogs reduces more than 99% of fleas in 24 hours and 100% of fleas in 48 hours. Bravecto® Topical solution for cats kills 100% of fleas within 8 hours."}}, {"@type": "Question", "name": "How long does it take Bravecto® to kill mites?", "acceptedAnswer": {"@type": "Answer", "text": "Although not FDA-approved for the treatment of mites, your veterinarian may prescribe Bravecto® off-label for mite infestations. Typically, dogs and cats will only require one or two treatments. Follow the instructions provided by your veterinarian."}}, {"@type": "Question", "name": "How long does it take for Bravecto® to kill ticks?", "acceptedAnswer": {"@type": "Answer", "text": "Bravecto® chewable tablets kills ticks within 12 hours. Bravecto® topical solution for dogs kills more than 93% of black-legged tick, brown dog ticks, and American dog ticks after 48 hours of treatment."}}, {"@type": "Question", "name": "Will Bravecto® kill existing fleas?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Bravecto® products will kill fleas already on your pet. It also helps control flea infestations for up to 3 months. However, talk to your veterinarian if you have a flea infestation to determine if additional flea treatments are necessary to treat fleas found in your home and yard.No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Circle Creative Studio"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bravecto® (fluralaner)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1331309569.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1331309569.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication, Flea, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/bravecto-fluralaner"}, "datePublished": "November 22, 2022", "dateModified": "November 22, 2022", "description": "Bravecto® is available in several formulations and strengths to treat and prevent flea and tick infestations on dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. Bravecto® Overview Bravecto® is a medication used to treat and prevent flea and tick infestations. It is available in several formulations and strengths, including an oral form that is for dogs only and a topical form that can be used in dogs and cats. The active ingredient in Bravecto® is fluralaner. Bravecto® belongs to a newer class of flea and tick preventatives called isoxazolines. Fluralaner is ingested by fleas and ticks when they bite, and works by over-exciting their nervous system, causing paralysis and death. In dogs and cats, this medication works within the first few hours after administration to kill fleas present on your pet. By reducing fleas, Bravecto® can help minimize itching and signs of skin disease associated with flea allergy dermatitis in dogs and cats. Bravecto® is also used in an extra-label capacity to treat demodectic mange and sarcoptic mange in dogs and sarcoptic mange in cats. The term off-or extra-label use means that a medication can be used in a way, or in a particular species, that is not specified on the medication label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether Bravecto® is right for your dog or cat. This medication is dosed separately for dogs and cats and is given by weight, so it is important to use the correct species and sized medication for your pet. Using cat medications on dogs or using dog medications on cats can cause serious problems, including lack of efficacy or an overdose.   Bravecto® is a prescription medication and is not available over-the-counter. Talk to your vet about whether Bravecto® is right for your pet. Always read and follow all label instructions carefully and use Bravecto® only as advised by your vet. Side Effects of Bravecto® (fluralaner) All versions of Bravecto® are usually tolerated well in both dogs and cats. Symptoms of Bravecto® intolerance may include: Vomiting Decreased appetite Diarrhea Decreased energy (lethargy) Additional symptoms of Bravecto® or Bravecto® 1-month include Increased thirst Flatulence (gas) Additional side effects that may be seen after the use of Bravecto® Topical Solution or Bravecto® PLUS include: Itching Dry skin Excessive drooling Neurologic side effects have been seen after using medications in this class of drugs. Tell your veterinarian if your dog has a history of seizures or other neurologic disease. Neurologic side effects may include: Muscle tremors Stumbling, incoordination Collapse Seizures Human Side Effects This medication is not for use in humans. It is recommended to wash your hands after administration. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on, or  the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Bravecto®, Bravecto® 1-Month, or Bravecto® PLUS Bravecto® Overdose Information Bravecto® has a wide margin of safety. Signs of a large overdose in pets receiving oral versions of this product may include diarrhea or tremors. In pets receiving topical versions, excessive drooling may be observed upon accidental oral ingestion. If you suspect an overdose of Bravecto® or gave the topical product by mouth, please immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Bravecto® Bravecto® is a flavored, chewable tablet flea and tick preventative medication for dogs older than 6 months of age and weighing more than 4 pounds. If your puppy is less than 6 months old but older than 8 weeks, ask your vet about Bravecto® 1-Month instead. Bravecto® also treats and controls several species of ticks for up to 12 weeks, including the Black-legged tick, the American Dog tick, and the Brown Dog tick. It also treats and controls the Lone Star tick for 8 weeks. If you have Lone Star ticks in your area, your veterinarian may recommend that you administer it every 8 weeks. Most dogs willingly take the flavored chew as a treat. If not, try hiding it in a small amount of food. Bravecto® works best when given with a meal, not on an empty stomach. If you forget to give a dose, give it when you remember. Remember that fleas and ticks may temporarily be seen due to the missed treatment.   Bravecto® 1-Month Bravecto® 1-Month is a flavored chewable tablet that prevents flea and tick infestations with a lower dose of fluralaner than Bravecto®, allowing for its use in younger dogs. Bravecto® 1-Month has the same flea and tick coverage as Bravecto®. Your veterinarian may switch your puppy from Bravecto® 1-Month to Bravecto® once they reach 6 months of age. Bravecto® 1-Month works best when given with a meal, not on an empty stomach. Bravecto® Topical Solution Bravecto® topical solution provides convenient protection from fleas and ticks for up to 12 full weeks in dogs and cats. In cats, Bravecto® topical solution kills adult fleas and treats and prevents flea infestations for 12 weeks. It also treats and controls black-legged ticks for 12 weeks. In addition, Bravecto® topical solution for cats treats and controls American dog ticks for 8 weeks. Bravecto® topical solution is applied to the skin of cats who are 6 months of age and older that weigh at least 2.6 pounds. This medication is not to be given by mouth. Depending on the type of ticks present in your area, your veterinarian may recommend using Bravecto® topical solution every 8-12 weeks throughout the year.  Follow the directions on the drug label or as provided by your veterinarian. See product packaging for complete instructions, including helpful illustrations. If you forget to give a dose, give it when you remember. Remember that fleas and ticks may temporarily be seen due to the missed treatment. Bravecto® PLUS Bravecto® PLUS contains topical fluralaner combined with moxidectin. In addition to helping to control fleas and ticks, Bravecto® PLUS also prevents heartworm disease and treats and controls roundworms and hookworms in cats. Moxidectin prevents heartworm disease by paralyzing and killing immature stages of heartworms. Moxidectin also kills intestinal roundworms and hookworms. Fluralaner kills adult fleas and treats and prevents flea infestations for 2 months in cats. Apply Bravecto® PLUS to your cat’s skin every 2 months. Do not give the product by mouth. The American Heartworm Society recommends that heartworm preventative medications be given throughout the year. See product packaging for complete instructions, including helpful illustrations. If you forget a dose of Bravecto® PLUS, give a dose immediately and resume dosing every 2 months. You may temporarily see fleas and ticks due to the missed treatment. Your veterinarian may perform a heartworm test before prescribing Bravecto® PLUS, because serious side effects have been seen in cats with heartworm disease. Bravecto® Storage Bravecto® and Bravecto® 1-Month should be stored at controlled temperatures below 86 F. Bravecto® Topical Solution and Bravecto® Plus are highly flammable. Keep away from sparks, heat, open flames, or any other sources of fire. Store Bravecto® PLUS and Bravecto® Topical Solution at or below 77 F. Keep the medication in the provided blister packs until ready to use in order to protect from moisture and light.  Keep out of reach of children and pets."}]