[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does Albon® last?", "acceptedAnswer": {"@type": "Answer", "text": "Your veterinarian will recommend an appropriate treatment length for your pet. In some cases, only 3-5 days of treatment is necessary. However, certain infections require longer treatment. Like all antibiotics, give the medication for the entire length of time directed by your veterinarian. When stored properly, Albon® will remain active until its labeled expiration date."}}, {"@type": "Question", "name": "How long does it take for Albon® to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Once your pet has taken the first dose of Albon®, the medication will begin to fight the infection within 1-2 hours. However, you may not see signs of improvement for 1-2 days. Talk to your veterinarian if no improvement has been seen within 2-3 days of treatment. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/gollykim"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Albon® (sulfadimethoxine)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1154667996.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1154667996.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/albon"}, "datePublished": "July 12, 2022", "dateModified": "August 17, 2022", "description": "Albon® is commonly prescribed to treat intestinal digestive issues in pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.   What is Albon®? Albon® (sulfadimethoxine) is a sulfonamide antibiotic commonly used to treat coccidiosis in dogs, cats, and other animals. Coccidiosis is an intestinal disease caused by coccidia, which are a type of protozoa (a microscopic, single-celled organism). Coccidiosis can cause diarrhea in dogs and cats. A fecal test is necessary to determine if coccidia are present in your pet’s feces and digestive tract. If so, your veterinarian may prescribe Albon® to treat the infection. Albon® can also be used to treat susceptible bacterial infections in many parts of the body. These infections may occur in the skin, soft tissues, respiratory tract, urinary tract, or digestive tract. However, Albon® does not treat all types of infections. Albon® should only be used under the direction of a veterinarian. How Albon® Works The active ingredient in Albon® is sulfadimethoxine. It belongs to a class of antibiotics called sulfonamides. This type of antibiotic interferes with bacteria’s ability to produce folic acid, which is essential for bacteria to grow. Sulfadimethoxines such as Albon® are only effective against bacteria that can produce their own folic acid. Sulfadimethoxines are also effective against some types of protozoa, including coccidia species. The drug is not effective against all species of bacteria, viruses, or rickettsia. Albon® Directions Follow the directions on the drug label or provided by your veterinarian. For Albon® to work properly, it must be given exactly as directed by your veterinarian. Like other antibiotics, Albon® should be administered for the entire length of treatment prescribed by your veterinarian. In most cases, the signs of infection will be absent for the last few days of treatment. It is still important to finish the treatment course even if your pet seems to have recovered from the infection. Giving antibiotics at smaller doses or for a shorter period than prescribed can result in recurrent infections and antibiotic-resistant bacteria. Albon® can be given with or without food. If your pet experiences digestive upset (like vomiting or diarrhea) after taking Albon®, try giving future doses with a meal. Make sure your pet always has free access to water. Animals taking Albon® should not get dehydrated. Tablets: To make the tablets easier to give, you can hide the tablet in small amounts of food or in treats designed to hide tablets. Talk to your veterinarian if you are still having trouble medicating your pet. Oral suspension (liquid): Shake the Albon® oral suspension well before use. Measure the liquid carefully using the syringe or other dosing device provided by your veterinarian or pharmacist. Liquid Albon® is flavored to taste like custard. Pets often like the taste and will take the medication willingly. Albon® oral suspension does not need to be refrigerated, but confirm with the recommendations on the packaging. Missed a Dose? If you forget to give a dose of Albon®, give it when you remember. However, if it is less than 12 hours before the scheduled time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.  Albon® Possible Side Effects The most common side effects seen in animals taking Albon® are digestive effects, including: Decreased appetiteVomitingDiarrhea or soft stoolsCall your veterinarian if these signs are severe, worsen, or do not improve. More serious side effects from this class of antibiotics can rarely occur, including: Dry eye syndrome (keratoconjunctivitis sicca or KCS)Irritated eyes (redness, squinting, increased discharge or blinking)Urine changes (blood or crystals in the urine, difficulty or straining to urinate)Urinating small amounts frequentlyDecreased energy level (lethargy)Skin changes (rash, hair loss, itching, inflammation)FeverSwelling of the facePain or difficulty walkingBone marrow suppression (reduced production of blood cells)Human Side Effects This product is not intended for use in humans, hand washing after prolonged contact with this product is recommended. If you accidentally ingest this medication, or if you develop skin irritation after contact with this product, please call your physician or local poison control center. Monitoring Patients who may need to be on a long course of this medication may be requested to have tear production testing done before starting on this medication. Monitoring of blood cell counts and organ function tests may also be needed. Your veterinarian may recommend additional testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Redness, irritation, discharge, squinting or frequent blinking of the eyeYour dog has a rash or other skin changesYour pet has trouble walkingAny serious side effects are seen (see above)You see or suspect an overdoseYou have additional questions or concerns about the use of Albon®Albon® Overdose Information Overdoses of Albon® most commonly cause severe diarrhea, though additional symptoms as listed above, can occur.  If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Albon® Storage Store between 59°F-86°F (15°C-30°C). Protect medication from the light. The oral liquid does not need to be refrigerated, but confirm with the recommendations on the packaging. Keep out of reach of children and pets."}]