[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Clomipramine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat, Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/clomipramine"}, "datePublished": "March 20, 2013", "dateModified": "August 17, 2022", "description": "Clomipramine is used in dogs to treat behavior problems such as separation anxiety and excessive barking. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "Uses Clomipramine is used in dogs to treat behavior problems such as separation anxiety, excessive barking and destructive behavior. Clomipramine can also be used in cats to help treat certain behavior problems such as urine spraying, certain types of aggression, or compulsive behaviors like excessive grooming. This drug should be used in conjunction with behavioral modification techniques.  Dosage and Administration Clomipramine should be given according to your veterinarian’s instructions.  Do not change the way you give clomipramine without speaking with your veterinarian first.  Missed Dose? If a dose of Clomipramine (Clomicalm) is missed, the next dose should be given as soon as you remember. If you remember when it is almost time for the next dose, skip the one you missed and get back on your regular schedule. Do NOT double the dosing. Possible Side Effects Clomipramine can cause side effects. Possible side effects of Clomipramine include:  Lethargy/depressionVomitingDiarrheaElevation in liver enzymesConvulsionsIncreased heart rateIncrease thirstConfusionIt is important to stop the medication and immediately contact your veterinarian if you think your dog has any medical problems or side effects while taking Clomipramine. Precautions Clomipramine is contraindicated for use in animals with a hypersensitivity to Clomipramine or related tricyclic antidepressants. Cats may be more sensitive to the drug’s side effects. Be sure to let your veterinarian know of other medications your pet is on or may be taking. Also let your veterinarian know of any environmental changes that may happen around your pet. Use with caution when using in animals with history of epilepsy, seizures, problems urinating, constipation, liver or kidney disease, heart rhythm issues, thyroid disease, or glaucoma. The safety of Clomipramine has not been tested in animals less than 6 months of age or in pregnant or lactating females. Clomipramine should not be used in male breeding dogs. It is also not recommended for aggression behavior problems in dogs. Human Warning: Children are very sensitive to the seizure-inducing and heart effects of Clomipramine. Storage Clomipramine should be stored in a dry place at controlled room temperatures, between 59o and 77oF. Store in a tightly closed container. Drug Interactions Consult your veterinarian when giving other medications including supplements with Clomipramine. Do not give this medication if your pet has taken or used a monoamine oxidase inhibitor (MAOI) such as selegiline, Mitaban Dip or Preventic Collar within the last 14 days. When given with other drugs that may cause drowsiness including other antidepressants, antihistamines, sedatives, pain relievers, muscle relaxers, and anxiety medicine, Clomipramine may increase the effects of these drugs. Additional drugs that are not listed may also interact with Clomipramine. Signs of Toxicity/Overdose Overdose of Clomipramine could be life threatening and cause such things as:  SeizuresAbnormal Heart RhythmHeart FailureIf you suspect or know you dog has had an overdose, please contact your veterinarian or emergency vet clinic immediately."}]