[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is meclizine the same as Dramamine® for dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "It depends on the particular formulation of Dramamine® and its corresponding active ingredient. The active ingredient in regular Dramamine® is dimenhydrinate, and the active ingredient in the Dramamine® Less Drowsy formulation is meclizine."}}, {"@type": "Question", "name": "Is meclizine safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Meclizine should not be used in dogs with certain medical conditions and can interact with some types of prescription medications, but it is generally considered safe for most dogs. Speak with your vet first to ensure this medication is appropriate for your dog."}}, {"@type": "Question", "name": "How quickly does meclizine work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Studies have not been performed to evaluate drug absorption of meclizine in dogs, but it is thought that meclizine starts working within an hour of administration. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Tashi-Delek"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Meclizine (NausX®) for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-462557727.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-462557727.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/meclizine-nausx-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "October 8, 2023", "description": "Meclizine is commonly prescribed by veterinarians to treat and prevent motion sickness in dogs. Learn how meclizine works in dogs, including side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Meclizine? Meclizine is used in veterinary medicine for the treatment and prevention of motion sickness in dogs and to treat the dizziness associated with vestibular disease—a syndrome of medical conditions causing loss of balance—in dogs, cats, rabbits, rodents, and other small animals. Meclizine is available over-the-counter for dogs as a veterinary formulation under the brand name NausX®. It is important to note that NausX® for medium-breed and large-breed dogs does not contain meclizine but has a different active ingredient, dimenhydrinate. NausX for small breed dogs does contain meclizine. Meclizine is FDA-approved for human use under the brand name Antivert® and the generic meclizine. The medication is also an active ingredient in Dramamine® Less Drowsy and Bonine®. These human formulations are not FDA-approved as veterinary medications. Meclizine is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of meclizine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Meclizine Works Meclizine is categorized as an H1 receptor blocker. It blocks certain chemical messengers in the gastrointestinal system from communicating to the vomiting center of the brain called the chemoreceptor trigger zone (CRTZ), which triggers nausea and vomiting. Meclizine should not be used in pets with certain medical conditions, so speak with your vet to ensure this medication is appropriate for your pet. Giving meclizine with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications with your veterinarian. Meclizine Directions Follow the directions on the drug label or as provided by your veterinarian. Generally, meclizine can be given with or without food, but giving it with food can decrease the risk of digestive upset. When using this medication to prevent motion sickness, your veterinarian may instruct you to give it within a certain time frame before travel. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of meclizine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Meclizine Possible Side Effects Meclizine is typically well tolerated in most pets. Common side effects may include: Drowsiness, sleepiness Dry eyes Fast heart rate This medication should not be given to pregnant dogs or puppies under 6 months of age. Human Side Effects Meclizine is also a medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. If you accidentally ingest this medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Due to possible side effects, pets should not be given any medicine prescribed for humans. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of meclizine Meclizine Overdose Information The signs of a meclizine overdose depend on the dose ingested and the weight of the animal. Signs of a moderate overdose of meclizine may include drowsiness or even overexcitement, vomiting, or elevated heart rate. A severe overdose may cause heavy sedation, hallucinations, seizures, elevated heart rate, or inability to urinate. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Meclizine Storage Meclizine should be stored at controlled room temperatures between 68–77 F. Always confirm storage requirements by reading the medication label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]