[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does Mometamax® treat for pets?", "acceptedAnswer": {"@type": "Answer", "text": "Mometamax® is used to treat susceptible external ear infections in dogs."}}, {"@type": "Question", "name": "How long does it take for Mometamax® to work?", "acceptedAnswer": {"@type": "Answer", "text": "Mometamax® is labeled for use for 7 days. Most pets with susceptible infections will show noticeable improvement in a few days."}}, {"@type": "Question", "name": "Can Mometamax® be used on cats?", "acceptedAnswer": {"@type": "Answer", "text": "Mometamax® has FDA approval for use in dogs, but it can be utilized in cats in an off-label manner. Please discuss off-label usage with your pets’ veterinarian."}}, {"@type": "Question", "name": "How do I apply Mometamax® to my cat?", "acceptedAnswer": {"@type": "Answer", "text": "Follow all recommendations from your veterinarian on the use of this product. Useful instructions on how to clean and medicate a cat&#039;s ear can be found here. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Kerkez"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mometamax®", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-807833246.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-807833246.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/mometamax"}, "datePublished": "October 10, 2022", "dateModified": "October 10, 2022", "description": "Mometamax® is a common ear medication prescribed for the treatment of ear infections in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Mometamax®? Mometamax® is an otic suspension ear medication prescribed for the treatment of external ear infections in dogs caused by susceptible strains of yeast and certain bacteria. Mometamax® is only FDA approved in dogs but is often prescribed for cats and other pets off-label. This is called extra-label or off-label use because this use isn’t described on the drug label. How Mometamax® Works Mometamax® works by combining three separate ingredients (gentamycin, mometasone, clotrimazole) to treat susceptible ear infections. Gentamycin is an antibiotic that is active against several common strains of bacteria which can infect the ear. Mometasone is a steroid utilized to decrease inflammation in the ear canal and clotrimazole is a broad-spectrum antifungal agent that is used to treat common yeast organisms. Before using this product, it is important that your veterinarian examines your dog’s eardrum to ensure that it is intact to avoid damage to the inner ear. Mometamax® Directions Follow the directions on the drug label or as provided by your veterinarian. Mometamax® ear drops are instilled directly into the infected ear canal once daily for 7 consecutive days. The number of drops to instill varies based on the pets&#039;s weight. Ensure that the external ear canal is thoroughly cleaned and dried before treatment. Missed a Dose? If you forget to administer a dose of Mometamax®, instill it when you remember. However, if it is almost time for the next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Mometamax® Possible Side Effects Possible side effects to Mometamax® may include: Topical irritation at the application site: redness, blistering, peeling, swelling, itching, hives and general skin irritation.Hearing loss or deafness has been noted in a small number of sensitive or geriatric dogs. The hearing loss is usually temporary.Administration of Mometamax® beyond the recommended 7 days may result in delayed wound healing.​​​​​Human Side Effects If you accidentally ingest this medication, or if skin or eye irritation occurs, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet&#039;s individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You have additional questions or concerns about the use of Mometamax® Mometamax® Overdose Information Overdosing on Mometamax® is not common, however sensitivity or allergic reactions can occur. If your pet is showing signs of hearing loss, deafness, a head tilt, circling or other signs of vestibular disease please contact your veterinarian immediately. Ingestion of this medication has been linked with adverse reactions. According to the manufacturer, adverse systemic reactions have been observed following the oral ingestion of some topical corticosteroid preparations like mometasone. Patients should be closely observed for fluid retention (swelling), weight gain, and increases in thirst and/or urination. Prolonged use or overdosage may blunt your pet’s immune response and upon discontinuation, may also block normal steroid production.    If you suspect an overdose or if your pet has ingested this product, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Mometamax® Storage Mometamax® should be stored at controlled room temperatures between 36 and 77 F. Shake well before use and use within 28 days of first use. Keep out of reach of children and pets."}]