[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for estriol to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "While some patients may see results in 1-2 days, it is recommended to administer Incurin® for two weeks before evaluating its effectiveness. If symptoms have not improved in that time, speak to your veterinarian, as there may be another cause for your pet’s urinary incontinence."}}, {"@type": "Question", "name": "How long can a dog stay on Incurin®?", "acceptedAnswer": {"@type": "Answer", "text": "Treatment is generally recommended for as long as the medication is causing symptom relief for your pet. While your dog is on this medication, your veterinarian may recommend periodic examinations and laboratory testing to monitor your pet’s response to Incurin® as well as any side effects that may occur."}}, {"@type": "Question", "name": "Is estrogen safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Estrogen in and of itself is a naturally occurring hormone that a female dog’s own body will produce. However, high doses can cause unwanted side effects and illness. Incurin® is a low dose, short-acting estrogen that is generally regarded as safe for use in female dogs with estrogen-responsive urinary incontinence.   No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.   Featured Image: iStock/bojanstory"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Incurin® (estriol)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/young-puppy-peering-over-womans-shoulder.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/young-puppy-peering-over-womans-shoulder.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/incurin-estriol"}, "datePublished": "July 6, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Howe discusses the use of Incurin® in pets, including possible side effects, and how it works.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Incurin®? Incurin® is a short-acting estrogen that treats estrogen-responsive urinary incontinence (urine leaking) in spayed female dogs. All factors that may contribute to urinary incontinence should be considered before this medication is prescribed. How Incurin® Works Estrogen is a hormone produced by the ovaries in females. Incurin® treats urinary incontinence specifically caused by low levels of estrogen in spayed female dogs. It increases the muscle tone of the urethral sphincter which allows it to contract and strengthen, preventing urine from leaking. Estriol is a naturally occurring short-acting estrogen. Since estriol is a short-acting hormone, it has a reduced risk for serious side effects. Incurin® Directions Please follow the directions on the drug label and as provided by your veterinarian. Incurin® is dosed according to your pet’s individual response to the medication, which means your pet will need to be closely monitored by your veterinarian before any required dosing adjustments can be made. During follow-up visits with your veterinarian, an evaluation of whether your pet’s urinary incontinence is well controlled will determine if the dose can be lowered to a maintenance dose. It is generally recommended to wait 7 days between dosing adjustments. Incurin® can be given with or without food, but always follow the instructions from your vet. It is important to note that this medication is not dosed by weight. Missed a Dose? If you forget to give a dose of Incurin®, give it when you remember. If it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Incurin® Possible Side Effects Anorexia/loss of appetite Vomiting Increased thirst Swollen vulva Anxiety Inflammation of the vagina (vaginitis) Lack of energy (lethargy) Aggression/hyperactivity Estrogens have been linked with bone marrow suppression, which is a dangerous condition where your body produces less blood cells. However, this has not been reported with estriol at recommended dosing levels. Human Side Effects Incurin® can affect the human body. It is recommended to wear gloves when handling or wash hands with soap and water after administration to avoid exposure to the drug. Pregnant, those of child-bearing age or those who are breastfeeding should use caution when administering this medication. This medication is not approved for use in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring All estrogen medications can potentially affect the bone marrow and may alter thyroid hormone levels, so your veterinarian may recommend routine blood testing before starting this medication, as well as periodically throughout treatment. Your veterinarian may also recommend additional routine testing depending on your pet’s individual needs and other medications they may be on. Call your vet if severe side effects are seen (see above) or you see or suspect an overdose. Call your vet or pharmacist if you have additional questions or concerns about the use of Incurin®. Incurin® Overdose Information Acute overdoses are most likely to cause varying levels of vomiting and diarrhea depending on the severity of the overdose. Redness, swelling of the vulva, vulvar discharge, and enlargement of the mammary glands is also possible. Changes in white blood cell counts are also possible. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Incurin® Storage Incurin® should be stored at controlled room temperature at or below 77°F. Brief exposure to temperatures up to 104°F are acceptable. Keep tablets in their blister packs until use to protect from moisture and light. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]