[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Gabapentin", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-123244070.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-123244070.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/gabapentin"}, "datePublished": "August 23, 2022", "dateModified": "October 17, 2023", "description": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Gabapentin? Gabapentin is a prescription human medication that is frequently prescribed for use in animals in multiple ways. Gabapentin for dogs and cats is especially useful in reducing the exaggerated pain response felt in animals suffering from long-term pain caused by arthritis, nerve pain or cancer. Gabapentin may also be used for other types of pain, including surgical pain. Veterinarians also prescribe gabapentin to help control seizures in animals, often in combination with other seizure medications. Gabapentin has also been shown to help reduce stress associated with visits to the veterinarian, especially in cats. Gabapentin is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of gabapentin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Gabapentin Works The way gabapentin works to reduce pain, controls seizures and decrease anxiety is not well understood. Gabapentin looks and functions similarly to gamma-aminobutyric acid (GABA), which is a naturally occurring brain neurotransmitter. Like GABA, gabapentin slows down the excitatory neurotransmitters involved in pain, anxiety, and seizures. Animals with chronic pain often become more sensitive to their pain over time. These dogs and cats may experience exaggerated pain from sensations that wouldn’t normally hurt much or at all, such as soft petting. Talk to your veterinarian about whether gabapentin may be helpful in managing these exaggerated pain responses. Gabapentin Directions Follow the directions on the drug label or as provided by your veterinarian. Gabapentin can be given with or without food. Talk to your veterinarian before discontinuing gabapentin. If your pet is taking gabapentin to control seizures, your veterinarian may recommend reducing the dose gradually to prevent breakthrough seizures. Do not give any medication to your pet that has not been prescribed by your veterinarian, including gabapentin. There are different brands and formulations of gabapentin that are not interchangeable, so use only the form of gabapentin prescribed by your veterinarian. This is particularly important for liquid versions of gabapentin manufactured for humans because they typically contain xylitol, a sweetener, that is toxic to dogs. Your veterinarian can prescribe a liquid formulation of gabapentin that does not contain xylitol. While the Federal government does not classify gabapentin as a controlled substance, some states classify it as a Schedule V controlled substance. As such, this may affect the prescribing, dispensing and refilling of this medication due to stricter laws in those states.  Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of gabapentin. Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses. Gabapentin Possible Side Effects The most common side effects observed with gabapentin are sedation (drowsiness or sleepiness) and ataxia (loss of coordination). In cats, an increase in drooling and vomiting has been observed. If you believe your pet may be experiencing any side effects of gabapentin, consult your veterinarian. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest your pets’ medication, immediately seek medical attention or call  the national Poison Control Center hotline at 800-222-1222. Monitoring Typically, beyond monitoring your pet’s response to gabapentin, no specific monitoring is required, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdoseYou have additional questions or concerns about the use of gabapentinGabapentin Overdose Information Overdoses of gabapentin can cause a lack of coordination, decreased energy level (lethargy), vomiting, and diarrhea. Most commercially available forms of gabapentin oral liquid contain xylitol that can cause severe toxicity in dogs. If you suspect an overdose, immediately seek emergency veterinary care or contact  an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Gabapentin Storage Gabapentin should be stored at a controlled room temperature of 77°F.  Brief exposure to temperatures between 59°F and 86°F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reviewing the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Kathryn_Thomas"}]