[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Zithromax® (Azithromycin)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1265530460.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1265530460.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/zithromax-azithromycin"}, "datePublished": "October 10, 2022", "dateModified": "October 10, 2022", "description": "Azithromycin is a common antibiotic medication that treats various types of infections in dogs, cats, horses, rabbits, guinea pigs, and birds.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Azithromycin? Azithromycin is an antibiotic medication in a class called macrolides. It is a strong, broad-spectrum antibiotic commonly prescribed in dogs, cats, horses, rabbits, guinea pigs, and birds to treat a wide variety of infections. Some of these infections include tick-borne (Rickettsia) infections, Bartonella, (Cat-Scratch Fever), Brucella, Lyme disease, and certain Mycoplasmas and Rhodococcus in foals. Azithromycin may also have some effects on the immune system and may be a helpful treatment option for dogs diagnosed with viral papillomatosis or for dogs with gingival hyperplasia caused by the medication cyclosporine. How Azithromycin Works Azithromycin works by preventing the development of proteins in susceptible strains of bacteria and species of protozoa that are necessary for them to survive and replicate. Some research suggest that azithromycin may play a role in boosting the immune system, however the way it works is unclear. To prevent antibiotic resistance, azithromycin is generally reserved for infections that the veterinarian has determined to be susceptible to azithromycin. Azithromycin is FDA-approved for human use under the brand name Zithromax®. Azithromycin is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of azithromycin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Azithromycin Directions Follow the directions on the drug label or as provided by your veterinarian. Azithromycin is typically given once a day but may also be given more frequently depending on the type of infection being treated. Your veterinarian will prescribe a dosage based on your pet’s weight and type of infection. Follow the directions closely. Do not give more or less than is prescribed by your veterinarian and finish the treatment course even if it seems like your pet has recovered from the infection. If your pet is being treated for a zoonotic disease (one that can spread from pets to humans), like Bartonella, exercise caution when administering medication to prevent any bites or scratches from occurring. Missed a Dose? If you forget to give a dose of azithromycin, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Azithromycin Possible Side Effects Azithromycin can cause gastrointestinal side effects such as:  Vomiting Diarrhea Inappetence Abdominal pain Rarely, severe side effects like heartbeat rhythm changes (arrhythmias), fast heart rates (tachycardia) and liver irritation can be seen. Side effects of azithromycin in foals may include: Diarrhea High body temperature (hyperthermia) Increased sensitivity to heat and sunlight Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. If you are allergic to azithromycin or other macrolide antibiotics, you should wear gloves when handling this medication. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet&#039;s individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You have additional questions or concerns about the use of azithromycin Azithromycin Overdose  While an azithromycin overdose is unlikely to cause significant harm, pets may experience severe diarrhea, vomiting, abdominal pain or cramping. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Azithromycin Storage Store commercially available azithromycin tablets at controlled temperatures between 59-86 F. Keep the container tightly closed to protect from moisture and light. Store liquid preparations of azithromycin between 41-86 F and used within 10 days. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}]