[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for selegiline hydrochloride to work in pets?", "acceptedAnswer": {"@type": "Answer", "text": "The time it takes for selegiline to start working in your dog is individual. In most dogs you will notice some improvement after about a month of treatment. You may continue to see increasing improvement up to 12 weeks after starting selegiline."}}, {"@type": "Question", "name": "Does selegiline hydrochloride help with anxiety in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Selegiline is not designed to help with anxiety in dogs. Dogs with canine cognitive dysfunction may display anxiety related to their condition, so many dogs that have canine cognitive dysfunction may also need to be on anti-anxiety medications. Their anxiety may also improve when their cognitive dysfunction is treated with selegiline."}}, {"@type": "Question", "name": "Will selegiline hydrochloride make my pet sleepy?", "acceptedAnswer": {"@type": "Answer", "text": "Lethargy is a possible side effect from use of selegiline, but this is not common.  No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Selegiline Hydrochloride (Anipryl®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1164351658.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1164351658.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/selegiline"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Selegiline is a prescription medication used to treat cognitive dysfunction in senior dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Selegiline Hydrochloride? Selegiline hydrochloride is currently the only FDA-approved prescription medication for the treatment of canine cognitive dysfunction. It is also approved for control of clinical signs associated with uncomplicated canine pituitary-dependent hyperadrenocorticism in dogs (canine Cushing’s Disease), but has fallen out of favor due to the development of more effective medications. Selegiline is available in generic form and under its brand name, Anipryl®. Selegiline has also been used in an off-label capacity for the treatment of feline cognitive dysfunction syndrome. The term off- or extra- label use means that a medication is prescribed for a certain use, or in a particular species, that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of selegiline. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Selegiline Hydrochloride Works Selegiline hydrochloride is classified as a monoamine oxidase inhibitor (MAOI). It blocks the reabsorption of beneficial nerve transmitters such as dopamine and serotonin, which enhances their activity in the brain. In doing so, selegiline may help lessen the symptoms of cognitive dysfunction in dogs and cats. The increased presence of dopamine also helps control adrenal overactivity in canine Cushing&#039;s disease, which lowers the amount of ACTH (adrenocorticotropic hormone) in the brain, thereby reducing the body’s overproduction of cortisol. Selegiline Hydrochloride Directions Follow the directions on the drug label or as provided by your veterinarian. Selegiline hydrochloride is generally given to dogs once daily, preferably in the morning. Selegiline can be given with or without food. If your pet has digestive upset after taking this medication without food, try giving it with a small meal. Selegiline tablets are not scored, which means that they are not designed to be split. If your veterinarian has prescribed this medication for your cat, selegiline is generally recommended to be given in the evenings. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of selegiline hydrochloride. Generally, they may instruct you to give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Selegiline Hydrochloride Possible Side Effects The most common side effect of selegiline is digestive upset. Stopping selegiline for a few days and restarting it at a lower dose may help. Signs of digestive upset may include: Vomiting Diarrhea Loss of appetite Additional side effects are rare, but may include: Restlessness Drooling Itching Trembling Hearing loss Lethargy Selegiline can have serious interactions with certain medications. For example, serotonin syndrome can occur while the pet is also on a selective serotonin reuptake inhibitor (SSRI) like fluoxetine, or a tricyclic antidepressant like clomipramine. Serotonin syndrome is a rare but serious condition that can occur when these drugs are given together, especially at higher doses, so your veterinarian may recommend other alternatives to these medications. Seek immediate emergency care if the following signs of serotonin syndrome occur: Vomiting or diarrhea Seizures Increased skin sensitivity (hyperesthesia) Depression Dilated pupils or blindness Vocalizations (whining, crying) Excessive drooling Trouble breathing Weakness or lack of coordination Disorientation Human Side Effects While selegiline hydrochloride is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: You see severe side effects (above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of selegiline Selegiline Overdose Information Overdoses of selegiline may cause drooling, decrease pupil response to light, weight loss, panting, dehydration, or lack of coordination. If you suspect an overdose,  contact your veterinarian immediately, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Selegiline Storage Selegiline should be stored at controlled room temperatures between 68-77 F. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reading the drug label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]