[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for cisapride to work in dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "Cisapride usually starts to work in the first few hours after administration. Cisapride does not remain in the system for a long time, so frequent dosing (three or four times a day) may be recommended."}}, {"@type": "Question", "name": "Is cisapride available as a liquid for cats?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Compounded versions of cisapride are the only forms of this medication currently available in the US. Compounding pharmacies can provide cisapride in various forms such as capsules, chews and liquids. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/miniseries"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cisapride", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1482780970.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1482780970.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cisapride"}, "datePublished": "May 22, 2023", "dateModified": "May 22, 2023", "description": "Cisapride is often prescribed by veterinarians to treat digestive or stomach-related health issues in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Cisapride? Cisapride is an oral medication that helps move food through the digestive tract. It can be used in several animals (dogs, cats, small mammals, chickens, reptiles, and rabbits) to treat slowing of the digestive tract, reflux, and constipation. It can also be prescribed to help prevent reflux and aspiration pneumonia in dogs undergoing surgery. Rarely, some veterinarians may also recommend this medication for cats with megacolon. Cisapride was FDA-approved for human use under the brand name Propulsid®, but its approval was pulled in the US due to adverse effects seen in humans (heart rhythm abnormalities, which have not been seen in pets). Cisapride is currently not FDA-approved as a veterinary medication. However, it is still used, though infrequently, in the veterinary field, and veterinarians can legally prescribe certain unapproved drugs for use in animals in certain circumstances. Only your veterinarian can determine whether cisapride is right for your pet, based on your pet’s symptoms and circumstances. How Cisapride Works Cisapride promotes acetylcholine, a naturally occurring signaling compound, to be released near the nerves responsible for smooth muscle movement in the stomach and intestines. Acetylcholine prompts these muscles to contract and relax, thereby ushering the movement of food throughout the entire digestive system. In doing so, cisapride helps to relieve constipation, as well as symptoms of constipation such as bloating and nausea. Cisapride is not FDA-approved in humans or animals at this time and must be obtained from a compounding pharmacy. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Cisapride Directions Follow the directions on the drug label or as provided by your veterinarian. Cisapride can be given with or without a meal. If digestive upset occurs, try giving cisapride with a meal. If digestive upset continues, please contact your veterinarian. Cisapride does not stay in the system long, so dosing is often done up to three or four times a day depending on the species and reason for using the medication. Your veterinarian will determine the best course of treatment for your pet. Missed a Dose? Speak with your veterinarian if you forget to give a dose of cisapride. Generally, your veterinarian may instruct you to give it when you remember or, if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Cisapride Possible Side Effects Cisapride is generally well tolerated in animals. Although cisapride was removed from the market for humans due to heart rate abnormalities, this has not been observed in dogs or cats.  Side effects are not common, but may include: Vomiting Diarrhea Stomach pain Human Side Effects This medication is no longer prescribed in human medicine. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of cisapride Cisapride Overdose Information Signs of a cisapride overdose may include lethargy, diarrhea, incoordination, tremors, abnormal behavior, fever and seizures. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Cisapride Storage Cisapride should be stored at a controlled room temperature. Keep the container tightly closed in order to protect it from moisture and light. Follow the storage information provided by the compounding pharmacy. Always confirm storage requirements by reading the label. Keep out of reach of children and pets."}]