[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take Vetoryl to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Vetoryl® starts working within 1-2 days. However, observable effects of the medication may take a few weeks. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/AegeanBlue"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vetoryl® (Trilostane)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1204793505.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1204793505.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/vetoryl"}, "datePublished": "October 10, 2022", "dateModified": "October 10, 2022", "description": "Vetoryl® is a commonly prescribed medication to help manage Cushing&#039;s disease in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Vetoryl®? Vetoryl® is a prescription medication used in the treatment of hyperadrenocorticism or Cushing’s Disease in dogs and cats. Hyperadrenocorticism is when a pet&#039;s adrenal glands produce too much cortisol, which is a naturally occurring steroid produced by the body. While Vetoryl® is the brand name of this medication, the active ingredient in Vetoryl® is called trilostane. How Vetoryl® Works Vetoryl® is used in the treatment of hyperadrenocorticism, acting as an enzyme to inhibit the production of cortisol, which is overproduced in pets that have Cushing&#039;s Disease. Vetoryl® does not cure Cushing&#039;s Disease but can manage the disease and improve your pet’s quality of life. In certain circumstances, your vet may recommend a compounded formulation of trilostane. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Certain formulations of compounded trilostane may not be as effective at treating hyperadrenocorticism in dogs. Always work with your veterinarian to find the best medication for your pet&#039;s specific needs. Vetoryl® Directions Follow the directions on the drug label or as provided by your veterinarian. Vetoryl® is typically administered once a day, however your veterinarian may recommend giving it twice a day depending on pet’s response to the medication. Vetoryl® should be given with food. Do not stop or change how you give this medication without specific instructions from your veterinarian. Missed a Dose? If you forget to give a dose of Vetoryl®, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Vetoryl® Possible Side Effects If your pet’s steroid levels fall too low while on Vetoryl®, a life-threatening condition called an Addisonian crisis can occur. If your pet has any of the following symptoms, please contact your veterinarian immediately. Vomiting Decreased energy levels (Lethargy) Lack of appetite Weakness Diarrhea (especially bloody diarrhea) Collapse Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You have additional questions or concerns about the use of Vetoryl® Human Side Effects This medication is not approved for use in humans. Wear gloves during administration or wash hands with soap and water after administration to avoid exposure to the drug. Pregnant individuals or those trying to conceive should wear gloves when handling this medication and avoid contact with the medication. Capsules should not be opened or split. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring Specific monitoring is recommended for this medication. Testing to monitor your pet’s response to this medication is recommend 10-14 days after your pet has started Vetoryl®. Individual dose adjustments may be needed. Routine monitoring may be recommended every 1-3 months thereafter depending on your pet&#039;s individual needs and other medications they may be on. Vetoryl® Overdose  Overdoses of Vetoryl® can cause severe suppression of the adrenal glands. Symptoms of an overdose may include: Lack of appetite Lack of energy (Lethargy) Weight loss Diarrhea (especially bloody diarrhea) Muscle tremors Collapse If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Vetoryl® Storage Vetoryl® should be stored at controlled temperature (77°F) and brief exposure to temperatures 59-86 F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]