[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is glipizide used to treat feline diabetes?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Glipizide is useful in certain diabetic cats that can be closely monitored, have only mild to moderate symptoms, are in good physical condition, and are not in a serious, complicated state of illness called diabetic ketoacidosis (DKA)."}}, {"@type": "Question", "name": "What are the most common side effects of glipizide in cats?", "acceptedAnswer": {"@type": "Answer", "text": "The most common side effects of glipizide in cats are gastrointestinal upset, such as low appetite or vomiting, and abnormally low blood glucose (hypoglycemia). No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/eclipse_images"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Glipizide for Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1337031916.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1337031916.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Cat, Medication, Diabetes", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/glipizide-cats"}, "datePublished": "October 9, 2023", "dateModified": "October 9, 2023", "description": "Glipizide is a prescription medication that is sometimes used to treat diabetes in cats. Learn how glipizide works, including side effects, storage, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Glipizide? Glipizide is a prescription human medication sometimes used in cats with diabetes mellitus to help lower blood sugar. Glipizide is useful in certain diabetic cats that can be closely monitored, have only mild to moderate symptoms, are in good physical condition, and are not in a serious, complicated state of illness called diabetic ketoacidosis (DKA). Although glipizide can be helpful, insulin therapy is considered the best and most effective primary treatment for diabetes mellitus in cats. Glipizide is not used in dogs, since diabetes in dogs is different than diabetes in cats. Dogs with diabetes have a deficiency of insulin due to non-functioning beta cells in the pancreas—a type of diabetes mellitus for which glipizide is ineffective. Glipizide is FDA-approved for human use under the brand names Glucotrol XL®, Glipizide XL®, and generic glipizide. Glipizide is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your cat. In certain circumstances, your vet may recommend a compounded formulation of glipizide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Glipizide Considerations Treatment with glipizide is highly specific to your cat and their response to the medication, requiring frequent blood sugar monitoring and close supervision by your veterinarian. Glipizide should not be used in cats in certain diabetic states, such as absolute insulin deficiency or diabetic ketoacidosis, and in cats that are hypersensitive to it or are allergic to sulfonamide medications. Glipizide should be used with caution in cats with thyroid disease, kidney disease, liver disease, chronic vomiting, high fever, malnutrition, adrenal insufficiency, pituitary insufficiency, or other debilitating conditions. Giving glipizide with certain medications can result in health risks to your cat, so it is important to discuss your cat’s medications and medical conditions with your veterinarian. How Glipizide Works Glipizide is in the class of drugs called sulfonylureas, which are medications that lower the level of sugar (glucose) in the blood. Glipizide stimulates the beta cells in the pancreas to make more insulin, which helps move the glucose from the blood and into the cells throughout the body. It can take four to eight weeks for glipizide to become fully effective, which is why insulin therapy is the fastest and safest way to rapidly reduce high blood sugar levels in a diabetic cat. Glipizide only works if a diabetic cat’s pancreas still has functioning beta cells. It is important to note that glipizide may become ineffective after a few weeks or a few months of use. Glipizide Directions Follow the directions on the drug label or as provided by your veterinarian. It may take four to eight weeks for glipizide to become fully effective. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of glipizide. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Glipizide Side Effects Gastrointestinal upset, lack of appetite, vomiting Abnormally low blood glucose (hypoglycemia) Abnormal protein buildup (amyloid deposits) in the pancreas, which can harm functioning beta cells Liver problems, such as jaundice or increased liver levels in the blood Human Side Effects Glipizide is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human’s use. If you accidentally ingest this medication, immediately seek medical attention or call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of glipizide Glipizide Overdose Information An overdose of glipizide can cause severely low blood glucose (hypoglycemia). If you suspect an overdose in your pet, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Glipizide Storage Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Glipizide should be stored at a controlled room temperature from 68–77 F. Brief exposures to temperatures from 59 F to 86 F are permitted. Keep the container tightly closed to protect its contents from moisture and light. Keep out of reach of children and pets."}]