[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog and cat be prescribed aluminum hydroxide?", "acceptedAnswer": {"@type": "Answer", "text": "The exact amount of time your dog or cat is prescribed aluminum hydroxide may vary. It would be at the discretion of your veterinarian, who will determine if your pet is tolerating aluminum hydroxide and if it is effective at keeping their blood phosphorous levels within a normal range."}}, {"@type": "Question", "name": "Is aluminum hydroxide toxic to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Aluminum hydroxide is commonly prescribed in dogs with kidney disease to help normalize their blood phosphorous levels. It may, however, be toxic in the event of a large overdose. If you suspect that your pet has received an overdose of aluminum hydroxide, contact your veterinarian immediately or seek emergency veterinary care. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/supersizer"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Aluminum Hydroxide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-976604414.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-976604414.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/aluminum-hydroxide"}, "datePublished": "May 22, 2023", "dateModified": "May 22, 2023", "description": "Aluminum hydroxide is a prescription medication that can help with health side effects due to kidney disease in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Aluminum Hydroxide? Aluminum hydroxide is a common medication available in liquid or tablet form to treat abnormally high phosphorous levels in dogs, cats, small mammals, and reptiles with kidney disease. It is typically prescribed when a low phosphorus diet is not enough to help them maintain normal phosphorus concentrations in the blood. Aluminum hydroxide may be used in cows as an antacid and for the treatment of abomasal ulcers. It is also used rarely in horses to treat gastroduodenal ulcers. Aluminum hydroxide is FDA-approved for human use as an over-the-counter medication. It is  currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. How Aluminum Hydroxide Works Aluminum hydroxide is a phosphate binder, meaning it binds directly to phosphorus, an electrolyte, in the gastrointestinal tract. By blocking the absorption of additional phosphorus from the diet, it prevents phosphorus levels in the blood from rising and helps maintain normal phosphorus concentrations in the blood. In excess, stomach acid can cause ulcers. Aluminum hydroxide’s antacid properties allow it to bind to and neutralize stomach acid, thereby creating a less acidic environment in the stomach, which in turn can prevent ulcers from forming or worsening. In certain circumstances, your veterinarian may recommend a compounded formulation of aluminum hydroxide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Aluminum Hydroxide Directions Follow the directions on the drug label or as provided by your veterinarian. For aluminum hydroxide to be effective, it should be given just before a meal or mixed into a pet&#039;s food. The frequency that you will use this medication is highly dependent on the species and reason it is being used. Your veterinarian will determine the best course of treatment for your pet, based on its symptoms and characteristics. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of aluminum hydroxide. Generally, they may instruct you to give it prior to, or mixed with, your pet’s next meal. However, depending on your veterinarian’s directions, if it is almost time for your next dose, they may instruct you to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Aluminum Hydroxide Possible Side Effects Side effects of aluminum hydroxide are quite rare. Constipation is the most common side effect seen. In horses, a decreased appetite may be observed. Human Side Effects While aluminum hydroxide is a human medication, there are different dosages and side effects for humans.  If you accidentally ingest medication intended for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of aluminum hydroxide Aluminum Hydroxide Overdose Information Aluminum toxicity is generally only caused by large overdoses, and the most likely sign of an overdose is constipation. Electrolyte imbalances may be possible and can present differently in each pet. Rarely, aluminum toxicity can occur in pets with kidney disease. Symptoms of aluminum toxicity may include weakness, incoordination, or stumbling. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Aluminum Hydroxide Storage Aluminum hydroxide should be stored at controlled room temperatures and avoid freezing. Protect this medication from extreme hot and cold temperatures. Always confirm storage requirements by reading the label. Keep the container tightly closed in order to protect the contents from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]