[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a cat stay on famciclovir?", "acceptedAnswer": {"@type": "Answer", "text": "Famciclovir is generally well tolerated and often used for several weeks in a row. Talk with your veterinarian to determine the best medication for your pet based on their diagnosis.  "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Famciclovir", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-492812844.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-492812844.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/famciclovir"}, "datePublished": "December 8, 2022", "dateModified": "December 8, 2022", "description": "Famciclovir is a human medication frequently prescribed by veterinarians to treat herpes infections in cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Famciclovir? Famciclovir is a human antiviral medication that is commonly used in the veterinary field to treat herpes infections in cats. While famciclovir is not a cure, it can help improve symptoms and decrease shedding of the virus. How Famciclovir Works Famciclovir is an antiviral medication. It works by blocking the virus’s ability to make more DNA and replicate. It will not kill the viruses that are currently circulating in the body, but it can prevent the virus from replicating out of control. Famciclovir is FDA-approved for human use. Famciclovir is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your veterinarian may recommend a compounded formulation of famciclovir. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Famciclovir Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine the appropriate dose. This medication is generally given twice daily without food. If your cat vomits after taking this medication, your veterinarian may recommend then give the next dose with a small amount of food. Missed a Dose? Speak with your veterinarian about what to do If you forget to give a dose of famciclovir. Generally they may advise you to give it when you remember. However, if it is almost time for your pet’s next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, they may instruct you to not give extra or double doses. Famciclovir Possible Side Effects Famciclovir is generally well tolerated. Side effects may include: Diarrhea Increased thirst Increased urination Weight loss Vomiting If you believe your pet is experiencing any side effects, consult your veterinarian. Human Side Effects While this is also a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, immediately seek medical attention, or call the   national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Your veterinarian may recommend periodic blood tests to ensure your pet is tolerating the medicine well. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of famciclovir Famciclovir Overdose Information Information and research is limited regarding overdoses of this medication in pets. Symptoms may include vomiting, diarrhea, and increased thirst. If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Famciclovir Storage Famciclovir should be stored at controlled temperatures between 68-77 F. Brief exposures to temperatures between 59-86 F are acceptable. Keep the container tightly closed in order to protect it from moisture and light. Always confirm storage requirements by reviewing the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]