[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Piroxicam", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-526490509.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-526490509.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Cancer, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/piroxicam"}, "datePublished": "September 9, 2022", "dateModified": "May 18, 2023", "description": "Piroxicam is a medication commonly prescribed to help with cancer treatment in animals.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Piroxicam? Piroxicam is a non-steroidal anti-inflammatory drug (NSAID) with anti-tumor activity. It is most often prescribed by veterinarians for cancer treatment in animals.   Veterinarians commonly prescribe piroxicam to treat a type of bladder cancer called transitional cell carcinoma (TCC) in dogs and cats. Piroxicam can also help treat other types of cancer, including mammary (breast) tumors, lung tumors, and squamous cell carcinoma.   Piroxicam is FDA-approved for use in humans under the brand name Feldene®. Piroxicam is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field as an anti-cancer treatment, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of piroxicam. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here.  How Piroxicam Works Veterinarians primarily prescribe piroxicam for its anti-tumor effects. The exact way that piroxicam works against tumors is unknown, but it appears to treat cancer in several ways. Piroxicam acts on the immune system by helping it identify and kill cancer cells. Piroxicam, like other NSAIDs, works by inhibiting an enzyme called cyclooxygenase, or COX, which produces pro-inflammatory chemicals. Suppressing COX activity reduces inflammation that is caused by tumor cells. Piroxicam appears to also inhibit blood vessel growth in tumors.    Piroxicam Directions Follow directions closely as provided on the drug label or as provided by your veterinarian. Your veterinarian will determine the appropriate dosage based on your pet’s weight and condition. This medicine is commonly given every 24-48 hours, but your veterinarian may recommend a different schedule. Do not give this medication more often or in a larger amount than prescribed without first speaking to your veterinarian.  Although piroxicam can be given with or without food, it is usually best to give it with a meal to minimize any potential stomach upset. Give piroxicam for as long as your veterinarian recommends.  Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of piroxicam. Generally, they may advise you to give it when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule.. In most cases, your veterinarian may instruct you to not give extra or double doses.   Piroxicam Possible Side Effects When giving your pet piroxicam, it is important to watch for side effects, especially signs of stomach or intestinal bleeding. This can be a serious condition, so be sure to contact your vet immediately, or seek emergency veterinary care, if you see: Diarrhea or vomiting Blood in your pet’s vomit or feces. Blood in vomit can appear bright red or dark (often like coffee grounds).   Black, tar-like stool Additional side effects of piroxicam may include: Decreased appetite Neurologic effects (lack of coordination, weakness, seizures) Itching or skin rash Increased thirst or urination Coughing or trouble breathing  Swelling of the limbs or belly If you believe your pet may be experiencing any side effects of piroxicam, consult your veterinarian. Call Your Vet If:•    Severe side effects are seen (see above) especially bloody vomit or stool•    Your pet’s condition worsens or does not improve with treatment•    You see or suspect an overdose•    You have additional questions or concerns about the use of piroxicam Human Side Effects While peroxicam  is a human prescription medication, there are different dosages and side effects that can occur in humans. Pregnant woman should use caution when administering piroxicam to their pets and make sure that they wash hands with soap and water after administration to avoid exposure to the drug. If you are allergic to this medication, wear gloves when handling, If you accidentally ingest this medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222.  Monitoring Periodic recheck exams and blood work tests to monitor liver and kidney health are usually necessary for pets taking piroxicam, especially those taking piroxicam long term.  Your veterinarian may recommend additional testing depending on your pets&#039; individual needs, other medications they may be on and/or the underlying issue this medication is being used to treat. Piroxicam Overdose Information Overdoses—even relatively small ones—can cause harm such as stomach ulcers and perforation of the stomach and intestines. Vomiting and vomiting blood is the most common sign of a piroxicam overdose. Piroxicam overdoses can also cause sudden kidney failure. Emergency veterinary treatment is usually necessary for overdoses of piroxicam. If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661ASPCA Animal Poison Control (888) 426-4435  Piroxicam Storage Piroxicam should be stored at controlled temperatures between 68-77 F and brief exposure to temperatures 59°-86°F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reviewing the label. Compounded medications should be stored according to the compounding pharmacy’s label.Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/martin-dm "}]