[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Nexgard® available only as a prescription medication?", "acceptedAnswer": {"@type": "Answer", "text": "Nexgard® is available by prescription only. It is important to work with your veterinarian to ensure the best flea and tick prevention plan for you and your pets specific needs. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Pekic"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Nexgard® (afoxolaner)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-854033746.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-854033746.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/nexgard"}, "datePublished": "December 22, 2022", "dateModified": "December 22, 2022", "description": "Nexgard® is a chewable medication used to treat and prevent fleas and certain ticks in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most frequently asked questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Nexgard®? Nexgard® is an oral chewable tablet used in the treatment and prevention of fleas and certain ticks in dogs. For tick prevention, Nexgard® is indicated for the treatment and control of the American dog tick, black-legged tick, lone star tick, and brown dog tick. Nexgard® is also used in an extra-label capacity to treat demodectic mange, sarcoptic mange, and ear mites in dogs. It has also been used extra-label in cats for the treatment of ear mites and fleas, pigs for the treatment of scabies, and birds for the treatment of bird lice. The term extra-label or off-label use means that a medication can be used in a way or in a particular species that is not specified on the medication label. While veterinarians often prescribe medications for extra-label uses, your veterinarian will determine whether this medication is right for your dog. How Nexgard® Works The active ingredient in Nexgard® is afoxolaner, which belongs to a newer class of flea and tick preventatives called isoxazolines. Isoxazolines eliminate fleas and ticks by over-exciting their nervous system, causing paralysis and death. Nexgard® works within the first few hours after administration to kill fleas present on your pet. It is dosed for dogs by weight, so it is important to use the correct-sized medication for your pet. Weighing your dog regularly will ensure that you are using the correct product size. Nexgard® Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is given once a month by mouth in dogs weighing 4 pounds or more and 8 weeks of age or older. You can give Nexgard® with or without food. If your dog vomits this medication within two hours of giving it, redose with another full chew. Missed a Dose? If you forget to give a dose of Nexgard®, give it when you remember and resume a monthly dosing schedule. Do not give extra or double doses. If it has been a long period of time since the last dose was given, you may see fleas temporarily during the missed time. Nexgard® Possible Side Effects This medication is well tolerated in most pets, but side effects may include: Vomiting Dry or itchy skin Lethargy Diarrhea Loss of appetite Allergic reactions: hives or facial swelling Neurologic side effects have been seen after using medications in this class of drugs. Tell your veterinarian if your dog has a history of seizures or other neurologic disease. Neurologic side effects may include: Muscle tremors Lack of coordination Seizures Human Side Effects This medication is not intended for use in humans. It is recommended to wash your hands after administering this medication. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Nexgard® Nexgard® Overdose Information Nexgard® has a wide margin of safety. Vomiting may be the only sign of an overdose of Nexgard®. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Nexgard® Storage Nexgard® should be stored at controlled temperatures below 86 F and brief exposure to temperatures up to 104 F is acceptable. Keep the medication in the provided blister packs until ready to use to protect from moisture and light.  Keep out of reach of children and pets."}]