[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Proin® (phenylpropanolamine)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1297896978.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1297896978.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/proin"}, "datePublished": "December 8, 2022", "dateModified": "December 8, 2022", "description": "Proin® is an FDA-approved and veterinarian prescription medication used to treat urinary issues in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Proin®? Proin® (phyenlpropanolamine) is an FDA approved and veterinarian prescribed medication used to treat urinary incontinence in dogs. Proin® is not effective in dogs with incontinence due to neurologic disease or malformations. It is also used in an extra-label capacity to treat urinary incontinence in cats. The term off-or extra- label use means that a medication can be used in a way or in a particular species that is not specified on the medication label. Off-or extra- label use of a medication can only be prescribed by a veterinarian who has direct and personal knowledge of your pet and when there are no other appropriate medications for a particular pet&#039;s circumstances. How Proin® Works Proin® is classified as a sympathomimetic amine, which is a medication that acts like certain naturally occurring chemicals in the body. Proin® treats urinary incontinence by stimulating the smooth muscles of the urethra, bladder neck, and urethral sphincter to increase tone and closing the neck of the bladder. Proin® Directions Please follow the directions on the drug label for Proin® or Proin® ER or as provided by your veterinarian.   Proin® XR is the extended-release version of this medication and is intended for once daily dosing, while the original formula may be given a few times a day depending on the prescription from your veterinarian. The extended-release tablets should not be crushed or cut to ensure their effectiveness. This medication can be given with or without food, but giving it with food may prevent digestive system upset.  Make sure that you provide your pet with ample water as this medication may cause increased thirst. Dogs may transition from Proin® to Proin® ER without a break in administration. However, do not alternate medications because the effectiveness and safety of interchangeable use has not been evaluated.  Missed a Dose? Speak with your veterinarian about what to do of you forget to give a dose of Proin®. Generally, they will advise you to give it when you remember. However, if it is almost time for your next dose, your veterinarian may recommend you skip the missed dose and resume your normal dosing schedule. In most cases, they may instruct you to not give extra or double doses.   Proin® Possible Side Effects Side effects are more likely to be seen at higher doses of this medication. Side effects may include: Vomiting High blood pressure Weight loss Protein in the urine Increased thirst Anxiety Abnormal heart rhythms Loss of appetite Restlessness High heart rate or low heart rate Panting Diarrhea Lethargy Insomnia Musculoskeletal Disorder If you believe your pet is experiencing any side effects, consult your veterinarian.  Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment. If you notice restlessness or irritability You see or suspect an overdose You have additional questions or concerns about the use of Proin® Human Side Effects This medication is not used in human medicine. If you accidentally ingest a pet medication, immediately seek medical attention or contact the national Poison Control Center hotline at 800-222-1222.    Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Proin®Overdose Information Acute overdoses are most likely to cause changes in blood pressure and heart rates, agitation, fever, hypertension, lethargy, panting, tremor, urinary retention, increased salivation, abnormal heart rhythms, vomiting and coma. In some cases, death has been reported.  Sudden death was sometimes preceded by neurologic signs, vocalization or collapse. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Proin® Storage Proin® should be stored at controlled temperatures below 68-77vF and brief exposure to temperatures between 59-104 F are acceptable. Keep tablets in their original container until ready to use. Protect from moisture and light. Overdose has been associated with dogs chewing through closed bottles of Proin® and consuming multiple tablets, it is important to store Proin® out of reach of dogs and other pets. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Patrick Chu"}]