[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much methocarbamol can a pet take?", "acceptedAnswer": {"@type": "Answer", "text": "The appropriate dose and frequency of methocarbamol will be determined by your veterinarian based on your pet’s underlying cause and symptoms. Be sure to follow the instructions on the label and administer as directed by your veterinarian.  "}}, {"@type": "Question", "name": "Does methocarbamol relieve pain in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Methocarbamol is not a direct pain medication. It is a muscle relaxant that can help relieve pain caused by muscle tremors or strain."}}, {"@type": "Question", "name": "How long does it take methocarbamol to begin working?", "acceptedAnswer": {"@type": "Answer", "text": "The exact data for this question is not available in pets. In humans, methocarbamol generally starts working about 30 minutes after it is ingested and reaches peak effectiveness in about 1-2 hours."}}, {"@type": "Question", "name": "What is methocarbamol used for in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Methocarbamol is a muscle relaxant that is prescribed to help treat muscle spasms in dogs, cats, and horses. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/Ksuksa"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Methocarbamol (Robaxin®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-178712120.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-178712120.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/methocarbamol-robaxin"}, "datePublished": "July 7, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Howe discusses the use of methocarbamol medication in pets, including possible side effects and commonly asked questions.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet What is Methocarbamol? Methocarbamol is an oral medication that is prescribed to help treat muscle spasms in dogs, cats, and horses. It is a muscle relaxant used to treat pets with intervertebral disc disease (IVDD) and traumatic muscle strains. It is often used in safe conjunction with other medications used to treat IVDD and traumas, like non-steroidal anti-inflammatory drugs (NSAIDs), gabapentin and other pain control medications. Methocarbamol can also be used to treat muscle spasms from being poisoned by strychnine (rat poison), metaldehyde (snail bait), or permethrin (cats only). It can also treat muscle spasms from infections such as tetanus. In horses, the injectable version of methocarbamol is used for muscle spasms or muscle strains but also to treat exertional rhabdomyolysis or “tying-up,” which is a syndrome of muscle pain and deep cramping associated with exercise. Oral use of methocarbamol in horses for exertional rhabdomyolysis is currently not an FDA approved use of this medication. However, it is readily utilized in the veterinary field. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of methocarbamol. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Methocarbamol Works Methocarbamol works on the central nervous system to indirectly lower muscle hyperactivity without working directly on the muscles. It interrupts abnormal nerve impulses from being transmitted to skeletal muscle, which are the muscles the body has direct control over, such as biceps or triceps, causing them to relax. The ability of the pets’ muscles to contract and function is not diminished in any way. Methocarbamol does not impact smooth muscles, like those present in the intestinal tract. Methocarbamol Directions This medication is generally given two to three times a day. However, the dose of methocarbamol your veterinarian may recommend is highly dependent on why it is being prescribed and the severity of the pets’ illness or symptoms. Please follow the directions on the drug label or as provided by your veterinarian. Missed a Dose? If you forget to give a dose of methocarbamol, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Methocarbamol Possible Side Effects Common side effects in dogs and cats include: SedationSalivation or excessive droolingVomitingLack of energy (lethargy)Weakness, especially hind limb weakness in geriatric petsLack of coordination (ataxia)In horses, sedation, and ataxia (lack of muscle control leading to uncoordinated movements) are possible. Deeper sedation may also be observed when used with other mediations that can also cause sedation as a side effect. Human Side Effects While methocarbamol is also a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest this medication, call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets’ individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If Severe side effects are seen (see above) or if you see or suspect an overdoseCall your vet or pharmacist if you have additional questions or concerns about the use of methocarbamolMethocarbamol Overdose Information Symptoms of methocarbamol overdose such as excessive sedation, staggering, depressed reflexes, and the inability to stand are generally due to its effects on the central nervous system. Vomiting, salivation, weakness, and difficulty walking may also be observed. Do not induce vomiting at home. Pets who have an altered state of consciousness are more likely to aspirate, or breathe in the vomit, which may lead to severe complications. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Methocarbamol Storage Methocarbamol should be stored at controlled room temperatures between 68-77°F (20°C to 25°C), but always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]