[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long should a pet be on clindamycin?", "acceptedAnswer": {"@type": "Answer", "text": "The length of time your pet is on clindamycin will depend on what type of infection your pet is being treated for and the location of the infection. Some superficial skin infections may take only a week to treat, but deeper infections, like those of the bone, may take four weeks or more. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Clindamycin", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-872828654.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-872828654.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/clindamycin"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Clindamycin is a medication commonly prescribed by veterinarians to treat various infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Clindamycin? Clindamycin is an antibiotic medication used in dogs and cats to treat skin infections, wounds, abscesses, respiratory infections, and oral infections related to dental disease. Clindamycin is also used off-label for the treatment of susceptible infections in other species such as birds, ferrets, and reptiles. It is important to note that clindamycin should not be given to species including horses, cows, sheep, goats, and other small mammals, as clindamycin can cause fatal diarrhea in these species. Clindamycin is also used off-label to treat certain protozoal infections in dogs and cats such as babesiosis, hepatozoonosis, neosporosis. and toxoplasmosis. The term off- or extra-label use means that a medication is prescribed for a certain use, or in a particular species, that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. How Clindamycin Works Clindamycin is an antibiotic that is subclassified as a lincosamide. Lincosamide antibiotics such as clindamycin block the formation of crucial proteins in certain strains of susceptible bacteria, which prevents the bacteria from multiplying and growing. Depending on the concentration of clindamycin, location of the infection, and strain of the bacteria, clindamycin may also cause bacterial death. In certain circumstances, your vet may recommend a compounded formulation of clindamycin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Clindamycin Directions Follow the directions on the drug label for the liquid or tablets or as provided by your veterinarian. This medication has a bitter taste, which may make administration difficult and cause drooling. Offering this medication with food may help. Give your pet at least a tablespoon of water or a small amount food following administration of clindamycin pills, subject to the instructions of your veterinarian. Administering probiotics while administering clindamycin can help to prevent digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of clindamycin. Generally, they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Clindamycin Possible Side Effects Like all antibiotics, clindamycin can cause gastrointestinal side effects:  Vomiting Diarrhea Lack of appetite Lethargy Additional side effects may include: Drooling Bloody diarrhea Injury of the esophagus in cats Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest clindamycin prescribed for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: You see severe side effects (above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of clindamycin Clindamycin Overdose Information Overdoses of clindamycin are very rare. Long-term overdoses could include loss of appetite, vomiting, weight loss, stomach ulcers, liver irritation, kidney damage, or gallbladder disease. If you suspect an overdose, contact your veterinarian immediately, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Clindamycin Storage Commercially available liquid and tablet versions of clindamycin should be stored at controlled room temperatures between 68-77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]