[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is toltrazuril used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Toltrazuril is used for the treatment of coccidia infections (coccidiosis) in dogs and puppies."}}, {"@type": "Question", "name": "How much toltrazuril can I give my dog?", "acceptedAnswer": {"@type": "Answer", "text": "With any medication, the safest way to know the proper dose for your dog is to ask your veterinarian and follow the directions on the drug label. Your veterinarian will recommend the appropriate dose for your dog depending on their individual needs, other medications they may be on, and their age, weight, and breed."}}, {"@type": "Question", "name": "Is toltrazuril safe for pregnant dogs?", "acceptedAnswer": {"@type": "Answer", "text": "It is not known if toltrazuril is safe for pregnant dogs, as reproductive and nursing studies have not been performed in animals. Speak with your vet to ensure this medication is right for your pet. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/SeventyFour"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Toltrazuril for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1457845439.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1457845439.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/toltrazuril-dogs-and-cats"}, "datePublished": "September 15, 2023", "dateModified": "September 15, 2023", "description": "Toltrazuril is sometimes used for the treatment of specific intestinal infections in dogs and cats. Learn how toltrazuril works, possible side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Toltrazuril? Toltrazuril is a prescription antiprotozoal medication. It has been used by veterinarians to treat coccidiosis, an intestinal protozoal infection that typically causes diarrhea in dogs and cats. Coccidiosis most commonly affects puppies and kittens, especially in a shelter environment. Toltrazuril has also been used for treating the shedding stage of toxoplasmosis in cats. The drug  has not been FDA-approved for any use. It is important to note that another drug, Albon® (sulfadimethoxine), is the only FDA-approved drug for the treatment of coccidiosis in dogs and cats. However, some coccidia strains may have developed resistance to Albon® over time, which means using Albon® to treat coccidia may not be as effective as it once was. The use of an alternative antiprotozoal medication, such as toltrazuril or ponazuril, may be ordered by a veterinarian where Albon® has not been effective. Toltrazuril is not currently FDA-approved or available in the United States. In certain circumstances, your veterinarian may be able to order it from a reputable veterinary compounding pharmacy. In certain circumstances, your vet may recommend a compounded formulation of toltrazuril. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Toltrazuril Works Coccidia belong to a subclass of parasites called protozoa that cause infection and disease in the gastrointestinal system. Toltrazuril is a medication that destroys all life stages of coccidia. It interferes with the coccidia’s abilities to multiply, form a cell wall, and make the proteins necessary for their survival, thereby destroying the coccidia. Toltrazuril Directions Follow the directions as provided by your veterinarian. Toltrazuril can be given with or without food, but giving it with food can decrease the risk of digestive upset. Toltrazuril should not be used in animals who are sensitive to it, or with other medications categorized in the same antiprotozoal drug class such as ponazuril. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of toltrazuril. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Toltrazuril Possible Side Effects At this time, side effects have not been reported in this medication.  Human Side Effects Avoid direct contact with the medication by wearing disposable gloves and washing your hands after administering this medication. This medication is not for use in humans. If you accidentally ingest this medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdoseYou have additional questions or concerns about the use of toltrazurilToltrazuril Overdose Information Studies have not been performed to evaluate the toxicity of toltrazuril in animals. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Toltrazuril Storage Toltrazuril should be stored at controlled room temperatures from 68 F to 77 F. Always confirm storage requirements by reading the pharmacy’s label. Keep the container tightly closed in order to protect its contents from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]