[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mirtazapine (Mirataz®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1279139884.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1279139884.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/mirtazapine-mirataz"}, "datePublished": "September 9, 2022", "dateModified": "July 25, 2023", "description": "Mirtazapine is commonly prescribed to treat unwanted weight loss in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Mirtazapine? Mirtazapine is used in cats and dogs to treat unwanted weight loss caused by various conditions, such as liver, kidney, or stomach disease, where a lack of appetite and nausea work hand in hand to decrease food intake. Mirtazapine can also be used to counteract weight loss caused by chemotherapy. Mirtazapine transdermal ointment is FDA-approved in cats to control unwanted weight loss under the brand name Mirataz®. Mirtazapine is not currently FDA approved for use in dogs as a veterinary medication, either as an ointment, tablet, or other form. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label.  In certain circumstances, your vet may recommend a compounded formulation of mirtazapine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here.  How Mirtazapine Works Mirtazapine was initially developed for use in humans as an antidepressant. It is not fully understood how this medication works, but it is known to increase certain neurotransmitters in the brain. In humans, appetite stimulation is a common side effect of mirtazapine, which is why it is used in pets to increase appetite and promote weight gain. Experts have theorized that mirtazapine’s impact on appetite is due to its ability to work as an antagonist to the brain’s 5-HT2c receptor, which is responsible for appetite inhibition. Mirtazapine also acts as an antagonist of 5-HT3 receptors located at the brain’s chemoreceptor trigger zone (CTZ), which controls vomiting. Mirtazapine Directions Follow the directions on the drug label or as provided by your veterinarian.  Do not administer transdermal versions of this product orally, to the eye, or directly into the ear canal. Alternate administrations of transdermal versions between the left and right inner ear flap (pinna) of the ears. Avoid contact with the treated area for two hours after administration. Remember to wear gloves when administering transdermal products. Dispose of used gloves and wash hands after each application.  Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of mirtazapine. Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses.   Mirtazapine Possible Side Effects The most common side effects of mirtazapine are related to application site reactions such as redness or irritation. Other side effects include: Drowsiness or sedation Increased vocalization  Vomiting Hyperactivity Low blood pressure  Increased heart rate An allergic reaction to this medication may present as difficulty breathing, hives or facial swelling If you believe your pet may be experiencing any side effects of mirtazapine, consult your veterinarian. Human Side Effects While mirtazapine is also a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest this medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222.  In the event of accidental skin exposure to Mirataz®, wash the affected area thoroughly with soap and warm water. In the event of accidental eye exposure to Mirataz®, flush eyes thoroughly with water. Monitoring Typically, beyond monitoring your pet’s response to mirtazapine, no specific monitoring is required, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Upon stopping mirtazapine transdermal ointment (Mirataz®), it is very important to monitor your pet&#039;s food intake. If food intake drops dramatically (&gt;75%) for several days or your pet stops eating for more than 48 hours, contact your veterinarian. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of mirtazapine Mirtazapine Overdose Information The most common signs of overdose are: vocalization, agitation, vomiting, ataxia (abnormal gait), restlessness, tremors (trembling), hypersalivation (drooling), increased respiratory rate, increased heart rate and lethargy. If you suspect an overdose, immediately seek emergency veterinary care or contact  an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435  Mirtazapine Storage Mirtazapine should be stored at controlled temperatures below 77°F. Always confirm storage requirements by reviewing the label. Mirtazapine is recommended to be discarded within 30 days of first use.  Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.  Featured Image: iStock.com/itchySan"}]