[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Capstar® a preventative?", "acceptedAnswer": {"@type": "Answer", "text": "Capstar® is used as needed to kill adult fleas. It is not a preventative. A monthly flea preventative should be used to help avoid infestations. Capstar® can be used in combination with monthly flea preventative treatments. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/PhotoAttractive"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Capstar® (Nitenpyram)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1135362773.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1135362773.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog, Flea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/capstar"}, "datePublished": "July 12, 2022", "dateModified": "August 17, 2022", "description": "Capstar® is commonly prescribed to treat fleas in cats and dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Capstar®?  Capstar® (nitenpyram) is a fast-acting, oral medication used to treat fleas in cats and dogs. Capstar® kills adult fleas before they can lay eggs and cause an infestation. The medication begins working within 30 minutes of application and kills over 90% of adult fleas within a few hours. If fleas have already infested your pet’s coat, Capstar® can be safely combined with other flea prevention treatments that kill immature fleas on the pet and in the environment. How Capstar® Works A single, female adult flea can lay as many as 2,000 eggs during her lifetime. These eggs develop into larvae, then pupae, and finally into adults within three weeks. Capstar® stops this cycle by killing adult fleas before they can lay eggs. Because it does not treat the immature stages of fleas, additional doses of Capstar® and other preventative flea medications may be necessary to eliminate infestations. Capstar® Directions Capstar® is available in three forms: 11.4 mg for cats between 2-25 pounds11.4 mg for small dogs between 2-25 pounds57 mg for large dogs between 25.1-125 poundsBe sure to know your pet’s accurate weight to determine which size of Capstar® your pet needs. It’s important to give the correct dosage based on your pet’s weight. Refer to instruction label on box for complete information. Missed a Dose? A single dose of Capstar® should kill adult fleas on your pet. However, if your pet has a flea re-infestation, it is safe to give another dose of Capstar® up to once daily as needed to kill adult fleas. If you are unsure whether your pet swallowed the tablet, an additional dose may be administered. Capstar® Possible Side Effects Your dog or cat may start scratching itself after receiving Capstar®. This is typically because of the pet’s reaction to the fleas, not the medication itself. Scratching is usually temporary. Serious side effects (such as seizures, incoordination, or death) are more likely in animals that weigh less than 2 pounds, are younger than 8 weeks of age, or are already in poor health. Do not administer Capstar® without consulting with your veterinarian if your pet weighs less than 2 pounds. Consult with your veterinarian before use if your pet is ill or has a health condition. According to the Capstar® label side effects may include: LethargyDepressionVomitingDiarrheaDecreased appetiteHyperactivityTremblingNeurologic signs (such as seizures or incoordination)PantingAllergic reactions (such as hives, swollen face, or trouble breathing)VocalizationExcessive droolingNervousnessFeverSide effects in cats are uncommon and can include: HyperactivityPantingVocalizationDecreased appetiteFeverNervousnessDiarrheaDifficulty breathingDroolingNeurologic signs (such as seizures or incoordination)Dilated pupilsTremblingHuman Side Effects This product is not intended for use in humans, hand washing after prolonged contact with this product is recommended. If you accidentally ingest this medication, please call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Contact your veterinarian immediately if any side effects are seen. Seek immediate emergency treatment for any severe signs, including but not limited to seizures, lack of coordination, difficulty breathing, or significant lethargy. Call your vet or pharmacist if you have any questions or concerns about the use of Capstar®. Capstar® Overdose Information Overdoses are unlikely to cause significant problems. However, if you observe your pet exhibiting any abnormal signs or behaviors that you suspect may be related to an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline at (855) 764-7661. ASPCA Animal Poison Control (888) 426-4435 Capstar® Storage Pyrantel should be stored at controlled temperatures between 59°-86°F. To protect from light, keep tablets in its original packaging until ready to use.  Keep out of reach of children and pets."}]