[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much lorazepam can I give my dog?", "acceptedAnswer": {"@type": "Answer", "text": "With any medication, the safest way to know the proper dose for your dog is to ask your veterinarian. Your veterinarian will recommend the appropriate dose for your dog depending on their individual needs, other medications they may be on, and their age, weight, and breed."}}, {"@type": "Question", "name": "How long does it take for lorazepam to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Lorazepam is a short-acting medication that takes effect in about 30–60 minutes."}}, {"@type": "Question", "name": "Is lorazepam safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Lorazepam can be used safely in dogs, but in very specific circumstances and only under the direct supervision of your veterinarian. It is best to discuss your pet’s medications and medical conditions with your veterinarian first before giving lorazepam, as there may be health risks to your pet if they are hypersensitive to it, have certain medical conditions, or taking certain medications. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/miniseries"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lorazepam for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1490713001.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1490713001.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication, Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/lorazepam-dogs"}, "datePublished": "August 31, 2023", "dateModified": "August 31, 2023", "description": "Lorazepam is a prescription medication used to treat fear and anxiety in dogs, and used as an emergency medication for seizures in dogs. Learn how lorazepam works, including direction, possible side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Lorazepam? Lorazepam is a prescription anti-seizure and anti-anxiety medication used in the emergency treatment of seizures in dogs and for short-term management of fear and anxiety. Lorazepam is most commonly used as an intravenous injection to treat active seizures in the hospital under the supervision of a veterinarian. It can sometimes be used as a short-acting oral medication and best administered at the earliest sign of your dog’s anxiety, ideally about an hour before your dog is exposed to the anxiety-triggering event, such as loud noises (thunderstorms and fireworks), separation anxiety, and other situations. Lorazepam is FDA-approved for human use under the brand name Ativan®, Lorazepam Intensol®; and as generic lorazepam. Lorazepam is currently not FDA-approved as a veterinary medication. However, it is sometimes utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Lorazepam is classified as a Drug Enforcement Administration Schedule IV controlled substance. As such, this may affect the prescribing, dispensing, and refilling of this medication due to federal and state law. Likewise, it is illegal for you to consume, sell, or give away your pet’s lorazepam. Lorazepam should not be used in dogs with aggression because sometimes, lorazepam may change your pet’s behavior in the opposite way from what is expected, causing your pet’s aggression to worsen. Lorazepam Considerations Lorazepam should not be used in pets with certain medical conditions, such as glaucoma and severe breathing conditions, or in pets who are hypersensitive to it. Giving lorazepam with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. How Lorazepam Works Lorazepam is classified as a benzodiazepine. It enhances the activity of certain chemical messengers in the brain responsible for slowing down, stabilizing, and calming the nervous system. This causes sedation, muscle relaxation, and the suppression of seizures. Lorazepam Directions Follow the directions on the drug label or as provided by your veterinarian. Lorazepam can be given with or without food, but giving it with food can decrease the risk of digestive upset. If your veterinarian recommends that you discontinue this medication for any reason, it is best to wean your pet off slowly, under a veterinarian&#039;s supervision, especially if your pet has been taking it long-term. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of lorazepam. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Lorazepam Possible Side Effects The most common side effects of lorazepam are grogginess and loss of balance. However, lorazepam can change your pet’s behavior, working in the opposite way from what is intended. For this reason, possible side effects of lorazepam include: Hyperactivity Aggression Increased appetite Human Side Effects Lorazepam is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. If you accidentally ingest this medication, immediately seek medical attention. Call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of lorazepam Lorazepam Overdose Information The severity of a lorazepam overdose depends on the species, the amount given by weight, and for how long it was given. Symptoms of an overdose in dogs may include sedation, hyperactivity, loss of balance, and vomiting. Symptoms in cats may include loss of balance, increased vocalization, and agitation. Large overdoses can be serious, resulting in severely low blood pressure and coma. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Lorazepam Storage Lorazepam tablets and capsules should be stored at 77 F with brief exposures permitted to 59–86 F. Keep the container tightly closed to protect the medicine from moisture and light. Keep out of reach of children and pets."}]