[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cefpodoxime Proxetil (Simplicef®, Cefpoderm™)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1176846287.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1176846287.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Skin health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cefpodoxime-proxetil-simplicef-cefpoderm"}, "datePublished": "September 8, 2022", "dateModified": "May 10, 2023", "description": "Cefpodoxime is an antibiotic medication also available under the brand names Simplicef® and Cefpoderm™. It is commonly prescribed to treat skin infections in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Cefpodoxime? Cefpodoxime is an antibiotic that is commonly used to treat skin infections in dogs. Your veterinarian may also prescribe it to treat other types of infections. Cefpodoxime is available as a generic medication, but also available under brand names: Simplicef® and Cefpoderm™. Currently, cefpodoxime is only FDA approved for use in dogs for the treatment of certain skin infections, but it is also used off-label in cats and horses. This is called extra-label or off-label use because this use isn’t described on the drug label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether this medication is right for your pet. How Cefpodoxime Works Cefpodoxime is an antibiotic in a class called third generation cephalosporins. Third generation means they have a wider range of efficacy over first and second generation antibiotics in this class. Cefpodoxime kills vulnerable bacteria by interfering with the production of their cell walls. Specifically, cefpodoxime binds to and inhibits proteins that are essential to the development of the bacterial cell wall. Cefpodoxime does not kill all types of bacteria. It is also ineffective against viruses, fungi, and parasites. Inappropriate use of antibiotics, including cefpodoxime, can lead to the development of antibiotic-resistant bacteria. As such, use antibiotics exactly as directed by your veterinarian. Cefpodoxime Directions Closely follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine the appropriate dosage based on your pet’s weight and the type of infection. Cefpodoxime tablets are typically administered by mouth once daily. It is important to administer the exact amount of medication prescribed by your veterinarian and complete the full treatment course, usually even if your pet seems to have recovered from the infection. Cefpodoxime can be given with or without food. Giving it with a small meal may help reduce vomiting or other digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of cefpodoxime. Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses.  Cefpodoxime Possible Side Effects The most common side effects of cephalexin involve irritation of the digestive system: Diarrhea Vomiting Decreased appetite Rarely, allergic reactions can occur. Symptoms of an allergic reaction to an antibiotic may include:  Skin rash (especially in the ears) Hives Facial swelling Pale gum color Trouble breathing Collapse  If you believe your pet may be experiencing any side effects of fluoxetine, consult your veterinarian. If your pet shows any signs of an allergic reaction, immediately seek emergency veterinary care.  It is important to inform your veterinarian of all allergies your pet may have. Do not give cefpodoxime to pets allergic to penicillin or cephalosporin antibiotics. Human Side Effects While some formulations of cefpodoxime are designed as a human prescription medication, there are different dosages and side effects that can occur in humans. People that are allergic to penicillin or cephalosporin antibiotics should avoid contact with cefpodoxime. If you accidentally ingest this medication, immediately seek medical attention  or call the national Poison Control Center hotline at 800-222-1222. Monitoring Typically, beyond monitoring your pet’s response to cefpodoxime, no specific monitoring is required for this medication. However, your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of cefpodoxime Cefpodoxime Overdose Information Symptoms of an overdose of cephalexin may include vomiting, diarrhea, lethargy and inappetence. Large overdoses may change your pets’ white and red blood cell counts. If you suspect an overdose, immediately seek emergency veterinary care  or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661ASPCA Animal Poison Control (888) 426-4435 Cefpodoxime Storage Cefpodoxime should be stored at controlled temperatures between 68-77 F. Keep the container tightly closed to protect this medication from moisture and light. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.  Featured Image: iStock.com/Evrymmnt"}]