[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How quickly does Clavamox® work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Clavamox® starts to work in your pet’s system after a few hours, but it can take up to five days for a noticeable improvement in your pet&#039;s condition."}}, {"@type": "Question", "name": "What bacteria does Clavamox® treat?", "acceptedAnswer": {"@type": "Answer", "text": "Clavamox® is typically effective against most strains of E.coli, Klebsiella, Haemophilus, Salmonella, Pasteurella, Staphylococcus, and Streptococcus, among others. If you have questions about the susceptibility of your pet&#039;s infection to this medication, contact your veterinarian. Your vet may also recommend a bacteria culture, which can determine the type of bacteria causing your pet&#039;s infection and which antibiotic will be most effective for treatment."}}, {"@type": "Question", "name": "What are the most common side effects of Clavamox® in dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "The most common side effects of Clavamox® are digestive upset, including vomiting, diarrhea, and lack of appetite. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/South_agency"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Clavamox® for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1319219843.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1319219843.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication-clavamox-dogs-cats"}, "datePublished": "June 27, 2023", "dateModified": "June 27, 2023", "description": "Clavamox® is commonly prescribed in the veterinarian field to treat infections in dogs and cats. Learn more about the medication, including side effects, how Clavamox® works, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Clavamox®? Clavamox® is an antibiotic combination of amoxicillin/clavulanic acid that is commonly used in dogs and cats to treat susceptible infections, which may include urinary, respiratory, or skin infections. In dogs, Clavamox® is also used in the treatment of canine periodontal disease. Clavamox® is also used in the treatment of susceptible infections in birds and ferrets. The use of Clavamox® in these species is considered off-label. The term off- or extra-label use means that a medication can be used in a way or in a particular species that are not specified on the medication label. Veterinarians can legally prescribe medication for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. Amoxicillin/clavulanic acid is also a prescription medication used for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. How Clavamox® Works Clavamox® is an antibiotic that contains two ingredients: amoxicillin and clavulanic acid. Amoxicillin is classified as a penicillin antibiotic. Antibiotics in this class prevent susceptible bacteria from creating a key part of cell walls, which then weaken, causing the bacteria to die. Amoxicillin is often used to treat urinary tract infections, since it often concentrates in the kidney and urine. Clavulanic acid prevents certain bacteria from releasing an enzyme that breaks down amoxicillin and renders it ineffective. With the addition of clavulanic acid, amoxicillin can treat a wider spectrum of bacteria compared to treatment with amoxicillin alone. Clavamox® Directions Follow the directions on the drug label for Clavamox® Liquid or Clavamox® Chewable tablets or as provided by your veterinarian. Clavamox® can be given with or without food, but giving it with a meal can help to prevent any digestive upset that may occur when using this medication.   Liquid versions of Clavamox® are usually supplied as a powder. Follow the mixing directions closely and note the exact amount of water that should be mixed with the powder to create the suspension. Mixed medication must be stored in the refrigerator. Any unused portion of the suspension should be discarded after 10 days.  Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Clavamox®. Generally, they may instruct you to give it when you remember. However, if it is almost time for your next dose, they may instruct you to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Clavamox® Possible Side Effects Like all other antibiotics, Clavamox® may cause stomach upset along with these other side effects:    Vomiting  Diarrhea  Lack of appetite  Penicillin allergies in animals are rare, but they can happen. Clavamox® contains amoxicillin, which is closely related to penicillin. This medication should not be used in pets who have a history of allergic reaction to penicillin or cephalosporins. Signs of an allergic reaction may include: Skin rashes (especially in the ears)  Watery eyes  Hives (urticaria)  Facial swelling  Vomiting  Diarrhea  Fever  Anaphylaxis    Clavamox® should not be used in rabbits or other herbivores, as life-threatening diarrhea can occur in these animals. Human Side Effects While this is a human prescription medication, there are different dosages and different side effects that can occur in humans. If you accidentally ingest a medication prescription for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.  If you are allergic to penicillin, talk to your veterinarian about using another medication or ensure that you wear gloves while handling this medication. Monitoring  A culture should be obtained prior to treatment to determine whether the bacteria is susceptible to Clavamox.® Otherwise, no specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication.  Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Clavamox® Clavamox® Overdose Information An overdose of Clavamox® is unlikely to cause toxicity but it may cause vomiting, diarrhea, and lack of appetite. Large overdoses may cause kidney disease, loss of coordination, or seizures.  If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Clavamox® Storage Clavamox® chewable tablets and powders for reconstitution should be stored at controlled room temperatures below 77 F. Once mixed, Clavamox® oral suspension should be stored in the refrigerator and any unused portion discarded after 10 days.   Keep the container tightly closed to protect the medicine from moisture and light. Always confirm storage requirements by reading the label.    Keep out of reach of children and pets."}]