[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does phenobarbital treat in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Phenobarbital is used in dogs to treat seizure disorders. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/RichLegg"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Phenobarbital for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-487149050.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-487149050.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication, Seizures, Symptom Checker, Phenobarbital", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/phenobarbital-dogs-and-cats"}, "datePublished": "June 27, 2023", "dateModified": "October 4, 2023", "description": "Phenobarbital is commonly prescribed by veterinarians to treat seizures or epilepsy in dogs and cats. Learn how phenobarbital works in pets, including directions and possible side effects.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Phenobarbital? Phenobarbital is used to treat seizures in many species including dogs, cats, horses, rabbits, cattle, and ferrets that are diagnosed with epilepsy, brain tumors, infectious disease processes and even some toxins. It can be used on its own or in combination with other anticonvulsant (anti-seizure) medications. Phenobarbital is FDA-approved for human use. It is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. Phenobarbital is classified as a DEA Schedule IV controlled substance. As such, this may affect the prescribing, dispensing, and refilling of this medication due to requirements under federal and state law. Likewise, it is illegal for you to consume, transfer, sell, or otherwise give away your pet’s phenobarbital. How Phenobarbital Works The brain has naturally occurring chemical messengers that communicate signals throughout the nervous system. Phenobarbital is a barbiturate medication that works by promoting certain chemical messengers to slow down and stabilize activity in the brain, thereby lowering the likelihood of seizures from occurring. Phenobarbital Directions Follow the directions on the drug label or as provided by your veterinarian. Generally, your veterinarian may recommend giving phenobarbital at the same time every day. Phenobarbital can be given with or without food, but giving it with food can decrease the risk of digestive upset. If your veterinarian recommends that you discontinue this medication for any reason, it is important to follow your veterinarian’s guidance closely on how to wean your pet off this medication. Missed a Dose? Speak with your veterinarians about what to do if you forget to give a dose of phenobarbital. Generally, they may instruct you to give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Phenobarbital Possible Side Effects Lethargy, or fatigue, is commonly observed in pets when they first start taking phenobarbital. It generally occurs temporarily while their body gets used to the medication. If your pet is severely lethargic, please inform your veterinarian immediately. Additional symptoms may include: Lethargy Vomiting Diarrhea Loss of appetite Agitation Increased thirst and urination Increased appetite Liver irritation Lack of coordination Facial itching, especially in cats Human Side Effects While phenobarbital is also a prescription medication for humans, there are different dosages and side effects  for humans. If you accidentally ingest a medication intended for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of phenobarbital Phenobarbital Overdose Information Overdoses of phenobarbital can be life threatening. Symptoms of an overdose may include sedation, lethargy, lack of coordination, low blood pressure, low or high heart rate, low body temperature, decreased breathing rate, blue gums, or coma. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Phenobarbital Storage Phenobarbital tablets should be stored at controlled room temperatures between 68-77 F. The liquid version of phenobarbital should be stored at controlled room temperatures between 59-86 F. Keep the container tightly closed in order to protect the contents from moisture and light. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]