[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for Equioxx® to kick in?", "acceptedAnswer": {"@type": "Answer", "text": "Equioxx® starts working within the first 1-12 hours after administration, but it can take a few days for a noticeable change in symptoms. Your veterinarian may prescribe a loading dose (a higher dose of the medication given for a short period of time at the beginning of a new treatment) to help Equioxx® achieve noticeable relief in your horse faster."}}, {"@type": "Question", "name": "Does Equioxx® help arthritis in horses?", "acceptedAnswer": {"@type": "Answer", "text": "Equioxx® is a non-steroidal anti-inflammatory medication used to relieve pain and inflammation associated with osteoarthritis in horses. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/bluegame"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Equioxx® (firocoxib)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1184153859.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1184153859.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Horse", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/equioxx-firocoxib"}, "datePublished": "November 7, 2022", "dateModified": "March 16, 2023", "description": "Equioxx® is a prescription medication commonly prescribed to treat pain and inflammation in horses.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Equioxx®? Equioxx® is an FDA approved non-steroidal anti-inflammatory (NSAID) prescription medication used in horses to treat pain and inflammation associated with osteoarthritis. Like other medications in its class, it may also be used to control fevers and inflammation caused by other conditions. Equioxx® belongs to a subcategory of NSAIDs called COX-2 inhibitors (coxibs) that have the unique property of causing less stomach and intestinal side effects compared to traditional NSAIDs. Equioxx® is often considered to be the preferred NSAID in the treatment of fever and pain in sick foals because there are fewer side effects compared to other NSAIDs. Equioxx® is typically well tolerated in horses and is an option for long-term pain relief when used as directed by your veterinarian. How Equioxx® Works Equioxx® is a selective NSAID that is subcategorized as a COX-2 inhibitor. Like other NSAIDS, it blocks the body’s COX-2 pathway, which lowers the production of natural chemicals that trigger inflammation—reducing fever and offering pain relief. Due to its selective property, Equioxx® typically spares the COX-1 pathway that is associated with digestion, kidney health, and blood clotting. This is beneficial because it causes less side effects compared to traditional NSAIDs. However, it’s important to note that Equioxx® can still partially block these beneficial chemicals at high doses, so it’s important to follow your veterinarian’s directions exactly. Equioxx® Directions Follow the directions on the drug label or as provided by your veterinarian. Oral Equioxx® is typically given once daily for up to 14 consecutive days. It may be used for a longer period of time in an extra-label capacity as directed by your veterinarian. The term off- or extra- label use means that a medication is used in a way, or in a particular species, that is not specified on the medication label.  While veterinarians often prescribe medications for off-label uses, your veterinarian will determine the dose and duration that is right for your horse. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Equioxx®. Generally, they will advise you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Equioxx® Possible Side Effects Most animals tolerate Equioxx® well. Possible side effects may include: Sores on the mouth, face, or lips Mouth or stomach ulcers Right dorsal colitis—which can present as diarrhea, dehydration, lethargy, decreased appetite, dark mucus membranes and/or increased heart rate Kidney disease  Diarrhea or loose stools Black or tarry stool Loss of appetite Hypoproteinemia (low blood protein levels) which can present as weight loss or swelling of the limbs (edema) Jaundice (yellowing of the gums, skin, or eyes) Treatment with Equioxx® should be terminated if signs such as inappetence, colic, abnormal feces, or lethargy are observed. If you believe your pet may be experiencing any side effects, consult your veterinarian. Human Side Effects This medication is not used in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.    Monitoring Specific monitoring or routine testing while your horse is on this medication may be recommended by your veterinarian depending on your horse’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Generally, appropriate laboratory tests should be conducted to establish hematological and serum biochemical baseline data before and periodically during administration of any NSAID. Call Your Vet If: Severe side effects are seen (see above) Your horse&#039;s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Equioxx® Equioxx® Overdose Information Oral ulcers were the most common symptom of an Equioxx® overdose. These ulcers may occur on the face, lips, gums, and/or tongue. Kidney damage is also possible, so monitoring for changes in appetite, energy levels, water intake, and changes in urination is important. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Equioxx® Storage Equioxx® should be stored according to the medication label and at controlled temperatures between 59-86 F. Brief exposure to temperatures up to 104 F are acceptable. Keep the container tightly closed to protect from moisture and light. Keep out of reach of children and pets."}]