[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pentoxifylline", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1127373600.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1127373600.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/pentoxifylline"}, "datePublished": "January 31, 2023", "dateModified": "January 31, 2023", "description": "Pentoxifylline is often prescribed by veterinarians to treat certain skin conditions in dogs and cats", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Pentoxifylline? Pentoxifylline is used to treat diseases that affect blood flow in the small blood vessels. In dogs, improving blood flow is an important part in treating inflammatory disease. It also aids in the healing of skin lesions such as ulcerative dermatosis, dermatomyositis, cutaneous lupus, pinnal vasculitis, and other diseases that occur due to inflammation in the small blood vessels (vasculitis). Pentoxifylline is also used, though less frequently, to treat vasculitis and certain skin conditions in cats. In horses, pentoxifylline is used to treat septicemia but may also be used for foot/hoof related issues like laminitis or navicular disease. It can also be used for inflammation of the placenta in mares (placentitis). How Pentoxifylline Works The way pentoxifylline works is not completely understood. Pentoxifylline seems to make new red blood cells more flexible and decreases the thickness of the blood. This allows the blood to flow more smoothly and gain better access to the body’s very small blood vessels. In horses, pentoxifylline is also thought to decrease cytokines, which are chemical messengers of inflammation driven by the immune system. While pentoxifylline is FDA-approved for human use, it is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of pentoxifylline. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Pentoxifylline Directions Follow the directions on the drug label or as provided by your veterinarian. This medication should be given with food. The frequency of administration will depend on the animal’s individual condition. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of pentoxifylline. Generally, they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Pentoxifylline Possible Side Effects Side effects in dogs and cats are uncommon, but may include: Vomiting Diarrhea Loss of appetite Excitement or agitation In horses, pentoxifylline is generally well tolerated. Side effects may include: Muscle tremors Sweating Increased heart rate Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Animals that are at an increased risk for bleeding may require additional monitoring. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of pentoxifylline Pentoxifylline Overdose Information Symptoms of an overdose of pentoxifylline include vomiting, loss of appetite, increased heart rate, bloody diarrhea, bleeding, drooling, high blood pressure, agitation, and tremors or seizures. Even small overdoses in dogs can cause symptoms. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Pentoxifylline Storage Commercially available versions of pentoxifylline should be stored at controlled room temperatures between 68-77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]