[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is telmisartan used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Telmisartan is used in dogs for treatment of high blood pressure (hypertension) and excessive protein leakage into the urine (proteinuria) due to chronic kidney disease (CKD). While this is considered off-label use, your veterinarian will determine whether telmisartan is right for your dog."}}, {"@type": "Question", "name": "What is telmisartan used for in cats?", "acceptedAnswer": {"@type": "Answer", "text": "Semintra® contains telmisartan as its active ingredient. It is FDA-approved in cats to control high blood pressure (hypertension). It is also used, off-label, to manage excessive protein leakage into the urine (proteinuria) due to chronic kidney disease (CKD)."}}, {"@type": "Question", "name": "How does telmisartan help dogs with kidney disease?", "acceptedAnswer": {"@type": "Answer", "text": "Telmisartan helps dogs with kidney disease by relaxing blood vessels, thereby decreasing high blood pressure in the kidneys and reducing protein leakage into the urine."}}, {"@type": "Question", "name": "Is telmisartan good for dogs with proteinuria?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Telmisartan is effective at reducing protein leakage into the urine (proteinuria). Depending on the underlying cause of your dog’s proteinuria, your veterinarian will determine whether telmisartan is right for your dog. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Telmisartan (Semintra®) for Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1185066025.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1185066025.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/telmisartan-semintra-cats"}, "datePublished": "September 11, 2023", "dateModified": "September 11, 2023", "description": "Telmisartan, brand name Semintra®, is commonly prescribed by veterinarians to treat high blood pressure in cats. Learn how telmisartan works, including dosing, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice from your vet. What Is Telmisartan? Telmisartan is a prescription blood pressure medication used in the treatment of cats and dogs. Telmisartan is used in dogs for treatment of high blood pressure (hypertension) and excessive protein leakage into the urine (proteinuria) due to chronic kidney disease (CKD). Telmisartan can be given alone but is more often used in combination with other medications. Semintra® Oral Solution (active ingredient telmisartan) is FDA-approved for use in cats for the control of systemic high blood pressure (hypertension). It is also used, but not FDA-approved for, treatment of excessive protein leakage into the urine (proteinuria) due to chronic kidney disease (CKD). Telmisartan is FDA-approved for human use under the brand name Micardis® and generic telmisartan. Telmisartan is currently not FDA-approved as a veterinary medication for use in dogs. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your dog. In certain circumstances, your vet may recommend a compounded capsule formulation or compounded oral liquid formulation of telmisartan. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Telmisartan Considerations Telmisartan should not be used in pets with certain medical conditions, such as pregnancy, low blood pressure (hypotension), dehydration, abnormal electrolyte levels (low sodium and low potassium), moderate to severe liver disease, and in pets who are hypersensitive to it. Telmisartan studies have not been performed in pets younger than 9 months of age. Giving telmisartan with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. How Telmisartan Works Telmisartan is in a class of medications called ARBs (angiotensin II receptor blockers). Telmisartan works by blocking certain receptors in the kidneys, blood vessels, and heart that affect blood pressure and electrolyte balance. By relaxing blood vessels, telmisartan decreases blood pressure in the kidneys and reduces protein leakage into the urine. Telmisartan Directions Follow the directions on the drug label or as provided by your veterinarian. Telmisartan is best absorbed when given on an empty stomach, but it may be given with or without food. This medication should not be given to pregnant or nursing animals. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of telmisartan. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Telmisartan Possible Side Effects Vomiting Diarrhea Loss of appetite Low energy level (lethargy) Weight loss (cats) Dehydration Fainting and weakness due to low blood pressure (hypotension) Decreased levels of red blood cells (anemia) Human Side Effects If you are pregnant, avoid contact with telmisartan, as substances such as ARBs can cause fetal and neonatal birth defects and death during pregnancy in humans. While telmisartan is prescribed for use in humans, never ingest telmisartan prescribed for your pet. Wear disposable gloves when administering the medication and wash your hands afterward. Telmisartan dosages are frequently different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should never be given any medicine dispensed for a human’s use. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of telmisartan Telmisartan Overdose Information Signs of an overdose of telmisartan may include lethargy, loss of appetite, trembling, vomiting, abnormally high or abnormally low heart rate, or low blood pressure. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Telmisartan Storage Semintra® Oral Solution (telmisartan) should be stored at controlled room temperatures at or below 77 F. Brief exposures up to 104 F are acceptable. Ensure the cap is tightly closed. Semintra® should not be used beyond 6 months from the date the bottle was opened. Telmisartan tablets should be stored at controlled room temperatures at or below 77 F. Brief fluctuations with temperatures from 59 to 86 F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]