[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for methimazole to work in a cat?", "acceptedAnswer": {"@type": "Answer", "text": "Methimazole typically takes 1-3 weeks before significant improvement of clinical symptoms are seen in pet. "}}, {"@type": "Question", "name": "What is the difference between Carbimazole and methimazole?", "acceptedAnswer": {"@type": "Answer", "text": "Carbimazole is an anti-thyroid drug that is used in Europe and is not available in the United States. "}}, {"@type": "Question", "name": "Can methimazole for cats be crushed in soft food?", "acceptedAnswer": {"@type": "Answer", "text": "Most tablet forms of methimazole are designed to be given whole and should not be crushed and placed in food. Crushing tablets can decrease the efficacy or absorption of this medication and can also unmask bitter flavors. Certain compounded versions of methimazole may be crushed and mixed with other ingredients for easy administration of various formulations. A compounding pharmacy will be able to do this for certain medications. "}}, {"@type": "Question", "name": "Symptoms of too much methimazole in cats?", "acceptedAnswer": {"@type": "Answer", "text": "Symptoms of excessive amounts of methimazole may include vomiting, diarrhea, depression, decreased appetite, facial itching, and changes in blood work.  The information in this article is for educational purposes only and is not a substitute for advice, diagnosis, or treatment from a veterinarian. If you believe your animal is experiencing a medical emergency, call your veterinarian office immediately or seek immediate care from your local animal hospital.  Featured Image: iStock.com/krblokhin"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Methimazole (Tapazole®, Felimazole®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/cat.window.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/cat.window.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/methimazole-tapazole-felimazole"}, "datePublished": "April 29, 2022", "dateModified": "March 16, 2023", "description": "Methimazole is a prescription medication used to treat hyperthyroidism in cats.", "articleBody": "What is Methimazole?  Methimazole is a prescription anti-thyroid medication used for the management of hyperthyroidism. Hyperthyroidism is a condition that occurs when there is excess thyroid hormone in a pet’s system. Thyroid hormone helps regulate your pet’s metabolism. Symptoms of hyperthyroidism can include weight loss, increased vocalization, vomiting, or increased drinking and urination.    Methimazole is rarely prescribed for dogs, as they are rarely diagnosed with hyperthyroidism. Instead, it is typically prescribed to cats, especially senior cats, which are more commonly diagnosed with this disease.   Methimazole is available under the brand names of Tapazole® and Felimazole®.   How Methimazole Works  Methimazole prevents the formation of thyroid hormone by restricting the body’s use of iodine, which is used to produce thyroid hormone. Methimazole is not a cure for hyperthyroidism; it is given on a strict schedule to prevent the formation of excessive thyroid hormone. Your pet will need to be given this medication consistently for the prevention of symptoms associated with hyperthyroidism.  In certain circumstances, your vet may recommend a compounded formulation of a medication. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here.  Methimazole Directions  Follow the directions on the drug label or as provided by your veterinarian. Dosing is highly dependent on an individual cat’s needs.  Missed a Dose?  If you forget to give a dose of methimazole, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.   Possible Side Effects of Methimazole Side effects from methimazole for hyperthyroidism typically occur within the first 3 months of use. Methimazole should be used with caution and/or with extra monitoring in cats with liver disease, autoimmune diseases, kidney disease, or other blood abnormalities. Methimazole should not be used in pets that are allergic to methimazole, or pets allergic to carbimazole or polyethylene glycol.  The most common side effects are:  Not eating (anorexia)   Vomiting  Diarrhea   Depression  Mild to moderate changes in your pet’s white blood cell count, which typically self resolves   Rare side effects can include:  Severe facial itching   A decrease in blood platelet levels  Liver disease  Immune-mediated disorders  Lowered levels of thyroid hormone in the body can also uncover underlying kidney disease if present  Human Side Effects  Methimazole can affect the human thyroid as well. It’s recommended that pet parents wear gloves during administration of the medication and wash their hands with soap and water afterwards to minimize any potential exposure to the drug. Pet parents who are pregnant or nursing should wear gloves when handling this medication or when exposed to the bodily fluid of cats on methimazole.  Monitoring  Cats being treated with methimazole for hyperthyroidism should have their thyroid levels and overall blood work checked before starting treatment. Once treatment has started, a pet’s thyroid levels should be monitored after 3 weeks, and again after 6 weeks of treatment. Once appropriate testing levels are met, thyroid levels should be monitored every 3 months, and doses can be adjusted as needed. Additional testing may be recommended by your veterinarian.   Call Your Vet If:  Severe side effects are seen (see above)  You see or suspect an overdose  You have additional questions or concerns about the use of methimazole  Methimazole Overdose Information  One-time overdoses may cause the adverse reactions that are listed above. White blood cell changes, liver disease, low platelet levels and other serious side effects can also be seen. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Methimazole Storage  Methimazole should be stored at controlled room temperatures between 68-77°F. Brief exposure to temperatures 59°-86°F are acceptable. Keep the container tightly closed in order to protect from moisture and light.   Compounded medications should be stored according to the compounding pharmacy’s label.  Keep out of reach of children and pets. "}]