[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for chloramphenicol to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Chloramphenicol starts working in your pet after the first several hours. Antibiotics can take time to bring infections under control before you can observe an improvement in symptoms. Make sure to communicate with your vet if you do not notice any improvement over the course of the first week. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Zbynek Pospisil"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chloramphenicol", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1356431581.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1356431581.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Antibiotics", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/chloramphenicol"}, "datePublished": "October 7, 2022", "dateModified": "October 7, 2022", "description": "Chloramphenicol is a antibiotic medication commonly prescribed to treat fungal infections in dogs and other pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Chloramphenicol? Chloramphenicol is a broad-spectrum antibiotic that treats a wide variety of bacterial infections. However, due to the potential risks and side effects of this medication, it is usually reserved for very specific types of infections. How Chloramphenicol Works Chloramphenicol works by preventing the development of proteins in susceptible strains of bacteria that are necessary for them to survive and replicate. This antibiotic, however, can negatively affect the bone marrow in pets. To prevent antibiotic resistance, chloramphenicol is generally reserved for infections that the veterinarian has determined to be susceptible to chloramphenicol when alternative medications are not available. Chloramphenicol is currently only FDA approved for use in dogs, but it is commonly used in an off-label capacity in other species, like cats, horses, birds, reptiles, ferrets and small mammals. The term off- or extra- label use means that a medication can be used in a way or in a particular species that are not specified on the medication label. Off- or extra- label use of a medication can only be done by a veterinarian who has direct and personal knowledge of your pet and when there are no other appropriate medications for a particular pet&#039;s circumstances.  In certain circumstances, your veterinarian may recommend a compounded formulation of chloramphenicol. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Note: chloramphenicol is not intended for use in animals which are raised for food production. Additionally, it should not be administered to dogs maintained for breeding purposes.  Chloramphenicol Directions Follow the directions on the drug label or as provided by your veterinarian. While chloramphenicol is typically administered 3 times a day, your veterinarian may recommend a different dosage and frequency depending on the type of infection being treated. Generally, chloramphenicol should be given with a meal. It is important to note that this medication may turn your pet’s stool bright green. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of chloramphenicol. It is especially important for this medication to be given exactly as prescribed to be effective. Generally, if you forget to give a dose of chloramphenicol, your veterinarian may instruct you to give the dose as soon as you remember and wait the recommended amount of time between doses. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses. Contact your veterinarian to see if an adjustment of their medication is needed. Chloramphenicol Possible Side Effects Common side effects of chloramphenicol include:  Vomiting Diarrhea Stomach upset Lack of appetite Long term use of this medication can cause suppression of the bone marrow in some pets; cats seem to be more susceptible to this long-term side effect. Bone marrow is responsible for the production of all blood cells, so anemia (low red blood cell counts), low white blood cell counts, and low platelet counts can be seen. If you believe your pet may be experiencing any side effects of chloramphenicol, consult your veterinarian. Human Side Effects While chloramphenicol  is a human prescription medication, there are different dosages and side effects that can occur in humans. There are potentially severe risks to humans upon exposure to chloramphenicol, so precautions such as wearing gloves and masks during administration must be taken to avoid harm. Pregnant women should not handle this medication. If you accidentally ingest this medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of chloramphenicol Chloramphenicol Overdose Overdoses of chloramphenicol may appear as vomiting and diarrhea, but large doses, especially in cats, can suppress the bone marrow, which is responsible for the production of new red blood cells. If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Chloramphenicol Storage Chloramphenicol should be stored at controlled room temperature at or below 77 F, but always confirm storage requirements by reviewing the label. Keep the container tightly closed to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]