[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does Heartgard® require a prescription?", "acceptedAnswer": {"@type": "Answer", "text": "Heartgard® is available by prescription only. It is important to work with your veterinarian to determine the best heartworm prevention plan for your pet. Your veterinarian may recommend that all pets be tested for heartworms before being placed on this medication. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Chalabala"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Heartgard®", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-951209962%20%281%29.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-951209962%20%281%29.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Heartworm, Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/heartgard"}, "datePublished": "December 8, 2022", "dateModified": "December 8, 2022", "description": "Heartgard® medications are frequently prescribed for the prevention of heartworm disease in dogs and cats.", "articleBody": "What is Heartgard®? Heartgard® is a veterinarian-prescribed heartworm prevention medication for use in cats. Heartgard® for cats contains the medication ivermectin. Heartgard® prevents heartworm disease in cats by killing the larval stage of heartworms. It also treats and prevents hookworm infestations in cats. Heartgard® for cats is intended for any size cat that is 6 weeks of age or older. Heartgard® for cats should be administered once a month. It may be given with or without food; however, food improves absorption of the medication into a cat’s system. If manual dosing is required, the chewable should be broken into pieces for administration. Food should be routinely available during the day of treatment administration.  If your cat does not consume or rejects part of the dose, redosing with a new chewable is recommended. Heartgard® Plus Heartgard® Plus for dogs is a veterinarian-prescribed medication that contains ivermectin and an additional dewormer called pyrantel, which provides coverage for roundworms and hookworms. Heartgard® Plus for dogs also prevents heartworm disease by killing the larval stage of heartworms. Heartgard® Plus is intended for any-sized dog that is 6 weeks of age or older. Heartgard® Plus for dogs should be administered once a month. When replacing another heartworm preventive product, Heartgard® Plus must be given within a month of the last  dose of the former medication. It may be given with or without food, but food does help with medication absorption. It is important to ensure that the chewable is chewed and not swallowed whole. If your dog did not consume the entire chewable medication, redosing with a new chewable is recommended. How Does Heartgard® Work? Ivermectin is the active ingredient in Heartgard® and one of the active ingredients in Heartgard® Plus. Ivermectin works by creating an electrolyte imbalance in the nerve and muscle cells of heartworms, which causes paralysis and death. Heartgard® Plus also contains pyrantel. Pyrantel works by paralyzing worms, which are then expelled in the feces or digested. Pyrantel treats only parasites in the digestive tract, as opposed to ivermectin, which treats parasites throughout the body.   Possible Side Effects of Heartgard® The most common side effects for Heartgard® are: Vomiting Diarrhea In addition to those symptoms, Heartgard® Plus can also cause: Fatigue (Lethargy) Loss of appetite Dilation of the Pupil Incoordination Drooling Seizures If you believe your pet is experiencing any side effects, consult your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Heartgard® or Heartgard® Plus. Generally they will advise you to give it when you remember. If the interval between doses exceeds 30 days, the efficacy of ivermectin can be reduced. It’s important to give this medication monthly, so be sure to maintain a dosing schedule every 30 days. Human Side Effects This medication is not used in human medicine. If you accidentally ingest a pet medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222.    Monitoring It is recommended for all pets to be tested for existing heartworm infection prior to starting treatment with Heartgard® for cats or Heartgard® Plus for dogs. Cats already infected with adult heartworms can be given Heartgard® monthly to prevent further infections. Dogs with existing heartworm infections should be treated to remove the adult heartworms before initiating medication. Heartgard® Plus can kill some microfilariae, which are worms in the early stage of their development, but it is not effective for microfilariae clearance. An allergic reaction to the dying microfilariae can occur in dogs when Heartgard® Plus is given to dogs with existing heartworm infections. Other specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition does not improve or worsens You see or suspect an overdose You have additional questions or concerns about the use of Heartgard® or Heartgard® Plus Heartgard® Overdose Information Nervous system changes may occur with large overdoses. Signs of an overdose include drooling, incoordination, weakness, tremors, disorientation, lethargy, dilated pupils, blindness, coma, and death. Other symptoms may include vomiting, diarrhea, low heart rate, body temperature changes and abnormal behavior. If you suspect an overdose of ivermectin, seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Heartgard® and Heartgard® Plus Storage Heartgard® and Heartgard® Plus should be stored at controlled temperatures between 68-77 F and brief exposure to temperatures 59-86 F are acceptable. Keep the medication in the provided blister pack until ready for administration in order to protect it from moisture and light. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]