[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is ponazuril a dewormer for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Ponazuril is not FDA-approved for use in dogs, but it may be used in specific circumstances. Your veterinarian would need to determine that this medication is the right choice for your dog&#039;s condition before prescribing a compounded formulation of ponazuril."}}, {"@type": "Question", "name": "What parasites does ponazuril treat in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Ponazuril is approved for the treatment of equine protozoal myeloencephalitis (EPM) caused by the protozoan Sarcocystis neurona. Ponazuril may also be used to treat other types of protozoal infections like Coccidia, Neospora, Eimeria and Cryptosporidium species."}}, {"@type": "Question", "name": "Does ponazuril need to be refrigerated?", "acceptedAnswer": {"@type": "Answer", "text": "Ponazuril paste should be stored at controlled room temperatures. If you have a compounded version of ponazuril, please follow the compounding pharmacy’s instructions for storage instructions. Always confirm storage requirements by reading the label. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/bluegame"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ponazuril", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1327630554.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1327630554.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Horse, Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ponazuril"}, "datePublished": "May 22, 2023", "dateModified": "May 22, 2023", "description": "Ponazuril is a common prescription medication utilized by veterinarians to treat EPM in horses.", "articleBody": "What Is Ponazuril? Ponazuril is an FDA-approved oral paste used to treat equine protozoal myeloencephalitis (EPM) in horses, which is caused by Sarcocysitis neruona. Ponazuril can also be used to treat other protozoal infections (such as Coccidia, Neospora, Eimeria, Toxoplasma and Cryptosporidium) in other species including dogs, cats, goats, camels, small mammals, and reptiles through off-label use. The term off- or extra- label use means that a medication is prescribed for a certain use or for a particular species that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of ponazuril. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Ponazuril Works Ponazuril is an antiprotozoal medication that blocks specific enzymes in the protozoa from working and decreases the formation of pyrimidine, which is an essential building block of its DNA. Interruptions in DNA formation will cause the protozoa to die. Ponazuril Directions Follow the directions on the drug label or as provided by your veterinarian. Ponazuril is a paste that is generally given once daily by mouth over a course of several days. The length of time that your pet will be administered this medication will depend on the species being treated, type of infection, and your pet’s symptoms. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of ponazuril. Generally, they may instruct you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Ponazuril Possible Side Effects Side effects with this medication are rare but may include: Vomiting Diarrhea Dry eye (in dogs) Mild colic Allergic reactions to this medication are possible and may be noted as: Vomiting Diarrhea Hives Blisters on the nose and mouth Seizures Human Side Effects  This medication is not used in human medicine. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.    Monitoring  No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication.  Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of ponazuril Ponazuril Overdose Information Moderate overdoses of ponazuril can cause loose stool. Severe overdoses can cause loose stool, weight loss, lack of appetite, or seizures. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Ponazuril Storage Ponazuril paste should be stored at controlled room temperatures between 68–77 F, and brief exposure to temperatures 59–86 F are acceptable. Always confirm storage requirements by reading the label. Keep the container tightly closed in order to protect it from moisture and light.   Compounded medications should be stored according to the compounding pharmacy’s label.  Keep out of reach of children and pets."}]