[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can my dog stay on Previcox®?", "acceptedAnswer": {"@type": "Answer", "text": "Previcox® can be used safely long-term in many dogs. Please discuss with your veterinarian if Previcox® is the right choice for your dog&#039;s long-term pain control needs."}}, {"@type": "Question", "name": "How quickly does Previcox® work?", "acceptedAnswer": {"@type": "Answer", "text": "Previcox® starts working in your dog about 7 hours after administration, but it may take 3-4 days to reach its peak effective level."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Previcox® (firocoxib)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1061363412.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1061363412.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/firocoxib-previcox"}, "datePublished": "November 28, 2022", "dateModified": "November 28, 2022", "description": "Previcox® is an FDA approved non-steroidal anti-inflammatory (NSAID) prescription medication used to treat pain in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Previcox®? Previcox® is an FDA-approved non-steroidal anti-inflammatory (NSAID) prescription medication used in dogs to treat pain and inflammation associated with osteoarthritis and for the control of postoperative pain and inflammation associated with soft-tissue and orthopedic surgery. Like other medications in its class, it may also be used off-label to control fevers and inflammation caused by other conditions. The term off-or extra- label use means that a medication is used in a way, or in a particular species, that is not specified on the medication label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether this medication is right for your dog. How Previcox® Works Previcox® is a selective NSAID that is subcategorized as a COX-2 inhibitor. Like other NSAIDs, it blocks the body’s COX-2 pathway, which lowers the production of natural chemicals that trigger inflammation, thereby reducing fever and offering pain relief. Due to its selectivity for the COX-2 pathway, Previcox® typically spares the COX-1 pathway, which is associated with digestion, kidney health and blood clotting. This selectivity is beneficial because it  causes fewer side effects compared to traditional NSAIDs. However, it’s important to note that at high doses, Previcox® can still partially block these beneficial chemicals, so it’s important to follow your veterinarian’s directions exactly. Previcox® Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is given at different dosages based on what it was prescribed, but it is generally given once daily by mouth at the lowest effective dose for the shortest duration consistent with individual response. Giving this medication with food can help to prevent digestive system upset. Please note, this product cannot be accurately dosed in dogs less than 12.5 pounds in body weight. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Previcox®. Generally, they will advise that you give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Previcox® Possible Side Effects Previcox® is generally well tolerated. Possible side effects include: Vomiting Loss of Appetite Diarrhea Bloody vomiting or diarrhea (black tarry stool) Fatigue (Lethargy) Change in thirst or urination Jaundice (yellowing of the gums, skin, or eyes) Elevated heart rate General itchiness Discontinue Previcox® and contact your veterinarian immediately if signs of intolerance are observed. Serious adverse reactions associated with this drug class can occur without warning, and in rare situations result in death. Most patients with drug-related adverse reactions have recovered when the signs are recognized, the drug is withdrawn, and veterinary care, if appropriate, is initiated. Human Side Effects This medication is not used in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your dog is on this medication may be recommended by your veterinarian depending on your dog’s individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication. Appropriate laboratory testing is recommended to establish hematological and serum baseline data before and periodically during administration of any NSAID. Call Your Vet If: Severe side effects are seen (see above) Your dog’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Previcox® Previcox® Overdose Information Decreased appetite, vomiting, black tarry stool, increased heat rate, fatigue (lethargy), kidney failure, and seizures are associated with overdoses of Previcox®. More severe symptoms may occur depending on the severity of the overdose. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Previcox® Storage Previcox® should be stored according to the medication label and at controlled temperatures between 59-86 F, although brief exposure to temperatures up to 104 F is acceptable. Keep the container tightly closed to protect this medication from moisture and light. Keep out of reach of children and pets."}]