[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What can I give my dog to treat diarrhea?", "acceptedAnswer": {"@type": "Answer", "text": "Do not give Kaopectate® to your dog unless directed by your veterinarian. If your dog develops diarrhea, contact your veterinarian right away before giving any over-the-counter medications, as your veterinarian has full access to their medical history and is the best person to make an appropriate recommendation for your dog. Depending on these factors, they may advise prescription medication to treat the underlying cause of the diarrhea so your dog can start feeling better sooner.  No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/O_Lypa"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Kaopectate® for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-870964926.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-870964926.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/kaopectate-for-dogs-cats"}, "datePublished": "June 27, 2023", "dateModified": "June 28, 2023", "description": "Kaopectate® should only be prescribed and used under the direction of a veterinarian for dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Kaopectate®? Kaopectate® is an over-the-counter (OTC) anti-diarrheal medication approved for use in humans to relieve upset stomach. The active ingredient in Kaopectate® is bismuth subsalicylate, which is not FDA-approved for use in animals. In specific circumstances, it is sometimes used in dogs, cats, horses, cattle, swine, and ferrets, but only under the direction and supervision of a veterinarian. There are many causes of diarrhea in dogs, as well as different causes of diarrhea in cats, and treatment will vary depending on the underlying cause. If your pet has diarrhea, speak with your veterinarian before giving any new medication to determine the best and safest option for your pet’s condition. Never give your pet a human medication without speaking to your vet. Bismuth subsalicylate is an active ingredient in Kaopectate®, Pepto-Bismol®, Bismatrol, and Pink Bismuth. These human formulations are not FDA approved as veterinary medications. However, Kaopectate® is sometimes utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. How Kaopectate® Works The active ingredient in Kaopectate® is bismuth subsalicylate, which works by protecting the lining of the stomach and reducing toxins and harmful bacteria from causing inflammation in the gastrointestinal tract. Bismuth subsalicylate separates into two parts in the body—salicylate, which is the active ingredient in aspirin, and bismuth. Salicylate helps reduce discomfort and inflammation in the gastrointestinal tract while bismuth offers antibacterial properties.  However, there are potential harmful effects of aspirin in dogs and cats.      Kaopectate® Directions Follow the directions recommended provided by your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Kaopectate®. Generally, they may instruct you to give it when you remember or, if it is almost time for the next dose, to skip the missed dose and resume the normal dosing schedule. Do not give extra or double doses. Because this is a human medication, it requires a veterinarian’s guidance for proper use. Kaopectate® Possible Side Effects Constipation  Gray-black or green-black discoloration of the stool and the tongue Kaopectate® should not be given in cats without your veterinarian’s strict supervision, as they are sensitive to products containing aspirin. Aspirin can even be toxic in cats.  Kaopectate® breaks down into aspirin in the body. If your pet is sensitive or allergic to aspirin, has certain medical conditions, or is taking any medications that interact with aspirin, they may experience more severe side effects, including: Vomiting Bleeding Black tarry stool Weakness Abdominal pain Seizures Human Side Effects Kaopectate® is also an over-the-counter medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans.   Call Your Vet If: Severe side effects are seen (see above) Your pet’s or animal’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Kaopectate® Kaopectate® Overdose Information An overdose of Kaopectate® can be life-threatening. Symptoms of an overdose may include diarrhea, lethargy, vomiting, wobbliness, weakness, panting, loss of appetite, abdominal pain, seizures, and kidney problems. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Kaopectate® Storage Kaopectate® tablets and liquids should be stored at controlled temperatures between 68-77 F. Keep the container tightly closed in order to protect the contents from moisture and light.    Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]