[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hydralazine for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1489802837.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1489802837.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dogs, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/hydralazine-dogs"}, "datePublished": "October 22, 2023", "dateModified": "October 22, 2023", "description": "Hydralazine is a medication sometimes prescribed by veterinarians to treat high blood pressure and heart failure in dogs. Learn how hydralazine works in dogs, including possible side effects, considerations, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Hydralazine? Hydralazine is a human prescription blood pressure medication that is used in dogs for treatment of high blood pressure (hypertension) and heart failure. It may also be used in cats and horses. Hydralazine is generally used as a sole medication for the treatment of high blood pressure, but may be used in combination with other medications (such as a diuretic) to treat heart failure. Hydralazine is FDA-approved for human use in oral form as generic hydralazine hydrochloride. It is also available as an injection under direct veterinary supervision in a hospital setting. Hydralazine is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of hydralazine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Hydralazine Considerations Hydralazine should not be used in pets with certain medical conditions, such as low blood volume (hypovolemia), low blood pressure (hypotension), or in pets who are hypersensitive to the medication. It should be used with caution in pets with severe kidney disease, hemorrhage within the brain (intracranial bleeding), and certain autoimmune conditions. Giving hydralazine with certain medications can result in health risks to your pet, so it is important to discuss your all of your pet’s medications and medical conditions with your veterinarian. Treatment with hydralazine requires monitoring and close supervision by your veterinarian, depending on your pet’s individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication. Your veterinarian will determine the best course of treatment for your pet. How Hydralazine Works Hydralazine is a blood pressure medication classified as a vasodilator. Hydralazine lowers blood pressure by relaxing the smooth muscles that line blood vessels, which allows them to widen and improve blood flow. In pets with congestive heart failure, this lowers the pressure that the heart pumps against, which helps the heart pump more efficiently and easily with each heartbeat. Hydralazine Directions Follow the directions on the drug label or as provided by your veterinarian. Hydralazine is best given with food. To avoid abnormally low blood pressure (hypotension) in your pet, generally your veterinarian may start with a low dose of hydralazine and gradually increase it over time, depending on how well it is working. Since safety studies have not been performed in animals, use hydralazine with caution in pregnant and lactating pets. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of hydralazine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Hydralazine Possible Side Effects If the dosage is too high or if the dosage is increased too fast, side effects may include: Weakness and fainting (syncope) due to low blood pressure (hypotension) Low energy (lethargy) Gastrointestinal upset (loss of appetite, vomiting, diarrhea) Abnormally fast heart rate (tachycardia) Elevated creatinine kidney level Human Side Effects Hydralazine is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medication dispensed for their pets and pets should not be given any medicine dispensed for a human’s use If you accidentally ingest a pet medication, immediately seek medical attention or call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of hydralazine Hydralazine Overdose Information Overdoses of hydralazine are serious, and symptoms may include fainting or collapse due to severely low blood pressure (hypotension), racing heart rate (tachycardia), abnormal heart rhythm (arrhythmia), and blotchy red skin. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Hydralazine Storage Hydralazine should be stored at controlled room temperatures from 68 F to 77 F. Keep the container tightly closed to protect this medication from moisture and light. Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/FG Trade"}]