[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Prascend® (pergolide)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1314166099.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1314166099.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/prascend-peroglide"}, "datePublished": "January 31, 2023", "dateModified": "January 31, 2023", "description": "Prascend® (peroglide) is prescribed by veterinarians to treat endocrine disorders in horses.", "articleBody": "What is Prascend®? Prascend® is the only FDA-approved drug for the control of clinical signs associated with Cushing’s Disease in horses, also known as pituitary pars intermedia dysfunction (PPID). Prascend® is the brand name for the generic medication pergolide. Prascend® will not cure a horse of PPID, but it can help manage the symptoms associated with this disease. How Prascend® Works Prascend® belongs to a class of medications called dopamine agonists, which mimic dopamine in the body. Horses with PPID do not make enough dopamine, a communication molecule in the brain that controls the secretion of hormones from the pituitary gland. In the presence of dopamine or a dopamine agonist like Prascend®, the pituitary gland will stop overproducing hormones that cause the symptoms of PPID. In certain circumstances, your veterinarian may recommend a compounded formulation of Pergolide®. Compounded medications are prescribed if there’s a specific reason your horse’s health can’t be managed by an FDA-approved drug, such as if your horse has trouble taking pills in capsule form, the dosage strength is not commercially available, or the horse is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Prascend® Directions Follow the directions on the drug label or as provided by your veterinarian. Prascend® is typically given by mouth once daily and often begins with a gradual increase in dose until desired levels are reached to help prevent loss of appetite—which is common with this medication. Your veterinarian may also recommend reducing their dose over time as they monitor how your horse is responding to the medication. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Prascend®. Generally, they may advise you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Prascend® Possible Side Effects The most common side effect with Prascend® is a loss of appetite that can occur at the beginning of treatment, but this side effect may persist throughout treatment. It is important to work with your veterinarian if you notice your horse is losing their appetite once they begin this medication. Other symptoms may include: Lethargy Diarrhea or loose stool Colic Weight loss Lameness Laminitis Skin irritation Human Side Effects This medication is not intended for use in humans. People who are allergic to ergotamine or other ergot derivatives should not handle this medication. Women who are pregnant or nursing should make sure to wear gloves when administrating this medication. Splitting or crushing this medication may cause eye irritation, an irritating smell, or headache. Prascend® tablets should not be crushed due to the potential for increased human exposure, and care should be taken to minimize exposure when splitting tablets. If you accidentally ingest this medication, immediately seek medical advice, call your physician, or call the national Poison Control Center hotline at 800-222-1222. Have the package leaflet of the label ready. Monitoring Specific monitoring or routine testing while your horse is on this medication may be recommended by your veterinarian depending on your horse’s individual needs, other medications they may be on, and/or the issue that initially caused your horse to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your horse’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Prascend® Prascend® Overdose Information In horses, an overdose of Prascend® may present as decreased appetite, stomach upset, vomiting, high heart rate, low blood pressure, incoordination, or seizures. If you suspect an overdose or have mistakenly given this medication to another animal species, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Prascend® Storage Prascend® should be stored at or below 77 F. Keep the container tightly closed to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Chalabala"}]