[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Metoclopramide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-625757844.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-625757844.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Horse, Medication, Rabbit", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/metoclopramide"}, "datePublished": "February 27, 2023", "dateModified": "September 8, 2023", "description": "Metoclopramide can be prescribed in the veterinary field to treat gastrointestinal muscle stimulation in dogs, cats, horses, rabbits, and other small mammals.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Metoclopramide? Metoclopramide is a prescription medication typically used to stimulate muscle movement throughout the digestive system to help move digested food down the digestive tract and to prevent esophageal reflux. Metoclopramide is often prescribed for gastrointestinal muscle stimulation in dogs, cats, rabbits, other small mammals, and horses. Your veterinarian will determine whether this medication is right for your pet. In dogs, this medication also treats vomiting and nausea. In horses, this medication is mainly used to improve gut movement after colic surgery.  It can be used for a wide variety of conditions that benefit from its ability to improve digestive motility and decrease vomiting and nausea. The medication can also be used in dogs and cats to promote milk production. How Metoclopramide Works Metoclopramide is a prokinetic, meaning that it increases peristalsis (the wavelike muscle movements that help move digested food contents through the digestive tract) in the intestines. It also strengthens stomach muscle contractions while causing relaxation of the lower stomach sphincter and increasing sphincter closure in the lower esophagus. This prevents reflux and encourages ingested food to move toward the intestines. Metoclopramide also works to prevent vomiting by blocking a naturally occurring chemical in the brain called dopamine, which is known to trigger nausea and vomiting. Metoclopramide is FDA-approved for use in humans under the brand names Reglan® and Maxolon®, as well as the generic name metoclopramide. Metoclopramide is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of metoclopramide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Metoclopramide Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is available as a tablet, oral syrup, or injection. Generally, your veterinarian may recommend that the oral version of this medication should be given on an empty stomach, but if digestive upset occurs it may be given with a small meal. If your pet is vomiting or becomes constipated while on this medication, please let your veterinarian know. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of metoclopramide. Generally, they may instruct you to give it when you remember and wait the normal dosing interval, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.  Metoclopramide Possible Side Effects Side effects may vary based on the species. In dogs, the most common side effects of this medication include: Restlessness Hyperactivity Aggression Spasms Vocalization Lethargy Hyperactivity Tremors Increased urination In cats, the most common side effects of this medication include: Hyperactivity Disorientation Constipation Additional side effects may include: Vomiting High blood pressure Horses given metoclopramide intravenously (into the blood system) can develop severe neurological side effects such as severe sedation, behavior changes, and abdominal pain. This medication should not be used in pets that have an intestinal blockage or bleeding in their stomach or intestine; pets that are allergic to sunscreens containing PABA; pets with pheochromocytoma (a type of adrenal gland tumor); or dogs with pseudopregnancy. Speak with your veterinarian before giving this medication to pets that have kidney or heart disease, seizure disorder, head injury, or are pregnant.  Tell your veterinarian about any medications your pet is taking before starting metoclopramide. Human Side Effects While this is a human prescription medication, there are different dosages for pets and different side effects that can occur in humans. If you accidentally ingest a medication prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Your veterinarian may recommend specific monitoring or routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of metoclopramide Metoclopramide Overdose Information Metoclopramide has a wide range of safety. However, large overdoses can cause drowsiness, incoordination, vomiting, and constipation. Serotonin syndrome can occur with overdoses of this medication depending on what other medications your pet may be on. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Metoclopramide Storage Metoclopramide should be stored at controlled room temperatures between 68-77 F and should be protected from freezing. Always confirm storage temperatures by reading the label. Keep the container tightly closed to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}]