[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long can a dog be prescribed tylosin tartrate?", "acceptedAnswer": {"@type": "Answer", "text": "The length of time dogs can be prescribed tylosin may vary greatly from weeks to months. The t treatment duration would be at the discretion of your veterinarian, who would make this determination by taking into consideration the condition being treated and how well your pet is tolerating the medication. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/RossHelen"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tylosin Tartrate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1482556931.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1482556931.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/tylosin-tartrate"}, "datePublished": "May 22, 2023", "dateModified": "May 22, 2023", "description": "Tylosin tartrate is often prescribed to treat GI-related issues in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Tylosin Tartrate? Tylosin tartrate is a prescription medication used to treat susceptible infections in livestock. It can also be used to treat certain gastrointestinal issues in dogs and cats. In chickens, tylosin treats digestive and upper airway infections caused by Clostridium and Mycoplasma. In turkeys, tylosin is used in the treatment of sinus infections caused by Mycoplasma. Tylosin can also be used in pigs for infections. Tylosin is also used in honeybees to control a fatal bacterial disease called American Foulbrood. It is rarely prescribed in reptiles and birds for the treatment of Mycoplasma. Horses should never be given tylosin due to the risk of life-threatening diarrhea. In dogs and cats, tylosin is used to treat certain inflammatory diseases of the digestive system such as colitis or inflammatory bowel disease (IBD), and may be safer compared to other antibiotics for long-term use. It can also be used to treat certain infections caused by Campylobacter, Cryptosporidium, and Clostridium bacteria. The use of tylosin in cats, dogs, and reptiles is considered an off-label use. The term off- or extra- label use means that a medication can be used in a way or in a particular species that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your animal. In certain circumstances, your veterinarian may recommend a compounded formulation of tylosin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. For animals meant for human consumption (i.e., food-producing animals), a withdrawal time between last administration of tylosin powder and slaughter varies depending on the animal. Follow directions on the medication label and reach out to your veterinarian to determine when to end the medication before consumption. How Tylosin Tartrate Works Tylosin is classified as a macrolide antibiotic. It is bacteriostatic, which means that it does not actually kill susceptible bacteria. Rather, tylosin prevents bacteria from growing and dividing by blocking its ability to create the required proteins necessary for survival. This allows an animal&#039;s immune system to overcome the infection more easily. Tylosin Tartrate Directions Follow the directions on the drug label or as provided by your veterinarian. Tylosin can be given with or without food. Giving tylosin with food can help to lower the risk of digestive upset. It is important to note that the tylosin powder is extremely bitter, so utilizing a compounded formulation or capsule version of this product can help make it more palatable in dogs and cats. When tylosin is administered in drinking water for poultry, fresh preparations will need to be made every three days and diluted according to the product label. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of tylosin. Generally, they may instruct you to give it when you remember or, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Tylosin Tartrate Possible Side Effects Like all other antibiotics, tylosin can cause gastrointestinal side effects:  Vomiting Diarrhea Decreased appetite Lethargy Human Side Effects This medication is not intended for use in humans. If you accidentally ingest this medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  When mixing or handling tylosin, use protective clothing and impervious gloves to avoid contact with human skin, as exposure to tylosin may cause a rash. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s or animal’s individual needs, other medications they may be on, and/or the issue that initially caused your pet or animal to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s or animal’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of tylosin Tylosin Tartrate Overdose Information Symptoms of an overdose of this medication are highly dependent on the species. In general, tylosin is relatively safe, but large overdoses may be a cause for concern. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Tylosin Tartrate Storage Tylosin powder should be stored at controlled temperatures at or below 77 F. Brief exposure to temperatures up to 104 F are acceptable. Keep the container tightly closed in order to protect its contents from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]