[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for Panacur® to work on giardia?", "acceptedAnswer": {"@type": "Answer", "text": "Giardia is a microscopic parasite that can live in the digestive tract of animals and people. Panacur® is one of the medications veterinarians prescribe to treat it. It is important to closely follow the instructions provided by your veterinarian because it is possible for giardia to spread from pets to people. Often, veterinarians prescribe Panacur® for three to five days to treat giardia. Your veterinarian will likely recommend testing a fecal sample two to four weeks after finishing the medication to ensure that treatment was successful. "}}, {"@type": "Question", "name": "What kind of worms does Panacur® kill?", "acceptedAnswer": {"@type": "Answer", "text": "Panacur® and other fenbendazole products treat roundworms, hookworms, whipworms, and tapeworms in dogs. Your veterinarian may prescribe Panacur® to treat other types of parasites, including giardia and lungworms. "}}, {"@type": "Question", "name": "How long does Panacur® take to work in cats?", "acceptedAnswer": {"@type": "Answer", "text": "Panacur® and other fenbendazole products are not FDA-approved for use in cats. However, your veterinarian may prescribe Panacur® to treat certain types of parasites. Treatment times vary between parasites. Follow the instructions provided by your veterinarian.  "}}, {"@type": "Question", "name": "Can I use Panacur® for horses on my dog?", "acceptedAnswer": {"@type": "Answer", "text": "No. It is important to use dog medications in dogs and horse medications in horses. Horse medications are usually much more concentrated than dog medications, making overdoses more likely. "}}, {"@type": "Question", "name": "Does Panacur® treat coccidia?", "acceptedAnswer": {"@type": "Answer", "text": "No. Panacur® and other fenbendazole products do not treat coccidia. Your veterinarian will prescribe a different antiparasitic drug to eliminate coccidia.  "}}, {"@type": "Question", "name": "How do I give Panacur® Powerpac?", "acceptedAnswer": {"@type": "Answer", "text": "Panacur® Powerpac is a deworming paste for horses. Talk to your veterinarian about the diagnosis, treatment, and control of parasites in your horse. Parasites and deworming schedules vary in different parts of the country. Do not use horse medications in dogs or cats. "}}, {"@type": "Question", "name": "Can you give Panacur® to kittens?", "acceptedAnswer": {"@type": "Answer", "text": "Panacur® and other fenbendazole products are not FDA-approved for use in cats or kittens. However, your veterinarian may prescribe Panacur® to your kitten to treat certain types of parasites. Follow all directions provided by your veterinarian.  "}}, {"@type": "Question", "name": "What is Panacur® used for in cats?", "acceptedAnswer": {"@type": "Answer", "text": "Panacur® and other fenbendazole products are not FDA-approved for use in cats. However, your veterinarian may prescribe Panacur® to treat susceptible roundworms, hookworms, lungworms, tapeworms, and giardia. "}}, {"@type": "Question", "name": "Can I use albendazole instead of fenbendazole for my dog?", "acceptedAnswer": {"@type": "Answer", "text": "No. Albendazole is a dewormer used in cattle, goats, sheep, and people. However, it should not be used in dogs or cats, unless directed by a veterinarian. Albendazole has the potential to cause severe damage to bone marrow in dogs and cats. Follow your veterinarian’s directions closely if prescribed.    No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Fenbendazole (Panacur®, Safe-guard®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-1313597127.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-1313597127.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/fenbendazole-panacur-safe-guard"}, "datePublished": "May 20, 2022", "dateModified": "October 4, 2023", "description": "Fenbendazole is the active ingredient in several common deworming medications including Panacur® and Safe-guard®.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Fenbendazole?  Fenbendazole is the active ingredient in several common deworming medications. Fenbendazole treats a wide variety of intestinal parasites including roundworms, hookworms, whipworms, and tapeworms in dogs, horses, and many other animal species.   Fenbendazole does not treat all types of intestinal worms. Your veterinarian may also prescribe fenbendazole for other types of parasites, including giardia in dogs.    Fenbendazole is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Follow the directions provided by your veterinarian. If you have questions about parasite control, talk to your veterinarian about the best way to deworm your pet. Fenbendazole is available under the brand names Panacur® and Safe-guard®.  How Fenbendazole Works  Fenbendazole blocks the ability of worms to produce energy which ultimately starves and kills the parasite. Immature life stages, such as larvae or eggs, may also be affected in some types of worms. You may see worms in your pet’s feces after treatment.    Fenbendazole is available over-the-counter as single-use packets or by prescription in granule, liquid, chew and capsule forms. To avoid stomach upset, it should be given with food in dogs. Mixing the granules into your pet’s food makes deworming easier.   In certain circumstances, your vet may recommend a compounded formulation of fenbendazole. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the  dosage strength  is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Fenbendazole Directions  Follow the directions on the drug label or as provided by your veterinarian.   Fenbendazole is typically given by mouth once daily for three consecutive days. This three-day cycle may be repeated based on the deworming schedule recommended by your veterinarian. Many puppies are dewormed after weaning at 6, 8, 10, and 12 weeks of age. Adult dogs may require deworming twice yearly or when parasites are present. Your veterinarian will determine a schedule that is that is appropriate for your pet.   Fenbendazole does not treat all types of parasites, including the tapeworm spread by fleas. A different type of deworming medication may be necessary, especially if parasites are still present after treatment. Your veterinarian may use fecal tests to determine if parasites are still present.  Missed a Dose?  If you miss a dose of fenbendazole, give it when you remember. Then, talk to your veterinarian to see if the deworming schedule needs to be adjusted.   Fenbendazole Possible Side Effects  When used as labeled, side effects are rare. Infrequently, the following side effects may be seen:  Vomiting  Excessive drooling  Diarrhea  Allergic reaction (including hives, facial swelling, lethargy, trouble breathing, or collapse)  Human Side Effects While this medication can also be used in humans, dosing for pets is often different and it may have different side effects. If you accidentally ingest your pets medication, call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Side effects are seen (see above)   You see or suspect an overdose or allergic reaction  Call your vet or pharmacist if you have you have additional questions or concerns about the use of fenbendazole  Fenbendazole Overdose Information  Overdoses of fenbendazole are unlikely to cause significant problems. However, in rare instances higher doses of fenbendazole may cause a severe allergic reaction known as anaphylaxis. This is due to the release of a substance called antigens by dying parasites. Signs of anaphylaxis may include hives, facial swelling, lethargy, trouble breathing, and collapse. Seek immediate medical treatment if any of these signs are seen.   If you suspect an overdose of fenbendazole, contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Fenbendazole Storage  Store at room temperature between 68–77 F (20–25 C). "}]