[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Credelio™ and Credelio™ CAT (lotilaner)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1321059114.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1321059114.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/credelio-and-credelio-cat-lotilaner"}, "datePublished": "November 8, 2022", "dateModified": "November 8, 2022", "description": "Credelio™ and Credelio™ CAT are oral chewable prescription medication tablets, used to treat and prevent fleas and certain tick infestations in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Credelio™ and Credelio™ CAT? The active ingredient in Credelio™ and Credelio™ CAT is lotilaner. It is an oral chewable tablet used to treat and prevent fleas and certain tick infestations in dogs and cats. For ticks, Credelio™ is FDA-approved for the treatment and prevention of the American dog tick, black-legged tick, lone star tick and the brown dog tick. In cats, Credelio™ CAT it is approved for treatment and prevention of the black legged tick only. Credelio™ is also used or prescribed in an extra-label capacity to treat demodectic mange and sarcoptic mange in dogs. The term off-or extra-label use means that a medication is used in a way, or in a particular species, that is not described on the manufacturer’s drug product label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether this medication is right for your pet. How Credelio™ and Credelio™ CAT Work Credelio™ and Credelio™ CAT belong to a newer class of flea and tick preventatives called isoxazolines. Isoxazolines eliminate fleas and ticks by over-exciting their nervous system, causing paralysis and death. In dogs and cats, this medication works within the first few hours after administration to kill fleas that are present on your pet. Although Credelio™ and Credelio™ CAT are dosed by weight, dosage strength recommendations differ between dogs and cats, which is why it is important to use the appropriate version of this medication for your pet. Credelio™ and Credelio™ CAT Directions Credelio™ and Credelio™ CAT are given by mouth once a month, with a meal or within 30 minutes after feeding. It is important to follow the instructions on either the cat label or dog label, or as provided by your veterinarian. The weight-based dosing charts differ between dogs and cats, so it is important to use the correct version of this medication for your pet. Using cat medications on dogs or using dog medications on cats can cause serious problems including a lack of efficacy or an overdose. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of this medication. Generally, they will advise you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Fleas and ticks may temporarily be seen due to the missed treatment. Credelio™ and Credelio™ CAT Side Effects This medication is well tolerated in most pets. Side effects may include: Weight loss Increased drinking or urinating Increased breathing rate Diarrhea Vomiting Loss of appetite Elevated Blood Urea Nitrogen (BUN) Neurologic side effects have been seen after using medications in this class of drugs (isoxazolines). Tell your veterinarian if your pet has a history of seizures or other neurologic disease. Neurologic side effects may include: Muscle tremors Incoordination Seizures Human Side Effects This medication is not intended for use in humans. If you accidentally ingest a pet medication, immediately seek medical attention, or call the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Credelio™ or Credelio™ CAT Credelio™ and Credelio™ CAT Overdose Information Overdoses of these medications are rare. Signs of a large overdose may include vomiting, diarrhea, muscle tremors, incoordination, or seizures. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Credelio™ and Credelio™ CAT Storage These products should be stored at controlled temperatures between 59F -77 F. Brief exposure to temperatures 41 F-104 F are acceptable. Keep the medication in the provided blister packs until ready to use to protect from moisture and light.   Keep out of reach of children and pets."}]