[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lactated Ringer’s", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/lactated-ringers-injection"}, "datePublished": "December 21, 2012", "dateModified": "August 17, 2022", "description": "Lactated Ringer’s are used to help maintain hydration or to rehydrate animals. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "Uses Lactated Ringer’s are used to help maintain hydration or to rehydrate animals. It can be used in the treatment of decreased intake of fluids and replace fluids lost do to kidney disease or illness. Dosage and Administration Lactated Ringer’s should be given according to your veterinarian’s instructions. If issues arise in the administration of the Lactated Ringer’s Injection please consult your veterinarian for advice. The dosage of Lactated Ringer does vary from animal to animal depending on the size, health issue, or the reason for receiving the LRS. Lactated Ringer’s Injection can be administered in two different ways, Intravenously (IV) or subcutaneously (SQ under the skin). Remember to use new, sterile needles when administering. Missed Dose? If a dose of Lactated Ringers’ Injection is missed, please consult with your veterinarian to discuss the best option.   Possible Side Effects Side effects are unlikely if the Lactated Ringers’ Injection is properly given. If you think your pet develops any reactions to the Lactated Ringer’s Injection, please contact your veterinarian immediately. Reactions may occur because the solution or the technique of administration include elevated body temperature or infection at the site of injection, blood clot, or swelling of a vein from the injection site. Precautions Lactated Ringer’s Injection should not be administered to any animals that are allergic to any of the ingredients in the LRS. Overhydration may occur more easily in animals with kidney and/or heart disease or obstruction of the urinary tract so please administer with extreme care. Do not use on animals whose kidneys are not producing urine. Storage Store Lactated Ringer’s Injection between 68° and 77°F in manufacturers packaging.  Protect product from freezing. Drug Interactions Additives may be incompatible. Consult with your veterinarian or pharmacist, if available. When introducing additives, use aseptic technique, mix thoroughly and do not store. Signs of Toxicity/Overdose Overdose of Lactated Ringer’s Injection is caused by overhydration (too much fluid given) signs may include: WeaknessRapid BreathingConstipationIncrease heart rateCoughingWheezingIf you suspect or know you dog has had an overdose, please contact your veterinarian, an emergency vet clinic, or the Pet Poison Helpline at (855) 213-6680 immediately. After an overdose, your pet should also be re-evaluated before Lactated Ringer’s Injections are continued."}]