[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can you give a dog TUMS®?", "acceptedAnswer": {"@type": "Answer", "text": "TUMS® is an antacid medication for humans, with dosages different from those prescribed for your dog by a veterinarian. Always check with your vet before giving TUMS® to your dog, as TUMS® should not be used in dogs with certain medical conditions. Speak with your vet to ensure this medication is right for them. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Circle Creative Studio"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can I Give Antacids to My Pet?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1432914188.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1432914188.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/can-i-give-antacids-my-pet"}, "datePublished": "July 31, 2023", "dateModified": "October 6, 2023", "description": "Antacids are sometimes, although rarely, prescribed by veterinarians to treat illnesses related to stomach acid in dogs and cats. Learn how antacids work in pets, why a veterinarian may prescribe an antacid, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Antacids Can Be Prescribed for Dogs and Cats? Antacids are formulated human medications that are sometimes prescribed in veterinary medicine for dogs and cats. Many products, dosage forms, and concentrations of antacids exist. The active ingredients for an antacid depend on the brand of medication, and may include:  Calcium carbonate (brand names include TUMS® and Caltrate®) Magnesium Hydroxide (brand names include Milk of Magnesia®) Aluminum hydroxide and magnesium hydroxide (brand names include Almacone® and Maalox®) Acid blockers Famotidine (brand name Pepcid®) Omeprazole (brand name Prilosec®) It is important to note that some antacids may contain multiple ingredients, such as acetaminophen, aspirin, and caffeine, which are toxic to dogs and cats. Consult with your veterinarian before giving any antacid to your pet; they will determine which medication is best based on your pet’s circumstances. Oral sodium bicarbonate and other medication combinations that include sodium bicarbonate such as Alka-Seltzer® are not used in animals. However, they are available as an intravenous infusion and given in certain severe medical conditions under direct veterinary supervision. Your veterinarian will determine whether antacid is correct for your pet based on your pet’s symptoms. Antacids are FDA-approved for human use, but they are currently not FDA-approved as veterinary medications. However, they are readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Why Is My Vet Prescribing an Antacid? Your vet may prescribe your pet an antacid for various medical conditions. Antacids are most commonly used to reduce stomach acid, but certain antacids can also be used to treat abnormally high phosphorus levels in dogs and cats due to kidney disease. In dogs, antacids may be used for upset stomach, bilious vomiting syndrome, and chronic kidney disease. In cats, antacids may be used for upset stomach, inflammatory bowel disease, and chronic kidney disease. Antacids should not be used in pets with certain medical conditions, so always speak with your vet to ensure this medication is right for them. In certain circumstances, your vet may recommend a compounded formulation of an antacid, such as aluminum hydroxide, famotidine, and omeprazole. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Antacids Work The ingredients in various antacids work differently through specific pathways: Calcium carbonate and aluminum hydroxide help neutralize stomach acid. They also treat high phosphate levels in the body by binding to phosphorus in the gastrointestinal tract, which blocks the absorption of additional phosphate into the bloodstream. Aluminum hydroxide and magnesium hydroxide help soothe the stomach by neutralizing stomach acid. Famotidine is a type of acid reducer called an H2 blocker that blocks the excess production of stomach acid. Omeprazole is a type of acid reducer called a proton pump inhibitor (PPI) that blocks the excess production of stomach acid. Antacid Directions Some antacids such as calcium carbonate need to be given with meals, but other antacids such as omeprazole need to be given on an empty stomach. Follow the directions on the drug label or as provided by your veterinarian. Giving an antacid with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of your pet’s antacid. Generally, they may instruct you to  give it when you remember, or, if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Antacid Possible Side Effects Most antacids are well tolerated. Side effects can vary, depending on the ingredient of the antacid. Side effects may include: Constipation (especially for calcium carbonate and aluminum hydroxide) Diarrhea (especially for magnesium hydroxide) Loss of appetite Vomiting Gas Human Side Effects Antacids are medications for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdoseYou have additional questions or concerns about the use of an antacidAntacid Overdose Information Signs of an antacid overdose may cause vomiting and diarrhea, as well as abnormal electrolyte levels in the body. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Antacid Storage Antacids should be stored according to the product label at a controlled room temperature between 68-77 F. Always confirm storage requirements by reading the medication label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]