[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Atenolol", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1345473066.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1345473066.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/atenolol"}, "datePublished": "October 7, 2022", "dateModified": "October 7, 2022", "description": "Atenolol is a common pet medication prescribed to treat some heart conditions in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Atenolol? Atenolol is a medication used most often in small animals to treat abnormal heart rhythms that cause the heart to beat too quickly and to treat high blood pressure (hypertension). It is also used in cats to treat hypertrophic cardiomyopathy (HCM) and in combination with other medications to treat hypertension caused by hyperthyroidism. In dogs, atenolol can also be used to treat certain abnormal heart beats called Ventricular Premature Complexes (VPCs), arrhythmogenic right ventricular cardiomyopathy (Boxer Cardiomyopathy) and certain obstructive heart diseases like pulmonic or aortic stenosis. It is also used in ferrets for a heart disease called left ventricular hypertrophy. How Atenolol Works Atenolol is a heart medication that is classified as a beta-blocker. Beta-blockers lower the heart rate by blocking the beta-1 receptors of the heart from binding to naturally occurring chemical messengers in the body such as epinephrine (adrenaline) and norepinephrine. This slows the heart rate, allowing blood to fill up in the heart before it is pumped to the rest of the body. It also decreases the oxygen requirements of the heart and lowers blood pressure. Atenolol is FDA-approved for human use under the brand name Tenormin® and the generic name atenolol. Atenolol is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of atenolol. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Atenolol Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine an appropriate dose of medication for your pet based on your pet’s weight and the condition being treated. This medication is often given for long periods of time, so do not stop administering atenolol to your pet without talking to your veterinarian. Missed a Dose? If you forget to give a dose of atenolol, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Atenolol Possible Side Effects Most pets tolerate atenolol well. Side effects are mostly seen in older pets or those with worsening heart disease. If you see any of the following symptoms, please notify your veterinarian as soon as possible. Slow heart rate (bradycardia) Loss of appetite Low blood pressure (hypotension) Abnormal heart rhythms (arrhythmias) Diarrhea Fainting Decreased energy levels (lethargy) Human Side Effects While this is a human prescription medication there are different dosages and side effects that can occur in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring Your veterinarian may recommend routine testing and monitoring of your pets’ heart depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You have additional questions or concerns about the use of atenolol Atenolol Overdose Signs of an atenolol overdose can be severe and may require hospitalization. Symptoms to monitor for include a very slow heart rate (bradycardia), lethargy, low blood pressure (hypotension), weakness, collapse and vomiting. Rarely, high blood pressure or a fast heart rate can be seen. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Atenolol Storage Atenolol tablets should be stored at controlled temperature between 68-77 F. Keep the container tightly closed to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]