[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does Seresto® kill fleas already on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Seresto® kills existing fleas within 24 hours of applying the collar. New adult fleas are killed within 2 hours for the next 8 months."}}, {"@type": "Question", "name": "Can Seresto® get wet? Is the Seresto® collar waterproof?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Seresto® is water resistant and remains effective after bathing, shampooing, swimming, and rain or sun exposure. The collar remains effective for 8 months if a pet is bathed monthly. However, with more exposure to water, the collar will only work effectively for five months for flea control and seven months for tick control. Replace the collar every 5 months for dogs that swim regularly or get bathed more than once per month."}}, {"@type": "Question", "name": "Are Seresto® collars safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Seresto® collars are considered safe for dogs 7 weeks of age and older and cats 10 weeks and older. Consult your veterinarian before use in ill, debilitated, geriatric, pregnant, breeding, or nursing pets. Talk to your veterinarian if you have additional concerns about the safety of Seresto®. Counterfeit Seresto® collars have been noted on the market, these products are not safe, so please ensure that you are obtaining your Seresto® collar from a licensed distributor."}}, {"@type": "Question", "name": "How long does it take for Seresto® flea collars to work?", "acceptedAnswer": {"@type": "Answer", "text": "Seresto® kills existing fleas within 24 hours of applying the collar. New adult fleas are killed within 2 hours for the next 8 months. However, immature fleas can still develop in the environment for six weeks or more. Seresto® may not kill ticks that are already on your pet before applying the collar. Remove any existing ticks. Prevention of new ticks starts within 2 days of using the collar. After that, new ticks are repelled or killed in as fast as 6 hours."}}, {"@type": "Question", "name": "How old does a cat have to be to wear a Seresto® collar?", "acceptedAnswer": {"@type": "Answer", "text": "Seresto® is considered safe for cats and kittens 10 weeks of age and older."}}, {"@type": "Question", "name": "Does the Seresto® collar kill ticks?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Seresto® kills and repels deer ticks, American dog ticks, brown dog ticks, and Lone Star ticks. Seresto® may not kill ticks that are already on your pet before using the collar, so you’ll need to remove any existing ticks. Prevention against new ticks starts within 48 hours of using the collar. After that, new ticks are repelled or killed in as fast as 6 hours."}}, {"@type": "Question", "name": "Do Seresto® collars have an expiration date?", "acceptedAnswer": {"@type": "Answer", "text": "Seresto® collars are not labeled with an expiration date. However, it is important to keep the collar in its original, sealed packaging in a dry, cool location. Once opened and placed on your pet, it is effective for up to 8 months."}}, {"@type": "Question", "name": "Can Seresto® be used with Frontline?", "acceptedAnswer": {"@type": "Answer", "text": "Seresto® collars and Frontline® Plus both treat fleas, ticks, and chewing lice. Seresto® also treats and controls sarcoptic mange. Treatment with both products may not be necessary because both products treat similar parasites. Talk to your veterinarian to see which product(s) is appropriate for your pet. Sometimes veterinarians will prescribe more than one flea and tick treatment when one product is not sufficient.   No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Seresto® (Flumethrin, Imidacloprid)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-1332250975_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-1332250975_0.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog, Cat, Flea, Tick", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/seresto-flumethrin-imidacloprid"}, "datePublished": "May 20, 2022", "dateModified": "August 17, 2022", "description": "Seresto® pet collars are commonly used to protect pets from fleas and ticks.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Seresto®? Seresto® pet collars help protect your dog or cat from fleas and ticks. The collars slowly and continuously release two active ingredients (flumethrin and imidacloprid) over the course of 8 months. These active ingredients repel and kill fleas and ticks in dogs and cats. Seresto® cat collars help to repel and kill fleas and ticks in cats and kittens 10 weeks and older. For puppies and dogs 7 weeks and older, Seresto® helps repel and kill fleas, ticks, and chewing lice. Seresto® can also be used as part of a treatment plan for dogs affected by sarcoptic mange. Talk to your veterinarian to determine if Seresto® is a good choice for your pet. Pets with flea-bite dermatitis or hypersensitivity to flea bites may scratch relentlessly and suffer from skin disease. Fleas and ticks also transmit several infectious diseases, including Lyme disease, tick fever, bartonellosis, tapeworms, and more. How Seresto® Works Seresto® collars contain 4.5% flumethrin and 10% imidacloprid. The collar slowly and continuously releases these active ingredients onto your pet’s skin over 8 months. The active ingredients spread along the pet’s skin and haircoat to help protect against external parasites. In dogs and cats, Seresto® kills and repels fleas. After applying the collar, Seresto® kills fleas already on your pet’s body within 24 hours. If your pet continuously wears the Seresto® collar over the next 8 months, any new fleas that land on your pet will be killed within 2 hours. Seresto® kills fleas before they can lay eggs, which helps reduce flea larvae in the pet’s environment. However, immature fleas, or flea pupae that are already in the environment are not affected, allowing fleas to emerge in the environment for six weeks or more. According to the Seresto® label susceptible ticks include deer ticks, American dog ticks, brown dog ticks, and Lone Star ticks. Seresto® may not kill ticks that are already on your pet before using the collar. Remove any existing ticks. Prevention of new ticks starts within 48 hours of applying the collar. After that, new ticks are repelled or killed in as fast as 6 hours. Seresto® kills chewing lice and treats and controls sarcoptic mange in dogs. Seresto® Directions Follow the directions on the drug label or as provided by your veterinarian. See product packaging for complete instructions and helpful illustrations. Step 1: Open packaging only when ready to use the collar. Break and remove all plastic connectors that hold the collar in a coil in the packaging. Step 2: Fasten one Seresto® collar around your pet’s neck. Insert the end of the collar through the buckle, and then tighten it until you can comfortably insert only two fingers between the collar and the neck. This ensures that the collar is neither too tight nor too loose. Periodically check and adjust the fit of the collar, especially in growing puppies and kittens. Step 3: Secure the excess length of the collar through the attached loop. Trim any excess that extends one inch beyond the loop. However, you may wish to leave some extra length to allow for growth in puppies and kittens. Step 4: Seresto® collars include optional light reflectors that increase your pet’s visibility at night. Attach the three reflective clips at equal distances along the collar, and squeeze until a click is heard. These reflective clips will be permanently secured. Seresto® collars are water resistant and remain effective after bathing and swimming. However, the collars do not work as long with repeated exposure to water. Replace the collar after 5 months in dogs that swim regularly or get bathed more than once per month. Missed a Dose? Replace your pet’s Seresto® collar every 8 months (or every 5 months if your pet swims or is bathed more than once per month). The collars are designed to widen in order to quickly release your pet if it ever gets trapped. If this occurs or if the collar is lost, replace it immediately with a new collar.   Seresto® Possible Side Effects Some pets will scratch at the collar for a few days until they get used to it. Check to make sure the collar is not too tight. Rubbing under the collar can cause slight hair loss and mild skin redness. These signs should improve in 1-2 weeks without having to remove the collar but talk to your veterinarian if these signs do not resolve. Rarely, more severe skin reactions can occur, including skin inflammation and eczema. Remove the collar if skin inflammation or changes are seen. Consult your veterinarian immediately if the irritation is severe or if it does not resolve after collar removal. Do not place the collar into your pet’s mouth or eyes. Keep the collar out of the reach of children. Human Side Effects This product is not intended for use in humans, hand washing after prolonged contact with this product is recommended, if you develop skin irritation after contact with this product please call your physician or local poison control center. Monitoring No specific monitoring is required for use of this product, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe skin irritation or any other side effects are seen (see above)Your pet chews or swallows the collarYou have additional questions or concerns about the use of Seresto®Seresto® Overdose Information Overdoses can occur if a pet licks, chews, or swallows the collar. Also, do not allow the collar to touch your pet’s eyes. Immediately contact your veterinarian or an animal poison control center if your pet chews or swallows the Seresto® collar or if serious side effects are seen. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Seresto® Storage Keep out of reach of children. Store an unopened package in a dry, cool location that cannot be accessed by children. Do not contaminate food or water. Do not reuse packaging for food storage or any other purpose. Dispose of packaging and used collar in trash. The outer container can also be recycled."}]