[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can you get Comfortis® without a vet prescription?", "acceptedAnswer": {"@type": "Answer", "text": "Comfortis® is only available by prescription from your veterinarian. "}}, {"@type": "Question", "name": "Is Comfortis® safe for older dogs?", "acceptedAnswer": {"@type": "Answer", "text": "While Comfortis® is safe for use in older pets, it is always best to discuss all medications with your pet&#039;s veterinarian. "}}, {"@type": "Question", "name": "What happens if I miss a dose of Comfortis® for my pet?", "acceptedAnswer": {"@type": "Answer", "text": "Comfortis® should be given once a month. If you are late giving a dose of Comfortis®, give it when you remember.  "}}, {"@type": "Question", "name": "Does Comfortis kill flea eggs?", "acceptedAnswer": {"@type": "Answer", "text": "Comfortis® does not directly kill flea eggs. However, it kills fleas before they can lay any new eggs.  The information in this article is for educational purposes only and is not a substitute for advice, diagnosis, or treatment from a veterinarian. If you believe your animal is experiencing a medical emergency, call your veterinarian office immediately or seek immediate care from your local animal hospital.  Featured Image: iStock.com/anurakpong"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Comfortis® (Spinosad)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/husky.scratch_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/husky.scratch_0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat, Flea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/comfortis-spinosad"}, "datePublished": "April 29, 2022", "dateModified": "May 11, 2023", "description": "Comfortis® is a common medication prescribed to treat and help prevent fleas in pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Comfortis®?  Comfortis® is a chewable medication available by veterinarians for dogs and cats to treat and help prevention flea infestations. This flavored chew is given once a month to help combat fleas.  How Comfortis® Works  Once administered, Comfortis® works by disrupting the fleas’ nervous system within 30 minutes. Comfortis® kills 100% of fleas on dogs and 98% of fleas on cats after four hours.  Directions  Follow the directions on the drug label or as provided by your veterinarian. This medication should be given on a full stomach. Refer to the package label and your veterinarian to determine dosing directions.  Missed a Dose?  If you forget to give a dose of Comfortis®, give it when you remember and resume your normal dosing schedule. Do not give extra or double doses.   Comfortis® should be given once a month. If you are late giving a dose of Comfortis®, give it when you remember. The next dose should be given one month from the day it was last given.   If vomiting occurs within an hour of administration, give the full dose again.  Comfortis® Possible Side Effects  Vomiting is the most common side effect seen with Comfortis®. This side effect can be lessened when Comfortis® is given on a full stomach, which also helps the body absorb the medication.  Other less frequent side effects include:  Fatigue  Lack of appetite   Weight loss  Diarrhea  Cough  Increased thirst  Itching  Lack of coordination  Seizures  Human Side Effects  If you accidentally ingest a pet medication, immediately call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring  No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs if:  Severe side effects are seen (see above)  You see or suspect an overdose  You have additional questions or concerns about the use of Comfortis®  Comfortis® Overdose Information  Symptoms of a Comfortis® overdose are very similar to the side effects listed above. Vomiting is the most frequent symptom of an overdose.  If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Comfortis® Storage  Comfortis® should be stored at controlled room temperatures between 68-77°F. Brief exposure to temperatures between 59°-86°F are acceptable. Keep the medication in the provided blister packs until ready for use in order to protect the chews from moisture and light.  Keep out of reach of children and pets.  "}]