[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Griseofulvin", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1127420602.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1127420602.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/griseofulvin"}, "datePublished": "March 21, 2023", "dateModified": "October 14, 2023", "description": "Griseofluvin is sometimes used as a medication to treat ringworm in dogs, horses, and pocket pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Griseofulvin? Griseofulvin is a rarely used prescription medication that treats fungal infections such as dermatophytosis or ringworm in several species, including dogs, horses, small mammals (rats, hamsters, guinea pigs, ferrets), and rarely, cats. In horses, it can also be used for the treatment of rain rot. As more effective antifungals and strong topical products become available to treat ringworm, griseofulvin is no longer commonly used. Griseofulvin is FDA-approved for use in horses but is used off-label in other species. The term off- or extra- label use means that a medication is prescribed for a certain use, or in a particular species, that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. How Griseofulvin Works Griseofulvin is not a true antifungal in that it does not directly kill the fungal organism or clear it from the skin or fur. Griseofulvin blocks fungus ability to divide and multiply, thereby preventing the growth of more fungi on new fur or skin. In certain circumstances, your vet may recommend a compounded formulation of griseofulvin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Griseofulvin Directions Follow the directions on the drug label or as provided by your veterinarian. Griseofulvin is best given with foods high in fat or oil, which can help minimize gastrointestinal side effects and improve absorption. If your pet is experiencing digestive upset after being given this medication, please contact your veterinarian. Pet parents should wear gloves while administering griseofulvin. Women who are pregnant or who may become pregnant should avoid contact with this medication. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of griseofulvin. Generally, they may advise you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Griseofulvin Possible Side Effects Griseofulvin can cause digestive upset in animals as well as changes to their blood cell production. Symptoms may include: Decreased appetite Vomiting Diarrhea Depression Incoordination Sun sensitivity Weakness Liver irritation Cats, especially those with FIV (feline immunodeficiency virus) or FeLV (feline leukemia virus) are more susceptible to suppression of the bone marrow, which leads to low production of blood cells. Fever Purple spots or rash on the skin or gums Pale gums Weakness Lethargy Unexplained bleeding Griseofulvin should not be used in pregnant pets, breeding males, or pets with liver disease. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. Women who are pregnant or who may become pregnant should avoid contact with this medication. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: You see severe side effects (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of griseofulvin Griseofulvin Overdose Information Overdoses of this medication are rare. Signs of an overdose may include vomiting, diarrhea, and loss of appetite. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Griseofulvin Storage Griseofulvin should be stored at controlled room temperatures between 68-77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}]