[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Temaril-P® safe for use in dogs long term?", "acceptedAnswer": {"@type": "Answer", "text": "Temaril-P® is generally not used long term because the prednisolone in it can cause unwanted side effects, such as increased chances of infection due to a weakened immune system, delayed wound healing, thinning skin, hair coat problems, potbellied appearance due to muscle wasting, low blood pressure, abnormal heart rate, or adrenal gland problems. Temaril-P® is meant to be given to your pet for the shortest amount of time at the lowest dose needed to help relieve your pet’s itching and suppress cough."}}, {"@type": "Question", "name": "What is Temaril-P® used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Temaril-P® is FDA-approved in dogs to provide relief from itching and as an anti-cough medication. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Przemysław Iciak"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Temaril-P® (trimeprazine with prednisolone) for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1197083216.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1197083216.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/temaril-p-dogs-cats"}, "datePublished": "June 27, 2023", "dateModified": "June 27, 2023", "description": "Teramil P® is commonly prescribed by veterinarians to treat itching or coughing in dogs. Learn more about Teramil P® for dogs and cats, including how it works, dosing, and possible side effects.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Temaril-P®? Temaril-P® is an FDA-approved medication prescribed by veterinarians for itching and coughing in dogs, especially if triggered by environmental allergies and inflammation. Temaril-P® is a combination of 2 medications—the antihistamine trimeprazine and the corticosteroid  prednisolone. Temaril-P® does not cure allergies and inflammation, but it can help suppress related symptoms. Although uncommon, Temaril-P® is sometimes prescribed for the treatment of itching in cats. The use of Temaril-P® in cats is considered off-label. The term off- or extra-label use means that a medication can be used in a way or in a particular species that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of Temaril-P®. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Temaril-P® Works Temaril-P® is a combination of trimeprazine, an antihistamine, and prednisolone, a corticosteroid. Trimeprazine blocks the effects of histamine, a chemical messenger produced with environmental allergies and inflammation, which occurs with an overreactive immune system. As an antihistamine, trimeprazine can help suppress coughing and itching. As a corticosteroid, prednisolone blocks harmful effects of inflammation through multiple complex pathways. Treatment with a trimeprazine/prednisolone combination may be more effective for itching than treatment with prednisolone alone. This reduces the dose of prednisolone needed to help control your pet’s symptoms, which can help your pet experience fewer medication-related side effects. Temaril-P® Directions Follow the directions on the drug label or as provided by your veterinarian. Always provide your pet with plenty of water when they are taking Temaril-P®. Temaril-P® can be given with or without food, but giving it with food can decrease the risk of digestive upset. If your veterinarian recommends that you discontinue this medication for any reason, it is best to wean your pet off slowly, under a veterinarian&#039;s supervision, especially if they have been taking it long term. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Temaril-P®. Generally, they may instruct you to give it when you remember, or, if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses Temaril-P® Possible Side Effects Increased thirst Increased urination Increased appetite Vomiting Diarrhea Weakened immune system Grogginess Low body temperature Low blood pressure Muscle stiffness, tremors, weakness Weight loss Human Side Effects Temaril-P® is not approved for use in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s or animal’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Temaril-P® Giving Temaril-P® with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. Temaril-P® Overdose Information An overdose of Temaril-P® can cause serious health problems such as sedation, loss of balance, seizures, and dangerously low blood pressure. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Temaril-P® Storage Temaril-P® should be stored in a cool, dry place at controlled temperatures below 77 F. Keep the container tightly closed in order to protect its contents from moisture and light. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]