[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much does Solensia™ for cats cost?", "acceptedAnswer": {"@type": "Answer", "text": "The cost for Solensia™ injections may vary depending on certain factors such as where you live, the setting of your veterinarian (hospital vs. clinic), and the dosage required."}}, {"@type": "Question", "name": "What does Solensia™ treat in cats?", "acceptedAnswer": {"@type": "Answer", "text": "Solensia™ is the only FDA-approved treatment for the control of pain associated with osteoarthritis in cats. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/didesign021"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Solensia™ (frunevetmab injection) for Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-529427582.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-529427582.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Cat, Medication, Arthritis", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/solensia-for-cats"}, "datePublished": "June 27, 2023", "dateModified": "June 27, 2023", "description": "Solensia™ is the first FDA-approved injection medication to treat arthritis in cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Solensia™? Solensia™ is the first and only FDA-approved treatment for the control of pain associated with osteoarthritis in cats. Approved by the FDA in January 2022, it is an injection given to your cat once a month by your veterinarian. How Solensia™ Works Frunevetmab is the active ingredient in Solensia™. It is classified as a monoclonal antibody, which is a lab-made protein developed to target certain parts of the body. Frunevetmab is specifically designed to work in cats and is the first monoclonal antibody approved by the FDA for veterinary use. In cats with osteoarthritis, cartilage breaks down in the joints, which causes the bones to rub together and cause pain. Frunevetmab specifically binds to a protein messenger called nerve growth factor (NGF) ,which blocks its ability to communicate pain signals to the brain, thereby preventing the cat from feeling pain. Solensia™ Directions Solensia™ is available only by prescription and must be administered at a veterinary practice. It is not available for administration at home because your vet’s professional expertise is needed to properly diagnose pain associated with osteoarthritis in your cat, administer the injection, and monitor the safe use of Solensia™. Solensia™ is given as an under-the-skin (subcutaneous) injection once a month, and the dosage is determined by your cat’s weight. Missed a Dose? If you forget to bring your cat in for their monthly injection, please contact your veterinarian. In general, your vet will schedule an appointment for your cat every four weeks to administer the injection and observe your cat’s response to Solensia™.  Solensia™ Possible Side Effects Solensia™ may cause the following side effects: Vomiting Diarrhea Pain at the injection site Scabs on the head and neck Itchy skin Solensia™ should not be administered to cats with known hypersensitivity to frunevetmab. It should also not be used in breeding, pregnant, or lactating cats because it may pass through the placental blood barrier and be excreted in milk. Human Side Effects Solensia™ is not an approved medication for humans and accidental injection may cause harm. Women who are pregnant, breastfeeding, or trying to conceive should take extreme care to avoid accidental self-injection. Allow veterinary staff to hold and position your cat upon administration by your veterinarian. Hypersensitivity reactions, including anaphylaxis, could potentially occur in the case of accidental self-injection. If accidental self-injection occurs, seek medical advice immediately and show the package leaflet or the label to the physician. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Solensia™ Solensia™ Overdose Information Solensia™ is well tolerated in cats, but an overdose is possible. Symptoms of an overdose include gastrointestinal issues (vomiting, diarrhea) or skin issues (scabs, itching, and hair loss). If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Solensia™ Storage Your veterinarian will need to store Solensia™ in the refrigerator between 35-46 F. Do not freeze Solensia™ and make sure to protect it from light. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]