[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Where can you buy ronidazole for cats and dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Ronidazole is not currently FDA-approved nor commercially available in the United States. In certain circumstances your veterinarian may be able to prescribe a compounded formulation if available at a reputable veterinary compounding pharmacy."}}, {"@type": "Question", "name": "What is ronidazole used for in cats and dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Ronidazole is used for intestinal protozoal infections including Tritrichomonas foetus infections in cats and Giardia infections in dogs as an alternative treatment after other preferred treatments have not been successful."}}, {"@type": "Question", "name": "How long can you keep a cat on ronidazole?", "acceptedAnswer": {"@type": "Answer", "text": "There is no defined period of time that a cat can be prescribed ronidazole. The most common duration of treatment for your cat to be on ronidazole is typically around two weeks, but this can vary depending on your cat’s response to the medication and their symptoms, which can take months to fully resolve. Your veterinarian may recommend diagnostic testing to confirm that the infection has been successfully treated. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/hobo_018"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ronidazole for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1136855170.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1136855170.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ronidazole-dogs-and-cats"}, "datePublished": "October 9, 2023", "dateModified": "October 9, 2023", "description": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Ronidazole? Ronidazole is a prescription antiprotozoal medication used for intestinal protozoal infections that cause diarrhea, including Tritrichomonas foetus infections in cats and Giardia infections in dogs, as an alternative treatment when primary treatments have not been successful. Ronidazole is not currently FDA-approved nor commercially available in the United States. In certain circumstances, your veterinarian may be able to prescribe a compounded formulation if available at a reputable veterinary compounding pharmacy. In certain circumstances, your vet may recommend a compounded formulation of ronidazole. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Ronidazole should not be used in animals that are sensitive to the medication or other medications categorized in the same antiprotozoal drug class, such as metronidazole. It is best to discuss your pet’s medications and medical conditions with your veterinarian first before giving ronidazole, as there may be health risks to your pet if they are taking certain other medications. This medication should not be used in farmed animals. How Ronidazole Works Protozoa are microscopic single-celled parasites that cause infection and disease in the gastrointestinal system. Ronidazole and other medications in its 5-nitroimidazole drug class, such as metronidazole, kill protozoa by generating free radicals that disrupt their DNA. Ronidazole Directions Follow the directions as provided by your veterinarian. Ronidazole can be given with or without food, but giving it with food can decrease the risk of digestive upset. Ronidazole should not be used in animals that are sensitive to it or other 5-nitroimidazole drugs like metronidazole. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of ronidazole. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Ronidazole Possible Side Effects Possible side effects of ronidazole include: Fever Loss of appetite Loss of balance, trouble walking Muscle tremors and weakness Seizures Low energy (lethargy) Eyes uncontrollably moving back and forth (nystagmus) Human Side Effects Ronidazole is a prescription medication that has not been FDA-approved for use in humans. Avoid direct contact with the medication. Wear disposable gloves and wash hands after administering this medication. When your pet is taking ronidazole, wear disposable gloves when cleaning up waste and handling the cat litterbox. Waste must be sealed in a plastic bag and disposed of according to your veterinarian’s instructions. If you accidentally ingest this medication, call your physician, seek medical care, or call the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of ronidazole Ronidazole Overdose Information Signs of an overdose of ronidazole may include neurological symptoms such as loss of balance, trouble walking or navigating stairs, muscle tremors, muscle weakness, seizures, or eyes moving back and forth (nystagmus). If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Ronidazole Storage Ronidazole should be stored according to the pharmacy’s label. Keep the container tightly closed to protect its contents from moisture and light. Keep out of reach of children and pets."}]