[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Diltiazem", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-696580340.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-696580340.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/diltiazem"}, "datePublished": "September 9, 2022", "dateModified": "October 7, 2023", "description": "Diltizazem is prescribed in pets to treat certain abnormal or irregular heartbeats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.  What is Diltiazem? Diltiazem is a type of medication called a calcium channel blocker that is used to treat certain arrythmias (abnormal or irregular heartbeats). It is primarily used in arrythmias with a fast heart rate (tachycardia) such as supraventricular tachycardia (SVT).  Diltiazem can also be used to treat hypertension (high blood pressure) in pets. In cats and ferrets, diltiazem is also used in combination with other medications to treat a heart muscle disease called hypertrophic cardiomyopathy. Diltiazem can be used as a maintenance medication as well as in the hospital for pets with heart related emergencies.  Diltiazem is a generic drug, FDA-approved for human use under several brand names, which include Cardizem® and Tiazac®. Diltiazem is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Diltiazem is often prescribed dogs, cats, horses, ferrets, rabbits and other small rodents. Ultimately, your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of diltiazem. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here.  How Diltiazem Works Diltiazem is a calcium channel blocker, which means it blocks calcium ions from entering the cells of the heart and blood vessels. This causes the heart rate to slow and blood vessels to relax and dilate, which lowers blood pressure because blood can then flow more easily. Diltiazem can slow abnormally fast heartbeats in certain arrhythmias such as SVT due to its ability to slow down the electrical signals in the muscles of the heart that are responsible for its contraction. Diltiazem should not be used with pets that have certain arrythmias, so speak with your vet to ensure this medication is right for them.   Diltiazem Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine the appropriate dosage based on your pet’s weight and their heart condition. Follow the directions closely. Do not give more or less than as directed by your veterinarian and ensure that this medication is given exactly as scheduled.Diltiazem can be given with or without food. Giving it with a small meal may help reduce vomiting or other digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of diltiazem. Generally, it is critical to give this medication exactly on schedule. If your pet has become off schedule while on this medication, speak with your veterinarian to clarify if any adjustments to their dosing schedule need to be made and for guidance on how to start them back up on a normal dosing schedule. If you forgot to give a dose and then administered it as soon as you remembered, your veterinarian may recommend waiting the usual amount of time between the next doses. Diltiazem Possible Side Effects Diltiazem is typically well tolerated in most pets. Common symptoms include: Lethargy Vomiting Diarrhea Inappetence (lack of appetite) Bradycardia (a heart rate that is too slow) Low blood pressure Weight loss Skin rash Cats receiving the extended-release version of this medication were more likely to exhibit symptoms of lethargy, vomiting, diarrhea, and weight loss than those not receiving the extended-release version. Human Side Effects While diltiazem is an FDA approved medication for use in humans, there are different dosages and side effects that can occur in humans, as well as interactions that can occur with other medications.  If you accidentally ingest this medication, immediately seek medical attention or the national Poison Control Center hotline at 800-222-1222.  Monitoring Periodic recheck exams to monitor your pet’s heart health while on diltiazem are necessary.  Your veterinarian may recommend additional testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdoseYou have additional questions or concerns about the use of diltiazem Diltiazem Overdose Information Overdoses of diltiazem are likely to cause exaggerated versions of the side effects noted above, with lethargy, low blood pressure and arrythmias that cause slow heart rates, being the most common symptoms. Treatment of overdoses usually involves hospitalization of the pet, so if you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661ASPCA Animal Poison Control (888) 426-4435  Diltiazem Storage Diltiazem should be stored at controlled temperatures of 77°F and brief exposure to temperatures 59°-86°F are acceptable. Keep the container tightly closed to protect from moisture and light. Always confirm storage requirements by reviewing the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. "}]