[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dexamethasone", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1327459254.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1327459254.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/dexamethasone"}, "datePublished": "September 8, 2022", "dateModified": "October 11, 2023", "description": "Dexamethasone is a medication commonly prescribed to treat allergic reactions and immune-related diseases in dogs, cats, and horses.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Dexamethasone? Dexamethasone is a type of steroid medication called corticosteroids. It belongs to a subcategory of naturally occurring corticosteroids called glucocorticoids.  Glucocorticoids medications have many functions depending on how they are administered. Dexamethasone is a powerful anti-inflammatory prescribed to treat immune mediated diseases, severe allergic reactions, and deficiencies of natural body steroids (e.g., Addison&#039;s disease). It can also be used in combination with other medications to treat certain types of cancer. Dexamethasone may also be used as a part of testing to help diagnose Cushing’s syndrome, as well as other steroid hormone imbalances.  The injectable version of dexamethasone is FDA approved for use in dogs, cats, horses, and cattle, but tablets are currently only approved by the FDA for use in humans. However, tablet versions of this medication are readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of dexamethasone. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Dexamethasone Works Dexamethasone is a steroid that can have various effects on the body depending on the dose and treatment regimen. At lower doses, dexamethasone reduces inflammation and can replace normal body steroids. At higher doses, dexamethasone can suppress the immune system. Dexamethasone is also commonly used as an injection in the hospital setting to aid in certain emergencies like severe allergic reactions, Addisonian crisis, certain head or spine traumas, or shock. Your veterinarian will determine and prescribe the dose that is appropriate for your pet’s medical condition. Dexamethasone Directions Follow the directions on the drug label or as provided by your veterinarian. Check the label closely, as the recommended dosage may change over the course of treatment. Your veterinarian may recommend giving dexamethasone with food, as this will lower the risk of digestive upset. Treatment with dexamethasone for longer than 1-2 weeks can interfere with your pets’ body’s production of their own steroids. To account for this, veterinarians usually recommend that the dose or frequency be slowly decreased over time (tapered) until your pet is no longer on this medication. Make sure to follow all dosing tapering directions closely. Do not stop the medication before completing the full course of treatment without first discussing it with your veterinarian. Abruptly stopping long-term treatment without tapering the dose can cause serious side effects. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of dexamethasone. Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses.  Dexamethasone Possible Side Effects Side effects from taking dexamethasone are highly dependent on what dose of medication your pet is receiving and how long they have been on the medication.  The most common side effects include the following: Increased appetite  Increased thirst Increased urination (increased amount and/or frequency, may cause accidents inside the house) Panting  Vomiting/Diarrhea Additional side effects can be seen, especially when dexamethasone is given long-term or at higher doses. These additional side effects may include: Weight gain Poor haircoat or hair loss Muscle wasting (atrophy) Behavior changes (aggression, depression, lethargy)  Decreased energy level or weakness Bleeding into the digestive tract – may present as black and tar-like stools  Stomach or intestinal ulcers (sores) - may present as bright blood in vomit Triggering or worsening of diabetes mellitus Pot-belly appearance (distended abdomen) Increased risk for infections  If you believe your pet may be experiencing any side effects of dexamethasone, consult your veterinarian. Abruptly stopping a steroid medication like dexamethasone can cause serious side effects. Contact your veterinarian before discontinuing dexamethasone. Your veterinarian can recommend a dose taper to reduce the likelihood of serious side effects. Human Side Effects While dexamethasone  is a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest your pet’s medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222.  Monitoring Your veterinarian is likely to recommend routine visits and testing while your pet is on this medication. Testing may vary depending on your pets&#039; individual needs, any other medications they may be on and/or the issue that initially caused your pet to be placed on this medication.  Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You have additional questions or concerns about the use of dexamethasone Dexamethasone Overdose Information Overdoses of steroids like dexamethasone can cause digestive upset and ulceration. Signs may include vomiting, diarrhea, decreased appetite, blood in the vomit or black, tar-like stools.  If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661ASPCA Animal Poison Control (888) 426-4435 Dexamethasone Storage Dexamethasone should be stored at controlled temperatures between 68-77°F, but always confirm storage requirements by reviewing the label. Keep the container tightly closed to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer.  Featured Image: iStock.com/Chalabala"}]