[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ursodiol", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-626535946.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-626535946.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ursodiol"}, "datePublished": "January 31, 2023", "dateModified": "February 3, 2023", "description": "Ursodiol is a prescription medication used to treat certain diseases that affect the liver and gallbladder in pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Ursodiol? Ursodiol is in a class of medications called gallstone dissolution agents. It is a naturally occurring bile acid. Bile acids are compounds created in the liver and stored in the gallbladder for release into the intestines to help digest food. Ursodiol is used in certain liver and gallbladder diseases like cholestasis in cats and dogs, chronic hepatitis in dogs, or toxic liver injuries. Ursodiol is also used infrequently for certain liver diseases in birds. How Ursodiol Works Ursodiol works in many ways. Ursodiol decreases the cholesterol content in bile by lowering the amount of cholesterol secreted by the liver. This helps to prevent gallbladder stones or sludge, which are often partially comprised of cholesterol. It also works to increase the flow of bile from the liver into the gallbladder. Ursodiol also has some anti-inflammatory and antioxidant properties. Ursodiol is FDA-approved for human use as a generic medication, and under the brand names Reltone®, Actigall, URSO 250, and URSO® Forte. Ursodiol is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your veterinarian may recommend a compounded formulation of ursodiol. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Ursodiol Directions Follow the directions on the drug label or as provided by your veterinarian. Ursodiol is best absorbed with food. Giving with food may also help mask its bitter taste. Ursodiol is typically given once or twice a day depending on the species and for what purpose the medication has been prescribed. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of ursodiol. Generally, they may advise you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Ursodiol Possible Side Effects There is limited information on side effects in pets, but overall ursodiol appears to be well tolerated. Side effects may include: Diarrhea Abdominal discomfort Nausea Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of ursodiol Ursodiol Overdose Information Symptoms of an overdose of ursodiol may include vomiting, diarrhea, and drooling. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Ursodiol Storage Generally, most commercially available ursodiol products should be stored at controlled room temperatures between 68-77. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]