[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can milk thistle reverse liver damage in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "SAMe, which is one of the ingredients in the milk thistle/SAMe combination, has been shown to help protect liver cells from cellular damage and may help with cell repair and regeneration. Depending on the type and severity of your dog&#039;s liver damage, it may not be sufficient to help your dog’s liver return to normal function. Milk thistle itself is more of an antioxidant and anti-inflammatory than a direct contributor to cell repair. Consult with your veterinarian about whether this supplement is right for your pet based on your pet’s history and risk factors. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Milk Thistle/SAMe", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1188475253.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1188475253.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/milk-thistle-same"}, "datePublished": "March 21, 2023", "dateModified": "November 6, 2023", "description": "Milk Thistle/SAMe is a nutraceutical medication or supplement that can be prescribed to treat chronic disease in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Milk Thistle/SAMe? Milk Thistle/SAMe is a supplement or nutraceutical containing two ingredients—milk thistle and SAMe (S-adenosylmethionine). Nutraceuticals are not pharmaceutical medications, because they derive from natural substances such as plants. Nutraceuticals may be prescribed by a veterinarian as a supplement to improve health or protect against chronic disease. Milk thistle and SAMe are utilized together as a liver protectant and antioxidant for pets with acute liver injury, chronic liver disease, and hepatic lipidosis. They can also be used in pets that are on medications that can cause liver irritation, or to support the liver when certain toxins have been ingested. Research suggests that using milk thistle and SAMe together may have a supportive effect on brain function in older dogs with cognitive decline. Consult your veterinarian before giving this supplement to your pet. Denamarin® is an over-the-counter supplement that contains silybin (the active compound extracted from the milk thistle plant) and SAMe. It is marketed as a supplement for dogs and cats that have liver disease. Veterinarians may also prescribe milk thistle/SAMe for use in horses, birds, ferrets, and rabbits. In certain circumstances, your vet may recommend a compounded formulation of milk thistle/SAMe. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Milk Thistle/SAMe Works SAMe has been shown to help protect liver cells from damage and may help liver cells repair and regenerate. Milk thistle contains silybin, which is the potent active compound responsible for its potent and beneficial antioxidant and anti-inflammatory effects. There are two commercially available forms of milk thistle and SAMe, Denamarin® and Denamarin® Advanced. The silybin component of Denamarin® has been shown to have better absorption in dogs compared to other milk thistle extract products. Denamarin® Advanced is a medication that contains the same two active ingredients but contains a proprietary formula that makes it easier for the body to absorb and reap its benefits. Denamarin® Advanced is only available from your veterinarian. Nutraceuticals are not regulated by the FDA, which is why there are no FDA-approved milk thistle/SAMe products. Denamarin® is a patented formulation and is labeled as a milk thistle/SAMe product. Speak with your veterinarian about whether milk thistle/SAMe products are right for your pet. Milk Thistle/SAMe Directions Follow the directions on the drug label or as provided by your veterinarian. For best absorption, it should be given on an empty stomach at least one hour before a meal. It can be given with a small treat or bite of food, if needed. When giving Denamarin® or milk thistle/SAMe to cats, it is best to follow the tablet administration with 3-6 milliliters (mL) of water by mouth, to help the tablet make its way down into the stomach. Enteric-coated tablet versions of Denamarin® or milk thistle/SAMe should not be split or crushed before administration. Missed a Dose? Speak with your veterinarian if you forget to give a dose of Denamarin® or milk thistle/SAMe. Generally, they may recommend that you give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Milk Thistle/SAMe Possible Side Effects Milk thistle/SAMe is generally well tolerated by most pets. Side effects are rare but may include: Decreased appetite Vomiting Diarrhea Human Side Effects While milk thistle and SAMe are used in human medicine, there are different dosages and side effects can occur in humans. If you accidentally ingest milk thistle/SAMe for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Denamarin® or milk thistle/SAMe Milk Thistle/SAMe Overdose Information Milk Thistle/SAMe overdoses are rare. Signs of an overdose may include vomiting, diarrhea or loss of appetite. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Milk Thistle/SAMe or Denamarin® Storage Denamarin® should be stored at controlled temperatures under 86 F. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]