[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lysine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/lysine"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Lysine is used to prevent the replication of herpesvirus in cats and dogs. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Lysine helps halt the replication of herpesvirus in your pet. It is typically administered to cats. It is effective against conjunctivitis (inflammation of the eye) that is associated with the herpesvirus. Always discuss the dosage of over the counter L-Lysine with your veterinarian, as it is different in pets than the label for humans recommends. How It Works Lysine coats the herpesvirus and interferes with another amino acid known as arginine, which the virus needs in order to replicate. Storage Information Keep in a tightly sealed container at room temperature. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Lysine may react with these drugs: Steroids or any other immune system suppressing drugCalcium supplementsAminoglycoside medicationsUse caution when purchasing over the counter Lysine! Ensure that the product does not contain propylene glycol, as this may cause reactions in cats. USE CAUTION WHEN ADMINISTERING THIS DRUG TO PETS WITH KIDNEY OR LIVER DISEASE"}]