[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does Apoquel® do for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Apoquel® relieves itching in dogs with allergic skin diseases, including atopic dermatitis. It inhibits an important itch signal, reducing itching at its source. Atopica® also reduces the release of some of the signals that trigger inflammation. By reducing itchiness and inflammation, Atopica® helps control allergic skin diseases in dogs."}}, {"@type": "Question", "name": "How long can a dog take Apoquel®?", "acceptedAnswer": {"@type": "Answer", "text": "Apoquel® can be given short-term or long-term. Your veterinarian will recommend an appropriate treatment length for your dog."}}, {"@type": "Question", "name": "Is there a generic version of Apoquel®?", "acceptedAnswer": {"@type": "Answer", "text": "There is no generic currently available for Apoquel®. There are other types of medications and treatments available to manage allergic dermatitis in dogs."}}, {"@type": "Question", "name": "Why is Apoquel® unique?", "acceptedAnswer": {"@type": "Answer", "text": "Apoquel® inhibits an important itch signal. This stops allergic itching at its source. Apoquel® is currently the only drug available for dogs that works in this way. There are other allergy treatment options available for dogs. Each varies in its effectiveness, cost, and possible side effects. A combination of drugs may also be necessary, especially since skin infections may commonly occur with or because of another infection. The best way to determine which drug or drug combination is best for your dog is to talk to your veterinarian. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer Featured Image: iStock/freemixer"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Apoquel® (oclacitinib)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1176429264.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1176429264.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/apoquel"}, "datePublished": "July 8, 2022", "dateModified": "September 15, 2023", "description": "Apoquel® is commonly prescribed to treat itching and inflammation in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Apoquel®? Apoquel® is an allergy medication that treats itching and inflammation in dogs by targeting an important itch signal in a dog’s body, helping to stop the itch before it starts. Apoquel® starts working within 4 hours and helps stop itching within 24 hours. Veterinarians prescribe Apoquel® either short-term for allergic flare-ups or long-term for the management of skin allergies. How Apoquel® Works Apoquel® controls the itching caused by allergic skin diseases. It also controls atopic dermatitis, which is a common, long-term inflammatory skin disease caused by environmental allergies in dogs. Apoquel® inhibits Janus kinase, an important signal that triggers itching and inflammation in allergic dogs. By inhibiting this itch signal, Apoquel® reduces the cause of itching at a cellular level. It can also reduce the effects of some inflammatory signals in the body. As a result, allergic dogs that take Apoquel® do not feel as itchy and scratch less. The skin inflammation caused by allergies is also reduced. Apoquel® Directions Follow the directions on the label and as provided by your veterinarian. Give Apoquel® tablets by mouth. Apoquel® can be given with or without food. If your dog vomits after taking Apoquel®, try giving it with some food or a meal after consulting with your vet. Apoquel® is approved for use in dogs 12 months and older. Do not use in breeding, pregnant, or nursing dogs. Tell your veterinarian if your dog has a serious infection, as this drug should not be used in these cases. Tell your veterinarian about all medications and supplements your dog takes, and do not give additional medications without discussing them with your veterinarian. It is unknown whether Apoquel® can be used with some other common allergy medications, including steroids and cyclosporine (Atopica®). Missed a Dose? If you miss a dose, you can give one when you remember and resume your dosing schedule. However, do not give a double dose. If the next dosage it due or close to being due, just skip the missed dose. Skipping doses may cause an increase in itching and skin inflammation. Apoquel® Possible Side Effects The most common side effects for Apoquel® include: VomitingDiarrheaAnorexiaDecreased energy (lethargy)Increased thirstOften, these side effects are temporary and resolve on their own. If these side effects are severe or do not resolve, contact your veterinarian. More serious side effects can also occur, including: Serious infections (including pneumonia, urinary tract infections, and skin infections)Demodicosis (a skin disease caused by Demodex mites)Skin masses, including cysts between the toes and skin cancerCancer (new tumors or worsening of existing ones)AggressionLow white blood cell countYou and your veterinarian should monitor your dog for the development of infections, cancer, or skin changes. Contact your veterinarian if you see any of the following signs: Trouble breathingDecreased energy or listlessnessAny skin or haircoat changesNew masses or changes to existing onesFeverChanges in urination (including accidents, frequency of urination, and bloody urine)Human Side Effects This product is not intended for use in humans, hand washing after prolonged contact with this product is recommended. If you accidentally ingest this medication, or if you develop skin irritation after contact with this product, please call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication.Call Your Vet If Your dog shows signs of infection or pneumonia (for example, trouble breathing, lethargy) or has a feverYou see abnormal skin changes or growths; severe side effects are seen, or you see or suspect an overdoseCall your vet or pharmacist if you have additional questions or concerns about the use of Apoquel®Apoquel® Overdose Information Dogs that received overdoses in safety studies had side effects that included one or more of the following: vomiting, diarrhea, cysts between the toes, skin inflammation, papilloma&#039;s (warts), pneumonia, enlarged lymph nodes, and decreased blood cell production. Do not give more Apoquel® than is recommended by your veterinarian. If you see or suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Apoquel® Storage Apoquel should be stored at controlled temperatures between 36-77°F and brief exposure to temperatures 59°-86°F are acceptable. Keep the container tightly closed in order to protect from moisture and light.   Keep out of reach of children and pets."}]