[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does budesonide treat in dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "In dogs and cats, budesonide may be used to treat inflammatory bowel disease (IBD) and other conditions with chronic (long-term) inflammation of the intestine. Your veterinarian will determine whether this medication is right for your pet."}}, {"@type": "Question", "name": "How long does it take budesonide to work in dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "Budesonide begins working within a few hours of your pet taking it, but it may take up to several days for your pet to feel better, depending on their underlying medical condition and individual health status. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/yacobchuk"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Budesonide for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-849953114.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-849953114.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/budesonide-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "October 6, 2023", "description": "Budesonide is a prescription medication prescribed by veterinarians to treat various intestinal conditions in dogs and cats. Learn how budesonide works in dogs and cats, including side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Budesonide? Budesonide is an oral corticosteroid used in dogs and cats to treat chronic (long-term) inflammation of the intestines. It may be used to manage inflammatory bowel disease (IBD) in dogs and inflammatory bowel disease (IBD) in cats. It may also be used in pets who cannot tolerate other corticosteroid medications since it may generally cause fewer overall side effects compared to other corticosteroids. Budesonide is FDA-approved for human use under the brand names Ortikos®, Tarpeyo®, Entocort EC®, Rhinocort®, and Uceris® and the generic budesonide. Budesonide is currently not FDA-approved as a veterinary medication. However, it is occasionally utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This practice is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. Budesonide is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. In certain circumstances, your vet may recommend a compounded formulation of budesonide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Budesonide Works Oral budesonide is a corticosteroid formulated to delay dissolving in the body until it reaches the gastrointestinal tract, where it works locally to block the harmful effects of gastrointestinal inflammation. Since less of the medication is absorbed through the bloodstream compared to other corticosteroids, this may result in fewer corticosteroid-associated side effects in the body. Budesonide Directions Follow the directions on the drug label or per instructions provided by your veterinarian. Budesonide can be given with or without food, but giving it with food can decrease the risk of digestive upset. Generally, your veterinarian will recommend providing your pet with plenty of water while they are on budesonide. Giving budesonide with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian prior to administering this medication to your pet. If your veterinarian recommends that you discontinue this medication for any reason, they will typically recommend that you wean your pet off the medication slowly, and under their supervision, especially if your pet has been taking budesonide long-term. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of budesonide.  Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Budesonide Possible Side Effects Like all other medications, budesonide may cause side effects. Common side effects include: Vomiting Loss of appetite Diarrhea Black, tarry stools Weakened immune system (more prone to infections) Increased panting (in dogs) Increased thirst Increased urination Increased appetite Muscle weakness Pot-bellied appearance to abdomen Weight gain Note, this medication has a moderate duration. Therefore, side effects may last for several days, even after you have stopped administering the medication to your pets. Side effects may last for a longer amount of time in animals with liver or kidney disease. Budesonide should be avoided in pregnant and lactating pets.   Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose Your pet’s condition worsens or does not improve with treatment. You have additional questions or concerns about the use of budesonide Budesonide Overdose Information Overdoses of budesonide can cause severe gastrointestinal symptoms such as bloody vomit (fresh blood or digested blood that may look like coffee grounds), loss of appetite, black tarry stools, or other symptoms such as high fever and low energy level. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Budesonide Storage Budesonide should be stored at a controlled room temperature between 68-77 F. Always confirm storage requirements by reading the prescription label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]