[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Potassium Supplements", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/potassium-supplements"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Potassium Supplements are used to treat a deficiency of potassium. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Potassium Chloride and Potassium Gluconate are supplements that are used to increase the amount of potassium in your pet’s blood. Dogs and cats that have a deficiency of potassium usually have an underlying condition such as a chronic kidney condition or kidney failure. These conditions are typically associated with old age. How It Works Potassium is eliminated in the urine, and pets with kidney conditions may not be able to adequately absorb it from their stomach and intestines. Giving your pet added potassium will improve the health of the nerves, enzymes, and muscles. Storage Information Keep in a tightly sealed container at room temperature. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Potassium supplements may result in these side effects: Muscle weaknessUpset stomachVomitingDiarrheaLoss of appetitePotassium supplements may react with these drugs: CorticotropinDifoxinPenicillinDiureticsRimadyl (and other NSAIDs)GlucocorticoidsMineralocorticoidsAnticholinergicsBenazapril (and other ACE inhibitors)"}]