[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Otomax®, Tri-Otic®", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1423831364.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1423831364.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/otomax-tri-otic"}, "datePublished": "November 8, 2022", "dateModified": "November 8, 2022", "description": "Otomax® and Tri-Otic® are prescription medications used to treat external ear infections in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Otomax® and Tri-Otic®? Otomax® and Tri-Otic® are the brand names for a prescription combination otic (ear) ointment. The three active ingredients in Otomax® and Tri-Otic® are gentamicin, betamethasone and clotrimazole. These medications are used to treat external ear infections in dogs caused by susceptible strains of yeast (Malassezia pachydermatis) and bacteria susceptible to the antibiotic gentamicin. Currently, Otomax® and Tri-Otic® are only FDA approved for use in dogs, but they are often used off-label in cats and other mammals. The term off-label or extra-label use means that a medication is used in a way, or in a particular species, that is not described on the drug product label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether this medication is right for your pet. How Otomax® and Tri-Otic® Works Otomax® and Tri-Otic® contain three ingredients that work together to treat susceptible ear infections: Gentamycin: an antibiotic active against several common pathogenic bacteria that infect the ear Betamethasone: a steroid utilized to decrease inflammation in the ear canal Clotrimazole: a broad-spectrum antifungal agent used to treat common yeast organisms If your pet’s ear infection does not improve after treatment with Otomax® or Tri-Otic®, the cause of the infection may be another microorganism that is not susceptible to this medication. Before using these products, it is critical that your veterinarian examines your dog’s eardrum to ensure it is intact to avoid damage to the inner ear. These products should not be used in dogs with known perforation of eardrums. Otomax® and Tri-Otic® Directions Typically, Otomax® and Tri-Otic® are administered directly into the infected ear canal once daily for seven consecutive days. The number of drops to administer into each ear will vary based on the pet’s size and the severity of the infection. Ensure that the external ear canal is thoroughly cleaned and dried before treatment. Pets with long ear hair may need to have the hair trimmed for the application to be effective. Missed a Dose? Speak with your veterinarian about what to do if you forget to administer a dose of Otomax® or Tri-Otic®. Generally, they may advise you to apply it when you remember. However, if it is almost time for your next dose, they may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Otomax® or Tri-Otic® Possible Side Effects Topical irritation at the application site is the most common side effect, including: Redness Blistering Peeling Swelling Itching Hives Administration of these medications beyond the recommended seven days may result in delayed wound healing. Hearing loss or deafness has been noted in a small number of sensitive or geriatric dogs. The hearing deficit is usually temporary. However, if hearing or vestibular dysfunction is noted during the course of treatment, immediately discontinue use of the ointment and flush the ear canal thoroughly with a non-toxic solution. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Otomax® or Tri-Otic® Human Side Effects This medication is not intended for human use. If you accidentally ingest a pet medication or have skin irritation after applying this medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222. Monitoring Typically, no specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Otomax® and Tri-otic® Overdose Information Overdose is not common with these products; however, sensitivity or allergic reactions can occur. If your pet is showing signs of hearing loss, deafness, a head tilt, circling, or other signs of vestibular disease, contact your veterinarian immediately. Accidental ingestion of large quantities of this medication may cause body wide (systemic) concerns such as swelling, weight gain, excessive thirst, and urination. If you suspect an overdose or if your pet has ingested this product, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Otomax® and Tri-Otic® Storage Otomax® and Tri-Otic® should be stored at controlled room temperatures between 36 F and 77 F. Shake well before each use. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]