[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ketoconazole", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1175548637.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1175548637.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ketoconazole"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Ketoconazole is prescribed by veterinarians to treat fungal and yeast infections in dogs, horses, birds, and other small pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Ketoconazole? Ketoconazole is a prescription medication used to treat certain fungal or yeast infections in animals including dogs, horses, birds, small mammals, reptiles, and rarely, cats. Susceptible fungal or yeast infections of the skin, eyes, or ears are often treated by ketoconazole, typically as an active ingredient in topical (for the skin) products such as a shampoo, wipe, spray, or eye or ear ointment. Ketoconazole is rarely used for body-wide (systemic) infections from organisms such as cryptococcus, valley fever (coccidioidomycosis), aspergillus, candidiasis, and blastomycosis because digestive side effects are common with this medication. Cats are more prone to severe side effects such as liver toxicity with ketoconazole, so other antifungal medications such as itraconazole or fluconazole are usually recommended first. Instead­ of ketoconazole, your veterinarian may also recommend one of those antifungals in other animals as well when systemic infections are present because they have less severe side effects. Ketoconazole has also been used to treat hyperadrenocorticism (Cushing’s disease) in dogs, but newer medications such as Vetoryl® are more effective in treating the condition. While Ketoconazole is FDA-approved for human use, it is currently not FDA-approved as a stand-alone veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use is not described on the drug label.  How Ketoconazole Works Ketoconazole works as an antifungal medication by blocking fungi ability to create an enzyme needed to fortify their cell membranes. This inhibits the metabolism and growth of a given fungus. Ketoconazole also works in the cells of mammals to mildly block the production of steroids such as cortisol in the body, which is why it has been used to treat canine Cushing’s disease. Ketoconazole can interfere with the metabolism of an immune-modulating medication called cyclosporine. In doing so, it increases the amount of cyclosporine in the body, thereby reducing the dose of cyclosporine required to be effective. Ketoconazole is available for direct veterinary use in various topical products such as shampoos, wipes, sprays, ear cleaners, and ear medications. In certain circumstances, your vet may recommend a compounded formulation of ketoconazole. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Ketoconazole Directions Follow the directions on the drug label or as provided by your veterinarian. Ketoconazole is best given with food, and foods that are higher in fat can help with gastrointestinal side effects. If your pet is experiencing digestive upset after it is given this medication, contact your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of ketoconazole. Generally, they may instruct you to give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Ketoconazole Possible Side Effects Some pets are more sensitive to this medication than others and are therefore more prone to experiencing side effects. Cats in particular tend to be very sensitive to this medication and side effects are much more commonly observed. Cats are also more prone to developing liver irritation compared to other species while on this medication. Side effects of ketoconazole may include: Vomiting Diarrhea Loss of appetite Weight loss Lethargy Incoordination Reversible lightening of hair coat Liver irritation Symptoms of liver irritation may include: Vomiting Loss of interest in food Yellow gums, skin, or whites of the eyes Human Side Effects While this is a human prescription medication there are different dosages and side effects that can occur in humans. If you accidentally ingest ketoconazole prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of ketoconazole Ketoconazole Overdose Information Ketoconazole overdoses are rare, but signs of an overdose include vomiting, diarrhea or loss of appetite, and liver irritation. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Ketoconazole Storage Ketoconazole should be stored at controlled room temperatures between 68-77 F. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/mladenbalinovac"}]