[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much lactulose can you give a cat?", "acceptedAnswer": {"@type": "Answer", "text": "This medication is often given up to 3 or 4 times a day. Since frequency and dose vary greatly, medication is typically adjusted based on the individual patient&#039;s response to this medication. If your pet develops diarrhea on this medication, your pet&#039;s dose may need to be adjusted. Contact your veterinarian. "}}, {"@type": "Question", "name": "Is lactulose harmful for cats?", "acceptedAnswer": {"@type": "Answer", "text": "Lactulose is a medication that is generally considered safe to use as a stool softener in the treatment of constipation. It can also be used to lower ammonia levels in pets with hepatic encephalopathy."}}, {"@type": "Question", "name": "What does lactulose do for cats?", "acceptedAnswer": {"@type": "Answer", "text": "Lactulose is a laxative that works to soften the stool of constipated cats and helps pets with hepatic encephalopathy lower high levels of ammonia found in the bloodstream."}}, {"@type": "Question", "name": "Is Kristalose® the same as lactulose?", "acceptedAnswer": {"@type": "Answer", "text": "Kristalose® is a brand name product with the active ingredient lactulose. It is the same product, but comes in a different concentration than Enulose®, which is the most common brand used in veterinary medicine. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/Santiaga"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lactulose (Constulose®, Enulose®, Generlac®, Kristalose®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/ginger-cat-sitting-on-womans-lap.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/ginger-cat-sitting-on-womans-lap.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/lactulose-constulose-enulose-generlac-kristalose"}, "datePublished": "July 6, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie discusses Lactulose medication for pets, including how it works and possible side effects.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Lactulose? Lactulose is used as a laxative  for the treatment of constipation in cats and dogs. It can also prevent and treat hepatic encephalopathy by lowering ammonia levels in small animals. Lactulose is FDA-approved for human use under the brand names Constulose®, Enulose®, Generlac®, and Kristalose®. Lactulose is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. How Lactulose Works Lactulose is a small sugar molecule that mammals and birds can’t digest. Since it is not digested, it passes unchanged all the way to the colon where normal colonic bacteria eat the lactulose. When digesting the lactulose, the bacteria break it down into primarily lactic acid (but also acetic and formic acid). The presence of this acid allows water to be pulled into the colon via osmosis, which causes  softening of the stool, making Lactulose beneficial for pets with constipation. Lactulose is also beneficial for pets with liver disease, as one of the liver’s key functions is to remove ammonia from the blood system for excretion. When the liver is diseased, it cannot do this properly and causes a buildup of ammonia in the blood stream. Excessive ammonia in the blood can travel to the brain and may lead to seizures or other neurological symptoms. The aforementioned acids create an acidic environment that makes naturally available ammonia from the blood stream shift into the colon. Excess ammonia is then trapped in the stool and defecated out. Lactulose Directions Lactulose is often given up to 3 or 4 times a day. However, frequency varies and can be adjusted based on your pet’s response to this medication. Check instructions on the label and from your veterinarian. Missed a Dose? If you forget to give a dose of lactulose, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Lactulose Possible Side Effects Side effects are generally confined to the digestive system and include: Flatulence Stomach distension/bloating Abdominal cramps Diarrhea Dehydration Human Side Effects While this medication is used in humans, it may be given differently and have different side effects. If you accidentally ingest this medication, call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing, especially the monitoring of electrolytes. Types of testing performed will depend on your pet&#039;s individual needs, any other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If Severe side effects are seen (see above) or if you see or suspect an overdoseCall your vet or pharmacist if you have additional questions or concerns about the use of lactuloseLactulose Overdose Information Diarrhea and dehydration are the most common signs of an overdose. Flatulence and cramping are also possible. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Lactulose Storage Lactulose should be stored at controlled room temperatures between 68-77°F (20-25°C), but always confirm storage requirements by reviewing the label. Store in a light-resistant container. Keep out of reach of children and pets."}]