[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does sildenafil take to start working in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Sildenafil will start to work in your dog&#039;s body within 1-2 hours. It may take a few days to observe an improvement in your dog’s symptoms."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sildenafil for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1066732138.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1066732138.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/sildenafil-dogs-and-cats"}, "datePublished": "January 23, 2023", "dateModified": "October 11, 2023", "description": "Sildenafil is commonly prescribed in veterinarian medicine to treat high blood pressure in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Sildenafil? Sildenafil is used in dogs and cats to treat pulmonary arterial hypertension (high blood pressure in the blood vessels of the lungs). It is also used to help improve symptoms associated with megaesophagus and myxomatous mitral valve disease in dogs. How Sildenafil Works Sildenafil relaxes and widens the blood vessels of the lungs, which makes it easier for the heart to pump blood through them. In dogs with megaesophagus, sildenafil works to relax the muscle at the end of the esophagus by the stomach, allowing it to widen and allow food to pass into the stomach more easily. Sildenafil is FDA-approved for human use as a generic medication and under the common brand names Viagra® and Revatio®. Sildenafil is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether sildenafil is right for your pet.  In certain circumstances, your veterinarian may recommend a compounded formulation of sildenafil. Compounded medications are prescribed if there is a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Sildenafil Directions Follow the directions on the drug label or as provided by your veterinarian. Sildenafil is generally given every 8-12 hours, depending on the cause for which your pet has been placed on this medication. Sildenafil should be given without food. However, if your pet has vomiting or digestive upset after having been given this medication on an empty stomach, contact your veterinarian. They may recommend you try administering it with a small amount of food. If vomiting continues, contact your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of sildenafil. Generally, they may advise you to give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Sildenafil Possible Side Effects Sildenafil is generally well-tolerated. Rare side effects may include: Vomiting Diarrhea Decrease in appetite A flush red appearance to the skin, especially around the belly or groin Human Side Effects While sildenafil is an FDA-approved medication in humans, there are different dosages and side effects that can occur in humans as well as interactions with other medications.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of sildenafil Sildenafil Overdose Information Signs of a sildenafil overdose include very low blood pressure, weakness, vomiting, high heart rate, collapse, or lethargy.   If you suspect an overdose, immediately seek emergency veterinary care, contact your veterinarian, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Sildenafil Storage Sildenafil should be stored according to the medication label and at a controlled room temperature between 67-77 F. Brief exposure to temperatures between 59 -86 F is acceptable. Keep the container tightly closed to protect this medication from moisture and light.   Store compounded medications according to the information provided by your pharmacy. Keep out of reach of children and pets."}]