[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is cephalexin used for in cats?", "acceptedAnswer": {"@type": "Answer", "text": "Cephalexin is typically used for skin infections in cats. Your veterinarian may also prescribe it for other types of infections."}}, {"@type": "Question", "name": "How long should a dog take cephalexin?", "acceptedAnswer": {"@type": "Answer", "text": "Give your dog cephalexin for as long as is prescribed by your veterinarian. Even if you do not see signs of infection, it is important to finish the treatment course as prescribed. Discontinuing antibiotics too early can lead to repeat infections and antibiotic-resistant bacteria. Contact your veterinarian if your pet still shows signs of infection at the end of the treatment course. Featured Image: iStock.com/Pekic"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rilexine® (Cephalexin)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1307238003.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1307238003.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/rilexine-cephalexin"}, "datePublished": "October 7, 2022", "dateModified": "October 7, 2022", "description": "Rilexine® (Cephalexin) is an antibiotic medication commonly prescribed to treat skin infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Cephalexin? Cephalexin is an antibiotic commonly used to treat skin infections in dogs and cats. Your veterinarian may also prescribe it to treat other types of infections. There is currently only one FDA approved form of cephalexin for the veterinary field, Rilexine®, which has been designed specifically for dogs and comes in chewable tablets. Generic cephalexin is FDA approved for human use and is currently not FDA approved as a veterinary medication. However, they are readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of cephalexin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Cephalexin Works Cephalexin is an antibiotic in a class of antibiotics called first-generation cephalosporins (first generation means they were the first of its class developed). Cephalexin kills vulnerable bacteria by interfering with the production of their cell walls. Specifically, cephalexin binds to and inhibits proteins that are essential to the development of the bacterial cell wall. Cephalexin does not kill all types of bacteria. It is also ineffective against viruses, fungi, and parasites. Inappropriate use of antibiotics, including cephalexin, can lead to the development of antibiotic-resistant bacteria, so it is important to use antibiotics exactly as directed by your veterinarian. Cephalexin Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will prescribe a dosage based on your pet’s weight and the type of infection. Follow the directions closely. Do not give more or less than is prescribed by your veterinarian and finish the treatment course, even if your pet’s infection seems to have improved. Cephalexin can be given with or without food. Giving it with a small meal may help reduce vomiting or other digestive upset. Missed a Dose? If you forget to give a dose of cephalexin, give it your pet when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Cephalexin Possible Side Effects The most common side effects of cephalexin involve irritation of the digestive system, including: Diarrhea Vomiting Decreased appetite Additional side effects may include a decreased energy level, itching/scratching, increased thirst, and drowsiness. Rarely, allergic reactions can occur. Symptoms of an allergic reaction to an antibiotic may include: A skin rash (especially in the ears) Hives (raised lumps that suddenly appear on the skin) Facial swelling Pale gum color Trouble breathing and/or collapse If your pet shows any signs of an allergic reaction, immediately seek emergency veterinary care. Do not give cephalexin to pets with a known allergy to penicillin or cephalosporin antibiotics. Human Side Effects While cephalexin is a human prescription medication, there are different dosages and side effects that can occur in humans. People that are allergic to penicillin or cephalosporin antibiotics should avoid contact with cephalexin. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose You have additional questions or concerns about the use of cephalexin Cephalexin Overdose Information Symptoms of an overdose of cephalexin may include severe vomiting, diarrhea, excessive drooling and watering of the eyes. Large overdoses may cause damage to the kidneys, liver, and changes in blood cell counts. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Cephalexin Storage Cephalexin should be stored at controlled temperatures between 68-77 F and brief exposure to temperatures 59-86 F are acceptable. Keep the container tightly closed to protect this medication from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]