[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cyclosporine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cyclosporine-atopica"}, "datePublished": "December 21, 2012", "dateModified": "August 17, 2022", "description": "Cyclosporine is indicated for the control of atopica dermatitis in dogs weighing at least 4 lbs body weight. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "Uses Cyclosporine is indicated for the control of atopica dermatitis in dogs weighing at least 4 lbs body weight. Dosage and Administration Cyclsporine (Atopica) should be given according to your veterinarian’s instructions. Do not change the way you give Cyclosporine without speaking with your veterinarian first. The recommended dose of Cyclosporine is it should be given initially as a 5 mg/kg/day (3.3-6.7 mg/kg/day) single daily dose for 30 days. Following this initial daily treatment period, the Cyclosporine dose may be tapered by decreasing the frequency of dosing to every other day or two times a week until a minimum frequency is reached, which will maintain the desired therapeutic effect. Cyclosporine should be given on an empty stomach, so please wait at least one hour before or two hours after a meal before giving Cyclosporine. Missed Dose? If a dose of Cyclosporine (Atopica) is missed, the next dose should be administered as soon as possible, but do NOT double the dose. Possible Side Effects Cyclosporine (Atopica) may cause some side effects. Most common side effects of Cyclosporine involve the digestive including vomiting, and diarrhea. Other possible side effects of Cyclosporine: Persistent Otitis Externa (swimmer’s ear)Urinary Tract InfectionAnorexiaLethargyGingival Hyperplasia (overgrowth of gums)Lymphadenopathy (swelling of lymph nodes)It is important to stop the medication and immediately contact your veterinarian if you think your dog has any medical problems or side effects while taking Cyclosporine. Precautions Cyclosporine is contraindicated for use in dogs with a history of neoplasia. Cyclosporine (Atopica) is a potent systemic immunosuppressant that may cause the susceptibility to infection and the development of neoplasia. Gastrointestinal problems and gingival hyperplasia may occur at the initial recommended dose. Cyclosporine should not be administered to dogs less than 6 months of age or less than 4 lbs of body weight. It should also not be used in breeding dogs, pregnant or lactating female dogs. The effect of Cyclosporine use on dogs with compromised renal functions has not been studied so Cyclosporine should be used with caution in dogs with renal insufficiency. Atopica is not for human use. Keep this drug and all drugs out of reach of children. For use in dogs only. Storage Cyclosporine (Atopica) should be stored and dispensed in the original unit-dose container at controlled room temperature between 59 and 77°F (15-25°C). Drug Interactions Cyclosporine should be used with caution when given with drugs that affect the P-450 enzyme system. Simultaneous administration of cyclosporine with drugs that suppress the P-450 enzyme system, such as ketoconazole, may lead to increased plasma levels of cyclosporine. Signs of Toxicity/Overdose Overdose of Cyclosporine (Atopica) may cause: Loss of appetiteVomitingDiarrheaIncreased thirstIncrease urinationJaundiceLethargyIf you suspect or know you dog has had an overdose, please contact your veterinarian an emergency vet clinic, or the Pet Poison Helpline at (855) 213-6680 immediately.."}]