[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does Profender® for cats take to work?", "acceptedAnswer": {"@type": "Answer", "text": "Profender® starts working in about 24-48 hours to start treatment of hookworm, roundworms, and tapeworms. You may or may not see worms being passed in your pet’s stool after treatment."}}, {"@type": "Question", "name": "How often do cats need Profender®?", "acceptedAnswer": {"@type": "Answer", "text": "One topical dose of Profender® is effective at the treatment of hookworm, roundworms, and tapeworms. Due to the life cycle of tapeworms, your veterinarian may recommend a second dose about 30 days after the first application. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Raphael Angeli"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Profender® Topical Solution", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1192677747.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1192677747.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/profender-topical-solution"}, "datePublished": "October 21, 2022", "dateModified": "October 21, 2022", "description": "Profender® is a common liquid medication prescribe to treat specific infections in cats and kittens.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Profender®? Profender® is a liquid parasiticide applied topically (to the skin) of a cat to treat tapeworm, hookworm and roundworm infections. It is FDA approved for use in kittens and cats older than 8 weeks of age and weighing 2.2 pounds or more. How Profender® Works Profender® is a topical product that contains two active ingredients: emodepside and praziquantel. Emodepside prevents neurotransmitters from working inside the worms’ brain, which causes paralysis and death. The way praziquantel works against intestinal parasites is unclear, but it is suspected to interfere with the worms&#039; muscle integrity and causes paralysis. The deceased worms will either be defecated out or digested within the cat’s digestive tract. Profender® Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine the appropriate topical dosage based on your pet’s weight. When ready to apply, part your cat’s fur at the back of the neck that is close to the base of your cat’s head, until the skin is visible. Place the tip of the tube on the skin and squeeze the entire contents of the tube directly onto the skin. Do not apply directly if hair coat is wet or to any irritated or broken skin. Do not allow any pets to lick the area for at least one hour after application. To prevent accidental ingestion of this product, children should not come in contact with the application site for 24 hours while the product is being absorbed. Missed a Dose? Profender® is typically given as a one-time treatment. It may be repeated after 30 days as needed to treat re-infection.  Profender® Possible Side Effects If a pet in your household licks the product or site of application, they may experience vomiting and drooling. Side effects after normal application can include: Excessive licking/grooming Irritation/scratching of the application site Drooling Lack of energy Hair loss at the application site Agitation Vomiting Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Profender® Human Side Effects This medication is not approved for use in humans. If you accidentally ingest a pet medication, immediately seek medical attention, or call the national Poison Control Center hotline at 800-222-1222. Topical exposure may cause skin reactions in some individuals. Wash hands with soap and water after applying this drug. It is recommended for pregnant individuals to wear gloves when applying this product. Monitoring Typically, no specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Profender® Overdose Information While an overdose of Profender® is unlikely to cause significant harm, drooling, tremors and lethargy are possible signs of an overdose. Accidentally giving this medication to your pet orally may cause them to experience drooling, vomiting, muscle tremors, or difficulty walking. If you suspect an oral or topical overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Profender® Storage Profender® should be stored at or below 77 F. Do not freeze. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]