[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is it safe to give a dog meloxicam?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs do well with the use of meloxicam. Some dogs will have side effects with vomiting and diarrhea being the most common. Some dogs, especially those with unknown kidney or liver disease can have serious side effects, which is why veterinarians will often recommend blood work before starting this medication long term."}}, {"@type": "Question", "name": "How many milligrams of meloxicam can a dog take?", "acceptedAnswer": {"@type": "Answer", "text": "If meloxicam is appropriate for your dog, your veterinarian will prescribe a dose based on your dog’s weight and the type of inflammation."}}, {"@type": "Question", "name": "How long can you give a dog meloxicam?", "acceptedAnswer": {"@type": "Answer", "text": "While some conditions are only treated for a short period of time, many dogs require long-term therapy with NSAIDs for conditions like arthritis. Recheck exams and laboratory tests are usually necessary for dogs taking meloxicam long term, at intervals recommended by your veterinarian."}}, {"@type": "Question", "name": "Is meloxicam bad for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Meloxicam is a helpful medication for the treatment of arthritis pain. At recommended doses, most dogs have little to no side effects. At higher doses it can cause serious side effects, so it is important to only give the amount that your veterinarian prescribed."}}, {"@type": "Question", "name": "Is it OK to give a dog expired meloxicam?", "acceptedAnswer": {"@type": "Answer", "text": "Do not give your dog expired meloxicam or any other expired medication. Talk to your veterinarian to determine if the medication can be refilled."}}, {"@type": "Question", "name": "How long can a dog stay on meloxicam?", "acceptedAnswer": {"@type": "Answer", "text": "Many dogs can remain on meloxicam long term if follow-up exams and laboratory tests are done at intervals recommended by your veterinarian."}}, {"@type": "Question", "name": "How long does it take for meloxicam to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Peak levels of meloxicam are seen about 7-8 hours after ingestion, but it typically takes 3-5 days before you see any change in signs of pain/symptom relief. Do not discontinue the drug without consulting first with your veterinarian. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/SeventyFour"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Meloxicam (Metacam®, OroCAM®, Loxicom®, Meloxidyl®, Meloxicam Injection, Meloxicam Solution for Injection)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1303833920.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1303833920.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/meloxicam-metacam-orocam-loxicomr-meloxidyl-meloxicam-injection-meloxicam"}, "datePublished": "July 7, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Howe explains how meloxicam works including possible side effects and frequently asked questions.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Meloxicam? Meloxicam is an FDA approved non-steroidal, anti-inflammatory drug (NSAID) that is available as a prescription medication to reduce pain, inflammation, and fevers in dogs. It is often used in pets who suffer from a degenerative or inflammatory joint condition, such as arthritis. NSAIDs such as meloxicam help to improve your dog&#039;s overall mobility by relieving joint pain and inflammation. Oral meloxicam is infrequently used for one-time pain relief in cats or short-term use in an off-label manner. Meloxicam is also used off label for pain relief and inflammation in horses, cows, sheep, goats, camels, pigs, birds, rabbits, ferrets, other small mammals and reptiles. This use of meloxicam is currently not FDA approved as a veterinary medication. The term off- or extra- label use means that a medication can be used in a way or in a particular species that are not specified on the medication label. Off- or extra- label use of a medication can only be done by a veterinarian who has direct and personal knowledge of your pet and when there are no other appropriate medications for a particular pet&#039;s circumstances. In certain circumstances, your vet may recommend a compounded formulation of meloxicam. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Meloxicam Works NSAIDs block the production of natural chemicals that trigger inflammation, called a cyclooxygenase (COX) pathway. Some COX pathways are helpful with digestion, kidney health and clotting. In dogs, meloxicam blocks significantly more of the inflammatory chemicals than the beneficial ones. Because of this, meloxicam has fewer side effects in dogs than other NSAIDs, especially those developed for humans. However, at higher doses, meloxicam also partially blocks the beneficial chemicals, so it’s important to follow your veterinarian’s directions carefully. Meloxicam Directions Your veterinarian will prescribe a dosage of meloxicam that is based on your pet’s weight and type of inflammation. Some drugs with meloxicam have two concentrations of liquid, so please ensure that your medication matches the drug label. This medication is typically given once daily and comes as a flavored liquid which can be administered directly to the pet after a meal or given on their food. For further instructions, please follow the directions on the drug label or as provided by your veterinarian.  Missed a Dose? If you forget to give a dose of meloxicam, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal every 24-hour dosing schedule. Do not give extra or double doses.  Meloxicam Possible Side Effects Meloxicam is typically well tolerated by dogs, but serious side effects involving ulcers of the digestive tract, kidney or liver irritation can occur. Side effects are more common in cats. Contact your veterinarian if you see any of the following signs: VomitingDiarrhea or soft stoolsDecreased appetiteDark, black, or tar-like stoolsChange in urination (frequency color or smell)Increased thirstPale gum colorSkin redness, scabs, or scratchingYellowing of the gums, skin, or whites of the eyesDecreased energy level (lethargy)Lack of coordination or weaknessSeizuresHuman Side Effects This medication is also used in humans but with different dosages and side effects. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Monitoring Monitoring kidney and liver function levels will likely be recommended before starting this medication. If your pet is going to be on this medication long term your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) or if you see or suspect an overdoseCall your vet or pharmacist if you have additional questions or concerns about the use of meloxicamMeloxicam Overdose Information The symptoms of overdose are related to kidney or liver changes/irritation, with vomiting and diarrhea being the most reported symptom. Overdoses of this medication can be very serious or even life threatening. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Meloxicam Storage Meloxicam should be stored at controlled room temperatures between 68-77°F and brief exposure to temperatures 59°-86°F are acceptable, but always confirm storage requirements by reviewing the label. Keep the container tightly closed to protect from light.   Keep out of reach of children and pets."}]