[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is amoxicillin safe for dogs and cats?", "acceptedAnswer": {"@type": "Answer", "text": "Amoxicillin is generally regarded as safe for use in most dogs and cats. It is a commonly used antibiotic due to the low number of side effects noted with this medication. Your veterinarian will determine whether this medication is right for your pet, based on your pet’s symptoms and circumstances."}}, {"@type": "Question", "name": "Can I give my dog amoxicillin prescribed for humans?", "acceptedAnswer": {"@type": "Answer", "text": "Your veterinarian may prescribe a form of amoxicillin that is dispensed by a human pharmacy. You should only utilize a human version of amoxicillin if directly told to do so by your veterinarian. There are many different dosages and formulations of human amoxicillin products available, and many are not suited for dogs. Your veterinarian will determine which is right for your pet."}}, {"@type": "Question", "name": "Is human amoxicillin the same as dog amoxicillin?", "acceptedAnswer": {"@type": "Answer", "text": "The active ingredient in amoxicillin for both humans and pets is the same. However, there are differences in available dosages, concentrations, and formulations. There are many sizes of human amoxicillin products available, and many are not suited for dogs. Your veterinarian will determine which is right for your pet. You should only utilize a human version of amoxicillin under the direction of your veterinarian. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/w-ings"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Amoxicillin for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-936223390.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-936223390.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/amoxicillin-for-dogs-cats"}, "datePublished": "June 26, 2023", "dateModified": "October 6, 2023", "description": "Amoxicillin is commonly prescribed by veterinarians to treat urinary, respiratory, and skin infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Amoxicillin? Amoxicillin is an FDA-approved antibiotic medication commonly used in dogs and cats to treat susceptible infections. This may include urinary infections, respiratory tract infections, some infections of the skin, Helicobacter infections and Lyme disease. Amoxicillin is also approved for infusion into the mammary glands of cows with mastitis. Amoxicillin is also used in the treatment of susceptible infections in birds, ferrets, reptiles, and fish. The use of amoxicillin in these species is considered off-label. The term off- or extra-label use means that a medication can be used in a way or in a particular species that are not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. It is important to note that amoxicillin is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medication prescribed for humans. Also, medications intended for use in an aquarium for the treatment of fish should not be used in any other species.   How Amoxicillin Works Amoxicillin is classified as a penicillin antibiotic. Antibiotics in this class prevent a susceptible bacterium from creating a necessary part of the cell wall, thereby weakening and destroying it, which causes the bacterium to die. Amoxicillin is often used to treat urinary tract infections, since it tends to concentrate in the kidney and urine.  Amoxicillin Directions Follow the directions on the drug label or as provided by your veterinarian. Amoxicillin can be given with or without food, but giving it will a meal can help to prevent digestive upset. Shake the bottle of amoxicillin suspension well, before administering a dose to your pet. Amoxicillin oral suspension is a liquid version of amoxicillin and is usually supplied as a powder. Follow the mixing directions closely and note the exact amount of water that should be mixed with the powder to create the suspension. Storing mixed amoxicillin suspension in the refrigerator is preferred. Any unused portion of the powder should be discarded after 14 days. When using aquarium-safe versions of amoxicillin, add the contents of the capsules into the aquarium as directed for each set of allotted gallons of water. Partial water changes during treatment are often recommended. Speak to your veterinarian regarding prescription instructions and how frequently partial water changes should occur during treatment. When amoxicillin is administered in cows used for milk production, their milk cannot be used for 60 hours following the last dose. For cattle used for food, a 12-day waiting period following the last dose is recommended. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of amoxicillin. Generally, they may instruct you give the dosage once you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.   Amoxicillin Possible Side Effects Like all antibiotics, amoxicillin can cause gastrointestinal side effects:  Vomiting Diarrhea Lack of appetite Lethargy Penicillin allergies in animals are rare but can happen. Amoxicillin is closely related to penicillin, so allergic reactions can occur and may include: Skin rashes (especially in the ears) Watery eyes Hives (urticaria) Facial swelling Vomiting Diarrhea Fever Anaphylaxis Amoxicillin should not be given to rabbits and other herbivores, as life-threatening diarrhea can occur in these animals. Additionally, this medication should not be given to pets who have a history of allergic reaction to penicillin. Human Side Effects Amoxicillin is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   If you are allergic to penicillin, talk to your veterinarian about using another medication or ensure that you always wear gloves while in contact with this medication. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of amoxicillin Amoxicillin Overdose Information An overdose of amoxicillin is unlikely to cause toxicity. Amoxicillin overdoses may cause vomiting, diarrhea, and loss of appetite. Large overdoses may cause kidney disease, lack of coordination, and seizures. Penicillin allergies in dogs are rare but can happen. Amoxicillin is a penicillin antibiotic and allergic reactions may occur. Signs of an allergic reaction include skin reactions, watery eyes, hives (urticaria), facial swelling, vomiting, diarrhea, and anaphylaxis. Speak with your veterinarian about whether this medication is right for your pet. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Amoxicillin Storage Amoxicillin tablets should be stored at a controlled room temperature between 59–86 F. Do not store the dried powder at temperatures above 77 F. Reconstituted amoxicillin suspension should preferably be stored in a refrigerator and discarded after 14 days. Keep the container tightly closed to protect from moisture and light. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]