[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can you give a dog or cat baby aspirin?", "acceptedAnswer": {"@type": "Answer", "text": "Talk to your veterinarian if your pet appears to be in pain. Your veterinarian can prescribe an appropriate pain medication. There are safer and more effective medications available to manage your pet’s pain than aspirin. Do not give your pet any human medications without first discussing it with your veterinarian. Severe side effects from aspirin can potentially occur, especially in cats.  "}}, {"@type": "Question", "name": "How much aspirin can I give my dog?", "acceptedAnswer": {"@type": "Answer", "text": "Only your veterinarian can tell you if aspirin is appropriate for your dog. Safer and more effective pain relief alternatives have been developed specifically for dogs. If aspirin is indicated, your veterinarian will provide you with an appropriate dose. "}}, {"@type": "Question", "name": "Is it safe to give my dog enteric coated aspirin?", "acceptedAnswer": {"@type": "Answer", "text": "Only your veterinarian can tell you if enteric-coated aspirin is appropriate for your dog and the issue that caused your veterinarian to recommend aspirin for your pet."}}, {"@type": "Question", "name": "Can I give my dog aspirin after surgery?", "acceptedAnswer": {"@type": "Answer", "text": "Do not give your dog aspirin after (or before) a surgery. Aspirin can reduce an animal’s ability to clot. Aspirin should not be given with other medications (such as NSAIDs), which your dog may have received during or after surgery. Your veterinarian can recommend an appropriate pain reliever that is safe to use after surgery. Contact your veterinarian if your dog still appears to be in pain after using the prescribed medication(s).     No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Aspirin", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-1024055194.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/iStock-1024055194.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/aspirin"}, "datePublished": "May 20, 2022", "dateModified": "August 17, 2022", "description": "There are specific times and situations when your veterinarian may prescribe aspirin for your pet.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Aspirin?  Aspirin is an over-the-counter (OTC) pain reliever for humans. When your pet is in pain, it can be tempting to give human aspirin. However, some OTC human medications, like aspirin, can have serious side effects in animals. Aspirin is more likely to cause digestive upset in dogs than in people. It can also cause severe side effects, such as stomach ulcers and intestinal bleeding. Cats are particularly sensitive to the effects of aspirin because the drug remains in the body for a longer period than in people or other animals. In some instances, use of aspirin can be fatal.  There are specific times when your veterinarian may prescribe aspirin for your pet. Your veterinarian will recommend an appropriate dose and formulation for your pet and their medical condition. If your pet is in pain, do not give aspirin. Contact your veterinarian. Your veterinarian can recommend a safer and more effective pain reliever made specifically for pets.  Aspirin is FDA-approved for human use and pet labeled products are available, but aspirin is currently not FDA approved as a veterinary medication. However, it is utilized rarely in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. How Aspirin Works  Aspirin is a nonsteroidal anti-inflammatory drug (NSAID). In animals, it is used most frequently to reduce blood clotting. While aspirin may also reduce pain, decrease inflammation, and reduce fever, it is not typically used in animals for these reasons due to the availability of safer and more effective medications.   Aspirin works by inhibiting an enzyme called cyclooxygenase. This reduces the production of compounds called prostaglandins and thromboxane within the body. The reduction in thromboxane is responsible for aspirin’s effects on blood clotting. Aspirin reduces the ability of platelets to clump together to form a clot.  By reducing prostaglandins, aspirin causes a decrease in inflammation, pain, and fever. However, aspirin also decreases the production of beneficial prostaglandins, which help maintain some of the normal functions of the body, including those of the digestive tract and kidneys. Aspirin’s interference in the production of beneficial prostaglandins explains its increased risk for side effects. Other NSAIDs made specifically for animals have less impact on these beneficial prostaglandins, reducing the likelihood of side effects.   Aspirin Directions  Use aspirin only as directed by your veterinarian. Follow the instructions from your vet closely, and do not give more than prescribed.   Do not give aspirin to your pet unless directed by your veterinarian. Your veterinarian will recommend an appropriate formulation of aspirin.  Do not use any formulations of aspirin that contain acetaminophen (Tylenol®), especially in cats. Acetaminophen is toxic to cats. Even a small amount of acetaminophen can kill a cat.  Your veterinarian may recommend that you give aspirin with a meal to help reduce the chance of digestive upset.   Contact your veterinarian right away if your pet is experiencing any side effects (see below) after taking aspirin. Side effects are more likely to occur in animals than in people.  Missed a Dose?  If you forget to give a dose of aspirin, give it when you remember and wait the prescribed amount of time before giving the next dose. Alternatively, if it is almost time for the next dose, skip the missed dose and give the next dose as scheduled. Do not give extra or missed doses.  Aspirin Possible Side Effects  Aspirin can cause serious side effects in animals. Ulcers (sores) in the stomach or intestines can occur, causing pain and blood loss. Black, tar-like stools can indicate serious internal bleeding and requires urgent veterinary attention. Contact your veterinarian right away if you see any of these signs:  Decreased appetite  Decreased energy level (lethargy)  Vomiting  Bloody vomit (can appear bright red or dark and look like coffee grounds)  Diarrhea  Blood in the feces (can appear bright red or dark and tar-like)  Nausea  Abnormal bleeding or bruising   Human Side Effects While this medication is used in humans, depending on the product you are using, it may be given differently and have different side effects. If you accidentally ingest your pet’s medication, call your physician or local poison control center. Monitoring Your veterinarian is likely to recommend routine testing while your pet is on this medication. Testing may vary depending on your pets&#039; individual needs, the length of time your pet will be on this medication, any other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Most common recommendations for monitoring on this medication is blood work, encompassing a complete blood cell count and chemistry panel. Call Your Vet If: Side effects are seen, blood is present in vomit or stools (digested blood can look like coffee grounds in vomit or make the stools look black or tar-like), or you see or suspect an overdose.Call your vet or pharmacist if you have additional questions or concerns about the use of aspirin.Aspirin Overdose Information  Overdosages of aspirin (also known as aspirin poisoning) can be very serious. It can occur when a pet gets into the medication or when an owner accidentally gives too much of it. To avoid giving an unintentional overdose, do not give aspirin to your pet unless directed by a veterinarian. Some websites provide inaccurate dosing information that could result in an overdose.  Signs of an overdose include rapid breathing or panting; decreased activity (lethargy); loss of appetite; vomiting (which may contain bright, red blood or digested blood that looks like coffee grounds); diarrhea; dark, tar-like stools; elevated body temperature; weakness; incoordination; seizures; coma; and death. Overdosages of aspirin usually require immediate emergency treatment.   If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Aspirin Storage Follow the storage instructions as directed on the product label. Keep container tightly closed and away from moisture and light. Do NOT use aspirin that has expired or has a strong vinegar smell.   Keep out of reach of children and pets. "}]