[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much does zonisamide cost?", "acceptedAnswer": {"@type": "Answer", "text": "The cost of this medication varies depending on the type of formulation, dose, and frequency that your veterinarian has prescribed for your pet. The cost for a one-month supply of this medication can range from $25–$250, depending on the formulation and quantity."}}, {"@type": "Question", "name": "Can zonisamide cause anxiety in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Anxiety is not one of the listed side effects with this medication. Pets may react differently to any medication. Drowsiness is the most common side effect seen with zonisamide."}}, {"@type": "Question", "name": "Is zonisamide safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": " Zonisamide is generally regarded as safe for pets in need of an anti-seizure medication. It can be used alone or with another seizure medication. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/MilanEXPO"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Zonisamide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-651931532.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-651931532.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication, Seizures", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/zonisamide"}, "datePublished": "May 23, 2023", "dateModified": "May 23, 2023", "description": "Zonisamide is a prescription medication that can be prescribed by a veterinarian to treat seizures in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Zonisamide? Zonisamide is a prescription anticonvulsant or anti-seizure medication. It may be prescribed by veterinarians for the prevention of seizures in dogs or cats. Zonisamide can also be used in combination with other anti-seizure medications such as phenobarbital. How Zonisamide Works The brain relies on ions such as sodium and chloride to conduct necessary electric charges in the nervous system for it to function normally. While the exact way that zonisamide works is not yet known, it is theorized that zonisamide rebalances the movement of certain key ions in the brain, which stabilizes its electrical activity and prevents seizures from occurring. Zonisamide may also affect the nervous system chemical messengers serotonin and dopamine. Zonisamide is FDA-approved for human use under the brand names Zonegran®, Zonisade®, and the generic zonisamide. Zonisamide is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your veterinarian may recommend a compounded formulation of zonisamide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Zonisamide Directions Follow the directions on the drug label or as provided by your veterinarian. Zonisamide is typically given once or twice daily depending on the species and other medications they may be on. Zonisamide can be given with food or on an empty stomach. If your pet has digestive upset, try giving it with food or a small meal. Do not stop giving this medication without direct instructions from your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of zonisamide. Generally, they may instruct you to give it as soon as you remember and wait the normal interval of time before giving the next dose. Or they may instruct you skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Zonisamide Possible Side Effects As with most seizure medications, drowsiness is the most common side effect. Additional symptoms may include: Lethargy Vomiting Diarrhea Loss of appetite Yellowing of the eyes or skin Incoordination Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of zonisamide Zonisamide Overdose Information Symptoms of an overdose can depend on how much was ingested and can include lethargy, incoordination, vomiting, diarrhea, loss of appetite, yellowing of the eyes or skin, or dry eye. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Zonisamide Storage Zonisamide should be stored at controlled temperatures around 77 F. Brief exposure to temperatures 59–86 F are acceptable. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect its contents from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]