[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take famotidine take to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Famotidine starts working in your dog’s system within the first one to three hours after administration. Depending on the reason that your pet was placed on this medication, symptoms should noticeably improve within the first few days. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/gollykim"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Famotidine (Pepcid®) for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1277012097.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1277012097.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/famotidine-dogs-cats"}, "datePublished": "January 31, 2023", "dateModified": "October 23, 2023", "description": "Famotidine is a prescription medicine used to treat various GI conditions in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Famotidine? Famotidine is an antacid commonly used to reduce the production of stomach acid, which helps prevent and treat stomach ulcers in dogs, cats, cattle, and small mammals. It may also be used in combination with other medications to treat stomach ulcers in horses.  Famotidine is FDA-approved for human use as a generic medication and under the brand name Pepcid® and Zantac 360™. It is important to note that the former Zantac (active ingredient ranitidine) has been withdrawn from commercial markets. Famotidine is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your veterinarian may recommend a compounded formulation of famotidine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Famotidine Works Famotidine is classified as an H2 blocker. By blocking H2 receptors located on the stomach lining, famotidine prevents histamine from binding to those receptors, which decreases the secretion of stomach acid. Reducing stomach acid helps prevent further injury to the lining of the esophagus, stomach, and duodenum. Famotidine Directions Follow the directions on the drug label or as provided by your veterinarian. Famotidine is best given on an empty stomach, preferably before the first meal of the day. If your pet has stomach upset when given this medication on an empty stomach, it can be given with a treat or a small amount of food. Missed a Dose Speak with your veterinarian about what to do if you forget to give a dose of famotidine. Generally, they may advise you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Famotidine Possible Side Effects Famotidine is usually well tolerated and side effects from this medication are rare. Side effects, when seen, may include: Lack of appetite Vomiting Diarrhea Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. Do not consume a medication that was dispensed for your pet and do not give your pet medication that was dispensed for a human.  If you accidentally ingest a pet medication, call your physician, seek medical attention, or call the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of famotidine Famotidine Overdose Information While famotidine has a wide margin of safety, overdoses are still possible and symptoms are dependent on the amount ingested. Moderate overdoses may cause vomiting, pale gums, drowsiness, restlessness, and a red tint to the ears and areas around the mouth. Large overdoses can cause low blood pressure, high heart rate, or collapse. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Famotidine Storage Famotidine should be stored at controlled room temperatures from 68 F to 77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed to protect this medication from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]