[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is clopidogrel the same as aspirin?", "acceptedAnswer": {"@type": "Answer", "text": "Before clopidogrel was made available on the market as an antiplatelet medication, aspirin was used in certain cases when a pet needed an anti-clotting medication. Clopidogrel is generally preferred over aspirin since aspirin is associated with significant side effects such as stomach ulcers, severe vomiting, and diarrhea. A study has also suggested that clopidogrel used for cats may be safer and more effective at preventing clot formation than aspirin. Some pets may have severe enough clotting for both medications to be required, but this should only be done at the direction of your veterinarian.   No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Clopidogrel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_208922836_%281%29.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_208922836_%281%29.jpeg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/clopidogrel"}, "datePublished": "April 10, 2023", "dateModified": "April 10, 2023", "description": "Clopidogrel is a prescription medication that helps to decrease blood clots from forming in cats and dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Clopidogrel? Clopidogrel is a prescription medication designed to decrease the body’s tendency to form blood clots. It is used in pets with conditions that can cause excessive blood clotting, such as dogs with immune-mediated hemolytic anemia, cats with hypertrophic cardiomyopathy, or cats with aortic thromboembolisms. Excessive blood clotting is a medical concern because clots can travel to areas in the body where they should not—potentially causing stroke, paralysis, or lung injury. How Clopidogrel Works Clopidogrel is an antiplatelet medication. Platelets exist in the bloodstream to help your body form blood clots and prevent bleeding. In pets with excessive blood clotting, clopidogrel works to prevent platelets from sticking together and forming clots. Clopidogrel is FDA-approved for human use under the brand name Plavix® and the generic clopidogrel. Clopidogrel is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of clopidogrel. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Clopidogrel Directions Follow the directions on the drug label or as provided by your veterinarian. Clopidogrel is generally given once a day. Depending on your pet’s condition, a veterinarian may recommend a higher dose on the first day it is administered (called a loading dose). This medication has a bitter taste and digestive upset is common if this medication is given on an empty stomach. Giving clopidogrel with a meal can help to prevent digestive upset with this medication. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of clopidogrel. Generally, they may instruct you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Clopidogrel Possible Side Effects Clopidogrel is generally well-tolerated. Side effects are rare but may include: Vomiting Loss of appetite Diarrhea Anemia (rarely seen after long-term use in cats) Giving Clopidogrel with a meal may alleviate side effects to the digestive system. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest clopidogrel that was prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of clopidogrel Clopidogrel Overdose Information Clopidogrel overdoses are rare; small to medium overdoses are generally well-tolerated. Large overdoses of this medication can cause bleeding or vomiting, and symptoms may continue for several days. Because this medication affects platelets, a platelet transfusion may be needed in cases of a severe overdose. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Clopidogrel Storage Clopidogrel should be stored at controlled room temperatures around 77 F and brief exposure to temperatures 59–86 F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]