[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long should a pet be prescribed itraconazole?", "acceptedAnswer": {"@type": "Answer", "text": "The length of time your pet is prescribed itraconazole will depend on the type, location, and severity of the infection. Some pets may be prescribed this medication for a few days to weeks, but others may need to be on this medication for several months. Your veterinarian will determine the best course of treatment based on your pet’s condition and symptoms."}}, {"@type": "Question", "name": "How quickly does itraconazole work in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Itraconazole will start working in your pet&#039;s system a few hours after ingestion, but it can take several days before you see a noticeable improvement in your pet&#039;s condition. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Linda Raymond"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Itraconazole (Itrafungol™)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-674744032.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-674744032.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Cat, Dog, Horse, Bird, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/itraconazole-itrafungol"}, "datePublished": "April 21, 2023", "dateModified": "September 8, 2023", "description": "Itraconazole is a prescription medication recommended by veterinarians to treat various fungal infections in cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Itraconazole? Itraconazole is an oral antifungal medication prescribed by veterinarians for the treatment of fungal infections in cats. Itraconazole is also available under the brand name Itrafungol™. Itraconazole can also be used off-label in several other species, including dogs, horses, birds, small mammals, and reptiles. The term off- or extra-label use means that a medication is prescribed for a certain use, or in a particular species that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use under certain circumstances. Your veterinarian will determine whether this medication is right for your pet. How Itraconazole Works Itraconazole works as an antifungal medication by stopping the fungi from creating an enzyme needed to produce their cell membrane. This inhibits the metabolism and growth of a given fungus. Itraconazole Directions Follow the directions on the drug label or as provided by your veterinarian. Itraconazole capsules are best given with food; foods that are higher in fat help promote its absorption into the body. Itrafungol™ oral solution is best given on an empty stomach. You should wash your hands and any exposed skin after administering the oral solution or handling your pet during treatment. Where protective gloves when handling your pet after treatment with the oral solution. If your pet is experiencing digestive upset after being given either version of this medication, please contact your veterinarian. Itraconazole may need to be given for days to weeks or months depending on the infectious agent and location of the infection. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of itraconazole. Generally, they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Itraconazole Possible Side Effects Itraconazole is better tolerated in most pets compared to other antifungal medications. Most pets do not see any side effects while taking this medication: Loss of appetite Vomiting Diarrhea Drooling Weight loss Lethargy Liver irritation Rarely, inflammation of the skin, skin ulcers, and swelling of the legs can occur in dogs. Symptoms of liver irritation may include: Vomiting Loss of interest in food Yellow gums, skin, or whites of the eyes Itrafungol™ should not be administered to cats with hypersensitivity to itraconazole or those with renal dysfunction. If clinical signs suggestive of liver dysfunction develop, treatment should be discontinued. Itraconazole is also a prescription medication for humans with differing dosages and side effects. Given the possible side effects, pets should not be given any itraconazole prescribed for humans.   Human Side Effects Itraconazole is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. If you accidentally ingest itraconazole prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose Itraconazole Overdose Information Itraconazole is unlikely to cause a toxic overdose; signs of an overdose may include drooling, vomiting, diarrhea, or loss of appetite. Overdoses can also cause liver irritation. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Itraconazole Storage Capsules of itraconazole should be stored at controlled room temperatures between 59–77 F and liquid Itrafungol™ should be stored at 68–77 F. Brief exposure to temperatures between 59–86 F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reading the label. Keep out of reach of children and pets."}]