[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for Vetmedin® (pimodendan) to work?", "acceptedAnswer": {"@type": "Answer", "text": "Vetmedin® starts to work inside the your pet’s body within 1-2 hours of administration. However, the effects may not be visible that fast. One study showed that the signs of heart failure in dogs taking Vetmedin® improved significantly within 7 days. Your veterinarian may prescribe additional medications to help reduce the signs of congestive heart failure."}}, {"@type": "Question", "name": "How long can a dog live on Vetmedin® (pimobendane)?", "acceptedAnswer": {"@type": "Answer", "text": "In 2006, the VetSCOPE study showed that dogs with Acquired Atrioventricular Valvular Disease treated with Vetmedin® lived around three times as long as those taking an alternative medication (an ACE inhibitor called benazepril). On average, the dogs treated with Vetmedin® lived for 13 months in this study. The dogs treated with benazepril lived for an average of 4.5 months.  No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/LPETTET"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vetmedin® (pimobendan)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1312512299.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1312512299.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/vetmedin"}, "datePublished": "August 23, 2022", "dateModified": "November 6, 2023", "description": "Vetmedin® is commonly prescribed to treat types of heart disease in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Vetmedin®? Vetmedin® is a medication prescribed for dogs that have been diagnosed with mild, moderate or severe congestive heart failure caused by valvular insufficiency or dilated cardiomyopathy (DCM). Several studies have shown that pimobendan (the active ingredient in Vetmedin®) can delay the onset of congestive heart failure in dogs with Mitral Valve Disease (MVD) and DCM and have shown that dogs can also have a better quality of life while on this medication. Vetmedin® is typically used in combination with other medications commonly prescribed for pets with heart conditions. Vetmedin® does not treat all types of heart disease. Speak to your veterinarian to see if Vetmedin® is appropriate for your pet. In certain circumstances, your vet may recommend a compounded formulation of Vetmedin®’s active ingredient, pimobendan. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug (such as Vetmedin® chewable tablets). Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Vetmedin® Works Vetmedin® helps the heart function in two ways. First, it causes vasodilation, which is when the muscles of the blood vessels relax. This allows your dog’s blood vessels to widen for blood to flow more easily. When veins widen, it reduces the back up of blood that causes abnormal fluid accumulation in the lungs and/or body. The widening of arteries reduces the resistance that the heart pumps against and improves blood flow to organs. Vetmedin® also indirectly acts on the muscle fibers of the heart to improve its ability to contract effectively. This allows the heart to pump blood forward through the heart and increases the volume of blood moved out of the heart to the rest of the body. Vetmedin® Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine an appropriate dose based on your pet’s weight. This dosage is often split into two doses, usually given 12 hours apart. The morning dose may differ from the evening dose, so follow your veterinarian’s directions closely. Vetmedin® is recommended to be given on an empty stomach. Vetmedin® is often given for long periods of time. Do not stop administering Vetmedin® to your pet without talking to your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Vetmedin®.  Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses. Vetmedin® Possible Side Effects The most common side effects are digestive upset which includes decreased appetite and diarrhea. Other possible side effects may include the following: Decreased energy (lethargy)Difficulty breathingElevated kidney enzymesWeaknessLack of coordinationHuman Side Effects This medication is not for use in humans in any capacity. If you accidentally ingest a pet medication, seek immediate medical attention or call  the national Poison Control Center hotline at 800-222-1222. Monitoring Your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Recommendations for monitoring may include radiographs (x-rays) of the chest, an electrocardiogram (to monitor heart electrical activity), blood pressure and/or an ultrasound of the heart (echocardiogram). Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdoseYou have additional questions or concerns about the use of Vetmedin®Vetmedin® Overdose Information Overdoses of Vetmedin® can have serious complications. Fast heart rates and blood pressure abnormalities can occur. Abnormal heart rhythms and structural changes to the heart were also seen in dogs receiving an overdose during safety studies. Emergency treatment is often necessary when an overdose occurs. If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Vetmedin® Storage Vetmedin® should be stored at controlled temperatures between 68°-77°F and brief exposure to temperatures between 59°-86°F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage requirements by reviewing the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]