[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can I use Revolution® for dogs on my cat?", "acceptedAnswer": {"@type": "Answer", "text": "No. It is important to use the correct species and sized medication for your pets’ exact weight. The dose for dogs and cats is different for Revolution®. Always use the correct medication for the intended pet. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/ElenaBoronina"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Revolution® (selamectin)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1297284395.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1297284395.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/revolution"}, "datePublished": "December 22, 2022", "dateModified": "December 22, 2022", "description": "Revolution® medications are used to prevent and treat flea infestations and heartworm disease in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most frequently asked questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Revolution®? Revolution® for Dogs and Revolution® for Cats protect against flea infestations and heartworm disease in dogs and cats due to the active ingredient selamectin. In dogs, Revolution® also treats and controls ear mites, sarcoptic mange, and tick infestations from the American Dog Tick. In cats, Revolution® also treats and controls ear mites, roundworm, and hookworm infections. Revolution® is available for dogs and puppies six weeks of age and older and cats and kittens eight weeks of age and older. What is Revolution® Plus? Revolution® Plus for Cats prevents flea infestations and heartworm disease in cats. It is intended for cats and kittens eight weeks of age and older and 2.8 pounds or greater in weight. Revolution® Plus for Cats also treats and controls ear mites, roundworm, and hookworm infections. Due to the addition of a second active ingredient, sarolaner. Revolution® Plus also treats and controls the Black legged dog tick, Gulf Coast tick, and the American Dog Tick, along with added protection against fleas. These medications are dosed differently in dogs and cats by weight. It is important to use the correct species and sized medication for your pet. Using cat medications on dogs or using dog medications on cats can cause serious problems, including lack of efficacy or an overdose. How Revolution® and Revolution® Plus Works The active ingredient in Revolution® is selamectin. Selamectin works by creating an electrolyte imbalance in the nerve and muscle cells of heartworms, which causes paralysis and death. Revolution® Plus is a combination medication, intended for use in cats, that adds an additional ingredient, sarolaner. Sarolaner is in a class of medications called isoxazolines. Isoxazolines eliminate fleas and ticks by overexciting their nervous system, causing paralysis and death. In cats, this medication works within the first few hours after administration to kill fleas present on your pet.   Revolution® and Revolution Plus® Directions Revolution® and Revolution® Plus are given once a month and the schedule should follow as close to every 30 days as possible in between doses. Follow the directions on the drug label of the species-specific product or as provided by your veterinarian. Topical versions of this product should be applied to the skin after the fur has been parted. Apply the full contents of the product applicator to one location on the skin between the shoulder blades in dogs and at the base of the neck in cats. After application, stiff or clumping hair, hair discoloration or a powdery residue may be observed at the application site. Do not apply Revolution® products to wet fur or skin. Wait 2 hours after applying Revolution® or Revolution® Plus before giving your dog a bath. Waiting 24 hours after applying Revolution® or Revolution® Plus to give your cat a bath is recommended. Do not allow your pet to ingest this medication. Missed a Dose? If you forget to give a dose of Revolution® or Revolution® Plus, give it when you remember. Revolution® or Revolution® Plus are given once a month and the schedule should follow as close to every 30 days as possible in between doses.  If your veterinarian has directed you to give this medication on a different dosing schedule, please contact them for further instructions if a dose was missed. Do not give extra or double doses. Possible Side Effects of Revolution® and Revolution® Plus Side effects are uncommon, but may include: Irritation or hair loss at the application site Vomiting Diarrhea Loss of appetite Lethargy Drooling Increased breathing rate Tremors Conjunctivitis Sneezing Fever Generalized itching Hives Lack of coordination Weakness Seizures Revolution® Plus contains the active ingredient sarolaner, which is an isoxazoline. Although uncommon, neurologic side effects have been seen after using medications in this class of drugs. Tell your veterinarian if your dog has a history of seizures or other neurologic disease. Neurologic side effects may include: Muscle tremors Stumbling, incoordination Collapse Seizures Human Side Effects This medication is not intended for use in humans. Avoid contact with the treated area on your pet until the area is completely dry, and wash your hands after applying this product. Rarely, skin reactions such as hives, itching and skin redness may occur in humans. If you accidentally ingest a pet medication, get this medication in your eyes, or a skin reaction has occurred, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring It is recommended that all dogs be tested for an existing heartworm infection prior to starting treatment with Revolution®. At the discretion of your veterinarian, cats greater than 6 months of age may be tested to determine the presence of existing heartworm infections before beginning treatment with Revolution® or Revolution® Plus. Dogs with existing heartworm infections should be treated to remove the adult heartworms before being placed on this medication. Cats that have adult heartworms can continue to be given Revolution® or Revolution® Plus to prevent further heartworms from developing. Other specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pet&#039;s individual needs. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Revolution® or Revolution® Plus Revolution® and Revolution® Plus Overdose Information Topical overdoses do not typically show any additional symptoms beyond the listed side effects. Overdoses are often more serious in dogs that have the MDR1 (ABCB1) gene defect. Oral overdoses of this medication can cause the following symptoms: Loss of appetite Tremors Lack of coordination Seizures Lethargy Drooling Blindness Vomiting Diarrhea Low heart rate High body temperature If you suspect an overdose, you used the wrong product on your pet, or you accidentally gave this topical product by mouth, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Revolution® and Revolution® Plus Storage Revolution® products should be stored at controlled temperatures below 86 F. Store away from heat or open flames. Keep the medication in the provided container until ready for administration in order to protect it from moisture and light.   Keep out of reach of children and pets."}]