[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does spironolactone take to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "While spironolactone will start to work in your pet&#039;s system within the first few hours of administration, it can take a few days for you to start noticing a relief in your pet’s symptoms."}}, {"@type": "Question", "name": "Is spironolactone for dogs a diuretic?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, spironolactone is a diuretic that is often used in dogs for certain conditions that cause swelling (a buildup of fluid) in the body."}}, {"@type": "Question", "name": "Can I give my dog human-prescribed spironolactone?", "acceptedAnswer": {"@type": "Answer", "text": "Although spironolactone is currently only FDA approved for use in dogs as a combination product with benazepril known as Cardalis®, spironolactone on its own is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. If your dog’s veterinarian feels that they would benefit from spironolactone alone, it may be obtainable through a compounding pharmacy or a pharmacy for humans."}}, {"@type": "Question", "name": "What is the difference between spironolactone and furosemide?", "acceptedAnswer": {"@type": "Answer", "text": "Furosemide and spironolactone are both diuretic medications used to treat edema in dogs. However, they act on different areas of the kidneys. Furosemide is a much stronger diuretic but spironolactone is potassium-sparing, meaning that potassium stays in the body while excess fluid is being excreted. Your veterinarian will decide which diuretic is best suited for your pet and the condition being treated. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/PhotoAttractive"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Spironolactone", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1179213726.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1179213726.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication, Cardiac health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/spironolactone"}, "datePublished": "May 23, 2023", "dateModified": "May 23, 2023", "description": "Spironolactone is a medication commonly prescribed by veterinarians to manage congestive heart failure in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Spironolactone? Spironolactone is a medication used in the treatment of congestive heart failure (CHF) in dogs and cats. Specifically in dogs, it is used in the management of myxomatous mitral valve disease (MMVD). It can also be used to treat swelling caused by fluid buildup in the body (edema). Spironolactone is often used in combination with other medications to benefit heart health. Currently, spironolactone is only FDA-approved for use in pets as a combination medication called Cardalis® that contains two ingredients: spironolactone and benazepril. By itself, spironolactone is FDA-approved for human use under the brand name Aldactone® and the generic spironolactone. Spironolactone is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. How Spironolactone Works Spironolactone belongs to a class of medications called potassium-sparing diuretics. Diuretics are medications that help reduce swelling by shifting fluid out of the body and into the urine. Spironolactone works in the kidneys, moving sodium and excess fluid out into the urine while sparing other important electrolytes, such as potassium, from exiting the body. In certain circumstances, your vet may recommend a compounded formulation of spironolactone. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Spironolactone Directions Follow the directions on the drug label or as provided by your veterinarian. Spironolactone is best given with food to improve its absorption in the body. Your pet’s thirst and urination may increase after starting this medication. It is important to make sure that your pet has access to plenty of fresh water while on this medication. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of spironolactone. Generally, they may instruct you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Spironolactone Possible Side Effects The most common side effects of spironolactone include stomach upset (loss of appetite, vomiting, diarrhea) and dehydration. Other side effects may include: Lethargy Incoordination Itchy face (in cats) If you observe that your pet is no longer drinking water or urinating, inform your veterinarian immediately. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a medication prescribed for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of spironolactone Spironolactone Overdose Information Spironolactone is a mild diuretic compared to others (such as furosemide), and an exact toxic dose of this medication is not currently known. Signs of an overdose may include vomiting, low blood pressure, increased thirst and urination, incoordination, dry gums, dehydration, lethargy, and weakness. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Spironolactone Storage Spironolactone should be stored at controlled room temperatures between 68–77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect the medicine from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]