[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is melphalan effective in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Melphalan is effective in treating certain cancers in dogs including bone marrow cancer (multiple myeloma), relapsed lymphoma, osteosarcoma, breast (mammary) cancer, and lung cancer. Several factors can influence the rate of remission, including the type of cancer diagnosed, the stage of the cancer, and a dog’s health status."}}, {"@type": "Question", "name": "How does melphalan work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Melphalan is a chemotherapy medication that is either given orally in combination with other chemotherapy medications or administered intravenously under direct veterinary supervision in a hospital setting. Melphalan works by directly interfering with the DNA and RNA of cancer cells, killing them and preventing them from rapidly dividing and replicating. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/AzmanL"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Melphalan for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1453786662.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1453786662.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/melphalan-dogs-and-cats"}, "datePublished": "October 9, 2023", "dateModified": "October 9, 2023", "description": "Melphalan is a prescription medication used by veterinarians to treat certain cancers in dogs and cats. Learn how melphalan works, including directions, side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Melphalan? Melphalan is a prescription human anti-cancer (chemotherapy) medication used to treat certain cancers in dogs and cats, including bone marrow cancer (multiple myeloma), resistant leukemia in cats, relapsed lymphoma in dogs, osteosarcoma, breast (mammary) cancer, and lung cancer. Melphalan can be given as an oral medication in combination with other chemotherapy medications or administered intravenously under the direct supervision of a veterinarian in the hospital. Melphalan is FDA-approved for human use under its generic name, melphalan for oral use, and the brand name Evomela® as an injectable formulation. Melphalan is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of melphalan. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Melphalan Considerations Due to the potential risk of toxicity to pets, veterinary staff, and pet parents, and because chemotherapy treatment protocols, monitoring, and safety guidelines often change, it is best to consult with a board-certified veterinary oncologist about the use of melphalan in your pet. If they determine melphalan to be an appropriate treatment option, they will also recommend an appropriate dose and schedule for your pet. Treatment with melphalan requires intensive monitoring and close supervision by your veterinarian. Before and during your pet’s treatment, your vet will perform blood tests to evaluate their immune system function as well as the effects of the drug on the liver and kidneys. Melphalan should not be used in pregnant or nursing pets; in pets with certain medical conditions, such as liver disease, kidney disease, current infection, bone marrow depression or abnormal blood cell levels; in pets that have recently been vaccinated or are scheduled for a vaccination; in pets that have recently received chemotherapy or radiotherapy, or in pets that are hypersensitive or allergic to it. Giving melphalan with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. How Melphalan Works Melphalan belongs to a class of chemotherapy medications known as alkylating agents. Melphalan works by directly interfering with the DNA and RNA of cancer cells, which kills them and prevents them from rapidly dividing and replicating. It is important to note that, like many chemotherapy drugs, melphalan also affects healthy dividing cells such as those in bone marrow. Melphalan decreases the ability of bone marrow to produce blood cells, resulting in low blood counts (such as anemia) and increases risk for infection. Melphalan Directions Follow the directions on the drug label or as provided by your veterinarian. Wear gloves when handling melphalan. Studies have shown that the absorption of melphalan can vary. Ask your veterinarian if you should give melphalan to your pet on an empty stomach or if you should give it with food to decrease the risk of digestive upset. Always provide your pet with plenty of water when they are taking melphalan. Do not discontinue melphalan without discussing it first with your veterinarian. Melphalan should not be used in pets that are allergic or sensitive to it. Melphalan should be avoided in pregnant and lactating pets. Missed a Dose? The dosing schedule for melphalan is complex and highly specific to your pet, their medical needs, and the type of cancer or condition being treated. Speak with your veterinarian right away about what to do if you forget to give a dose of melphalan. Do not give extra or double doses.  Melphalan Possible Side Effects Side effects from melphalan include bone marrow suppression—a low red blood cell count (anemia), low platelet count (thrombocytopenia), or low white blood cell count (leukopenia). Symptoms may include: Low energy (lethargy) Weakness Bleeding or bruising Fever (indicating infection) Trouble breathing or coughing Sores in the mouth and throat Gastrointestinal upset—nausea, loss of appetite, vomiting, diarrhea Symptoms of an allergic reaction to melphalan (anaphylaxis) include: Trouble breathing (respiratory distress) Fainting or collapse due to low blood pressure (hypotension) Hives, rash, or red, itchy skin Your veterinarian may need to delay your pet’s treatment or adjust the dose of melphalan depending on your pet’s response and any side effects that they experience. Human Side Effects Melphalan is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human’s use. If you are pregnant, trying to become pregnant, or breast-feeding, talk to your veterinarian about the possibility of administering an alternative medication to your pet. Melphalan is a chemotherapy drug and it can be hazardous to other animals and people who come in contact with it. Your veterinarian will give you specific instructions including (but not limited to) the following precautions: Ensure that you do not ingest melphalan. Wear disposable gloves at all times while in contact with this medication and wash your hands with soap and water after handling. If any medicine contacts your skin, wash it off immediately and contact your physician or the national Poison Control Center. Melphalan and its byproducts are found in a treated animal&#039;s secretions and bodily waste, including saliva, vomit, urine, stool, blood, and litter. Wear disposable gloves when cleaning up waste and handling the cat litterbox. Waste must be sealed in a plastic bag and disposed of according to your veterinarian’s instructions. If you accidentally ingest this medication, immediately seek medical attention. If you come into contact with this medication without wearing gloves, immediately wash it off and call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of melphalan Melphalan Overdose Information An overdose of melphalan can be serious. Symptoms may include abnormal diarrhea, drowsiness, bleeding or bruising, bloody or black, tarry bowel movements, bloody urine, bloody vomiting, or vomited material that looks like coffee grounds. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Melphalan Storage Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Melphalan should be stored in a refrigerator at controlled temperatures from 36 to 46 F. Keep the container tightly closed to protect its contents from moisture and light. Keep out of reach of children and pets."}]