[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does metronidazole kill worms in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Metronidazole does not kill intestinal worms such as roundworms, hookworms, or whipworms. Metronidazole can be used to treat certain protozoal parasites such as giardia. Your veterinarian can perform a fecal test to identify which intestinal parasite your pet may have so appropriate treatment can be started."}}, {"@type": "Question", "name": "Is metronidazole for dogs an antibiotic?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, metronidazole is an antibiotic commonly used in dogs to treat specific bacterial infections. Different antibiotics work against different types of bacteria so your veterinarian may recommend this or another antibiotic for your pet depending on what kind of infection is suspected."}}, {"@type": "Question", "name": "Can metronidazole for a dog cause constipation?", "acceptedAnswer": {"@type": "Answer", "text": "Constipation is not a typical side effect of metronidazole. The drug is often prescribed to dogs with diarrhea. Dogs with diarrhea may strain to defecate, which is easily confused with constipation. In addition, your dog’s diarrhea should improve after starting metronidazole. In the beginning, it is not uncommon to see fewer stools for a day or two after the diarrhea is resolved."}}, {"@type": "Question", "name": "What does metronidazole do for cats?", "acceptedAnswer": {"@type": "Answer", "text": "Metronidazole can be used in cats to treat diarrhea, certain bacterial infections, and some intestinal protozoa such as giardia. It can also treat some inflammatory diseases of the intestinal tract like inflammatory bowel disease (IBD). Featured Image: iStock.com/chendongshan No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Metronidazole", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1289859249.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1289859249.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/metronidazole"}, "datePublished": "August 9, 2022", "dateModified": "August 9, 2022", "description": "Metronidazole is a common medication prescribed to treat bacteria parasites in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.  What is Metronidazole? Metronidazole is an antibiotic and antiprotozoal medication that kills certain types of bacteria and protozoa parasites. In dogs and cats, it is most commonly used to treat infections of the digestive tract. Metronidazole targets certain types of bacteria called anaerobic bacteria, which are bacteria that do not require oxygen to survive. It also treats protozoal parasites, such as giardia, especially when given in combination with other drugs. Metronidazole can also be used to treat certain kinds of inflammation in the digestive tract. Metronidazole is FDA-approved for human use under the brand name Flagyl®. Metronidazole is currently not FDA approved for use in animals. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use is not described on the drug label. Speak with your veterinarian about whether metronidazole is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of metronidazole. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Metronidazole Works Metronidazole kills bacteria by disrupting their DNA. It is not known how it kills protozoal parasites. Metronidazole is also used to treat inflammatory diseases in the digestive tract and is thought to accomplish this by blocking certain inflammatory mechanisms. Metronidazole Directions Follow the directions on the drug label or as provided by your veterinarian. The exact dose of metronidazole depends on your pet’s weight, as well as the type of bacteria or parasite present. Metronidazole is typically given with food and should be given for the full treatment period prescribed by your veterinarian. Missed a Dose? If you forget to give a dose of metronidazole, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.  Metronidazole Possible Side Effects Metronidazole is generally well tolerated in dogs and cats. Side effects can include: Vomiting or diarrheaFatigue (lethargy)WeaknessLow white blood cell countsBlood in the urineLoss of appetiteYellowing of gums, skin, or whites of the eyesNeurologic symptoms including lack of coordination, dilated pupils, abnormal eye movements called nystagmus or seizuresNeurologic side effects are more common in pets receiving higher doses or are on this medication for long periods of time. Metronidazole has been shown to be carcinogenic in mice and rats. Unnecessary use of the drug should be avoided. Its use should be reserved for the conditions as determined by your veterinarian. Human Side Effects While metronidazole is a prescription medication approved for use in humans, there are different dosages from those given to animals and side effects that can occur in humans.  Pregnant women or individuals allergic to metronidazole should wear gloves when handling the medication and wash their hands after use. If you accidentally ingest a pet medication, seek medical attention, or call the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdose.Call your vet or pharmacist if you have additional questions or concerns about the use of metronidazole. Metronidazole Overdose Information Overdoses of metronidazole can cause vomiting, decreased appetite, and life-threatening neurologic symptoms such as seizures. Overdoses often require emergency treatment to limit the absorption of the medication and minimize neurologic symptoms. If you suspect an overdose, immediately seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Metronidazole Storage Metronidazole should be stored at controlled temperatures between 59°F to 77°F. Always confirm storage requirements by reviewing the label. Keep the container tightly closed to protect it from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]