[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does Deramaxx® make dogs sleepy?", "acceptedAnswer": {"@type": "Answer", "text": "Deramaxx® should not make your dog sleepy. Some slight lethargy may occur as a side effect to this medication, but if your pet seems severely lethargic or you are noticing any other abnormal symptoms while your pet is on this medication, contact your veterinarian immediately, seek emergency veterinary care, or call an animal poison control center. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/SeventyFour"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Deramaxx™ (deracoxib)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1371820898.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1371820898.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/deracoxib-deramaxx"}, "datePublished": "January 23, 2023", "dateModified": "January 23, 2023", "description": "Deramaxx™ is commonly prescribed to treat pain in dogs, most commonly pain that occurs after general surgery.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Deramaxx®? Deramaxx® (deracoxib) is an FDA-approved non-narcotic, non-steroidal anti-inflammatory (NSAID) prescription medication for canines. It is used primarily for the treatment of post-operative pain and inflammation caused by orthopedic and general surgery, including dental surgery. It is also used to treat inflammation associated with arthritis, and may also be used to control fevers and inflammation caused by other conditions.   In dogs, Deramaxx® may offer some anti-cancer effects through off-label use. It can be used in combination with some chemotherapy medications to treat a particular bladder cancer called a transitional cell carcinoma (TCC) and a blood-based cancer called hemangiosarcoma. The term off- or extra-label means that a medication is used in a way or in a particular species that is not specified on the medication label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether Deramaxx® is right for your pet. How Deramaxx® Works NSAIDs block the production of natural chemicals that trigger inflammation—called a COX pathway. Some COX pathways are helpful with digestion, kidney health and clotting, but Deramaxx® blocks significantly more of the inflammatory chemicals than the beneficial ones. Because Deramaxx® can still partially inhibit the beneficial chemicals, especially at higher doses, make sure to speak with your veterinarian about prescription instructions and follow those directions closely. Deramaxx® Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is given at different dosages based on the condition for which it is prescribed. Generally, your veterinarian may recommend giving the medication once daily by mouth. Deramaxx® can be given with or without food, but giving it with food can help to prevent digestive system upset. As determined by your veterinarian, use the lowest effective dose for the shortest duration consistent with your pet’s individual response. Missed a Dose? Speak with your veterinarian about what to do if  you forget to give a dose of Deramaxx®. Generally, they may advise you to give it when you remember, or,  if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Deramaxx® Possible Side Effects Deramaxx® is generally well-tolerated. Vomiting and loss of appetite are the most common side effects noted.  Additional side effects may include: Diarrhea or soft stools Dark tarry stool Bloody vomiting or diarrhea Abdominal pain Increased salivation Urinary tract infection Unilateral conjunctivitis Seizures Panting Tachycardia Blindness Lethargy Weight loss Stomach ulcers Change in thirst or urination Jaundice (yellowing of the gums, skin, or eyes) General itchiness In some cases, death has been reported as an outcome of the adverse events listed above. If you believe your pet may be experiencing any side effects, consult your veterinarian. Human Side Effects This medication is not intended for use in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose Your pet’s condition worsens or does not improve with treatment You have additional questions or concerns about the use of Deramaxx® Deramaxx® Overdose Information Decreased appetite, vomiting, dark tarry stool, and lethargy have all been noted with overdoses of this medication. More severe symptoms can occur depending on the severity of the overdose. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Deramaxx® Storage Deramaxx® should be stored according to the medication label and at controlled temperatures between 59-86 F. Keep the container tightly closed in order to protect this medication from moisture and light. Keep out of reach of children and pets."}]