[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What enzyme is used for exocrine pancreatic insufficiency (EPI) in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Pancreatic enzymes are used to treat EPI in dogs. They comprise lipase, protease, and amylase enzymes."}}, {"@type": "Question", "name": "How do you treat pancreatic enzyme deficiency in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "In dogs, when pancreatic enzyme deficiency is due to inability of the pancreas to produce enough digestive enzymes on its own, prescription digestive enzyme replacement therapy is  used. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/RossHelen"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pancreatic Enzymes for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1319891134.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1319891134.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/pancreatic-enzymes-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "August 7, 2023", "description": "Pancreatic enzymes can be prescribed by veterinarians to help replace pancreatic enzymes lost in dogs and cats due to an illness. Learn how pancreatic enzymes work, including common brand medications, side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Are Pancreatic Enzymes? Pancreatic enzymes are prescribed in veterinary medicine when the pancreas is unable to produce enough digestive enzymes on its own to digest the proteins, fats, and carbohydrates in food. It is a form of enzyme replacement therapy that can help with a rare malnutrition syndrome called exocrine pancreatic insufficiency (EPI) in dogs and cats. Pancreatic enzymes are also used in birds to treat EPI, as well as in rabbits, rodents, and other small mammals to break up fur balls. Pancreatic enzymes are not FDA-approved in veterinary medicine, but there are multiple prescription veterinary labeled formulations used. Most commonly, pancreatic enzymes are given in powder formulation such as: Viokase®-V powder, VetOne® PancrePlus powder, Epizyme™ powder, and PanaKare™Plus powder. VetOne® PancrePlus tablets and PanaKare™Plus tablets are also available. Pancreatic enzymes, also known as pancrelipase, are FDA-approved for human use under the brand names Creon®, Pertzye®, Viokace®, Zenpep® and Pancreaze®. Pancreatic enzymes are currently not FDA-approved for animals as a veterinary medication. However, they are readily available and utilized in the veterinary field. Cats may dislike the taste of the powder mixed into their food. In certain circumstances, your vet may recommend a compounded capsule or tablet formulation of pancreatic enzymes. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking the powder form, the dosage strength is not commercially available, or the pet is allergic to an ingredient. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Pancreatic Enzymes Work Pancreatic enzymes are a concentrated formula of essential enzymes: lipase, protease, and amylase. These enzymes help break down nutrients (carbohydrates, sugars, fats, and proteins) when the pancreas cannot produce them on its own. Pancreatic enzymes are made from pork pancreas. Pancreatic Enzyme Directions Follow the directions on the drug label or as provided by your veterinarian. Pancreatic enzyme powder is typically given with each meal and mixed into the food. Follow your veterinarian’s instructions, which will normally instruct you to thoroughly mix the powder into your pet’s food and let the food/powder mixture stand for a few minutes before feeding.  Missed a Dose? Speak to your veterinarian about what to do if you forget to give a dose of pancreatic enzymes. Generally they will instruct you to give it at your pet’s next meal, and resume your normal dosing schedule. Do not give extra or double doses. Pancreatic Enzyme Possible Side Effects Pancreatic enzymes may cause gastrointestinal side effects: Diarrhea Stomach cramps Nausea Vomiting Gas Mouth irritation Ulcers in the mouth and esophagus This medication should not be used in pets with pork allergies. Human Side Effects Pancreatic enzymes are also used in humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should only be given medicine approved for human use if that human medicine is specifically prescribed by a veterinarian.  Avoid inhaling the pancreatic enzyme powder; it may cause coughing, chest tightness, lung irritation, and worsen asthma. Be careful not to get the powder in your eyes, nose, mouth, or on your skin as it can cause irritation.  Wash your hands after handling. People with severe pork allergies should not handle this product. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of pancreatic enzymes Pancreatic enzyme supplementation should never be given unless your pet has been diagnosed with EPI by your veterinarian. Pancreatic enzymes can harm the function of your pet’s pancreas if your pet does not need them. Speak with your veterinarian to determine whether this medication is right for your pet. Pancreatic Enzyme Overdose Information An overdose of pancreatic enzymes can cause diarrhea, cramping, and vomiting. In general, an overdose of a medication depends on the species, the amount ingested, and for how long it was given. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Pancreatic Enzyme Storage Store pancreatic enzyme at controlled room temperature between 68-77 F. Always confirm storage requirements by reading the drug label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]