[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Marbofloxacin (Zeniquin®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-517696693_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-517696693_0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/marbofloxacin-zeniquin"}, "datePublished": "February 27, 2023", "dateModified": "February 27, 2023", "description": "Marbofloxacin can be prescribed by veterinarians to treat urinary, skin, and soft tissue infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Marbofloxacin? Marbofloxacin (generic for Zeniquin®) is an FDA-approved antibiotic medication approved for use in dogs and cats that treats a wide variety of bacterial infections—especially those in the bladder, kidneys, prostate, or skin. How Marbofloxacin Works Marbofloxacin works by disrupting DNA formation in susceptible bacteria during the replication process, thereby preventing the bacteria from growing and multiplying. Marbofloxacin is approved for use in dogs and cats. However, it is readily utilized in the veterinary field across many different species including rabbits, reptiles, and birds. Veterinarians can legally prescribe certain medications for animals they are not approved for in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Marbofloxacin is not recommended for use in growing animals or pregnant animals. Marbofloxacin and other antibiotics that belong to the fluoroquinolone class can cause abnormal cartilage development in growing animals. This medication should not be used in pets that are hypersensitive to quinolones. It is also illegal to use this medication in food-producing animals in the United States. Speak with your veterinarian before providing this medication to a pet with known or suspected central nervous system disorders. In certain circumstances, your vet may recommend a compounded formulation of marbofloxacin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Marbofloxacin Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is best given on an empty stomach and is generally given once daily. If giving this medication on an empty stomach causes GI upset, speak with your veterinarian, who may recommend providing it with a small amount of food. Giving this medication with dairy products or anything containing calcium, iron, or aluminum may decrease its effectiveness.  Speak with your veterinarian about what to do if your animal vomits while on this medication. Certain medications can interfere with the absorption of this medication, so let your veterinarian know all medications that your pet currently takes, including vitamins, supplements, or herbal therapies, before starting marbofloxacin. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of marbofloxacin. Generally, they may recommend that you give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Marbofloxacin Possible Side Effects Marbofloxacin can cause upset stomach. Additional side effects may include:  Vomiting Diarrhea Loss of appetite Lethargy Dehydration Skin rash Rarely, severe side effects may be seen: Lack of coordination Behavioral changes Shivering or shaking Liver irritation Depression Blindness Seizures In higher doses, this medication may cause blindness or eye damage in cats. This medication is not recommended for use in growing animals of any species. Marbofloxacin and other antibiotics of the fluoroquinolone class can cause abnormal cartilage development in growing animals. Fluoroquinolones, including marbofloxacin, can also increase sensitivity to sunlight. Direct or prolonged sun exposure should be avoided for any animals on this medication. Human Side Effects This medication is not intended for use in humans. Avoid getting this medication in your eyes and make sure to wash your hands after administering this medication. If you are allergic to this medication or other medications in this class, avoid handling this medication. Prolonged sun exposure after handling may cause skin sensitivities. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of marbofloxacin Marbofloxacin Overdose Information The most common symptoms of an overdose are vomiting and diarrhea. Signs of larger or more prolonged overdoses include loss of appetite, dehydration, lethargy, tremors, facial swelling, red skin/ears, drooling and blindness. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Marbofloxacin Storage Marbofloxacin should be stored at controlled temperatures below 86 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/WhitneyLewisPhotography"}]