[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cytoxan", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Medication", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cytoxan"}, "datePublished": "November 7, 2012", "dateModified": "August 17, 2022", "description": "Cyclophosphamide is used in the treatment of cancers, including lymphoma, and a number of immune-mediated diseases in cats and dogs. Come to petMD for a complete list of pet medications and prescriptions.", "articleBody": "General Description Cyclophosphamide is used in the treatment of cancers, including lymphoma, and a number of immune-mediated diseases. It is an immunosuppressant that kills rapidly dividing cells. How It Works Cyclophosphamide binds to DNA, interferring with normal cell function. It specifically targets the rapidly replicating DNA in rapidly dividing cells such as cancer cells or inflammatory cells.   Storage Information Injectable may need to be refrigerated - pay close attention to the drug label’s instructions for storage information. Missed Dose? Give the dose as soon as possible. If it is almost time for the next dose, skip the missed dose, and continue with the regular schedule. Do not give your pet two doses at once. Side Effects and Drug Reactions Cyclophosphamide may result in these side effects:     Loss of appetite    Bone marrow suppression    Upset stomach    Development of Hemorrhagic Cystitis as displayed by blood in the urineCyclophosphamide may react with these drugs:     Barbiturates    Bone marrow suppressants    Thiazide diuretics    Allopurinol    Digoxin    Doxorubicin    Phenobarbital    Succinylcholine chlorideALWAYS WEAR GLOVES WHEN HANDLING THIS DRUG - THIS IS A CYTOTOXIC DRUG USE CAUTION WHEN ADMINISTERING THIS DRUG TO PETS WITH LIVER OR KIDNEY DISEASE USE CAUTION WHEN ADMINISTERING THIS DRUG TO PREGNANT PETS - It is toxic to unborn fetuses due to their quickly dividing cells. Use only when the benefits outweigh the risks."}]