[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is the difference between Interceptor® and Interceptor® plus for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The difference between Interceptor® and Interceptor® Plus is that Interceptor® Plus contains a second active ingredient called praziquantel. Praziquantel provides additional efficacy against intestinal parasites and specifically adds protection against tapeworms."}}, {"@type": "Question", "name": "Can you give Interceptor® Plus and Bravecto® at the same time?", "acceptedAnswer": {"@type": "Answer", "text": "Interceptor® Plus is a fantastic heartworm and intestinal parasite prevention option. Bravecto® is an excellent external parasite (fleas and ticks) prevention. These two products can be safely used together in most dogs. It is important to work with your veterinarian to ensure the best heartworm and flea prevention plan for you and your pet’s specific needs."}}, {"@type": "Question", "name": "How long does Interceptor® Plus stay in a dog’s system?", "acceptedAnswer": {"@type": "Answer", "text": "Interceptor® Plus is given once monthly for the prevention of heartworm and intestinal parasites. When administered orally, it stays in a dog’s system for 1-2 days. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Evrymmnt"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Interceptor® (milbemycin oxime)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1364211235.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1364211235.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/interceptor"}, "datePublished": "December 22, 2022", "dateModified": "December 22, 2022", "description": "Interceptor® medications are used to treat and prevent multiple types of worms and parasites in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most frequently asked questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Interceptor®? Interceptor® is a monthly medication for the prevention of heartworms in dogs and cats, containing the active ingredient milbemycin oxime. In dogs, Interceptor® also controls hookworms, and treats and controls roundworms, and whipworms. Interceptor® is intended for dogs and puppies weighing more than 2 pounds and older than 4 weeks of age. In cats, Interceptor® also treats roundworms and hookworms. Interceptor® is intended for cats and kittens weighing more than 1.5 pounds and older than 6 weeks of age. What is Interceptor® Plus? Interceptor® Plus contains two active ingredients, milbemycin oxime and praziquantel. Interceptor® Plus works to prevent heartworm disease, and to treat and control hookworms, roundworms, whipworms and tapeworms. Interceptor® Plus is intended for dogs and puppies weighing more than 2 pounds and older than 6 weeks of age. How Interceptor® and Interceptor® Plus Works The main active ingredient in both Interceptor® and Interceptor® Plus is milbemycin oxime. Milbemycin shifts chloride, a naturally occurring electrolyte, across the cell membrane of certain susceptible worms such as heartworms, roundworms, and hookworms. By overloading chloride into these worms, it affects the electrical activity within their nervous system, causing muscle paralysis and death. Praziquantel is the second active ingredient in Interceptor® Plus, which adds protection against tapeworms. The way praziquantel works against intestinal parasites is unclear, but it is believed to interfere with the worms&#039; muscle integrity and cause paralysis. Interceptor® and Interceptor® Plus Directions Interceptor® and Interceptor® Plus should be administered by mouth once a month. It may be given with or without food. The chewable may be broken up for ease of administration. Efforts should be made to ensure that the Interceptor® Plus chewable is chewed and not swallowed whole. With Interceptor® and Interceptor® Plus, if your dog or cat did not consume all the chew, then redosing with a new chewable is recommended. Missed a Dose? If you forget to give a dose of Interceptor® or Interceptor® Plus, give it when you remember. Interceptor® or Interceptor® Plus are given once a month and the schedule should follow as close to every 30 days as possible in between doses. If your veterinarian has directed you to give this medication on a different dosing schedule, please contact them for further instructions if a dose was missed. Do not give extra or double doses. Possible Side Effects of Interceptor® and Interceptor® Plus Side effects are uncommon, but may include: Vomiting Diarrhea Loss of appetite Lethargy Lack of coordination Drooling Weakness Convulsions Salivation Human Side Effects This medication is not intended for use in humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring It is recommended that all pets should be tested for existing heartworm infection prior to starting treatment with Interceptor® and Interceptor® Plus. Dogs with existing heartworm infections should be treated to remove the adult heartworms before going back on this medication. Interceptor® and Interceptor® Plus can kill microfilariae, but an allergic reaction to the dying microfilariae can occur in dogs when Interceptor® is given to dogs that are heartworm-positive. Safety of Interceptor® in heartworm positive cats is unknown. Other specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pet&#039;s individual needs. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Interceptor® or Interceptor® Plus Interceptor® and Interceptor® Plus Overdose Information The most common symptoms of an overdose of Interceptor® and Interceptor® Plus include vomiting, incoordination, lethargy, drooling and tremors. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Interceptor® and Interceptor® Plus Storage Interceptor® and Interceptor® Plus should be stored at controlled temperatures between 59-77 F. Keep the medication in the blister pack provided until ready for administration in order to protect it from moisture and light.  Keep out of reach of children and pets."}]