[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is potassium bromide prescribed as seizure medication for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, potassium bromide can be prescribed to dogs as either a solo medication or in combination with other anti-seizure medications for the control or prevention of seizures."}}, {"@type": "Question", "name": "What are side effects of potassium bromide in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The most common side effects of potassium bromide are sedation and incoordination. These side effects tend to occur during the first days to weeks of treatment and may improve over time. Additional side effects include increased thirst, hunger, or urination, vomiting, diarrhea, and constipation. If your pet is showing severe sedation or incoordination, contact your veterinarian."}}, {"@type": "Question", "name": "How long does potassium bromide take to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Potassium bromide can take a long time to reach therapeutic levels (the level required for it to be most effective) in a dog&#039;s system. Depending on your dog, their medical condition, and other medications they may be on, your veterinarian may recommend a loading dose of potassium bromide. A loading dose is a larger dose that is given only at the start of treatment to help the medication get to high enough levels in the body to be helpful. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/AleksandarNakic"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Potassium Bromide (K-BroVet-CA1®, K-BroVet®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1188473929.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/iStock-1188473929.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/potassium-bromide-k-brovet-ca1-k-brovet"}, "datePublished": "May 22, 2023", "dateModified": "October 14, 2023", "description": "Veterinarians often prescribe potassium bromide to help with seizures in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Potassium Bromide? Potassium bromide is a prescription medication that can be used alone or with another medication to control epilepsy seizures in dogs. Potassium bromide is also available under the following brands: K-BroVet-CA1® chewable tablets and K-BroVet® oral solution. K-BroVet-CA1® contains potassium bromide that is specifically formulated as chewable tablets. This particular formulation has been conditionally approved by the FDA to be reasonably safe and effective in treating epilepsy in dogs. Its full approval by the FDA is pending more robust post-marketing data to further prove its safety and effectiveness. K-BroVet® is an oral solution that contains three ingredients: potassium bromide, vitamin B12, and pyridoxine (vitamin B6). Although K-BroVet® is not currently approved by the FDA, it is also used to treat epilepsy in dogs. Potassium bromide is readily utilized in the veterinary field, and veterinarians can legally prescribe certain unapproved drugs for use in animals in certain circumstances. This medication has not been tested in dogs that are intended for breeding or that are pregnant or nursing. Additionally, this medication has not been tested in young dogs or neonates. Speak with your veterinarian about whether this medication is right for your pet. How Potassium Bromide Works Chloride is a naturally occurring ion in the body that has many essential functions, including conducting necessary electric charges throughout the brain and nervous system. However, in pets with epilepsy, there is a buildup of chloride in the brain that causes seizures. When potassium bromide is administered, it separates into two ions in the body: potassium and bromide. The bromide component is key in re-balancing chloride levels in the brain, thereby reducing the likelihood of a seizure from reoccurring.  In certain circumstances, your vet may recommend a compounded formulation of potassium bromide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Potassium Bromide Directions Follow the directions on the drug label for the tablet or liquid versions of potassium bromide or as provided by your veterinarian. Potassium bromide is best given with food to help with digestive upset. If digestive upset continues, please contact your veterinarian. Your veterinarian may recommend giving a loading dose of this medication. A loading dose is a larger dose that is given only at the start of treatment. It is given to help the medication quickly reach a certain level in the body that is necessary for it to be effective in treating a specific condition. While your pet is on this medication–salty snacks are not recommended. It is best to check with your pet’s veterinarian before considering any diet changes while your pet is on this medication. Additionally, this medication should not be used in pets with a history of hypersensitivity to Bromide. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of potassium bromide. Generally, they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Potassium Bromide Possible Side Effects Grogginess and decreased balance for the first few days to weeks after starting this medication may be seen. Most pets will adapt to the effects of this medication and return to normal behavior. If your pet is experiencing significant sedation, please let your veterinarian know. Other side effects may include: Lethargy or sedation Irritability or restlessness Increased thirst and urination Increased appetite Weight gain Weakness in the back legs or incoordination Excitability Vomiting Diarrhea Constipation Loss of appetite Liver irritation Human Side Effects This medication is not used in human medicine. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Dogs receiving this medication should be carefully monitored when changing diets or receiving chloride-containing IV fluids or concurrent medications. Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdoseYou have additional questions or concerns about the use of potassium bromidePotassium Bromide Overdose Information Potassium bromide overdoses are most likely to cause neurological side effects including extreme drowsiness, drooling, vomiting, diarrhea, incoordination, tremors, loss of control of the limbs, or even a coma.   Bromism, or bromide intoxication, is a rare side effect that can occur with overdoses of this medication. Signs of bromism include muscle pain, loss of feeling to their limbs, pupil size changes, and other neurological symptoms such as changes in consciousness, drowsiness, incoordination, or tremors. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Potassium Bromide Storage Tablet formulations of potassium bromide should be stored at controlled room temperatures between 68–77 F. Liquid formulations should be stored at controlled temperatures between 59–86 F. Keep the container tightly closed in order to protect it from moisture and light. Always confirm storage requirements by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]