[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for Doxycycline to work in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Doxycycline will start working in your pet’s system in just a few hours, but it can take several days for symptoms to improve. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Doxycycline", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1359342922.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1359342922.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Reptile, Horse, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/doxycycline"}, "datePublished": "February 27, 2023", "dateModified": "September 8, 2023", "description": "Doxycycline is commonly prescribed by veterinarians to treat bacterial infections in dogs, cats, horses, small mammals, birds, and reptiles.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Doxycycline? Doxycycline is a prescription antibiotic medication that treats a wide variety of bacterial infections. It can be prescribed for various types of pets including dogs, cats, horses, small mammals, birds, and reptiles. Doxycycline is commonly used to treat tick-borne diseases like Lyme, Rickettsia, Anaplasma, and Ehrlichia. It is also prescribed for the treatment of leptospirosis. Doxycycline is also in the American Heartworm Society protocol for treatment of heartworm disease. In foals with bronchopneumonia caused by Rhodococcus, doxycycline can be used in combination with other antibiotics to treat this infection. It can also be used in horses for  treatment of joint infections. In birds, doxycycline is used specifically for treatment of chlamydiosis. Doxycycline is also available as a gel, called Doxirobe® Gel (doxycycline hyclate), which is FDA-approved for  the treatment and control periodontal disease in dogs. It is often also used off-label in cats. How Doxycycline Works Doxycycline is a tetracycline antibiotic that works by blocking the bacteria’s ability to make essential proteins required for their survival. Without these proteins, the bacteria’s cell wall becomes compromised, along with their ability to properly replicate and grow. Doxycycline is FDA-approved for use in humans under its generic name and the brand names Avidoxy®, Doryx®, Oracea®, and Vibramycin®. Doxycycline is currently not FDA-approved as a veterinary medication (except for Doxirobe® Gel, as noted above). However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of doxycycline. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Doxycycline Directions Follow the directions on the drug label or as provided by your veterinarian. It is critical that this medication is given with food, as it can cause irritation or ulceration to the esophagus if it spends too much time in the esophagus before reaching the stomach. Giving doxycycline with a small meal or treat can help. That small meal should ideally not contain iron or dairy products, as these can decrease the effectiveness of the medication.It may be recommended to syringe 5 ml of water into the mouths of cats after administering this medication when given as a tablet, or to have doxycycline compounded into a liquid. Certain medications can interfere with the absorption of this medication. It is important to give your veterinarian a complete list of medications that your pet is currently taking. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of doxycycline. Generally, they may instruct you to give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Doxycycline Possible Side Effects Like all other antibiotics, doxycycline can cause gastrointestinal side effects:  Vomiting Diarrhea Anorexia Lack of appetite Lethargy Additional side effects in cats include: Liver irritation Irritation or narrowing of the esophagus Doxycycline and other medications in the tetracycline class should be used with caution in pregnant animals, as well as young animals, because it can permanently stain teeth and disrupt bone growth. Tetracyclines such as doxycycline can also cause increased sensitivity to sunlight. Direct or prolonged sun exposure should be avoided for all animals on this medication. The use of intravenous (into the venous system) doxycycline of a horse should be avoided because it can cause severe side effects such as heart arrhythmias and death. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest doxycycline prescribed for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of doxycycline Doxycycline Overdose Information Doxycycline overdoses are rare. The most common signs of overdose may include digestive upset such as vomiting, diarrhea, and loss of appetite. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Doxycycline Storage Oral formulations of doxycycline should be stored at controlled room temperatures between 68-77 F. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]