[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for Amantadine to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "It’s expected for pets to have a noticeable response to the medication after about a week, but it can take up to 3 weeks to reach its full efficacy.   The information in this article is for educational purposes only and is not a substitute for advice, diagnosis, or treatment from a veterinarian. If you believe your animal is experiencing a medical emergency, call your veterinarian office immediately or seek immediate care from your local animal hospital.  Featured Image: iStock.com/gradyreese"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Amantadine (Symmetrel®, Gocovri®, Osmolex ER®, Endantadine®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/sleepy.puppy__0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/sleepy.puppy__0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/amantadine-symmetrel-gocovri-osmolex-er-endantadine"}, "datePublished": "April 29, 2022", "dateModified": "March 16, 2023", "description": "Amantadine is a medication prescribed off-label by veterinarians for treatment of pain in pets.", "articleBody": "What is Amantadine?  Amantadine is an antiviral drug that was historically used in horses to treat equine influenza. It is now infrequently utilized for this illness and is typically prescribed along with other pain relief medications such as NSAIDS (non-steroidal anti-inflammatory drugs) or gabapentin to treat chronic pain in dogs and cats. Examples of chronic pain that are best treated with amantadine include arthritis, neurologic pain, and pain associated with cancer.  Amantadine is available under the brand names Symmetrel®, Gocovri®, Osmolex ER®, and Endantadine®. This is called extra-label, or sometimes off-label use, because this use isn’t described on the drug label.  How Amantadine Works  Amantadine inhibits the NMDA (N-methyl-D-aspartate) receptor. This is a receptor in the nervous system that binds to neurotransmitters (a chemical used to transfer a nerve impulse from one nerve cell to the next) that can create a sensation of pain. The NMDA receptor is involved in wind-up pain, which causes a feeling of sustained pain when the nervous system is subjected to repeated stimulation. By blocking these NMDA receptors, amantadine helps alleviate chronic pain, especially when used together with other pain control medications.  Amantadine Directions This medication is most often administered daily, but frequency may vary. It can be given with or without food. Follow the directions on the drug label or as provided by your veterinarian.   Missed a Dose?  If you forget to give a dose of amantadine, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.   Amantadine Possible Side Effects  The most common side effects with amantadine are mild and generally resolve with time. These include:  Agitation   Loose or soft stools  Flatulence  Diarrhea  Amantadine also has anticholinergic effects (meaning that it can block the action of certain neurotransmitters responsible for the parasympathetic nervous system), which can cause symptoms of increased thirst, urinary retention, and an increased heart rate.  Human Side Effects  While this is a human prescription medication there are different dosages and side effects that can occur in humans. If you accidentally ingest this medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring  No specific monitoring is required for this medication. However, your veterinarian may recommend routine testing depending on your pets&#039; individual needs to monitor the issue that initially caused your pet to be placed on this medication.  Call Your Vet If:  Severe side effects are seen (see above)  You see or suspect an overdose  You have additional questions or concerns about the use of amantadine  Amantadine Overdose Information  Symptoms of an overdose of amantadine may include tremors (shaking), trouble breathing, lack of coordination, increased salivation, and vomiting. If you suspect an overdose or notice any of these symptoms immediately contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Amantadine Storage  Amantadine should be stored at controlled room temperatures between 68-77°F. It can be briefly exposed to temperatures between 59°-86°F. Keep the container tightly closed when not in use to protect the capsules from moisture and light.  Keep out of reach of children and pets. "}]