[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Frontline® (fipronil + (S)-methoprene)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1053650696_1.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1053650696_1.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/frontline"}, "datePublished": "December 22, 2022", "dateModified": "December 22, 2022", "description": "Frontline® medications are used to treat and prevent fleas in dogs and cats depending on the formulation.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most frequently asked questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. Frontline® Plus Frontline® Plus for Cats includes the ingredients fipronil and (S)-methoprene. Frontline® Plus is used to kill fleas and prevent all flea stages from developing. It protects against brown dog ticks, American dog ticks, lone star ticks and deer ticks. It can also aid in the control of chewing lice. Frontline® Plus is approved for use in kittens and cats 8 weeks of age and older and weighing at least 1.5 pounds. Frontline® Plus for Dogs also includes the ingredients fipronil and (S)-methoprene, but at different concentrations compared to the cat version. Frontline® Plus for Dogs should NOT be used on cats. Frontline® Plus is used to kill fleas and prevent all flea stages from developing. It also protects against brown dog ticks, American dog ticks, lone star ticks, and deer ticks. It may also aid in the control of chewing lice and sarcoptic mange. Frontline® Plus is approved for use in puppies and dogs 8 weeks of age and older and weighing at least 5 pounds. These medications are dosed differently by weight in dogs and cats, so it is important to use the correct species and sized medication for your pet. Using cat medications on dogs or using dog medications on cats can cause serious problems, including lack of efficacy or an overdose.     Frontline® Shield for Dogs Frontline® Shield for Dogs contains the ingredients fipronil, (S)-methoprene and pyriproxyfen but at different concentrations compared to other versions of Frontline®. Frontline® Shield for Dogs should NOT be used on cats. Frontline® Shield is used to kill fleas and prevent all flea stages from developing. It also protects against ticks (Deer, Brown Dog, American and Lone Star Ticks) and aids in the control of chewing lice and Sarcoptes mites. Frontline® Shield also repels mosquitos and stable flies. Frontline® Shield is approved for use in puppies and dogs 9 weeks of age and older and weighing at least 5 pounds. Frontline® Gold Frontline® Gold for Cats includes the ingredients fipronil, (S)-methoprene and pyriproxyfen. Frontline® Gold is used to kill fleas and prevent all flea stages from developing. It also protects against ticks. Frontline® Gold is approved for use in kittens and cats 8 weeks of age and older and weighing at least 1.5 pounds. Frontline® Gold for Dogs contains the ingredients fipronil, (S)-methoprene and pyriproxyfen but at different concentrations than the version intended for use on cats. Frontline® Gold for Dogs should NOT be used on cats. Frontline® Gold is used to kill fleas and prevent all flea stages from developing. It also protects against ticks and aids in the control of chewing lice. Frontline® Gold is approved for use in puppies and dogs 8 weeks of age and older and weighing at least 5 pounds. How Do Frontline® Plus, Frontline® Gold and Frontline® Shield for Dogs Work? The 2 main active ingredients in all Frontline® products are fipronil and (S)-methoprene. Fipronil works by blocking certain messenger channels in the insects’ nervous system, which causes overstimulation and death. (S)-methoprene is chemically similar to a naturally occurring growth hormone found in insects. This similarity allows (S)-methoprene to insert itself into larvae, which blocks their growth into adulthood. It also prevents eggs from being produced in the female insect. An additional active ingredient in Frontline® Shield and Gold products is pyriproxyfen. Pyriproxyfen is also chemically similar to the insect growth hormone chemical. Frontline® Plus, Frontline® Gold and Frontline® Shield for Dogs Directions Frontline® Plus, Frontline® Gold or Frontline® Shield are given once a month and should be administered as close to every 30 days as possible in between doses. Follow the directions on the drug label of the species-specific product or as provided by your veterinarian. These topical products should be applied to the skin after the fur has been parted. Apply the full contents of the product applicator to one location on the skin–between the shoulder blades in dogs and at the base of the neck in cats. Wait 24 hours after applying Frontline® Shield and 48 hours after applying Frontline® Plus and Frontline Gold before giving your pet a bath. If you are bathing your pet before application,  wait until your pet is fully dried to apply a Frontline® product. Do not allow your pet to ingest this medication. Side Effects of Frontline® Side effects with any of the topical Frontline® products are uncommon but may include itching, redness, or irritation at the site of application. If any signs of skin irritation occur, bathe your pet with mild soap and large amounts of water. Rarely, additional side effects may include: Drooling Vomiting Diarrhea If signs persist or become more severe within a few days of application, consult a veterinarian immediately. Missed a Dose? If you forget to give a dose of Frontline® Plus, Frontline® Gold or Frontline® Shield, give it when you remember. Frontline® Plus, Frontline® Gold or Frontline® Shield are given once a month and should be dosed every 30 days. If your veterinarian has directed you to give this medication on a different dosing schedule, please contact them for further instructions if a dose was missed. Do not give extra or double doses. Human Side Effects This medication is not used in human medicine and is harmful if swallowed. Avoid contact with the treated area on your pet until the area is completely dry, and wash your hands with soap and water after applying this product. If you accidentally ingest a pet medication or get this medication in your eyes, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Aside from generally monitoring your pet after application, no specific monitoring is required for this medication. However, most veterinarians routinely screen for parasites during annual exams.   Other specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian, depending on your pet&#039;s individual needs. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Frontline® Plus, Frontline® Gold or Frontline® Shield Frontline® Overdose Information Overdose symptoms will depend on which product was used and on which species of animal. Frontline® products should never be used on rabbits. Topical overdose symptoms may include Scratching, rolling, itchiness Agitation Crying, whimpering When pets are given this medication orally, the following symptoms may be seen: Tremors Lack of coordination Seizures Lethargy Drooling Vomiting Loss of appetite If you suspect an overdose, you used the wrong product on your pet, or you accidentally gave this topical product by mouth, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Frontline® Plus, Frontline® Gold and Frontline® Shield for Dogs Storage Frontline® products should be stored at controlled room temperatures. Store away from heat or open flames. Keep the medication in the provided container until ready for administration in order to protect it from moisture and light.  Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/mladenbalinovac"}]