[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is hydroxyzine the same as Benadryl®?", "acceptedAnswer": {"@type": "Answer", "text": "Hydroxyzine and Benadryl® belong to the same class of medications called antihistamines, but they are not the same medication. Benadryl® is the brand name for the generic medication diphenhydramine, which is typically used in animals to treat acute allergic reactions. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Moyo Studio"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hydroxyzine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1355055860.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1355055860.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/hydroxyzine"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Hydroxyzine is prescribed by veterinarians to treat allergies and atopic dermatitis in many types of pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Hydroxyzine? Hydroxyzine is a prescription antihistamine primarily used by veterinarians for dogs, cats, horses, ferrets, and rabbits to treat allergies, itching, and atopic dermatitis. In birds, it is used most often for feather picking. An animal&#039;s response to an antihistamine can vary between species. An antihistamine that has excellent effectiveness in one pet may not be as effective in another. If your pet is not responding to this antihistamine, please discuss other treatment options with your vet. Hydroxyzine is FDA-approved for human use under its generic name and the common brand names Vistaril® and Atarax®. Hydroxyzine is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use is not described on the drug label. How Hydroxyzine Works Histamine is the chemical that the body produces in response to an allergen. Hydroxyzine works by binding to histamine receptors in the body, thereby preventing histamine from attaching and exerting its effect on the body. In certain circumstances, your vet may recommend a compounded formulation of hydroxyzine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Hydroxyzine Directions Follow the directions on the drug label or as provided by your veterinarian. Hydroxyzine can be given with or without food. If your pet has digestive upset when given this medication on an empty stomach, try giving it with food or a small treat. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of hydroxyzine. Generally, they may instruct you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.  Hydroxyzine Possible Side Effects The most common side effect of this medication is drowsiness. Additional side effects include: Excitement Tremors Seizures Constipation Dry mouth and thirst Human Side Effects While this is a human prescription medication, different dosages and side effects can occur in humans.  If you accidentally ingest hydroxyzine prescribed for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of hydroxyzine Hydroxyzine Storage Hydroxyzine should be stored at controlled room temperatures between 68°-77°F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect this medication from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]