[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can I use human hydrocortisone cream on my dog or cat?", "acceptedAnswer": {"@type": "Answer", "text": "Products intended for humans which contain hydrocortisone are not recommended for dogs or cats. There are some distinct differences between human and animal hydrocortisone products. Speak with your veterinarian about which product is right for your pet, as your vet may find it best to use an FDA approved pet product when treating dogs or cats."}}, {"@type": "Question", "name": "Is hydrocortisone safe for dogs and cats to lick?", "acceptedAnswer": {"@type": "Answer", "text": "Generally speaking, when normal quantities of this medications are used and have dried on the applied area, it’s okay to be licked. If freshly applied medication is licked, it can cause digestive upset. Prevent your pet from licking the area where medication has been applied for at least half an hour."}}, {"@type": "Question", "name": "Can you use over-the-counter hydrocortisone cream on your pet?", "acceptedAnswer": {"@type": "Answer", "text": "Hydrocortisone comes in many forms and is available as over-the-counter cream products made specifically for dogs and cats. For certain skin irritations, over-the-counter pet hydrocortisone cream may be sufficient, but please contact your veterinarian if improvement is not noted within 1-2 days. It is important to note that human formulations of topical hydrocortisone, including human over-the-counter hydrocortisone cream, is for human use only. It is not FDA approved for use in animals.  Featured Image: iStock.com/Pekic   No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Topical Hydrocortisone", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/golden-dog-with-bandana-walking-on-city-street.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/golden-dog-with-bandana-walking-on-city-street.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/topical-hydrocortisone"}, "datePublished": "August 9, 2022", "dateModified": "August 9, 2022", "description": "Hydrocortisone is commonly used on pets for anti-itch and anti-inflammatory medical issues. Hydrocortisone for dogs and cats is available over-the-counter.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Topical Hydrocortisone? Topical hydrocortisone is a type of corticosteroid. It can be found in multiple products, both alone and in combination with other ingredients. It is also available in many forms like creams, shampoos, sprays, ointments, etc. Hydrocortisone is used for its anti-inflammatory and anti-itch effects. Speak with your veterinarian about which topical hydrocortisone product is right for your pet. It is important to note that steroids can inhibit the body&#039;s ability to respond to infections and may worsen skin irritations caused by an infection. Over-the-counter (OTC) hydrocortisone products contain less than 1% of hydrocortisone as the active ingredient. More potent topical hydrocortisone strengths, which are 1% or more, require a prescription from your veterinarian. How Hydrocortisone Works The exact mechanism for how hydrocortisone reduces inflammation and itchiness is not precisely known. Topical hydrocortisone does get absorbed through the skin to be effective in the areas where it is applied. Hydrocortisone Directions Topical hydrocortisone can be the main active ingredient in a spray or cream, or products in conjunction with other medications that include antibiotics or antifungals. The directions for administration will depend on the area of the body that is being treated and the product being used. Please follow all directions on the drug label or as provided by your veterinarian. Hydrocortisone Dosing Speak with your veterinarian about what to do if you forget to give a dose of hydrocortisone. Generally, your vet may advise you to give it when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses.  Hydrocortisone Possible Side Effects Irritation at the application site is the most commonly observed reaction with topical hydrocortisone. Skin irritation may appear as redness, blistering, peeling, swelling, itching, or hives. Long-term use of topical steroids can cause thinning of the skin. Human Side Effects There are different dosages of topical hydrocortisone used in humans and there can be different side effects. Pregnant women, individuals allergic to hydrocortisone, or those sensitive to topical medications should wear gloves when handling their pets’ topical hydrocortisone and wash their hands after exposure. If you accidentally ingest topical hydrocortisone or develop any skin irritation where you have touched this product, seek medical attention or call the national Poison Control Center hotline at 800-222-1222.  Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above)Your pet’s condition worsens or does not improve with treatmentYou see or suspect an overdose.Call your vet or pharmacist if you have additional questions or concerns about the use of topical hydrocortisone. Hydrocortisone Overdose Information Topical forms of hydrocortisone are to be applied on external skin only. Avoid contact with your pets’ eyes and mouth. If you get this product into your pets’ eyes or mouth, contact your veterinarian immediately. While rare, when large amounts of topical corticosteroids are applied, they can by absorbed into the body. This may cause side effects such as increased thirst or urination, vomiting or diarrhea. If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Hydrocortisone Storage Topical hydrocortisone should be stored at a controlled room temperature between 68-77°F. Always confirm storage requirements by reviewing the label. Keep this medication tightly closed in its original container when not in use. Keep out of reach of children and pets."}]