[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for domperidone to work in horses?", "acceptedAnswer": {"@type": "Answer", "text": "Studies have not been performed to establish exactly when domperidone takes effect in horses, but it is thought that it begins working within a few hours of administration. It may take up to several days for your horse to feel better, depending on their level of fescue toxicosis."}}, {"@type": "Question", "name": "What is domperidone used for in horses?", "acceptedAnswer": {"@type": "Answer", "text": "Domperidone is FDA-approved for the prevention and treatment of fescue toxicosis in pregnant mares. It is also used off-label in horses to help diagnose an overactive pituitary gland disorder (pituitary pars intermedia dysfunction, or PPID). The term off- or extra-label use means that a medication can be used in a way or in a particular species that is not specified on the medication label. Veterinarians can legally prescribe certain medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/bluegame"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Domperidone (Equidone® Gel) for Horses", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1327630556.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1327630556.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Horse, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/domperidone-equidone-gel-horses"}, "datePublished": "September 15, 2023", "dateModified": "September 15, 2023", "description": "Domperidone is a prescription equine medication available under the brand name Equidone® Gel. Domperidone is used to prevent fescue toxicosis in pregnant mares. Learn how this medication works, including common side effects, dosing, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Domperidone? Domperidone is a prescription veterinary medication that is FDA-approved for the prevention of fescue toxicosis in pregnant mares. It is available as an oral gel under the brand name Equidone® Gel. Domperidone is also used off-label in horses to help diagnose an overactive pituitary gland disorder (pituitary pars intermedia dysfunction, or PPID). The term off- or extra- label use means that a medication is used in a way or in a particular species that is not specified on the FDA-approved drug label. Your veterinarian will determine whether this medication is right for your animal. Fescue toxicosis typically occurs during the summer months when horses graze on tall fescue grass or ingest the fescue seeds infected with the fungal endophyte, also known as E+. Pregnant mares eating E+-infected fescue may develop an abnormally thick placenta, experience an abnormally long pregnancy (prolonged gestation), and an abnormally positioned fetus that can lead to difficulty giving birth and possible death of the mare and foal. There is also a higher risk of the mare birthing a stillborn foal. Mares that have been consuming E+- infected fescue may not have any milk production from their mammary glands after giving birth. Domperidone Considerations Your veterinarian will need accurate breeding dates and the expected foaling date (EFD) to determine the safe use of domperidone. Domperidone should not be given to mares more than 15 days before their expected foaling date (EFD), as it can result in premature birth, low birth weight, or even death of the foal. It is important to note that domperidone can cause a false positive on the milk calcium test used to predict EFD.           Domperidone should not be used in horses with a sensitivity or allergy to it and in horses with gastrointestinal blockage, gastrointestinal bleeding, or holes (perforations) in the digestive tract. Giving domperidone with certain medications can result in health risks to your horse, so it is important to discuss your horse’s medications and medical conditions with your veterinarian. Speak with your vet to ensure this medication is right for your horse. How Domperidone Works Domperidone is a D2 dopamine receptor blocker. In pregnant mares, it is thought that the E+ fungus causes its harmful toxic effects by stimulating dopamine receptors, which dangerously lowers prolactin, the vital pregnancy hormone responsible for mammary gland growth and milk production. Domperidone works by blocking dopamine receptors, thereby returning the pregnancy hormones to normal levels and functions. It can also block dopamine receptors in the gastrointestinal tract, which increases muscle movement throughout the digestive system to help move food through the tract more quickly. Domperidone Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will instruct you on the proper use of the multidose syringe and how to set the dial ring for accurate dosing after the first dose. When administering domperidone, make sure the horse’s mouth is empty and free of food. If administered more than 15 days prior to the mare’s expected foaling date (EFD), domperidone may result in premature birth, low birth weight, or even death of the foal. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of domperidone. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Domperidone Possible Side Effects The most common side effects of domperidone in pregnant mares may include: Dripping of milk prior to foaling (premature lactation) Abnormally enlarged mammary glands (gynecomastia) Increased white blood cell and granulocyte counts Increased gamma glutamyl transferase (GGT) and/or alkaline phosphatase concentrations Side effects of domperidone in foals born to mares treated with domperidone may include: Diarrhea Failure of the mare’s milk to pass on important maternal antibodies (immunoglobulins, or IgG) for a strong immune system. Domperidone may cause false positives on the milk calcium test used to predict foaling. All foals born to mares treated with domperidone should have their blood levels tested for adequate IgG concentrations. Human Side Effects Domperidone is not for use in humans and is intended only for oral use in animals. Pregnant and lactating women should use caution when handling domperidone, as systemic exposure to domperidone may affect reproductive hormones. Wear disposable gloves at all times while in contact with this medication, and wash your hands after handling. If you are pregnant, trying to become pregnant, or breastfeeding, talk to your veterinarian about using another medication, or ensure that you do not ingest domperidone. If you accidentally ingest this medication, immediately seek medical attention, call your physician, or call the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) The horse’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of domperidone Domperidone Overdose Information Studies have not been performed to evaluate the toxicity of domperidone in animals. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Domperidone Storage Domperidone is an oral gel that should be stored at a controlled room temperature (77 F). Brief exposure to temperatures from 59 F to 86 F is permitted. Ensure the container is recapped after each use and the product is protected from light and moisture. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]