[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for insulin to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "For most diabetic pets, improvement of clinical symptoms occurs quickly after insulin therapy has begun. However, it can take several weeks for a pet to fully adjust to insulin therapy. Every pet responds to insulin therapy differently and frequent monitoring of glucose levels is required for all diabetic pets."}}, {"@type": "Question", "name": "How long does it take for insulin to work in cats?", "acceptedAnswer": {"@type": "Answer", "text": "For cats, as well as dogs, some improvement to clinical signs can be noted quickly after insulin therapy is initiated. It can, however, take several weeks and multiple adjustments to a cat’s insulin dose until a cat becomes stable with their insulin requirements."}}, {"@type": "Question", "name": "Will insulin make my pet sleepy?", "acceptedAnswer": {"@type": "Answer", "text": "Insulin should not make your pet sleepy; it is a naturally occurring hormone that their body produces to help them process sugar into energy. However, having a dose of insulin that is too high for their current blood sugar levels may cause hypoglycemia (low blood sugar) and lethargy (fatigue)."}}, {"@type": "Question", "name": "How long after eating should you give a pet insulin?", "acceptedAnswer": {"@type": "Answer", "text": "Ideally, insulin should be administered to your pet immediately after their meal, but be sure to follow the recommendation from your vet.   No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/PeopleImages"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Insulin For Dogs and Cats (Vetsulin®, Caninsulin®, Humulin®, Humalog®, Lantus®, Levemir®, Novolin®, NovoLog®, ProZinc®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/dog-and-cat-on-vet-table-for-exam.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/dog-and-cat-on-vet-table-for-exam.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/insulin-dogs-and-cats"}, "datePublished": "July 6, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Howe discusses what to expect, including possible side effects, if you have a diabetic pet who requires insulin medication.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. Insulin Overview It can also be used by veterinarians to treat diabetic ketoacidosis (DKA) and hyperkalemia (high blood levels of potassium). There are many kinds of insulin on the market. Insulin is categorized in multiple ways based on how long their effects can last in the body, whether they are porcine (pig) based or a human recombinant product, by cost, or by the concentration of insulin. The most important distinction is that insulin comes in different concentrations. It is critical that your insulin syringes match the concentration of the insulin that you have for your pet. Insulin comes in two concentrations: 40 units of insulin per milliliter (40 U/ml) or 100 units of insulin per milliliter (100 U/ml). The syringes must match the insulin concentration and will be labeled U-40 or U-100. Utilizing the incorrect syringe type will cause your pet not to receive the proper dose of insulin. When treating an uncomplicated diabetic pet, your veterinarian typically selects an insulin based on efficacy in the species and duration of action. Most patients start home use on intermediate or long-lasting insulin. Regular or short-acting insulin are mostly used only in a hospital.  Since dog and pork insulin are essentially the same molecule, porcine based insulins like Vetsulin® or VetPen® are typically recommended for use in newly diabetic dogs. Other options like NPH (Humulin® or Novolin®) insulin are also commonly used in dogs. The cat insulin molecule more closely resembles bovine (cow) insulin. Since protamine zinc insulin (ProZinc®) and glargine insulin (Lantus®) are made from bovine insulin, either of these is recommended in newly diabetic cats to control their blood sugar levels and achieve diabetic remission. Common insulin medications prescribed for dogs and cats include Vetsulin®, ProZinc®, Caninsulin®, VetPen®, Lantus®, Humulin®, Levemir®, Novolin®, NovoLog®, and Humalog®. While only Vetsulin®, and ProZinc®, are FDA-approved, the others are readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. How Insulin Works Glucose is a small sugar molecule that comes from the food our pets eat. It is utilized by their cells for energy. When they eat, their digestive system breaks the food down into simpler sugars which are then absorbed into the bloodstream. Insulin (a hormone made by a pet&#039;s pancreas) helps shift the sugar from the blood into the cells where it can be uses to create energy, thereby lowering the level of glucose in the bloodstream. Insulin administered to diabetic pets is an injectable version of the hormone normally produced by your pet&#039;s pancreas. It is used to help move glucose from the bloodstream and into the cells where it can be used to make energy. Insulin is generally synthesized using recombinant DNA or purified from animal sources. Insulin Directions It is very important that you follow the directions on the insulin label or as provided by your veterinarian. Most pets will need to be given insulin injections twice a day and will be started at a dose recommended by the insulin manufacturer for your pets&#039; weight. Consistent timing, feeding and treatment are essential for the management of diabetes. General recommendations for administration of insulin via vial include: Ensure that your pet has eaten sufficiently before administering insulin. Clean the top of the insulin vial with an alcohol wipe. Roll the vial in between your hands to mix until the insulin appears uniform in color/consistency. Do not shake the vial. Draw up the prescribed amount of insulin in a new syringe. Do not touch the needle. Ensure that your insulin syringe matches your pet’s type of insulin. Accurate measuring of insulin is key. Insulin injections are given just under the skin. Alternating injection locations helps to avoid soreness at the injection site. Have someone help you hold your pet or distract them with a low carb treat. Hold the syringe in one hand and with the other pinch a section of skin into a tent type shape and insert the needle confidently into the center of the tent. Once the needle is under the skin, gently push the syringe plunger all the way down to dispense all the insulin. Carefully withdraw the needle from the skin and dispose of the syringe and needle into an appropriate sharps container. For general recommendations for administration of insulin via insulin pen, you should follow the manufacturer’s instructions and ask your vet. Missed a Dose? If you forget to give a dose of insulin and your pet has eaten recently, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. If you have questions about missed doses please contact your prescribing veterinarian. If you think you did not inject all of the insulin dose into the subcutaneous space under the skin or it seems that some of the insulin came back out, the safest option is to contact your veterinarian. Insulin Possible Side Effects The most common side effect of this medication is due to low blood sugar (hypoglycemia). If pet’s blood sugar levels drop too low, it can be a life-threatening emergency. Mild symptoms of hypoglycemia might include: Weakness/Stumbling/falling down Shaking or tremors Muscle twitching Fatigue (lethargy) Hunger Moderate symptoms may include any of the above, but also: Disorientation Collapse Vomiting Severe symptoms may include any of the above, but also: Seizures Coma Death Additional symptoms related to general symptoms of diabetes are also possible. Insulin Human Side Effects If you accidentally inject yourself with this medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Insulin Overdose  Signs of an overdose of insulin are generally a result of hypoglycemia, or a blood sugar level that has fallen too low. If you notice any of the symptoms of hypoglycemia listed above, please contact your veterinarian or local emergency clinic immediately. Mild hypoglycemia can be treated by having your pet eat an additional meal. However, more serious symptoms should be treated in a hospital by a veterinarian. If you suspect an overdose, or you accidentally gave your pet insulin an extra dose, please immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Monitoring Diabetic patients should be closely monitored. This will include monitoring of symptoms, body weight, appetite, thirst, and the amount of urine excreted. Your veterinarian will typically monitor glucose levels with blood tests when your pet has started treatment with insulin. Periodic monitoring throughout the life of a diabetic pet is important to ensure insulin dosing is effectively correcting patient hyperglycemia (high blood sugar levels). Your vet will recommend appropriate follow-up exams to ensure the dose of insulin is prescribed is working, and provide dosing adjustments if needed. A blood glucose curve is created when blood samples are taken every 2 hours within an approximate 12-hour time period, and the blood glucose levels from these samples are plotted to depict how the glucose levels range throughout the day. This type of test is generally recommended after the first dose of insulin is given or after the first dose of a new insulin type. Your vet will likely recommend 1-2 weeks after any insulin change and every 3 months in a stable diabetic. There are additional monitoring options for diabetic pets your veterinarian may recommend based on each individual patient’s circumstance. Your veterinarian may also recommend additional tests depending on your pet.  Call Your Vet If Severe side effects are seen (see above) or if you see or suspect an overdose Call your vet or pharmacist if you have additional questions or concerns about the use of insulin Insulin Storage Refer to your specific insulin packaging for recommendations on storage instructions. All unopened bottles of insulin should be stored in the refrigerator at consistent temperatures between 36°F to 46°F until the expiration date. Exposure to high temperatures over 86°F or freezing temperatures below 36°F can alter the insulin and lower its ability to work. If you have left your insulin out of the refrigerator, contact your veterinarian, pharmacist, or the insulin manufacturer for specific product recommendations. Insulin manufacturers generally recommend that the product be used within 4-6 weeks of first puncture. Contact your veterinarian for specific information and before starting your insulin. Dispose of used needles and syringes in accordance with all federal, state and local environmental laws. Keep out of reach of children and pets."}]