[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is the difference between furosemide and Salix?", "acceptedAnswer": {"@type": "Answer", "text": "Salix is a brand name of the drug furosemide."}}, {"@type": "Question", "name": "How safe is furosemide for my pet?", "acceptedAnswer": {"@type": "Answer", "text": "Furosemide is a key medication in the treatment of edema (swelling). Side effects such as increased urination and thirst are common but transient. The majority of pets do very well on this medication with minimal side effects."}}, {"@type": "Question", "name": "How long can a dog live on furosemide?", "acceptedAnswer": {"@type": "Answer", "text": "Long-term risks of furosemide are minimal. However, long-term safety and life expectancy is more often linked with the disease process for which the medication is being used."}}, {"@type": "Question", "name": "How long does it take furosemide to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The oral form of furosemide takes approximately one hour, while the injectable works within minutes of administration.         The information in this article is for educational purposes only and is not a substitute for advice, diagnosis, or treatment from a veterinarian. If you believe your animal is experiencing a medical emergency, call your veterinarian office immediately or seek immediate care from your local animal hospital."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Furosemide (Salix ®, Lasix ®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/cocker-spaniel-laying-down-on-floor.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/cocker-spaniel-laying-down-on-floor.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Symptom Checker, Diuretics", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/furosemide"}, "datePublished": "April 18, 2022", "dateModified": "September 12, 2023", "description": "Furosemide is a common medication under the brand names Salix and Lasix, prescribed to treat edema in pets.", "articleBody": "What Is Furosemide? Furosemide is a diuretic used to relieve edema, which is swelling caused by fluid trapped in the body’s tissues. Edema can be caused by heart disease or heart failure, kidney failure, high blood calcium, high blood potassium and/or other non-inflammatory causes of edema. In horses, furosemide is also used to reduce the incidence of exercise-induced pulmonary hemorrhage (EIPH). Furosemide is available under the brand names of Salix and Lasix. How Furosemide Works Furosemide works on the kidneys by changing the balance of electrolytes filtered into the urine. This causes excess water in the body to shift from the tissues and into the urine so edema (swelling) in the body can subside. Furosemide can also play a preventative role in horses with EIPH. By shifting water and electrolytes from the blood into the urine, it lowers blood pressure in the small vessels that travel to the heart and lungs. In doing so, furosemide can prevent pulmonary hemorrhage (bleeding in the lungs). In certain circumstances, your vet may recommend a compounded formulation of a medication. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Furosemide Directions Follow the directions on the drug label or as provided by your veterinarian. Your veterinarian may need to adjust the dosage based on how your pet responds to the medication. Make sure that your pet has access to plenty of fresh water while on this medication. Furosemide Dosing If you forget to give a dose of furosemide, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Furosemide Possible Side Effects Side effects are rare with furosemide. Although increased thirst and urination are expected, they are generally transient. The common side effects listed below are related to fluid and electrolyte changes caused by furosemide: DehydrationAbnormal urine productionElectrolyte imbalancesVomiting and/or diarrheaWeaknessIncreased heart rateDepression or restlessnessDamage to the ear (decreasing the ears’ ability to hear and/or balance)Furosemide should not be used in pets that are incapable of producing urine, have low calcium levels, or have an allergy to furosemide or sulfa drugs. Furosemide should be used with caution in pets with electrolyte abnormalities, dehydration, kidney disease, liver disease, or diabetes. Human Side Effects Furosemide is also used in humans to treat edema. Depending on the amount of furosemide accidentally ingested, it may cause electrolyte imbalances and more urine production in humans as well. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. If you are allergic to sulfa-based medications, you should wear gloves when handling this medication. Monitoring Animals on furosemide should receive periodic blood work to monitor kidney and electrolyte levels during early therapy and periodically thereafter. Your veterinarian may also recommend monitoring your pets&#039; weight, blood pressure, or other testing based on your pets’ individual needs. Call Your Vet If Severe side effects are seen (see above)You see or suspect an overdoseYou have additional questions or concerns about the use of furosemideFurosemide Overdose Information One-time overdoses are likely to cause side effects related to fluid and electrolyte imbalances that are listed above. Toxic doses can lead to convulsions, impaired coordination, paralysis and collapse. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Furosemide Storage Furosemide should be stored at controlled room temperatures between 68-77°F. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]