[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Optimmune® (0.2% Cyclosporine, USP) Ophthalmic Ointment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1127710500.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-1127710500.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cyclosporine-ophthalmic-ointment"}, "datePublished": "August 9, 2022", "dateModified": "August 9, 2022", "description": "Optimmune® is an eye medication used to treat common eye infections in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Optimmune®? Optimmune® (0.2% Cyclosporine, USP) is FDA approved for ophthalmic use in dogs. It is an immune system modulating eye ointment used to treat dry eye (keratoconjunctivitis sicca, or KCS) and pannus (chronic superficial keratitis, or CSK) in dogs. Veterinarians may also prescribe Optimmune® (0.2% Cyclosporine, USP) to treat other inflammatory diseases of the cornea. Dry eye and pannus are both chronic conditions that typically require consistent, life-long care. Optimmune® (0.2% Cyclosporine, USP) is prescribed for these conditions to increase tear production and improve the signs of disease, but it is not a cure.   How Optimmune® Works? The active ingredient of Optimmune® is cyclosporine. Cyclosporine inhibits T cells, a type of white blood cell involved in the immune response. By inhibiting T cells, cyclosporine helps regulate the immune system in dogs with dry eye or pannus. This decreases inflammation on the surface of the eye. Cyclosporine also appears to stimulate the lacrimal gland, which helps produce tears. Decreasing inflammation and increasing tear production can significantly improve the signs of dry eye and pannus in dogs. Optimmune® Directions Follow the directions on the drug label or as provided by your veterinarian. Optimmune is commonly applied every 12 hours. It is important that the medication’s applicator tip does not contact your pet’s eye during application to avoid contaminating the medication. If you are using any other eye drops, it is typically recommended to wait 5-10 minutes before instilling any other medications into the eye. Do not stop using Optimmune® without first talking to your veterinarian. Missed a Dose If you forget to give a dose of Optimmune® (0.2% Cyclosporine, USP), give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Optimmune® Possible Side Effects If your dog develops any new or worsening symptoms during treatment with Optimmune®, please consult your veterinarian. Optimmune® is generally well tolerated, so your veterinarian may determine that symptoms may be from worsening of the underlying disease, in addition to true side effects. Side effects may include: Redness of the eyesWatery eyesEye discomfort - rubbing or “pawing” at the face or eyesEyelid squinting or excessive blinkingRedness or swelling of the eyelidsHair loss around the eyesHuman Side Effects This medication is also used in human medicine, but with different dosages and side effects. If you accidentally ingest or get Optimmune® (0.2% Cyclosporine, USP) in your eye, seek medical attention or call the national Poison Control Center hotline at 800-222-1222.  Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing of tear production and ocular examinations for eye inflammation. Additional testing may be recommended depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above)Your dog’s condition worsens or does not improve with treatmentYou see or suspect an overdose.Call your vet or pharmacist if you have additional questions or concerns about the use of Optimmune® (0.2% Cyclosporine, USP). Optimmune® Overdose Information Overdose of this medication through the ocular application is very rare; however, an overdose may occur if an animal eats the medication. Symptoms of an overdose may include vomiting, diarrhea, inappetence, increased thirst, and urination. If your pet ingests Optimmune® or its packaging, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Optimmune® Storage Optimmune® should be stored at controlled temperatures between 68-77°F. Always confirm storage requirements by reviewing the label. Keep the container tightly closed in order to protect it from moisture and light.   Keep out of reach of children and pets. Featured Image: iStock.com/skynesher No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}]