[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How quickly does Cerenia® work in dogs for prevention of vomiting due to motion sickness?", "acceptedAnswer": {"@type": "Answer", "text": "In dogs 4 months and older, oral maropitant citrate should reach its maximum efficiency at about 2 hours after ingestion. Administer maropitant citrate a minimum of two hours prior to travel with a small amount of food to mitigate vomiting associated with administration of the dose on an empty stomach; however, refrain from feeding a full meal prior to travel."}}, {"@type": "Question", "name": "Does Cerenia® cause loss of appetite in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Most dogs will maintain a normal appetite while taking maropitant citrate, but a loss of appetite is a possible known side effect."}}, {"@type": "Question", "name": "How long does maropitant citrate last in cats?", "acceptedAnswer": {"@type": "Answer", "text": "The injectable version of maropitant citrate, which is approved for use in cats, is labeled to last approximately 24 hours.   Featured Image: iStock.com/kosziv No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cerenia® (maropitant citrate)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-521085904.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/iStock-521085904.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cerenia-maropitant-citrate"}, "datePublished": "August 10, 2022", "dateModified": "August 10, 2022", "description": "Cerenia® is an FDA approved medication used to prevent and treat vomiting caused by motion sickness in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Cerenia®? Cerenia® is the only drug approved by the FDA for use in dogs to help prevent and treat vomiting caused by motion sickness. Cerenia® is also used to treat acute nausea and vomiting in dogs and can alleviate nausea associated with chemotherapy. The injectable formulation is FDA approved for use in both dogs and cats, but the tablets are only approved by the FDA for use in dogs at this time. Many veterinarians may use the tablets as a treatment for vomiting in an off-label manner, meaning in a way that has not been approved by the FDA. This is called extra-label, or sometimes off-label use, because this use is not described on the drug label.  How Cerenia® Works Cerenia® does not target the stomach to decrease nausea. It specifically targets the part of the brain that triggers vomiting (called the emetic center). Due to this effect on the brain, Cerenia® is a potent drug that can treat and prevent vomiting from a wide variety of causes. Cerenia® Directions Generally, to prevent vomiting associated with motion sickness in dogs, administer this medication to your dog, with a small amount of food, at least 2 hours prior to traveling. For other uses of this medication, please follow the directions on the drug label or as provided by your veterinarian. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Cerenia® (maropitant citrate). Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, your veterinarian may instruct you to not give extra or double doses Possible Side Effects of Cerenia® Consult with your veterinarian or seek immediate veterinary medical attention if vomiting continues despite treatment with Cerenia®. Your veterinarian may want to reevaluate your pet to see if a more serious underlying condition is present. In dogs, direct side effects from this medication are rare, but may include: Decreased energy level (lethargy) or sedationDecreased appetite and weight lossDiarrheaIncoordinationExcessive droolingVomiting or retchingTrembling or muscle tremorsIf you believe your pet may be experiencing any side effects of Cerenia®, consult your veterinarian. Human Side Effects Cerenia® (maropitant citrate) is not approved for use in humans. If you accidentally ingest a pet medication, immediately seek medical attention, or call the national Poison Control Center hotline at 800-222-1222. Topical exposure to Cerenia® (maropitant citrate) may elicit localized skin reactions in some individuals. Repeated or prolonged exposure may lead to skin sensitization. Wash hands with soap and water after administering the medication and in case of accidental skin exposure. Cerenia® (maropitant citrate) is also an ocular irritant. In case of accidental eye exposure, flush with water for 15 minutes and seek medical attention. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seenYour pet’s condition worsens or does not improve with treatmentYou see or suspect an overdose.Call your vet or pharmacist if you have additional questions or concerns about the use of Cerenia®. Cerenia® Overdose Information Symptoms of an overdose of Cerenia® may include weight loss, vomiting, soft stools, weakness, lethargy, excessive drooling, decreased heart rate, changes in electrolyte levels and changes in your pets’ white blood cell count or their bone marrow. If you suspect an overdose, immediately seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Cerenia® Storage Cerenia® tablets should be stored at controlled room temperatures between 68-77°F and brief exposure to temperatures 59°-86°F are acceptable. Keep the tablets in the supplied blister packs until use to protect from moisture and light. Always confirm storage requirements by reviewing the label. Keep out of reach of children and pets."}]