[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is sulfasalazine an antibiotic?", "acceptedAnswer": {"@type": "Answer", "text": "Sulfasalazine is in the drug class of sulfa antibiotics, but it is used for its anti-inflammatory effects in the large intestine (colon)."}}, {"@type": "Question", "name": "What is sulfasalazine used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Sulfasalazine may be used for treatment of colitis (inflammatory disease of the large intestine) and vasculitis (inflammatory disease of blood vessels) in dogs. Your veterinarian will determine whether this medication is right for your pet."}}, {"@type": "Question", "name": "Is sulfasalazine available over the counter?", "acceptedAnswer": {"@type": "Answer", "text": "Sulfasalazine is available only by prescription from your veterinarian. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/sanjeri"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sulfasalazine for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1217462491.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1217462491.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/sulfasalazine-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "August 7, 2023", "description": "Sulfasalazine is sometimes prescribed by veterinarians to treat colitis in dogs and cats. Learn how sulfasalazine works, side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Sulfasalazine? Sulfasalazine is a prescription medication that may be used for treatment of colitis (inflammatory disease of the large intestine) in dogs and cats. It is also may be used in combination with other medications to treat vasculitis (inflammation of blood vessels) in dogs. Sulfasalazine is uncommonly used in horses for the treatment of chronic diarrhea. Sulfasalazine should be avoided in pets who are allergic or sensitive to sulfasalazine, sulfas, or salicylates, and in pets with certain medical conditions including intestinal obstruction and urinary obstruction. Cats and certain breeds of dogs, including Doberman Pinschers, Samoyeds, and Miniature Schnauzers, are particularly sensitive to sulfasalazine and may be recommended an alternative medication instead. Your veterinarian will assess your pet’s circumstances and symptoms to determine whether this medication is appropriate. Administering sulfasalazine in combination with certain medications may result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. Sulfasalazine is FDA-approved for human use under the brand name Azulfidine® and the generic sulfasalazine. Sulfasalazine is currently not FDA-approved as a veterinary medication. However, it is occasionally utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs to animals in certain circumstances. This practice is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. Sulfasalzine is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. In certain circumstances, your vet may recommend a compounded formulation of sulfasalazine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Sulfasalazine Works Sulfasalazine breaks down in the body to its active component, 5-ASA, which is responsible for treating colitis by locally targeting and reducing inflammation in the colon. Sulfasalazine Directions Follow the directions on the drug label or per instructions provided by your veterinarian. Generally, your veterinarian will recommend administering sulfasalazine to your pet with food in order to help decrease the risk of digestive upset. Your veterinarian will also recommend providing your pet with plenty of water when they are taking sulfasalazine. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of sulfasalazine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Sulfasalazine Possible Side Effects Sulfasalazine is typically well tolerated in most pets, with the exception of certain breeds mentioned above. Possible side effects in dogs include: Yellow or orange discoloration of skin and body fluids, which may cause staining Loss of appetite Vomiting Abnormal buildup of bilirubin in the bloodstream, a condition known as jaundice Decreased numbers of red and white blood cells Rarely, more serious side effects may occur: Squinting, uncomfortable, red eyes with discharge due to dry eye disease known as keratoconjunctivitis sicca (KCS) Persistent vomiting Diarrhea Paleness Fever Skin rash Sulfasalazine should be used with caution in cats. Possible side effects include: Loss of appetite Vomiting Decreased numbers of red blood cells Human Side Effects While this is a human medication, different dosages and side effects can occur in humans. If you accidentally ingest this medication, immediately seek medical attention. Call your physician or the national Poison Control Center hotline at 800-222-1222. If you are allergic to sulfa or salicylate medications, talk to your veterinarian about the possibility of administering another medication to your pet or ensure that you wear gloves at all times while in contact with this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment. You see or suspect an overdose You have additional questions or concerns about the use of sulfasalazine Sulfasalazine Overdose Information There is little data regarding sulfasalazine overdoses in animals, but significant overdoses can be serious. The severity of a sulfasalazine overdose depends on the species and breed, the amount given, and for how long it was given. Signs of an overdose may vary and may include the side effects listed above. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Sulfasalazine Storage Sulfasalazine should be stored at 68-77 F. Brief exposure to temperatures between 59-86 F are acceptable. Always confirm storage requirements by reading the prescription label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]