[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can I give my pet sucralfate on an empty stomach?", "acceptedAnswer": {"@type": "Answer", "text": "Sucralfate works best on an empty stomach, and is generally given with water at least two hours after other medications have been administered."}}, {"@type": "Question", "name": "How long should a pet stay on sucralfate?", "acceptedAnswer": {"@type": "Answer", "text": "A pet can generally stay on sucralfate for as long as their veterinarian deems it necessary for their current condition. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sucralfate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_320546943.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/AdobeStock_320546943.jpeg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Horse, Ferret, Chinchilla, Reptile, Bird, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/sucralfate"}, "datePublished": "April 10, 2023", "dateModified": "September 8, 2023", "description": "Sucralfate is commonly prescribed by veterinarians to prevent and treat ulcers in dogs, cats, horses, ferrets, chinchillas, reptiles, and birds.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Sucralfate? Sucralfate is a medication used to protect the lining of the digestive tract, specifically the esophagus, stomach, and the upper small intestines. It is available in tablet or liquid form and is effective in preventing ulcers and treating existing ulcers. Sucralfate is used in many species including dogs, cats, horses, ferrets, chinchillas, reptiles, and birds. How Sucralfate Works Sucralfate combines with stomach acid (hydrochloric acid) to form a paste-like coating that binds to the lining of the gastrointestinal system. It also creates a protective barrier over ulcerations in the stomach, duodenum, and esophagus. Sucralfate is FDA-approved for human use under the brand name Carafate® and as generic sucralfate. Sucralfate is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of sucralfate. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Sucralfate Directions Follow the directions on the drug label or as provided by your veterinarian. Sucralfate is generally given by mouth every six to 12 hours. Sucralfate should be given on an empty stomach and at least two hours after other medications have been administered. When using the tablets, it is best to crush and then dissolve the tablets in a small amount of water before administering the slurry by mouth. Shake liquid preparations before administration. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of sucralfate. Generally, they may instruct you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Sucralfate Possible Side Effects Sucralfate is typically well-tolerated and these side effects are generally rare and mild: Constipation Vomiting Drooling Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest sucralfate prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of sucralfate Sucralfate Overdose Information Overdoses of sucralfate are extremely rare, and even large amounts of this medication are well-tolerated. Signs of overdose may include vomiting, constipation, and drooling. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Sucralfate Storage Sucralfate tablets and liquids should be stored at controlled room temperatures between 68-77 F. Do not freeze and always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect it from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]