[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do I need a prescription to buy Bute for horses?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, you will need a prescription for this medication. While there are products available over the counter referred to as “bute-less”, they may not be effective depending on your animal’s condition. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Irina Orlova"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bute (Phenylbutazone, Equi-bute®, VetriBute™)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1402716833.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1402716833.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Horse, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/bute-phenylbutazone-equi-bute-vetribute"}, "datePublished": "November 7, 2022", "dateModified": "November 8, 2022", "description": "Phenylbutazone is a common NSAID prescription medication FDA approved to treat certain musculoskeletal conditions in horses.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Bute (phenylbutazone)? Bute is short for phenylbutazone, a non-steroidal anti-inflammatory (NSAID) prescription medication. Bute is FDA approved for use in horses to treat inflammatory conditions associated with the musculoskeletal system. Many different formulations of this product are available, including tablets, injectable, powder, and paste. It is important to note which product you are using and refer to the product label for additional information. The use of this medication is prohibited in lactating dairy cattle and animals intended for human consumption. What is Bute (phenylbutazone)? Bute is short for phenylbutazone,  a non-steroidal anti-inflammatory (NSAID) prescription medication. Bute is FDA approved for use in horses to treat inflammatory conditions associated with the musculoskeletal  system. Many different formulations of this product are available, including tablets, injectable, powder, and paste. It is important to note which product you are using and refer to the product label for additional information. The use of this medication is prohibited in lactating dairy cattle and animals intended for human consumption. How Bute (phenylbutazone) Works Bute is a non-selective NSAID. It blocks the body’s COX- 2 pathway, which lowers the production of natural chemicals that trigger inflammation, thereby reducing fever and offering pain relief. Due to its non-selective property, Bute also blocks the COX-1 pathway, which can cause the major side effects associated with digestion, kidney health, and clotting. Bute (phenylbutazone) Directions Since there are many formulations of Bute, it is important that you closely follow the directions on the drug label or as provided by your veterinarian. Your veterinarian will determine the appropriate dosage based the animal’s weight, condition, and other medications they may be prescribed. When given by mouth, Bute is usually given once or twice daily with food. Note, when administering oral paste, your animal’s mouth should be empty. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Bute. Generally, they will advise you to give it when you remember or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Bute (phenylbutazone) Possible Side Effects Bute is generally well tolerated in horses. Possible side effects include: Mouth or stomach ulcers Right dorsal colitis – which can present as diarrhea, dehydration, lethargy, decreased appetite, dark mucus membranes and/or increased heart rate Kidney disease Diarrhea Black or tarry stool Loss of appetite Hypoproteinemia (low blood protein levels) which can present as weight loss or swelling of the limbs (edema) When this medication is given as an injection, swelling, inflammation, and wound formation at the injection site is possible. Stop administering Bute at the first sign of gastrointestinal upset, jaundice or blood dyscrasia (abnormal condition or disease of the blood) and speak with your veterinarian. If you believe your pet may be experiencing any other side effects, consult your veterinarian. Human Side Effects Bute is not approved for use in humans. If you accidentally ingest this medication, immediately seek medical attention or call or the national Poison Control Center hotline at 800-222-1222. Monitoring While no specific monitoring is required for this medication, your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. For example, to guard against agranulocytosis (low white blood cell count), your veterinarian may recommend conducting routine blood counts at weekly intervals during the early phase of therapy and at intervals of two weeks thereafter. If your horse needs to be on an NSAID long-term, your veterinarian may wish to discuss alternative medication options or the use of digestive system protective medications while on this medication. Call Your Vet If: Severe side effects are seen (see above) Your animal&#039;s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Bute Bute (phenylbutazone) Overdose Information The most common symptoms of an overdose are: Colic Loss of appetite Stumbling/incoordination Depression Kidney disease Diarrhea/Colitis Black or tarry stools If you suspect an overdose or a small animal gets into this medication, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Bute (phenylbutazone) Storage Please see individual packaging for product-specific storage recommendations. Carefully dispose of used needles in accordance with all federal, state, and local environmental laws. Keep out of reach of children and pets."}]