[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Animax® an antibiotic?", "acceptedAnswer": {"@type": "Answer", "text": "Animax has four active ingredients, one of which is the antibiotic neomycin. Antibiotics are best used to treat specific strains of bacteria that are susceptible to it. Work with your veterinarian to determine what antibiotic would be best for your pet&#039;s condition."}}, {"@type": "Question", "name": "Where should I apply Animax® ointment on my pet?", "acceptedAnswer": {"@type": "Answer", "text": "Animax is used for a wide variety of skin conditions that can occur at any place on your pet&#039;s body. Your veterinarian will provide directions on the exact location to apply Animax® on your pet."}}, {"@type": "Question", "name": "Can I put Animax® ointment on an open wound?", "acceptedAnswer": {"@type": "Answer", "text": "Animax is not intended for use on deep wounds, abscesses, or infections. Deep infections or wounds typically need oral antibiotics. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/AnnaStills"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Animax® Ointment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1292846331.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1292846331.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/animax-ointment"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Animax® Ointment is commonly prescribed by veterinarians to treat various skin infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Animax® Ointment? Animax® is a topical ointment used commonly in the veterinary field. It is made up of a combination of medications: nystatin (antifungal), neomycin (antibiotic), thiostrepton (antimicrobial), and triamcinolone (steroid). Animax® is FDA-approved for the treatment of severe and chronic otitis (ear infection) of varied etiologies, for interdigital cysts in cats and dogs, and for anal gland infections in dogs. This veterinarian-prescribed ointment is also approved to help manage certain skin disorders in both cats and dogs. Animax® is also used in non-food producing horses and cows for skin and ear conditions in an off-label capacity. The term off- or extra- label use means that a medication is prescribed for a certain use, or in a particular species, that is not specified on the medication label.  Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. How Animax® Ointment Works Animax® has four active ingredients: nystatin, neomycin, thiostrepton and triamcinolone. Nystatin is a broad-spectrum antifungal that disrupts and weakens the fungal cell wall. Neomycin is an antibiotic which blocks the formation of key proteins in susceptible bacteria, thereby preventing its growth. Because neomycin is poorly absorbed, it mostly remains on the skin’s surface, making it effective against localized skin bacteria. Thiostrepton is an antimicrobial often used in combination with other active ingredients such as neomycin or nystatin. Triamcinolone is a synthetic corticosteroid utilized to decrease inflammation and itching. Animax® Ointment Directions Follow the directions on the drug label or as provided by your veterinarian. The frequency of application will depend on the issue, severity, and location. The location you apply the medication to may need to be cleaned and dried before use. If you are applying Animax® to your pet&#039;s ear, check with your veterinarian to ensure your pet’s tympanic membrane (ear drum) is not ruptured. Wear gloves when applying this medication or wash hands after use. Do not allow your pet to lick the medication until after the area dries. Missed a Dose? Speak with your veterinarian about what to do if you forget to apply a dose of Animax®. Generally, they may recommend that you apply it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal application schedule. Do not apply extra or double amounts. Animax® Ointment Possible Side Effects Topical irritation at the application site is the most common side effect and may include: Redness Irritation Swelling Temporary hearing loss or deafness, which has been noted in a small number of sensitive pets It is possible, though rare, for topical steroids to become absorbed and cause systemic or body- wide side effects.  Patients should be closely observed for increased appetite, thirst, or urination, and/or weight gain. Also, speak with your veterinarian about the use of this medication if your pet is or becomes pregnant, as data has shown that corticosteroids administered orally or by injection to animals may result in premature birth or birth defects. Human Side Effects This medication is not intended for use in humans. If you accidentally ingest this medication, seek medical attention or call the national Poison Control Center hotline at 800-222-1222.  Monitoring Your pet should be closely observed for increased appetite, increased thirst or urination, and/or weight gain. Otherwise, no specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Animax® Animax® Ointment Overdose Information A typical overdose is not common with this product; however, sensitivity or allergic reactions can occur. When using this product for the ears, if your pet is showing signs of hearing loss, deafness, head tilt, circling, decreased balance, or other signs of inner ear issues (vestibular disease), discontinue use and contact your veterinarian immediately. Avoid ingestion. Ingestion of large quantities of this medication may cause body-wide (systemic) concerns like fluid retention, weight gain, and excessive thirst and urination. Prolonged use or overdosage may suppress your pet’s immune system and may result in its body not producing normal steroids on its own, which can cause dangerous side effects if the medication is stopped abruptly.  If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Animax® Ointment Storage Animax should be stored at controlled room temperatures below 86 F and brief exposure to temperatures up to 104 F are acceptable. Keep the container tightly closed in order to protect from moisture and light.  Always confirm storage temperatures by reading the label. Keep out of reach of children and pets."}]