[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Acetazolamide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-171156062.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-171156062.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/acetazolamide"}, "datePublished": "January 31, 2023", "dateModified": "January 31, 2023", "description": "Acetazolamide is prescribed by veterinarians to treat horses with HYPP (Hyperkalemic Periodic Paralysis). Acetazolamide is sometimes prescribed by veterinarians for the treatment of glaucoma in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Acetazolamide? Acetazolamide belongs to a class of medications called carbonic anhydrase inhibitors, which are typically used in combination with other medications to treat canine glaucoma and feline glaucoma. In horses, acetazolamide is used as an adjunctive treatment for hyperkalemic periodic paralysis (HYPP). How Acetazolamide Works Acetazolamide is a carbonic anhydrase inhibitor. Medications in this class decrease the production of aqueous humor, which is a clear liquid located in the front of the eye. Aqueous humor maintains a certain pressure within the eye, known as the intraocular pressure. In animals with high intraocular pressure, acetazolamide works to decrease the amount of aqueous humor produced, thereby lowering the intraocular pressure. Acetazolamide also causes an increase in the kidney’s ability to excrete certain electrolytes, like sodium and potassium. It also helps stabilize blood sugar and blood potassium levels by prompting the body to make insulin. These two functions are key in acetazolamide’s role in treating hyperkalemic periodic paralysis. While acetazolamide is FDA-approved for use in humans, it is currently not FDA-approved as a veterinary medication. However, acetazolamide is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your veterinarian may recommend a compounded formulation of acetazolamide. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Acetazolamide Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is generally given 2 to 3 times a day, depending on the animal and the reason they were placed on this medication. If your pet experiences an upset stomach while on this medication, giving acetazolamide with food may help. Make sure that your pet has access to fresh water while on this medication. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of acetazolamide. Generally, they may advise you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Acetazolamide Possible Side Effects Acetazolamide can cause stomach upset and kidney damage. Symptoms may include: Nausea Vomiting Diarrhea Loss of appetite Lethargy Excitement Increased thirst or urination Skin rash Electrolyte changes Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of acetazolamide Acetazolamide Overdose Information Acetazolamide overdoses in pets are rare. Symptoms may include severe signs of the side effects listed above. If you observe your pet experiencing severe sedation or seizures, or if you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Acetazolamide Storage Commercially available tablets of acetazolamide should be stored at controlled room temperatures between 68-77 F. Always confirm storage temperatures by reading the label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]