[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What bacteria does Tresaderm® treat?", "acceptedAnswer": {"@type": "Answer", "text": "Neomycin is the antibiotic present within Tresaderm®. It treats many different types of bacteria, including some that infect the ear and skin, such as Staphylococcus aureus, Proteus vulgaris, and Pseudomonas aeruginosa."}}, {"@type": "Question", "name": "Do you need a prescription for Tresaderm®?", "acceptedAnswer": {"@type": "Answer", "text": "Tresaderm® requires a prescription. It is important for a veterinarian to ensure that your pet’s eardrum is intact before starting this medication and to ensure Tresaderm® is the right medication for your pet. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Vonschonertagen"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tresaderm®", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1209013254.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1209013254.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication, Ear health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/tresaderm"}, "datePublished": "December 8, 2022", "dateModified": "December 8, 2022", "description": "Tresaderm is a prescription topical medication used to treat skin and ear infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Tresaderm®? Tresaderm® is a veterinarian-prescribed topical solution used to treat specific skin and ear infections in dogs and cats. Tresaderm contains three active ingredients: neomycin sulfate, dexamethasone, and thiabendazole. This medication is prescribed for the treatment of external ear or skin infections in dogs and cats that are caused by susceptible strains of fungus and bacteria. Tresaderm® is only FDA-approved in dogs and cats but is often used in ferrets for the off-label treatment of ear mites. The term off- or extra-label use means that a medication can be used in a way or in a particular species that is not specified on the medication label. Off- or extra-label use of a medication can only be prescribed by a veterinarian who has direct and personal knowledge of your pet and when there are no other appropriate medications for a particular pet&#039;s circumstances. How Tresaderm® Works Tresaderm® works with three separate components to treat susceptible ear infections: Neomycin is an antibacterial agent active against several common bacteria which infect the ear and skin. Thiabendazole is a broad-spectrum antifungal agent used to treat common yeast and fungal organisms. Dexamethasone is a steroid utilized to decrease inflammation in the ear canal or the skin. Before using this product in the ear, it is important that your veterinarian examines your pet&#039;s eardrum to ensure it is intact to avoid damage to the inner ear. Tresaderm® Directions Follow the directions on the drug label or as provided by your veterinarian. Ensure that the external ear canal or skin area being treated is thoroughly cleaned and dried before treatment. The amount and frequency of administration will depend on what area is being treated, the severity of the infection and the size of the pet. Use with caution around the eyes and wash hands after administering. Application should be limited to a period of not longer than one week. Missed a Dose? Speak with your veterinarian ff you forget to administer a dose of Tresaderm®. Generally, they will advise you to apply it when you remember. However, if it is almost time for the next dose, your veterinarian may recommend you skip the missed dose and resume your normal dosing schedule. In most cases, they may instruct you to not apply extra or double doses.   Tresaderm® Possible Side Effects Topical irritation at the application site is the most common side effect, and it may include: Redness Irritation Discomfort An allergy to neomycin has been seen rarely in dogs and would cause the symptoms above. If you believe your pet is experiencing any side effects, consult your veterinarian. Call Your Vet If: Severe side effects are seen (see above) You see or suspect an overdose Your pet’s condition worsens or does not improve with treatment You have additional questions or concerns about the use of Tresaderm® You see symptoms of a ruptured eardrum (loss of appetite, vomiting, hearing loss, severe ear pain, head tilt, or walking in circles) Human Side Effects This medication is not intended for human use. If you accidentally ingest a pet medication, get this medication in your eyes, or have skin irritation after applying this medication, seek emergency care or the national Poison Control Center hotline at 800-222-1222. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication Tresaderm® Overdose Information A typical overdose is not common with these products; however, sensitivity or allergic reactions can occur. Your pet may show signs of hearing loss, deafness, a head tilt, circling or other signs of vestibular disease. Ingestion of large quantities of this medication may cause body wide (systemic) concerns like fluid retention (swelling), weight gain, and excessive thirst and urination. If you suspect an overdose or if your pet has ingested this product, immediately seek emergency veterinary care or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Tresaderm® Storage Tresaderm® should be stored at controlled refrigerated temperatures between 36-46 F. Keep out of reach of children and pets. Always confirm storage requirements by reviewing the label."}]