[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Enalapril maleate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1319237121.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1319237121.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/enalapril"}, "datePublished": "November 8, 2022", "dateModified": "November 8, 2022", "description": "Enalapril maleate is a prescription medication used to treat hypertension or high blood pressure and congestive heart failure in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Enalapril? Enalapril is a medication that is commonly used to treat high blood pressure (hypertension) and congestive heart failure in small animals. Enalapril can be given alone but is typically used in conjunction with other medications to treat congestive heart failure, especially when caused by degenerative mitral valve disease and dilated cardiomyopathy in dogs. Enalapril can also be used to treat patients with kidney failure or a disease that causes protein to leak into their urine. How Enalapril Works Enalapril is classified as an ACE inhibitor or angiotensin converting enzyme inhibitor. ACE inhibitors help pets with heart disease by lowering blood pressure and widening blood vessels. ACE inhibitors block an enzyme that constricts blood vessels in the body. Once that enzyme no longer affects the body, the blood vessels relax and stay open. This decreases blood pressure and allows blood to circulate smoothly in the body. In pets with kidney disease, ACE inhibitors cause the blood vessels in the kidney to relax. This decreases blood pressure in the kidney and minimizes protein loss into the urine.   Enalapril is only FDA approved for use in dogs (for treatment of mild, moderate, and severe heart failure) and is often used off-label in cats, ferrets, and birds. Veterinarians may also elect to prescribe the human version of this medication, under brand names that include Epaned® and Vasotec®, in an off-label capacity. The term off- or extra- label use means that a medication is used in a way, or in a particular species, that is not specified on the medication label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your veterinarian may recommend a compounded formulation of enalapril. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Enalapril Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is typically given once or twice daily in dogs and cats, every 24 to 48 hours in ferrets, or every 8 to 48 hours in birds. Do not stop or change the amount of enalapril you give your pet unless directed by your veterinarian. This medication can be given with or without a meal. Giving it with a meal can help minimize digestive upset. High salt treats should not be used to give this medication. Your pet should always have access to water while on this medication. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of enalapril. Generally, they may advise you to give it when you remember or, if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Enalapril Side Effects The most common side effects include: Loss of appetite Vomiting Diarrhea Weakness Low blood pressure (hypotension) Cough Changes in thirst and urination Edema (swelling of the limbs) Lethargy Fever Allergic reactions to this medication can occur, symptoms of which may include Swelling of the face or lips Generalized hives Difficulty breathing Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest a pet medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Such monitoring may include blood tests and checking blood pressure. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of enalapril Enalapril Overdose Information Enalapril overdoses can be concerning and require immediate medical attention because of its ability to drastically lower blood pressure and damage kidneys. Signs of extremely low blood pressure include weakness, collapse, or lethargy. Signs of kidney failure include rapid changes in thirst and urination, excessive drooling, inappetence, or a high heart rate. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Enalapril Storage Enalapril tablets should be stored at up to 77 F. Brief exposure to temperatures between 59 F and 86 F are acceptable. Keep the container tightly closed to protect it from moisture and light.   Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]