[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is digoxin used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Digoxin is used off-label in dogs for treatment of congestive heart failure and abnormal heart rhythm (arrhythmia). Your veterinarian will determine whether this medication is right for your pet."}}, {"@type": "Question", "name": "Is digoxin safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Digoxin can be used safely in dogs, but under very specific circumstances and only under the direct supervision of your veterinarian. They will recommend the appropriate dose for your dog based on their individual needs, other medications they may be on, and their age, weight, and breed."}}, {"@type": "Question", "name": "Does my dog need routine testing if prescribed digoxin?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Your pet will need to be monitored and closely supervised by your veterinarian with follow-up visits. Your veterinarian may order blood tests, blood pressure measurement, chest X-rays, or an ECG (electrocardiogram) to monitor your pet’s heart rate and rhythm while they are taking digoxin. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/supersizer"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Digoxin for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1325357562.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-1325357562.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication, Heart Disease in Dogs", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/digoxin-dogs"}, "datePublished": "October 9, 2023", "dateModified": "October 9, 2023", "description": "Digoxin is a prescription medication sometimes used by veterinarians to treat certain types of heart conditions in dogs. Learn how digoxin works, including directions, side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Digoxin? Digoxin is a prescription human heart medication used in dogs and horses to treat certain types of congestive heart failure (CHF) and a dangerously fast heartbeat caused by an abnormal heart rhythm (arrhythmia). If your veterinarian has diagnosed your pet’s arrhythmia as atrial fibrillation or supraventricular tachycardia (SVT) and has identified the underlying cause of the heart problem, they may start treatment with digoxin in combination with other heart medications to help your pet’s heart be stronger and return to a normal rhythm. Digoxin is mostly given as an oral medication, but it can also be given intravenously under direct veterinary supervision within a hospital setting. While digoxin is effective, your veterinarian may instead recommend pimobendan (Vetmedin®), which is an FDA-approved medication for use in dogs that has primarily become the preferred treatment for congestive heart failure due to atrioventricular valvular insufficiency or dilated cardiomyopathy in dogs because it has fewer side effects. Digoxin is FDA-approved for human use under the brand name Lanoxin® and generic digoxin. Digoxin is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your veterinarian may recommend a compounded formulation of digoxin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Digoxin Considerations Treatment with digoxin is complex and highly specific to your pet and their response to the medication, requiring intensive monitoring and close supervision by your veterinarian. Digoxin should not be used in pets with certain medical conditions, such as kidney disease, subaortic stenosis (SAS), and a specific type of arrhythmia called complex ventricular fibrillation. Giving digoxin with certain medications can result in health risks to your pet, so it is important to discuss all of your pet’s medications, including vitamins and supplements, and medical conditions with your veterinarian. How Digoxin Works Digoxin belongs to a class of medications called cardiac glycosides. It works by helping the weak and failing muscles of the heart produce stronger contractions and pump more efficiently. Digoxin helps slow down a racing heart rate and reduce the workload on the heart. Digoxin also has electrical effects on the heart to help restore a normal rhythm. Digoxin Directions Follow the directions on the drug label or as provided by your veterinarian. Digoxin can be given with or without food, but giving it with food can decrease the risk of digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of digoxin. The dosing schedule for digoxin is highly specific to your pet and their medical needs. Generally, your veterinarian may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Digoxin Side Effects Digoxin has a narrow margin of safety, meaning that even a small amount given over the prescribed dose can result in poisoning or toxicity. Follow your veterinarians prescribing instructions carefully to avoid an overdose. Side effects may include: Gastrointestinal upset—loss of appetite (anorexia), vomiting, diarrhea Weight loss Worsening heart failure—cough, low energy, inability to exercise, breathing problems Worsening arrhythmia—fainting, collapse It can be difficult to tell if these side effects in your pet are from their heart disease worsening on its own or from digoxin toxicity. Your veterinarian may need to check your pet’s blood digoxin levels to ensure they are not too high if your pet has these symptoms. Human Side Effects Digoxin is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for human use. If you accidentally ingest this medication, immediately seek medical attention or call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of digoxin Digoxin Overdose Information Overdoses of digoxin can be life-threatening. The severity of a digoxin overdose depends on the species, the amount given by weight, and for how long it was given. Symptoms may vary but can include loss of appetite, vomiting, diarrhea, worsening heart disease, and worsening arrhythmia. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Digoxin Storage Digoxin should be stored at controlled room temperatures from 68 to 77 F. Keep the container tightly closed to protect its contents from moisture and light. Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]