[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can dogs take propranolol for anxiety?", "acceptedAnswer": {"@type": "Answer", "text": "No. Propranolol does not help with anxiety in dogs. It is used as a heart medication for treatment of arrhythmias, hypertension, and a rare birth defect of the heart known as Tetralogy of Fallot, a combination of four congenital heart defects."}}, {"@type": "Question", "name": "How much propranolol can a dog take?", "acceptedAnswer": {"@type": "Answer", "text": "With any medication, the safest way to know the proper dose for your dog is to ask your veterinarian and follow the directions on the drug label. Your veterinarian will recommend the appropriate dose for your dog depending on their individual needs, other medications they may be on, and their age, weight, and breed. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/FamVeld"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Propranolol for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1418606500.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1418606500.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/propranolol-dogs-and-cats"}, "datePublished": "September 15, 2023", "dateModified": "September 15, 2023", "description": "Propranolol is a prescription medication often used by veterinarians to treat various heart conditions in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Propranolol? Propranolol is a prescription heart medication used in dogs and cats for the treatment of several medical conditions: an abnormal heart rhythm (arrhythmia) that causes unusually fast heart rates (tachycardia); high blood pressure (hypertension); and a rare congenital heart condition called Tetralogy of Fallot. Propranolol may also be used short-term to manage abnormal heart rhythm and high blood pressure in cats with hyperthyroidism and in dogs with a rare type of adrenal gland tumor called pheochromocytoma. Propranolol is also available in a hospital setting as an injection and is administered under direct veterinary supervision. Compared to other similar heart medications in the same category, propranolol is not absorbed as effectively in the gastrointestinal tract and does not last as long, which requires more frequent administration throughout the day. Your veterinarian may elect to use another medication for your pet rather than propranolol. Propranolol is FDA-approved for human use under the brand names Inderal®, InnoPran®, and Hemangeol®, and in multiple generic forms. Propranolol is not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of propranolol. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Propranolol Considerations Propranolol should not be used in pets with certain medical conditions, such as congestive heart failure, slow heart rate (bradycardia), specific heart arrhythmias called second- or third-degree atrioventricular block, certain types of breathing (respiratory) conditions, or in pets that are hypersensitive to it. Giving propranolol with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. It is important to note that your pet needs to be monitored and closely supervised by your vet with follow-up visits while on this medication. Your veterinarian may recommend blood pressure measurements and an ECG (electrocardiogram) to monitor their heart rate and rhythm. How Propranolol Works Propranolol is a heart medication classified as a beta-blocker. Propranolol blocks beta receptors in the heart, which helps relax the heart to slow down the rapid heart rate. It also blocks beta receptors in the muscles that line blood vessels, which helps them relax to decrease blood pressure. Propranolol Directions Follow the directions on the drug label or as provided by your veterinarian. Propranolol can be given with or without food, but giving it with food can decrease the risk of digestive upset. When starting this medication, your veterinarian may start with a low dose and gradually adjust the dosage and frequency appropriately, depending on how well it is working for your pet. It is important that you follow your veterinarian’s directions carefully. Propranolol should be used with caution in pets with kidney disease, liver disease, or diabetes. Do not suddenly stop giving your pet propranolol. If your veterinarian recommends that you discontinue this medication, they will typically recommend that you wean your pet off the medication slowly, and under their supervision, especially if your pet has been taking propranolol long-term. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of propranolol. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.  Propranolol Possible Side Effects Side effects of propranolol may include: Tiredness, lack of energy (lethargy) Slowed heart rate (bradycardia) Low blood pressure (hypotension) Collapse Diarrhea Worsening of heart failure Low blood sugar (hypoglycemia) Wheezing, cough, or trouble breathing These adverse effects may occur more often in older pets and in pets with unstable heart disease. Human Side Effects Propranolol is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human’s use. If you accidentally ingest this medication, seek medical attention, call your physician, or call the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of propranolol Propranolol Overdose Information Propranolol has a narrow margin of safety, meaning that only a small amount given over the prescribed dose can result in toxicity. Overdoses of propranolol can be life-threatening and require hospitalization. Symptoms of an overdose may include nausea, vomiting, very slow heart rate (bradycardia), weakness, abnormally low blood pressure (hypotension), trouble breathing, fainting or collapse, abnormally low blood sugar (hypoglycemia), seizures, heart failure, or kidney failure. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Propranolol Storage Propranolol should be stored at a controlled room temperature from 68 to 77 F. Always confirm storage requirements by reading the prescription label. Protect from freezing and excessive heat. Keep the container tightly closed to protect its contents from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]