[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can you get ampicillin for dogs without a veterinarian’s prescription?", "acceptedAnswer": {"@type": "Answer", "text": "No. Ampicillin is only available by prescription for administration by a licensed veterinarian in an animal hospital setting. It is not available for administration at home. Your veterinarian’s professional expertise is needed to accurately diagnose your pet’s infection, to determine if the bacteria involved are susceptible to ampicillin, and to administer the injection while your pet is hospitalized."}}, {"@type": "Question", "name": "Are ampicillin and amoxicillin the same?", "acceptedAnswer": {"@type": "Answer", "text": "No. Ampicillin and amoxicillin are different medications that are both categorized as penicillin antibiotics. Ampicillin is given by injection by a licensed veterinarian, whereas amoxicillin is given to a pet orally."}}, {"@type": "Question", "name": "What is ampicillin used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Ampicillin is an injectable antibiotic administered to dogs to treat susceptible bacterial infections such as leptospirosis and other bacterial infections of the respiratory tract and skin. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/BraunS"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ampicillin for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-498304126.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-498304126.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ampicillin-dogs-and-cats"}, "datePublished": "August 15, 2023", "dateModified": "October 6, 2023", "description": "Ampicillin is an uncommon prescription medication sometimes used by veterinarians to treat bacterial infections in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Ampicillin? Ampicillin is a prescription penicillin antibiotic used to treat susceptible bacterial infections in dogs and cats. The injectable form of ampicillin is FDA-approved for use in dogs, cats, horses, and cattle to treat susceptible respiratory tract and skin infections. Ampicillin is also used in dogs for certain bacterial infections. including leptospirosis. Due to ampicillin’s poor absorption in the gastrointestinal tract, the oral form of ampicillin is rarely prescribed in favor of other oral penicillin antibiotics such as amoxicillin or Clavamox® . It is important to note that ampicillin is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Ampicillin is given to humans by injection by a healthcare provider and is available as a generic medication. Due to possible side effects, pets should not be administered any medication prescribed for humans. Ampicillin should not be prescribed to certain species such as rabbits, guinea pigs, chinchillas, or hamsters, as life-threatening inflammation of the gastrointestinal tract can occur.  How Ampicillin Works Ampicillin is in the drug class of penicillin antibiotics. It prevents susceptible bacteria from creating a necessary part of their cell walls, thereby weakening and destroying them, which causes the bacteria to die. Ampicillin Directions Ampicillin is only available by prescription for administration at a veterinary hospital. It is not available for administration at home because your veterinarian’s professional expertise is needed to accurately diagnose your pet’s infection, both to determine if the bacteria involved are susceptible to ampicillin and to administer the injection while your pet is hospitalized. Ampicillin Possible Side Effects Ampicillin is generally well tolerated in dogs and cats. Allergies to penicillin antibiotics in animals are rare but can happen. Symptoms may include: Skin rashes Fever Collapse Difficulty breathing Swollen lymph nodes Human Side Effects Ampicillin is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. If you are allergic to penicillin antibiotics, talk to your veterinarian about using another medication or ensure that you wear gloves at all times while in contact with this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of ampicillin Ampicillin Overdose Information An overdose of ampicillin is unlikely to cause toxicity. Large overdoses and prolonged use of ampicillin may cause a lack of coordination, seizures, breathing problems, fluid retention, or rapid heart rate. Penicillin allergies in pets are rare but can happen. Signs of an allergic reaction include skin reactions, watery eyes, hives (urticaria), facial swelling, vomiting, diarrhea, and anaphylaxis. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Ampicillin Storage Your veterinarian will properly store ampicillin at the hospital in its original powder form at controlled room temperatures between 68 F and 77 F until it is ready to be mixed and administered to your pet. Keep out of reach of children and pets."}]