[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Baytril® (enrofloxacin)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-913083964.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-913083964.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/baytril"}, "datePublished": "January 23, 2023", "dateModified": "February 3, 2023", "description": "Baytril® is prescribed to treat a variety of infections in pets, including rabbits, birds, rats, and reptiles.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Baytril®? Baytril® is the brand name for a prescription antibiotic called enrofloxacin. Enrofloxacin is an antibiotic in a class called fluoroquinolones, which treat a wide variety of bacteria. It is FDA-approved for use in dogs and cats to manage diseases associated with bacteria that are susceptible to enrofloxacin. In dogs, it is commonly used to treat certain respiratory, urinary tract, and skin infections. In cats, the medication is commonly used for skin infections. In large non-food producing animals, it is commonly used for certain respiratory and skin infections. In non-food producing birds, reptiles, rabbits, ferrets, rats, and other small mammals, Baytril® is often used for susceptible respiratory infections. The tablet version of Baytril® is FDA-approved for use in dogs and cats, while the injectable version is approved for use in dogs only. However, it is readily utilized in the veterinary field across many different species, such as non-food producing cattle, horses, small mammals, reptiles, and birds for off-label uses.  The term off- or extra-label means that a medication is used in a way or in a particular species that is not specified on the medication label. While veterinarians often prescribe medications for off-label uses, your veterinarian will determine whether Baytril® is right for your pet.   It is important to note that Baytril® is not recommended for use in dogs during the rapid growth phase. Baytril® and other antibiotics of the fluoroquinolone class can cause abnormal cartilage development in growing animals. This is especially true for growing foals. Speak with your veterinarian about whether your pet is still in its growth stage. How Baytril® Works Fluoroquinolone antibiotics work by blocking bacteria’s’ DNA replication, which prevents the bacteria from multiplying. In certain circumstances, your vet may recommend a compounded formulation of Baytril®. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Your veterinarian will determine whether a compounded medication is right for your pet. Baytril® Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is best given on an empty stomach and is generally given once daily. If giving this medication on an empty stomach causes stomach upset, then giving it with a small amount of food is an option. Please contact your veterinarian if your animal vomits while on this medication. Animals on this medication should have consistent access to water. Injectable versions of this medication are available only for slow administration into the vein by a trained veterinary professional. The injectable version of enrofloxacin is sometimes given to horses orally via off-label use, but it can be irritating to the mouth and throat when given this way. Talk with your veterinarian about whether this medication is right for your pet.   Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Baytril®. Your veterinarian may recommend that you give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Speak with your veterinarian regarding specific dosing instructions for your pet. In most cases, do not give extra or double doses. Baytril® Possible Side Effects Like all antibiotics, Baytril® can cause gastrointestinal side effects, including:  Vomiting Diarrhea  Lack of appetite Abdominal pain Rarely, the following severe side effects may occur: Incoordination Liver irritation Depression Lethargy Seizures Nervousness Aggression Vocalization When used at higher doses in cats, this medication can negatively affect the eyes, causing dilated (larger) pupils, retinal degeneration, and blindness. If you notice your cat’s pupils are larger than usual while on this medication, immediately contact your veterinarian or seek emergency veterinary care. This medication is not recommended for use in growing animals of any species. Baytril® and other antibiotics of the fluoroquinolone class can cause abnormal cartilage development in growing animals. Speak with your veterinarian regarding risks associated with growing animals before administering this medication. Baytril® and other medications in the fluoroquinolone class can cause increased sensitivity to sunlight. Direct or prolonged sun exposure should be avoided when on this medication. Human Side Effects This medication is not intended for use in humans. Avoid contact with eyes, and in case of contact immediately flush eyes with copious amounts of water for 15 minutes. In case of skin contact, wash skin with soap and water. Consult a physician if irritation persists.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.    Monitoring Bacteria specimens for susceptibility testing should be collected prior to the initiation of enrofloxacin therapy. Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment. You see or suspect an overdose You have additional questions or concerns about the use of Baytril® (enrofloxacin) Baytril® Overdose Information The severity of an enrofloxacin overdose depends on the species and the amount given by weight. In dogs, the most common symptoms are vomiting, loss of appetite, lethargy, and incoordination. In cats, overdoses may cause serious effects to the nervous system such as seizures and blindness. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Baytril® Storage Baytril® should be stored at or below 77 F. Keep the container tightly closed to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/AzmanJaka"}]