[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Entyce® and Elura®", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1158789001.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1158789001.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/entyce-and-elura"}, "datePublished": "November 1, 2022", "dateModified": "November 1, 2022", "description": "Entyce® and Elura® are two separate medications that can be prescribed to dogs and cats to increase appetite.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What are Entyce® and Elura®? Entyce® and Elura® are both medications that may help pets improve their appetite. Entyce® is FDA approved for dogs as an appetite stimulant, while Elura® is FDA approved for cats to help manage weight loss associated with chronic kidney disease. Entyce® and Elura® come in liquid form and are administered orally. Both contain capromorelin as their active ingredient, but at different concentrations. How Entyce® and Elura® Work Capromorelin is the active ingredient in Entyce® and Elura®. Capromorelin is a ghrelin-receptor agonist that increases the production of growth hormone within the body and signals the brain’s hypothalamus to stimulate appetite. Speak with your veterinarian about whether Entyce® and Elura® are right for your pet. Both products should not be used in dogs and cats that have a hypersensitivity to capromorelin, and Elura® should not be used in cats with hypersomatotropism (acromegaly). Entyce® and Elura® Directions Entyce® and Elura® are both liquid oral medications. Follow the administration directions on the drug label closely or as directed by your veterinarian.Your veterinarian will determine the appropriate dosage based on your pet’s weight. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Entyce® or Elura®. Generally, they may advise you to give the dose when you remember. However, if it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses.   Entyce® and Elura® Possible Side Effects Side effects in dogs and cats may include: Diarrhea Vomiting Drooling Belly pain Nausea Flatulence Increased thirst Lack of energy Additional side effects of Elura® in cats may include: Loss of appetite Changes in behavior Anemia (low red blood cell count) Dehydration If you believe your pet may be experiencing any side effects, consult your veterinarian. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Entyce® or Elura® Human Side Effects This medication is not approved for use in humans. If you accidentally ingest a pet medication, immediately seek medical attention or call the national Poison Control Center hotline at 800-222-1222. Monitoring For cat parents: Elura® mimics the action of a naturally-occurring hormone called ghrelin. Ghrelin influences many systems in the body and Elura® may also affect these systems. As such, your veterinarian may instruct you to monitor for changes in thirst or water intake; lethargy or weakness; digestive issues (vomiting, diarrhea, drooling, decreased appetite); or behaviors. Typically, no other specific monitoring is required for Elura® or Entyce®, but your veterinarian may recommend routine testing depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Keeping a log of your pet’s food intake and body weight can help to monitor their response to this medication. Entyce® and Elura® Overdose Information Signs of Entyce® overdoses in dogs include drooling, red or swollen paws, liver damage, and pale skin or gums. Cats who receive overdoses of Elura® may experience vomiting, drooling, and lethargy. If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Entyce® and Elura® Storage Entyce® and Elura® should both be stored at controlled room temperature at or below 86 F. Keep the container tightly closed to protect from moisture and light.  Keep out of reach of children and pets."}]