[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much does mitotane cost for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The cost for mitotane can vary for a dog from month to month. It primarily depends on the dosage your veterinarian prescribes, your dog’s weight, health status, and other medications your pet is taking. Your dog needs to be intensely monitored and closely supervised by your vet with follow-up visits and lab work while they are taking this medication. Your veterinarian will adjust the dosage and frequency of mitotane appropriately."}}, {"@type": "Question", "name": "How long does it take for mitotane to work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Certain signs of improvement, such as drinking less, urinating less, and resolution of a ravenous appetite, are typically observed within 5 to 14 days of starting mitotane. Contact your vet when you notice these improvements so that your dog can be tested for their next phase of treatment."}}, {"@type": "Question", "name": "Does Lysodren® treat Cushing’s disease in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Lysodren® (mitotane) is used for treatment for Cushing’s syndrome in dogs, specifically when there are clinical signs from the condition—increased thirst, increased urination, increased appetite, haircoat changes, skin conditions, distended abdomen, muscle atrophy, and urinary tract infections. Lysodren® (mitotane) is only FDA-approved for human use. However, veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/DragonImages"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Mitotane (Lysodren®) for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1421312458.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1421312458.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication, Cushing&#039;s Disease", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/mitotane-lysodren-dogs"}, "datePublished": "September 15, 2023", "dateModified": "September 15, 2023", "description": "Mitotane is a prescription medication available under the brand name Lysodren® for management of symptoms related to Cushing’s disease in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Mitotane? Mitotane (brand name Lysodren®) is a prescription medication that has been used to treat Cushing’s syndrome in dogs and ferrets that are experiencing symptoms and have a confirmed diagnosis for Cushing’s through laboratory testing. While mitotane is effective, your veterinarian may instead recommend trilostane (Vetoryl®), which is an FDA-approved medication for use in dogs with Cushing’s syndrome, as it is considered safer with fewer side effects. Mitotane is FDA-approved for human use under the brand names Lysodren® and generic mitotane. Mitotane is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of mitotane. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Mitotane Considerations Mitotane should be used with caution in pets with certain medical conditions, such as pregnancy, diabetes, kidney disease, and liver disease, and should be avoided in pets who are hypersensitive to it. Giving mitotane with certain medications can result in health risks to your pet, so it is important to discuss all your pet’s medications, supplements, and medical conditions with your veterinarian. Mitotane can decrease the body’s ability to handle stress. In the case of an injury, trauma, or surgery, it is important to tell your veterinarian that your pet is taking this medication. Medications such as dexamethasone or prednisone may be needed for your pet during those times of immune system stress. Mitotane should never be given to sick pets with poor appetite, low energy, vomiting, diarrhea, weakness, or loss of balance. Your veterinarian will determine whether this medication is right for your pet, based on their symptoms and traits. Treatment with mitotane is complex, requiring monitoring and close supervision by your veterinarian. How Mitotane Works In pets with Cushing’s syndrome, a tumor in the pituitary gland stimulates the adrenal glands to overproduce cortisol, resulting in harmful effects in the body. Mitotane is a cytotoxic agent that slowly destroys the cells in the adrenal glands by blocking certain proteins that are key to its survival, thereby controlling the amount of cortisol produced. Mitotane does not cure Cushing’s syndrome, but it can manage the disease and improve quality of life. Mitotane Directions Follow the directions on the drug label or as provided by your veterinarian.  Mitotane is absorbed best when given on a full stomach, especially if the food is high in oil and fat. Ensure your pet has access to plenty of water. Your veterinarian may also prescribe a glucocorticoid for your pet such as dexamethasone or prednisone to administer in case of an emergency, sudden illness, injury, or surgery. Do not give this medication if your pet is ill and experiencing vomiting, diarrhea, poor appetite, weakness, or stumbling. Mitotane should be avoided in pregnant and lactating pets. Missed a Dose? Speak with your veterinarian right away about what to do if you forget to give a dose of mitotane. The dosing schedule for mitotane is complicated and highly specific to your pet and their medical needs. Your vet will instruct you when to give the next dose. Do not give extra or double doses. Mitotane Possible Side Effects Treatment with mitotane can sometimes result in dangerously low levels of cortisol and cause a serious condition known as Addison’s disease. Possible side effects of mitotane include: Low energy (lethargy) Loss of balance (ataxia) Weakness Loss of appetite Vomiting Diarrhea It is important that you contact your veterinarian right away if you notice any of the above signs. Long-term therapy with mitotane can result in harmful liver changes, especially in pets with preexisting liver disease. Central nervous system (CNS) toxicity, including sedation, lethargy, and vertigo can also occur with treatment.  This is a long-acting medication, so side effects may last for several days, even after you have stopped administering the medication to your pet. Side effects may last for a longer time in animals with liver or kidney disease. Human Side Effects Wear disposable gloves at all times when in contact with this medication and wash your hands after handling. Mitotane is also a prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human’s use. In humans, mitotane can cause birth defects and fetal death. If you are pregnant, trying to become pregnant, or breastfeeding, avoid contact with mitotane or talk to your veterinarian about using another medication. If you accidentally ingest this medication, immediately seek medical attention, call your physician, or call the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen in your pet (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of mitotane Mitotane Overdose Information Overdoses of mitotane can be life-threatening and result in severe illness known as Addisonian crisis. Symptoms of an overdose may include vomiting, diarrhea, poor appetite, low energy level, weakness, or stumbling. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call  an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Mitotane Storage Mitotane should be stored at controlled room temperature of 77 F. Brief exposure to temperatures from 59 to 86 F is permitted. Keep the container tightly closed in order to protect its contents from moisture and light. Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]