[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is the cost of Palladia® for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The cost for toceranib can vary depending on the dosage and treatment schedule your veterinarian recommends, your dog’s weight, the type and stage of cancer being treated, their health status, and their individual needs. Your veterinarian will adjust the dosage and frequency throughout the treatment."}}, {"@type": "Question", "name": "Is Palladia® considered chemo medication for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "No. Palladia® (active ingredient toceranib) is a prescription FDA-approved veterinary anti-cancer medication, but since it does not directly kill rapidly dividing cancer cells, it is not considered a chemotherapy medication."}}, {"@type": "Question", "name": "What is the success rate of Palladia® for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Several factors influence the success rate of Palladia® in a dog—the type of cancer diagnosed, the stage at which the cancer is diagnosed, and the dog’s health status."}}, {"@type": "Question", "name": "How long can a dog be prescribed toceranib?", "acceptedAnswer": {"@type": "Answer", "text": "There is no defined period of time that a dog can be prescribed toceranib. Treatment is continued if toceranib is effective and your dog is tolerating treatment. To best determine the duration of your dog’s treatment, your veterinarian will perform tests to assess their response to treatment, depending on the type and stage of cancer being treated. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: Getty/Tashi-Delek"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Toceranib (Palladia®) for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-930934742%20%281%29.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/GettyImages-930934742%20%281%29.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/toceranib-palladia-dogs"}, "datePublished": "October 9, 2023", "dateModified": "October 9, 2023", "description": "Palladia® (toceranib) is a FDA-approved prescription medication used to treat certain types of mast cell tumors in dogs. Learn how toceranib works, including directions, side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Toceranib (Palladia®)? Toceranib (brand name Palladia®) is an FDA-approved prescription veterinary anti-cancer medication for treatment of grade II and grade III mast cell tumors (MCTs) in dogs. It has also been used off-label to treat a wide variety of other cancers in dogs, such as sarcomas, carcinomas such as bladder cancer and mammary cancer, anal sac adenocarcinoma, melanomas, and bone marrow cancer (multiple myeloma). It is currently recommended as a solo medication for certain cancers in dogs, but veterinarians combine it with other anti-cancer treatments. Toceranib has also been used off-label to treat certain cancers in cats. The term off-label use means that a medication is used in a way or in a particular species that is not specified on the FDA-approved drug label. Your veterinarian will determine whether this medication is right for your pet. Toceranib is available from the manufacturer as an oral tablet. In certain circumstances, your vet may recommend a compounded formulation of toceranib. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Toceranib (Palladia®) Considerations Due to the potential risk of toxicity to pets, veterinary staff, and pet parents, and because chemotherapy treatment protocols and monitoring guidelines often change, it is best to consult with a board-certified veterinary oncologist about the use of toceranib in your pet. If they determine toceranib to be an appropriate treatment option, they will also recommend an appropriate dose and schedule for your pet. Treatment with toceranib requires intensive monitoring and close supervision by your veterinarian. Before and during your pet’s treatment, your vet will perform blood and urine tests to evaluate their immune system function as well as the effects of the drug on the liver and kidneys. Toceranib should not be used in pets that are less than 24 months of age or that weigh less than 11 pounds, or in pets that are pregnant or nursing. Toceranib should not be used three days before surgery or up to two weeks after surgery, as it can prolong healing time and increase the risks of swelling and blood clots. Giving toceranib with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. How Toceranib (Palladia®) Works Toceranib belongs to a class of medications known as tyrosine kinase inhibitors (TKIs). Toceranib is an anti-cancer medication but it is not considered chemotherapy, as it does not directly kill rapidly dividing cancer cells. Toceranib works by blocking tyrosine kinase receptors on the surface of cancer cells and nearby blood vessels. This cuts off the cancer’s blood vessel supply, thereby removing its source of oxygen and nutrients that are key to its survival. Toceranib (Palladia®) Directions Follow the directions on the drug label or as provided by your veterinarian. Wear gloves when handling toceranib phosphate. Do not break, split, or crush tablets. Toceranib can be given with or without food, but giving it with food can decrease the risk of digestive upset. Toceranib should be avoided in pregnant and lactating pets. Missed a Dose? The dosing schedule for toceranib is highly specific to your pet and depends on their medical needs and the type of cancer or condition being treated. Speak with your veterinarian right away about what to do if you forget to give a dose of toceranib. Do not give extra or double doses. Toceranib (Palladia®) Possible Side Effects Side effects of toceranib may include: Gastrointestinal upset—diarrhea, decreased appetite, vomiting Low energy (lethargy) Weight loss Fresh blood in vomit or stools Black tarry stools Bleeding and bruising Toceranib has a moderate duration, which means its side effects may last for several days, even after you have stopped administering the medication to your pet. Side effects may last for a longer time in animals with liver or kidney disease. Human Side Effects Toceranib is a veterinary anti-cancer drug that is not used in humans. It can be hazardous to other animals and people who encounter it. If you are pregnant, trying to become pregnant, or breast-feeding, talk to your veterinarian about the possibility of administering an alternative medication to your pet. Your veterinarian will give you specific instructions including (but not limited to) the following precautions: Ensure that you do not ingest this medication. Wear disposable gloves while in contact with this medication and wash your hands with soap and water after handling. If any medicine contacts your skin, wash it off immediately and contact your physician or the national Poison Control Center. If you have “hidden” toceranib in your dog’s food, make sure that your dog has eaten the entire dose. This will minimize the potential for exposure to children or other household members. Toceranib and its byproducts are found in a treated animal&#039;s secretions and bodily waste, including saliva, vomit, urine, stool, blood, and litter. Wear disposable gloves when cleaning up waste and handling the cat litterbox. Waste must be sealed in a plastic bag and disposed of according to your veterinarian’s instructions. If you accidentally ingest this medication, immediately seek medical attention. If you come into contact with this medication without wearing gloves, immediately wash it off and call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of toceranib Toceranib (Palladia®) Overdose Information Toceranib has a narrow margin of safety, meaning that even a small amount given over the prescribed dose can result in toxic effects. Signs of an overdose may include loss of appetite, vomiting, diarrhea, low energy, bleeding or bruising, limping, or muscle cramps. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Toceranib (Palladia®) Storage Always confirm storage requirements by reading the prescription label. Compounded medications should be stored according to the compounding pharmacy’s label. Toceranib tablets should be stored at controlled room temperatures from 68 to 77 F. Keep the container tightly closed to protect its contents from moisture and light. Keep out of reach of children and pets."}]