[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is cimetidine used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Cimetidine is an acid reducer that helps treat ulcers that have already formed in the esophagus, stomach, and small intestine. It may be used to help prevent future ulcers from recurring. Cimetidine has also been used to treat acid reflux in conditions where excessive stomach acid is produced, such as stomach tumors and advanced stages of mast cell tumors."}}, {"@type": "Question", "name": "Does cimetidine treat chronic vomiting in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Cimetidine is sometimes used for chronic vomiting in dogs, but generally only if the cause of the vomiting is associated with conditions that involve excessive stomach acid. There are many potential underlying causes of chronic vomiting, and it is important to work with your veterinarian to determine why your dog is having this symptom. Depending on your pet’s diagnosis, your veterinarian will determine if cimetidine is right for your dog."}}, {"@type": "Question", "name": "How much cimetidine should I give my dog?", "acceptedAnswer": {"@type": "Answer", "text": "Your veterinarian will recommend the appropriate dose of cimetidine for your dog depending on their individual needs, other medications they may be on, and their age, weight, and breed. With any medication, the safest way to know the proper dose for your dog is to ask your veterinarian and follow the directions on the drug label."}}, {"@type": "Question", "name": "Is cimetidine the same as Pepcid?", "acceptedAnswer": {"@type": "Answer", "text": "No. Cimetidine and Pepcid® (active ingredient famotidine) are different medications that are both categorized as H2 blocker acid reducers. Compared to cimetidine, Pepcid® is a newer H2 blocker that lasts longer and has fewer potential drug interactions. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Mr Vito"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cimetidine for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1460863443.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/iStock-1460863443.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/cimetidine-dogs"}, "datePublished": "September 11, 2023", "dateModified": "September 11, 2023", "description": "Cimetidine is a prescription medication used to treat stomach ulcers and acid reflex in dogs. Learn how cimetidine works in dogs, including side effects and commonly asked questions about the medication.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Cimetidine? Cimetidine is an acid reducer that is available as both an over-the-counter and prescription medication for humans. It is sometimes prescribed for dogs, cats, and horses to reduce the buildup of excess stomach acid. If prescribed for pets, it is only available by prescription through your veterinarian. Cimetidine helps treat ulcers that have already formed in the esophagus, stomach, and upper small intestine (duodenum). It may also be used to prevent future ulcers from recurring. Cimetidine has also been used to treat acid reflux and in certain conditions where excessive stomach acid is produced, such as stomach tumors and advanced stages of mast cell tumors. Compared to newer acid reducing medications on the market, cimetidine is less effective and does not last as long, which requires more doses per day. It is more likely to negatively interact with other medications. Due to these considerations, your veterinarian may prescribe another more favorable acid reducer for your pet. Cimetidine is FDA-approved for human use both over-the-counter and by prescription as generic cimetidine tablets. Cimetidine is currently not FDA-approved as a veterinary medication. However, it is occasionally utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of cimetidine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Cimetidine Works Cimetidine is a stomach acid reducer classified as an H2 blocker. By blocking H2 receptors located on the stomach lining, cimetidine blocks histamine from binding to those receptors, which decreases the secretion of stomach acid. Reducing stomach acid helps prevent further ulcers and injury to the lining of the esophagus, stomach, and duodenum. Cimetidine Directions Follow the directions on the drug label or as provided by your veterinarian. Cimetidine is best absorbed if given on an empty stomach. Cimetidine should be used with caution in geriatric pets and those with liver or kidney disease. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of cimetidine. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Cimetidine Possible Side Effects Cimetidine is well tolerated in animals when used at the correct veterinary prescribed dosages. Side effects in animals are rare and have not been reported. Human Side Effects Cimetidine is also an over-the-counter and prescription medication for humans, frequently with dosages that are different from those prescribed for your pet by a veterinarian. Due to possible side effects, humans should never use medicine dispensed for their pets and pets should not be given any medicine dispensed for a human’s use. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of cimetidine Cimetidine Overdose Information There is limited data to evaluate overdoses of cimetidine in animals. Animals that have ingested extremely high doses of cimetidine may experience a fast heart rate and difficulty breathing. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Cimetidine Storage Cimetidine should be stored at controlled room temperatures from 68 to 77 F. Always confirm storage requirements by reading the prescription label. Keep the container tightly closed in order to protect its contents from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]