[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Why is Tylenol® toxic to cats?", "acceptedAnswer": {"@type": "Answer", "text": "Acetaminophen is especially toxic to cats and can be fatal. Cats lack an enzyme that the liver needs to break down acetaminophen so that the body can excrete it. When acetaminophen builds up in the body, it can lead to severe damage to the red blood cells which cause them to lose their ability to carry oxygen."}}, {"@type": "Question", "name": "What pain reliever can I give my pet?", "acceptedAnswer": {"@type": "Answer", "text": "Please contact your veterinarian as they will be able to prescribe the right pain medication for your pet. All pain relievers for pets are prescription only and not one medication is not right for all pets. Some common pain medications for use in pets may include Rimadyl®, Metacam®, Onsior®, or gabapentin. Tylenol should never be given without a veterinarian’s guidance. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Acetaminophen (Tylenol®)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-648152138_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-648152138_0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/acetaminophen-tylenol"}, "datePublished": "April 21, 2023", "dateModified": "April 21, 2023", "description": "Acetaminophen is typically never prescribed to pets unless the medication is prescribed with other medications as part of a recovery plan determined by a veterinarian.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Acetaminophen (Tylenol®)? Acetaminophen (Tylenol®) is a human medication that is very rarely used in dogs and horses as an oral pain and fever reducing medication. Tylenol® is typically not prescribed because  acetaminophen can have severe side effects in pets, including liver damage and red blood cell toxicity. If a veterinarian prescribes acetaminophen to a dog, it is typically being prescribed in addition to other medications such as codeine or tramadol as a part of a multidrug pain plan. Acetaminophen is currently being investigated as a treatment option for horses with laminitis because acetaminophen does not appear to have significant side effects in horses. Never give your horse acetaminophen without the guidance and direction of your veterinarian. Tylenol® is highly toxic to cats and should never be given to cats or left in a place where it is accessible to cats. How Acetaminophen (Tylenol®) Works The exact way acetaminophen works to reduce fever and offer pain relief is not entirely clear, but it is theorized that it increases the amount of serotonin and norepinephrine in the body by targeting certain neurotransmitter pathways of the central nervous system. Acetaminophen also affects the COX pathway of the central nervous system, which lowers the production of natural chemicals that trigger inflammation. Acetaminophen is FDA-approved for human use under many brand names, including Tylenol®, Aminofen®, Panadol®, and the generic acetaminophen. Acetaminophen is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. Acetaminophen (Tylenol®) Directions Follow the directions on the drug label or as provided by your veterinarian. Due to the potential severity of side effects in dogs, please follow all directions as recommended by your veterinarian. Missed a Dose? If you forget to give a dose of Tylenol®, contact your veterinarian. Do not give extra or double doses. Acetaminophen (Tylenol®) Possible Side Effects Side effects are very much possible when your pet is taking this medication. In dogs, acetaminophen can cause dose-dependent liver damage, meaning the higher the dose of acetaminophen the more potential to damage the liver. It is very important to have open communication with your veterinarian if you see any of the following from your pet while they are taking Tylenol®: Vomiting Diarrhea Lethargy Constipation Loss of appetite Yellowing of the skin or whites of the eyes Increased thirst and urination Human Side Effects Acetaminophen is also a prescription and over-the-counter medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of acetaminophen Acetaminophen (Tylenol®) Overdose Information Tylenol® is highly toxic to cats. If your cat has ingested any amount of Tylenol®, please contact your veterinarian or an animal poison control center immediately. Acetaminophen can cause liver damage and decrease red blood cells’ ability to carry oxygen. As such, overdoses can be severe. Signs of an overdose may include vomiting, decrease in appetite, yellowing of the skin or the whites of the eyes, weakness, collapse, dark colored urine, or uncontrolled bleeding. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Acetaminophen (Tylenol®) Storage Most acetaminophen products should be stored at controlled room temperatures from 68–77 F. Avoid excessive heat over 104 F and protected from freezing. Always confirm storage requirements by reading the label. Keep the container tightly closed in order to protect from moisture and light.   Keep out of reach of children and pets."}]