[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Neomycin Sulfate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-514236868.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-514236868.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/neomycin-sulfate"}, "datePublished": "March 21, 2023", "dateModified": "March 21, 2023", "description": "Neomycin Sulfate can be prescribed by veterinarians to treat bacterial infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Neomycin Sulfate? Neomycin sulfate is a prescription antibiotic used to treat susceptible bacterial infections that occur in the intestines in cows, sheep, pigs, and goats. Neomycin can be used in ferrets, turkeys and chicken to treat E. coli infections, but other antibiotics are more often used instead due to possible side effects. This medication should not be given to horses, hamsters, or rabbits, as it can cause life-threatening diarrhea in these species. Neomycin sulfate is rarely used in dogs and cats, off-label, to aid in the treatment of hepatic encephalopathy. The term off- or extra-label use means that a medication is prescribed for a certain use or for a particular species that is not specified on the medication label. Veterinarians can legally prescribe medications for off-label use in certain circumstances. Your veterinarian will determine whether this medication is right for your pet. Neomycin sulfate is used most often as part of a topical product such as shampoo, wipe, spray, or eye or ear ointment for multiple species, including dogs and cats. How Neomycin Sulfate Works Neomycin sulfate is an antibiotic that is classified as an aminoglycoside. Aminoglycosides such as neomycin block protein synthesis in susceptible strains of bacteria, preventing them from growing and multiplying. Since neomycin is poorly absorbed, it mostly remains in the intestinal tract, making it highly effective against intestinal bacterial infections. Neomycin’s poor absorption is beneficial when administered as a topical (on the skin) product. Because it is not absorbed well, it remains on the surface of the skin to target susceptible bacteria localized on the skin. In certain circumstances, your vet may recommend a compounded formulation of neomycin. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Neomycin Sulfate Directions Follow the directions on the drug label or as provided by your veterinarian. Neomycin sulfate can be given with or without food, but if your pet experiences digestive upset after administration, it can be given with a small amount of food or a treat. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of neomycin. Generally, they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Neomycin Sulfate Possible Side Effects Like all other antibiotics, neomycin can cause gastrointestinal side effects such as:  Vomiting Diarrhea Lack of appetite Lethargy Additional concerns with neomycin are that it can be toxic to the ears and kidneys, which may present with the following symptoms: Hearing loss Head tilt Severe diarrhea Increased thirst and urination Topical preparations which contain neomycin can cause local skin reactions including redness, irritation, and itching where it has been applied. Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest neomycin sulfate prescribed to your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of neomycin Neomycin Overdose Information Overdoses of neomycin are rare because neomycin is generally not absorbed well into the body. Prolonged exposure in pets with certain underlying health concerns may cause severe consequences such as deafness, hearing loss, head tilt, weakness, severe kidney injury, increase in thirst and urination, and severe diarrhea. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Neomycin Storage Oral neomycin should be stored at controlled room temperatures between 68-77°F and some products may be safe with brief exposure to temperatures 59°-86°F. Keep the container tightly closed in order to protect from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer/"}]