[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Azathioprine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-866123344.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-866123344.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/azathioprine"}, "datePublished": "November 1, 2022", "dateModified": "November 1, 2022", "description": "Azathioprine is a prescription medication used to treat different types of immune-related diseases in dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Azathioprine? Azathioprine is a type of prescription medication called an immunosuppressant. It is utilized to treat different types of immune system related diseases, including immune mediated hemolytic anemia, inflammatory bowel disease, or perianal fistulas. It can be used alone but is typically used in conjunction with other immune mediating medications. This medication is primarily used in dogs but is also used (rarely) in ferrets and horses. Azathioprine is FDA-approved for human use under the brand names Imuran® and Azasan®. Azathioprine is currently not FDA approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine is azathioprine is right for your pet. In certain circumstances, your vet may recommend a compounded formulation of azathioprine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule/tablet form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Azathioprine Works Azathioprine suppresses the immune system in two ways. It blocks the body’s pathway for making purine, which is an essential component in the formation of DNA and RNA. Azathioprine also breaks down into its active form in the body that incorporates itself into replicating DNA and RNA–and interrupts the replication process. With less DNA and RNA available, there are less white blood cells that can be created in the body.   Because azathioprine suppresses the immune system, pets who are on this medication long term are at a greater risk for developing serious infections and experiencing toxic side effects. Your veterinarian will determine the appropriate dosage for your pet. Azathioprine Directions Azathioprine is generally given once daily for several weeks. Dosing may be adjusted over the course of several weeks–to months–to the lowest effective dose that can prevent symptoms from recurring. Missed a Dose? If you forget to give a dose of azathioprine, contact your veterinarian to determine when it is appropriate to resume the dosing schedule. Do not give extra or double doses. If it is almost time for your next dose, your veterinarian may instruct you to skip the missed dose and resume your normal dosing schedule. Azathioprine Possible Side Effects Azathioprine can cause digestive upset, suppression of the bone marrow (where new blood cells are made), pancreatitis, and liver damage. Symptoms may include: Vomiting Diarrhea Loss of appetite Abdominal pain Pale or white gums Weakness Abnormal bleeding or bruising Yellowing of the skin or whites of the eyes Fever If you believe your pet may be experiencing any side effects, consult your veterinarian. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of azathioprine Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. This medication is a known carcinogen. As such, consider wearing gloves during administration and wash hands with soap and water after administration to avoid exposure to the drug. Pregnant or nursing mothers should avoid contact with this medication. If you accidentally ingest a pet medication, immediately seek medical attention, or call the national Poison Control Center hotline at 800-222-1222. Monitoring Your veterinarian is likely to recommend periodic follow ups and routine testing while your pet is on azathioprine. Testing recommendations may depend on your pet’s individual needs, other medications they may prescribed, and/or the issue that initially caused your pet to be placed on this medication. Azathioprine Overdose Information The most common symptoms of an overdose of azathioprine are vomiting and loss of appetite. Liver irritation may raise liver enzyme levels and, due to the potential for bone marrow suppression, low platelet levels may also be seen. If you suspect an overdose, immediately seek emergency veterinary care or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435   Azathioprine Storage Azathioprine should be stored at controlled temperatures between 68 to 77 F. Keep the container tightly closed to protect from moisture and light. Always confirm storage requirements by reviewing the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]