[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for Thyro-Tabs® to work?", "acceptedAnswer": {"@type": "Answer", "text": "Most pets will show an improvement in the first 1-2 weeks. Weight loss, hair coat quality and neurological signs may take 8-12 weeks for notable improvements. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/NickyLloyd"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Thyro-Tabs® Canine (levothyroxine sodium)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1280869124_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/iStock-1280869124_0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/thyro-tabs-canine-levothyroxine-sodium"}, "datePublished": "February 27, 2023", "dateModified": "February 27, 2023", "description": "Thyro-Tabs® (Levothyroxine) is commonly prescribed to treat hypothyroidism in dogs.", "articleBody": "What is Thyro-Tabs® Canine (levothyroxine sodium)? Thyro-Tabs® contains the active ingredient levothyroxine sodium and is FDA-approved for replacement therapy for diminished thyroid function in dogs. It is primarily used to treat hypothyroidism in dogs. Levothyroxine sodium is also FDA-approved for use in dogs under the brand name ThyroKare™. In cats, it is used for hypothyroidism or for thyroid management after antithyroid treatment for hyperthyroidism. Levothyroxine is also used in horses for the treatment of hypothyroidism or as an additional treatment for equine metabolic syndrome (EMS). It can also be used to treat hypothyroidism in birds and tortoises. How Thyro-Tabs® Canine (levothyroxine sodium) Works Levothyroxine is a synthetic form of a naturally occurring thyroid hormone called thyroxine. The thyroid gland secretes thyroxine, which is responsible for maintaining metabolism and various physiological processes throughout the body. Pets with hypothyroidism have a thyroxine deficiency because the thyroid gland does not produce adequate amounts of thyroxine. Levothyroxine replaces the missing thyroxine and normalizes thyroid hormone levels in the body. Veterinarians commonly prescribe levothyroxine for off-label use in other species for certain conditions. The term off- or extra- label use means that a medication is prescribed for a certain use, or in a particular species, that is not specified on the medication label. Your veterinarian will determine whether this medication is right for your pet. Thyro-Tabs® Canine (levothyroxine sodium) Directions Follow the directions on the drug label or as provided by your veterinarian. This medication is typically administered to dogs once or twice a day. Ideally, it should be given without food and at the same time every day. Dogs may require a much higher dose of thyroid hormone replacement compared with humans, cats, or other species. Your veterinarian will determine the appropriate dose based on your dog’s weight and other factors. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of Thyro-Tabs®. Generally, they may instruct you to give it when you remember, or, if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Try to give Thyro-Tabs® as close to the same time each day as possible for best response. Thyro-Tabs® Canine (levothyroxine sodium) Possible Side Effects A small percentage of pets taking this medication will experience side effects, which may include: Loss of appetite Weight loss Skin irritation or itching Vomiting Lethargy Diarrhea Increased thirst Increased respiratory rate Allergic reactions to this medication are rare but may include: Hives Rash Facial Swelling Human Side Effects While levothyroxine is also a human prescription medication, there are different dosages and side effects that can occur in humans. This medication can affect the human thyroid gland, so it is recommended to wear gloves or wash your hands after administration. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Monitoring of thyroid levels is typically recommended, especially when starting or adjusting doses of levothyroxine. Other types of monitoring and testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of Thyro-Tabs® Thyro-Tabs® Canine (levothyroxine sodium) Overdose Information There is a wide margin of safety with this medication. Large overdoses may cause agitation, seizures, elevated heart rate, high blood pressure, increased hunger, vomiting, diarrhea, weight loss, and excessive panting. This medication is excreted into the feces, so always ensure that other pets are not eating the feces of a medicated pet. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Thyro-Tabs® Canine (levothyroxine sodium) Storage Thyro-Tabs® should be stored at controlled room temperatures between 68-77 F; brief exposure to temperatures of 59-86°F is acceptable. Always confirm storage temperatures by reading the label. Keep the container tightly closed to protect from moisture and light.   Keep out of reach of children and pets."}]