[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does it take for amitriptyline to work in pets?", "acceptedAnswer": {"@type": "Answer", "text": "Amitriptyline starts working in your pet&#039;s system within hours, but it can take days to several weeks to see positive changes in your pet’s behaviors."}}, {"@type": "Question", "name": "What is the dosage of amitriptyline in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The dose of amitriptyline prescribed to your dog depends on the behavior issue you are wanting to correct and what other medications they may already be prescribed. Be sure to work closely with your veterinarian to determine the dosage and if a dose adjustment is necessary."}}, {"@type": "Question", "name": "Does amitriptyline help with anxiety in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Some dogs may benefit from the use of amitriptyline in conjunction with other medications and a behavior modification program. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/LordHenriVoton"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Amitriptyline Hydrochloride", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-1319238018.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-1319238018.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/amitriptyline-hydrochloride"}, "datePublished": "April 21, 2023", "dateModified": "July 3, 2023", "description": "Amitriptyline is a prescription medication that can be prescribed by veterinarians to treat behavior disorders in pets including dogs, cats, and birds.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Amitriptyline? Amitriptyline can be prescribed in veterinary medicine for the treatment of behavioral disorders in small animals, including anxiety disorders in dogs, chronic pain disorders in dogs and cats, feather plucking in birds, and behavior disorders in cats. It is important to note that behavior-modifying medications such as amitriptyline are best used together with behavior modification such as training, in partnership with a veterinarian or certified trainer. Your pet’s behavioral disorder may also require the use of additional medications, daily modifications to routine, environmental changes, supplements, or other medical therapies. Amitriptyline is FDA-approved for human use under the generic amitriptyline hydrochloride. Amitriptyline is currently not FDA-approved as a veterinary medication. However, it is utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. How Amitriptyline Works Amitriptyline is in a class of medications called tricyclic antidepressants. These medications block the reabsorption of serotonin and norepinephrine, which are neurotransmitters in the brain that send messages throughout the nervous system. Serotonin is responsible for moderating mood and behavior, and low levels are thought to contribute to stress and anxiety. Norepinephrine is responsible for emotional regulation, motivation, and cognition. By increasing the amount of both these neurotransmitters, amitriptyline helps the brain regulate mood and behavior. In certain circumstances, your vet may recommend a compounded formulation of amitriptyline. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule or tablet form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Amitriptyline Directions Follow the directions on the drug label or as provided by your veterinarian. Amitriptyline is generally given once or twice daily depending on the species and condition you are using this medication for. Amitriptyline can be given with or without food, but offering it with a small meal can help improve absorption of the medication. When stopping this medication, it should be weaned, or done slowly over time. Please follow your veterinarian’s weaning directions closely. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of amitriptyline. Generally, they may instruct you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Amitriptyline Possible Side Effects The side effects typically seen with amitriptyline are due to its effects on the central nervous system: Constipation Urine holding Vomiting Diarrhea Excessive sleepiness Excitability Seizures Heart rhythm changes Decreased red and white blood cell production Additional side effects noted in cats include: Lethargy Drooling Loss of appetite Unkempt hair coat Amitriptyline can have serious interactions with certain medications. For example, serotonin syndrome can occur while the pet is also on a selective serotonin reuptake inhibitor (SSRI) like fluoxetine or a sedative like trazodone. Serotonin syndrome is a rare but serious condition that can occur when these drugs are given together, especially in large doses. Contact your veterinarian, and/or seek immediate emergency care if signs of serotonin syndrome occur: Vomiting or diarrhea Seizures Increased skin sensitivity (hyperesthesia) Depression Dilated pupils or blindness Vocalizations (whining, crying) Excessive drooling Trouble breathing Weakness or lack of coordination Disorientation Amitriptyline is also a prescription medication for humans with differing dosages and side effects. Given the possible side effects, pets should not be given any amitriptyline prescribed for humans. Human Side Effects While amitriptyline is a prescription medication for humans, there are different dosages and side effects that can occur in humans. If you accidentally ingest amitriptyline prescribed for your pet, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring Specific monitoring or routine testing while your pet is on this medication may be recommended by your veterinarian depending on your pet’s individual needs, other medications they may be on, and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of amitriptyline Amitriptyline Overdose Information Overdoses of medications in this class (tricyclic antidepressants) can be life-threatening. Symptoms of an overdose may include lethargy, incoordination, vomiting, heart rhythm changes, and collapse. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Amitriptyline Storage Amitriptyline should be stored at controlled room temperatures between 68–77 F. Keep the container tightly closed to protect from moisture and light. Always confirm storage temperatures by reading the label. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]