[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is diazepam for dogs considered doggie Valium®?", "acceptedAnswer": {"@type": "Answer", "text": "Diazepam is FDA-approved for human use under the brand name Valium®. Although diazepam is currently not FDA-approved as a veterinary medication, your veterinarian can legally prescribe certain human drugs such as Valium® for dogs in certain circumstances."}}, {"@type": "Question", "name": "How long does diazepam last in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Diazepam is short-acting in dogs and lasts for a few hours."}}, {"@type": "Question", "name": "Will diazepam make my dog sleepy?", "acceptedAnswer": {"@type": "Answer", "text": "Diazepam often causes dogs to feel sleepy and groggy. However, it is important to note that there is a chance it may cause overexcitement, which is why it may not be an ideal sedating medication, especially when used alone for this purpose. Your veterinarian will determine whether this medication is right for your pet based on your pet’s symptoms and circumstances. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Aja Koska"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Diazepam for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1287673569.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1287673569.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/diazepam-dogs"}, "datePublished": "July 31, 2023", "dateModified": "October 7, 2023", "description": "Diazepam is a prescription medication that can be used by veterinarians to treat anxiety and other conditions in dogs. Learn how diazepam works in dogs, including side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Diazepam? Diazepam is a controlled-substance medication used in veterinary medicine to relieve anxiety, stimulate appetite, and help manage sedation and anesthesia. It is also used in the emergency treatment of seizures and muscle spasms. Diazepam is available in multiple formulations such as an injection, oral tablet, oral solution, and rectal gel. It is mostly used in dogs short-term or as a single dose. Diazepam injections are only used for sedation and anesthesia in cats, horses, sheep, goats, alpacas, birds, ferrets, rabbits, rodents, and other small mammals. Diazepam can be used either as a solo medication or in combination with other medications. Your veterinarian will determine whether this medication and which type of medication formula is right for your pet. It is important to note that if a dog takes diazepam long-term, they can build up a tolerance to it, which means if they are having seizures, then a typical emergency dose of diazepam may not be as effective. Your veterinarian may prefer other anticonvulsant (anti-seizure) medications for long-term management of seizures in dogs. Diazepam is FDA-approved for human use under the brand names Valium®, Diastat®, Valtoco®and the generic diazepam. Diazepam is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of diazepam medication. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Diazepam is classified as a DEA Schedule IV controlled substance. As such, this may affect the prescribing, dispensing, and refilling of this medication due to federal and state law. Likewise, it is illegal for you to consume, transfer, sell, or otherwise give away your pet’s diazepam. How Diazepam Works Diazepam is classified as a benzodiazepine. It enhances the activity of certain chemical messengers in the brain responsible for slowing down, stabilizing, and calming the nervous system. This causes sedation, muscle relaxation, and the suppression of seizures. Diazepam Directions Follow the directions on the drug label or per the instructions as provided by your veterinarian. Generally, your veterinarian will recommend that diazepam can be given with or without food, but providing it with food can decrease the risk of digestive upset. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of diazepam. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Diazepam Possible Side Effects Common side effects of diazepam may include: Grogginess Loss of balance Less common side effects of diazepam may include: Overexcitement Increased appetite Muscle tremors (horses) Diazepam oral tablets and oral suspension should not be used in cats, as a life-threatening liver problem can occur. Signs of liver injury may include jaundice (yellowing of eyes, gums, and skin), weight loss, vomiting, diarrhea, and weakness. Diazepam should not be used in pets with a known hypersensitivity to the medication. Human Side Effects Diazepam is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment. You see or suspect an overdose You have additional questions or concerns about the use of diazepam Diazepam Overdose Information Signs of a diazepam overdose in pets are typically related to the nervous system, such as decreased muscle reflexes or confusion. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Diazepam Storage Diazepam tablets should be stored at controlled room temperature between 68-77 F. The rectal gel formula and oral solution should be stored at controlled room temperatures around 77 F, with limited fluctuations between 59 F to 86 F permitted. Always confirm storage requirements by reading the prescription label. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]