[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long does Strongid® T take to work?", "acceptedAnswer": {"@type": "Answer", "text": "Strongid® T contains pyrantel pamoate and is labeled for use in horses and ponies. This product contains a much higher concentration of pyrantel than the products labeled for dogs. When deworming a dog, please use only products labeled for use in dogs. Products for dogs can work as a single treatment or may need to be repeated. Talk to your veterinarian about an appropriate deworming schedule for your pet."}}, {"@type": "Question", "name": "Can a cat overdose on pyrantel?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Consult with your veterinarian before giving pyrantel to your cat. Your veterinarian can recommend a dose that is safe and appropriate. If you suspect that your cat has overdosed on pyrantel, call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435"}}, {"@type": "Question", "name": "Does pyrantel kill tapeworms in cats?", "acceptedAnswer": {"@type": "Answer", "text": "No, pyrantel pamoate by itself does not kill tapeworms, and there are no FDA-approved medicines for cats that contain only pyrantel pamoate. However, there are combination products that treat tapeworms and contain pyrantel and other deworming medications. For example, Drontal® contains pyrantel pamoate and praziquantel and is FDA-approved for the treatment of tapeworms in cats and kittens."}}, {"@type": "Question", "name": "How long does it take Nemex® to kill worms?", "acceptedAnswer": {"@type": "Answer", "text": "Nemex® products can remove roundworms and hookworms in a single treatment. However, it is often given as part of a deworming schedule to help eliminate worms that commonly reinfest dogs. Talk to your veterinarian about an appropriate treatment schedule for your pet."}}, {"@type": "Question", "name": "What kind of worms does Strongid® kill?", "acceptedAnswer": {"@type": "Answer", "text": "Strongid® T is a horse dewormer that contains pyrantel pamoate. In horses, pyrantel is FDA approved to remove large and small strongyles, pinworms, and large roundworms. This medication is not meant for dogs. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock/AleksandarNakic"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pyrantel Pamoate", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1290887067.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-07/iStock-1290887067.jpg"}, "author": {"@type": "Person", "name": "Amy Van Gels, DVM", "url": "https://www.petmd.com/author/dr-amy-van-gels"}, "keywords": "Medication, Dog, Cat, Heartworm", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/pyrantel-pamoate"}, "datePublished": "July 12, 2022", "dateModified": "August 17, 2022", "description": "Pyrantel pamoate is a common parasiticide used to help deworm pets.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet.   What is Pyrantel Pamoate? Pyrantel pamoate is a common parasiticide used to treat intestinal parasites in puppies, dogs, horses, and other animals. This liquid medication helps to deworm pets against a few common parasites such as large roundworms and hookworms. Manufacturers also blend pyrantel pamoate with other types of antiparasitic medications that target a larger variety of internal parasites. As a component of several popular heartworm preventative medications, including Heartgard® Plus and Tri-Heart® Plus, many dogs safely receive pyrantel pamoate on a monthly basis.  How Pyrantel Pamoate Works Pyrantel pamoate treats large roundworms (Toxocara canis and Toxascaris leonina) and hookworms (Ancylostoma caninum and Uncinaria stenocephala). The medication works by paralyzing worms, which are then expelled from the body in feces. Pyrantel only treats parasites found in the gastrointestinal tract because it does not absorb well into the bloodstream. Because these worms can be large enough to see without a microscope, you may see them in your dog’s feces after treatment.  Pyrantel Pamoate For Cats Pyrantel pamoate by itself is not FDA-approved in cats. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label Pyrantel pamoate can be found in combination products along with other deworming medications. For example, Drontal®, which is FDA approved for use in cats and kittens, contains pyrantel pamoate and praziquantel. Follow the directions on the drug label or as directed by your cat’s veterinarian. Pyrantel Pamoate Directions Consult with your veterinarian to see if pyrantel is appropriate for your pet. Since pyrantel does not eliminate all types of worms or parasites, your veterinarian may perform a fecal test before treatment to pinpoint the type of parasite your dog has. A follow-up fecal test may also be necessary 2-4 weeks after treatment to confirm that the worms are gone. Follow the directions on the drug label or as provided by your veterinarian. Liquid suspensions can separate; shake well before use. Most dogs like the taste of pyrantel and usually take the medication willingly. If not, the medication can be hidden in a small amount of food. Talk to your veterinarian about a deworming schedule that is appropriate for your pet, as dosing schedules vary for puppies, nursing dogs, and adult dogs. A single treatment can be effective, but it may need to be repeated as part of a deworming program. Several pyrantel pamoate products are available. The amount of pyrantel varies between the products. Follow the directions on the drug label or as provided by your veterinarian. Consult your veterinarian for assistance in the diagnosing, treating, and controlling intestinal worms and other parasites. Pyrantel pamoate and other types of pyrantel (such as pyrantel tartrate) are available for use in horses and other species. These products contain much larger amounts of the drug and should not be used in dogs. Missed a Dose? If you forget a dose, give pyrantel pamoate when you remember. Follow-up testing for the presence of worms may need to be rescheduled. Consult with your veterinarian to determine the appropriate timing for these tests. Pyrantel Pamoate Possible Side Effects Pyrantel pamoate is considered a safe medication. Side effects are rare when given at doses recommended on the label. If seen, the following side effects may be due to the removal of the worms. VomitingDiarrheaDecreased appetiteHuman Side Effects While this medication is also used in human medicine there are different dosages and side effects that can occur in humans.    If you accidentally ingest this medication please call your physician or local poison control center. Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on and/or the issue that initially caused your pet to be placed on this medication. Call Your Vet If Side effects are severe or you witness or suspect an overdoseCall your vet or pharmacist if you have other questions or concerns about the use of pyrantel pamoatePyrantel Pamoate Overdose Information Pyrantel is typically well tolerated, but symptoms of an overdose may include, rapid breathing, an increase in sweating, and disorientation. If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Pyrantel Pamoate Storage Pyrantel should be stored at controlled temperatures between 59°-86°F. Keep the container tightly closed in order to protect from moisture and light. Keep out of reach of children and pets.  "}]