[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How often should my dog get Adequan® injections?", "acceptedAnswer": {"@type": "Answer", "text": "Adequan® generally starts with a loading dose or an initial higher dose at the beginning of treatment before lowering to a maintenance dose. It is initially given every 3-5 days and then given on a weekly, monthly, or as needed basis as recommended by your veterinarian.   "}}, {"@type": "Question", "name": "How long can a dog stay on Adequan®?", "acceptedAnswer": {"@type": "Answer", "text": "According to the product label, Adequan® is approved as a twice weekly injection given within a 4-week period. However, many veterinarians prescribe this medication for longer periods of time. Your veterinarian will be able to recommend an individualized dosing regimen for your pet.   "}}, {"@type": "Question", "name": "Where should Adequan® be injected?", "acceptedAnswer": {"@type": "Answer", "text": "Adequan® is approved for injection into your pet’s muscle. The muscles of the front of the thigh (quadriceps), lower back (lumbar), back of the front leg (triceps), and the back of the thigh (hamstring) are the most frequently used muscles for injection. There are important nerves and other structures near all these locations, so it is vital that you receive training from your veterinarian before performing any injections into your pet’s muscles.   "}}, {"@type": "Question", "name": "Is Adequan® a steroid?", "acceptedAnswer": {"@type": "Answer", "text": "Adequan® is not a steroid; it is a chondroprotectant or a protector of cartilage. Adequan® primarily works on the cartilage located in your pet’s joints and generally does not have the negative whole-body effects that steroids can. "}}, {"@type": "Question", "name": "How quickly does Adequan® work in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Adequan® starts to reach the joint within 2 hours after injection and can reach the joint cartilage within 3 days. It can take several doses before a noticeable improvement in your pet can be observed. "}}, {"@type": "Question", "name": "Does Adequan® affect the liver?", "acceptedAnswer": {"@type": "Answer", "text": "Adequan® can have negative consequences on pets with known liver disease or if an overdose is administered. In healthy pets, its effect on the liver is generally considered safe.    The information in this article is for educational purposes only and is not a substitute for advice, diagnosis, or treatment from a veterinarian. If you believe your animal is experiencing a medical emergency, call your veterinarian office immediately or seek immediate care from your local animal hospital. "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Adequan® (Polysulfated Glycosaminoglycan)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/bulldog-getting-leg-examined-by-vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/bulldog-getting-leg-examined-by-vet.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Medication, Dog, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/adequan-polysulfated-glycosaminoglycan"}, "datePublished": "April 22, 2022", "dateModified": "February 14, 2023", "description": "Adequan® is a common medication prescribed to help treat arthritis in dogs.", "articleBody": "What is Adequan®?  The following content may contain Chewy links. PetMD is operated by Chewy  Adequan® is an injectable medication prescribed for pets with arthritis. It treats cartilage loss in joints and may also help restore joint lubrication, relieve inflammation, and rebuild healthy cartilage. Adequan® works best when used proactively to prevent arthritis from worsening.   The use of Adequan® as a urinary bladder lining protector in cats with idiopathic cystitis is currently being prescribed extra-label or off-label by some veterinarians. This is called extra-label, or sometimes off-label use, because this use isn’t described on the drug label.  How Adequan® Works  The active ingredient in Adequan® is called polysulfated glycosaminoglycan or PSGAG. Glycosaminoglycans (GAGs) are naturally produced by the body and are critical components in the growth of cartilage. Like the GAGs already present in your pet’s cartilage, Adequan® can help fortify the cartilage and maintain joint health in three main ways:  Adequan® binds to other GAGs in the joint cartilage to help prevent them from continuing to degrade. This prevents arthritis from worsening.   Adequan® blocks the release of enzymes that can degrade the cartilage in the joint. Adequan® can also block some of the naturally occurring chemicals that cause inflammation in the joint.  Adequan® stimulates the activity of existing collagen in the joint and improves the quality of joint fluid.  GAGs are also located in other parts of the body such as the lining of the urinary bladder. It is theorized that Adequan® can help to strengthen the bladder wall and decrease inflammation in a cat with idiopathic cystitis.   Adequan® Directions   Be sure to discuss how to properly inject Adequan® before starting the medication by reading the drug label and consulting with your veterinarian.   Adequan® is an injectable medication that is approved for injection into the muscle. Adequan® is usually given twice weekly for up to 4 weeks, or according to your veterinarian’s recommendations.  When drawing up each dose from the vial, try to keep the vial and the syringe/needle as clean as possible to lower the risk of infection at the injection site. Clean and disinfect the stopper of the Adequan® vial before each use. Use only sterile needles and properly discard the needle after each use. Needles should only be used once.   Adequan® Dosing   Missed a Dose?  If you forget to give a dose of Adequan®, give it when you remember. However, if it is almost time for your next dose, skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses.   Possible Side Effects of Adequan®  Side effects are rare but possible. In clinical trials, side effects studied were generally mild and all pets were able to continue with their treatment.   Important side effects to note include: Pain, swelling, or hematoma (a blood blister or deep bruise) at the injection site that may be due to an infection  Decreased blood clotting that may cause nose bleeds, gastrointestinal bleeding (can cause bloody, dark coffee ground stool), or vomiting  If these symptoms occur, please contact your veterinarian immediately.  Human Side Effects  If you accidentally ingest or inject yourself with this medication, call your physician or the national Poison Control Center hotline at 800-222-1222.  Monitoring  No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pet&#039;s individual needs.  Call Your Vet If:  Severe side effects are seen (see above)  You see or suspect an overdose  You have additional questions or concerns about the use of Adequan®  Adequan® Overdose Information  Pain, swelling, or hematoma formation at the site of injection is possible with an overdose of Adequan®. An overdose can also cause low platelet counts which would increase blood clotting time. This may present as nose bleeds, gastrointestinal bleeding (which can cause bloody stool, dark coffee ground stool), or vomiting. Liver and kidney damage are also possible side effects of an overdose.   If you suspect an overdose, immediately contact your veterinarian or an animal poison control center. Consultation fees often apply.  Pet Poison Helpline (855) 764-7661  ASPCA Animal Poison Control (888) 426-4435  Adequan® Storage  Adequan® should be stored at controlled room temperatures between 68-77°F. Brief exposure to temperatures between 59°-86°F are acceptable. Avoid prolonged exposure to temperatures greater than 104°F. Use within 28 days of first puncture. A maximum of 10 uses per vial is recommended. Properly dispose of used needles in accordance with all federal, state, and local environmental laws.   Keep out of reach of children and pets. "}]