[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much buspirone can I give my dog?", "acceptedAnswer": {"@type": "Answer", "text": "With any medication, the safest way to know the proper dose for your dog is to ask your veterinarian. They will recommend the appropriate dose for your dog depending on their individual needs, other medications they may be on, and their age, weight, and breed."}}, {"@type": "Question", "name": "Is buspirone safe for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Buspirone can be used safely in dogs, but under very specific circumstances and only under direct supervision by their veterinarian. Always discuss your pet’s medications and medical conditions with your veterinarian before giving buspirone, as there may be health risks to your pet if they are hypersensitive to it, if they have certain medical conditions, or if they are taking certain medications. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/NoSystem images"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Buspirone for Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1230864792.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1230864792.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Medication, Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/buspirone-dogs"}, "datePublished": "August 14, 2023", "dateModified": "October 6, 2023", "description": "Buspirone is a prescription medication commonly prescribed by veterinarians to treat anxiety issues in dogs–including fear and anxiety. Learn how buspirone works in dogs, possible side effects, and commonly asked questions related to buspirone for dogs.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Buspirone? Buspirone is a prescription anti-anxiety medication used to treat certain behavior disorders in dogs such as fear and anxiety. Buspirone may also be helpful in cats for behavior problems including urine spraying and fear. Buspirone is typically given long-term because it takes weeks to months to become effective. Because it requires time to work, it does not help relieve anxiety if given only as needed in a stressful situation. Buspirone is FDA-approved for human use as a generic medication. It is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use, because this use isn’t described on the drug label. In certain circumstances, your vet may recommend a compounded formulation of buspirone. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Buspirone Considerations Buspirone should not be used in pets with certain medical conditions, such as liver disease or kidney disease, or in pets who are hypersensitive to the medication. Giving buspirone with certain medications can result in health risks to your pet, so it is important to discuss their medications and medical conditions with your veterinarian. How Buspirone Works It’s unclear exactly how buspirone works to treat fear and anxiety in pets. However, it is theorized that buspirone rebalances levels of two key chemical messengers, serotonin and dopamine, in parts of the brain that are responsible for emotional processing. Buspirone Directions Follow the directions on the drug label or the instructions provided by your veterinarian. Generally, your veterinarian will recommend that buspirone can be given with or without food, but providing it with a small amount of food may decrease the risk of digestive upset. If your veterinarian recommends that you discontinue this medication for any reason, it is best to wean your pet off slowly, under veterinarian&#039;s supervision, especially if your pet has been taking it long-term. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of buspirone. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Buspirone Possible Side Effects Buspirone is typically well-tolerated in most dogs and cats. Possible side effects include: Decreased appetite Vomiting Agitation, pacing Grogginess (dogs) abnormally low heart rate Human Side Effects Buspirone is also a prescription medication for humans, frequently with dosages different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be administered any medication prescribed for humans. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of buspirone Buspirone Overdose Information There is limited information available about overdoses of buspirone. Signs of an overdose may include vomiting, dizziness, grogginess, abnormally small pupil size of the eyes, and bloated stomach. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Buspirone Storage Buspirone should be stored at controlled temperatures between 68–77 F. Brief exposure to temperatures of 59–86 F are acceptable. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]