[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/yrkqmc73hf", "@type": "VideoObject", "duration": "PT1M25S", "name": "5637164675001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/b5ad05e4ebff03cccba4645b308d1d01aa7b23f1.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/yrkqmc73hf", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/304257889e7a1e0fab215f24918fdd6db9d101b4.m3u8", "transcript": "Penicillin is an antibiotic that is used to fight a variety of bacterial infections in dogs and cats. These may include dental infections skin abscesses urinary tract infections and respiratory infections. It can also be given prior to a surgical procedure to prevent infections from starting your vet near and may prescribe penicillin and capsule oral liquid or injectable form. It is FDA approved for use in dogs and cats.\n\nPenicillin kills bacteria by preventing them from forming a proper cell wall as they grow. Unfortunately bacteria often build up resistance to this drug especially with overuse or inappropriate use side effects of penicillin may include allergic reaction loss of appetite rash fever joint pain, vomiting, nausea, and diarrhea. The drug works best if given one hour prior to feeding or two hours after feeding. But if your pet gets an upset stomach the drug may be given with food.\n\nIf you observe any of these symptoms consult your veterinarian. Don't stop your pets treatment unless your veterinarian tells you to do so. Penicillin may react with other antibiotics, such as syphilis forums and amino glycol sides as well as drugs that inhibit bacterial growth. Pet parents should exercise caution when giving this drug to pregnant pets.\n\nPenicillin is safe for use in dogs, cats ferrets hedgehogs and some species of bird but other species may be sensitive to it.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/pet-medication/penicillin-dogs-and-cats?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much penicillin can you give a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Always speak with your veterinarian before giving your dog penicillin. The oral form of penicillin is generally not used in dogs because it must be given several times a day on an empty stomach. If your veterinarian recommends that you administer penicillin dispensed by a pharmacy, the dose and frequency will depend on your dog’s individual needs, their weight, and the condition being treated. There are different sizes of human penicillin products available, and some are not suited for dogs. Your veterinarian will determine the best drug medium and frequency for your pet. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/:ThamKC"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Penicillin for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-524229041.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-524229041.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/penicillin-dogs-and-cats"}, "datePublished": "June 27, 2023", "dateModified": "June 27, 2023", "description": "Penicillin is sometimes used in the veterinary field to treat specific infections in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Penicillin? Penicillin is an antibiotic that treats susceptible bacterial infections in dogs, cats, cattle, horses, and swine. Penicillin G Procaine, the injectable form, is FDA-approved for use in horses, cattle, sheep, dogs, and cats for respiratory tract infections and in swine for infections of the skin. Penicillin G injection is sometimes used in dogs for certain bacterial infections, including leptospirosis. Penicillin V, the oral form, is rarely used in veterinary medicine because it must be given several times a day on an empty stomach.    Penicillin V and Penicillin V Potassium are FDA-approved for human use as generic Penicillin V tablets or as a powder mixed with water to create an oral liquid. Penicillin V is currently not FDA-approved as a veterinary medication. However, while it is rarely utilized in the veterinary field, veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. How Penicillin Works Penicillin prevents susceptible bacterium from creating a necessary part of its cell wall, thereby weakening and destroying it, causing the bacterium to die. Penicillin Directions Follow the directions on the drug label or as provided by your veterinarian. Penicillin V is best given without food. If your pet experiences stomach upset when taking this medication, giving it with a small amount of food can help.  Penicillin V oral suspension is a liquid version of penicillin and is usually supplied as a powder. Follow the mixing directions closely and note the exact amount of water that should be mixed with the powder to create the suspension. Shake well. Storing mixed penicillin in the refrigerator is preferred. Any unused portion of the suspension should be discarded after 14 days. Always confirm storage requirements by reading the prescription label. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of penicillin. Generally, they may instruct you to give it when you remember, or if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Penicillin Possible Side Effects Like all other antibiotics, penicillin can cause gastrointestinal side effects:    Vomiting  Diarrhea  Loss of appetite Penicillin allergies in animals are rare but can happen. Symptoms may include:  Skin rashes Fever  Collapse  Difficulty breathing  Penicillin V, the oral form, should not be used in horses, rabbits, guinea pigs, gerbils, hamsters, and chinchillas as life-threatening diarrhea can occur in these species.  Human Side Effects Penicillin is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.    If you are allergic to penicillin, talk to your veterinarian about using another medication or ensure that you always wear gloves while in contact with this medication.  Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of penicillin Penicillin Overdose Information An overdose of penicillin is unlikely to cause toxicity. Penicillin may cause vomiting, diarrhea, and decreased appetite. Large overdoses and prolonged use of penicillin may cause a lack of coordination, seizures, breathing problems, fluid retention, and rapid heart rate.  Penicillin allergies in pets are rare but can happen. Signs of an allergic reaction include skin reactions, watery eyes, hives (urticaria), facial swelling, vomiting, diarrhea, and anaphylaxis. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Penicillin Storage Penicillin tablets and powders should be stored at controlled room temperatures between 68–77 F. Reconstituted penicillin suspension should be stored in the refrigerator and discarded after 14 days. Always confirm storage requirements by reading the label. Keep the container tightly closed in order to protect the penicillin from moisture and light.   "}]