[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What is gentamicin topical spray used for in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Gentamicin is used to treat small areas of susceptible bacterial skin infections in dogs."}}, {"@type": "Question", "name": "Is gentamicin safe for kittens?", "acceptedAnswer": {"@type": "Answer", "text": "Most gentamicin formulations are only FDA-approved for use in dogs, so it is best to have your vet examine your kitten first to determine if it is an appropriate medication for your pet. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/DragonImages  "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Gentamicin for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1491041843.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1491041843.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/gentamicin-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "August 7, 2023", "description": "Gentamicin is often prescribed by veterinarians to treat various bacterial infections in dogs and cats. Learn how gentamicin works in dogs and cats, side effects, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Gentamicin? Gentamicin is an FDA-approved prescription antibiotic used to treat a variety of susceptible bacterial infections in dogs and cats. Gentamicin is available in multiple brand and generic formulations such as a topical spray (brand name GentaVed®); eye drops (brand name Gentocin® Durafilm® and generic gentamicin); and topical ointments for the skin and ear (brand names GentaOtic™, EasOtic®, Mometamax®, Mometavet™, Otomax®, and generic GenOne™). Gentamicin may be the sole ingredient in one eye formulation, but most formulations of gentamicin are available in combination with other medications such as corticosteroids and antifungals. In some cases, gentamicin is administered by injection to horses for certain serious medical conditions under direct veterinary supervision. The injectable version of gentamicin is not used in other animals due to its potential for toxic side effects. Most gentamicin formulations are only FDA-approved for use in dogs. Gentamicin is mostly used in dogs for treatment of susceptible outer ear infections, skin infections, and eye infections. In certain circumstances, a board-certified veterinary ophthalmologist or dermatologist may recommend a compounded formulation of gentamicin. Compounded medications are prescribed when there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. How Gentamicin Works Gentamicin belongs to a class of drugs known as aminoglycoside antibiotics. Gentamicin works by binding to the genetic code of susceptible bacteria, which prevents the bacteria from making the essential proteins necessary for survival, growth, and replication. This leads to death of the bacteria. Gentamicin should not be used in pets with certain medical conditions such as liver or kidney disease, so speak with your veterinarian to ensure this medication is right for them. Administering gentamicin with certain medications can result in health risks to your pet, so it is important to discuss all your pet’s medications with your veterinarian. Gentamicin Directions Follow the directions on the drug label or as provided by your veterinarian. Wear gloves while applying gentamicin to prevent the spread of the bacteria to other areas, and always wash your hands after applying it. Topical spray: Do not spray on ulcerated or burned skin. Do not allow your pet or other pets to lick or chew at the area where you used the spray for at least 30 minutes after application. Do not allow the spray to get into your pet’s eyes, mouth, or nose. Eye drops: Have your pet’s eyes examined by a veterinarian first before applying gentamicin eye drops. Applying gentamicin in a deep corneal wound can cause toxicity to the eye. Ear formula: Have your pet’s ears examined by a veterinarian first before applying gentamicin ear medication. Using gentamicin in a pet with a damaged ear drum can cause toxicity to the ear. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of gentamicin. They may instruct you to give the missed dose as soon as you remember and wait the normal amount of time until the next dose. If it is almost time for your pet’s next dose, your vet may instruct you to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Gentamicin Possible Side Effects Gentamicin is generally well tolerated, but side effects may occur depending on the formulation and the other ingredients involved. Gentamicin topical sprays and ear formulations, as well as some eye drops, contain corticosteroids, which may cause side effects including: Increased thirst Increased urination Increased appetite Thinning skin Hair loss Decreased muscle mass Pot-bellied appearance Gentamicin eye drops may cause: Eye burning and irritation Eye redness Gentamicin ear medications may cause minor ear redness. Rarely, gentamicin ear medications can cause serious side effects such as: Decreased appetite Gastrointestinal signs such as vomiting and diarrhea Sudden hearing loss Ear pain Head tilt and walking in circles Human Side Effects While gentamicin is also a human prescription medication, there are different dosages and side effects from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. If you have hypersensitivity to cortisone, aminoglycoside antibiotics, or antifungal medication, talk to your veterinarian about using another medication, or ensure that you always wear gloves while handling this medication. Wash your hands after application. In case of accidental skin contact, wash the area thoroughly with water. Avoid contact with eyes. If you accidentally ingest or inject gentamicin, GentaVed®, Gentocin®, Durafilm®, GentaOtic™, EasOtic®, Mometamax®, Mometavet™, or Otomax®, call your physician or the national Poison Control Center hotline at 800-222-1222.   Call Your Vet If: Severe side effects (listed above) are seen Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of gentamicin Gentamicin Overdose Information An overdose of topical gentamicin is unlikely to occur unless your pet ingests the medication. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Gentamicin Storage Store this medication in the provided container at room temperature between 59-86 F. Protect from light and moisture. Compounded medications should be stored according to the compounding pharmacy’s label. Always confirm storage requirements by reading the prescription label. Keep out of reach of children and pets."}]