{
    "What are the potential causes of a dog shivering or trembling?":
        "Causes may include joy, toxic food ingestion, pain, old age, nausea, poisoning, and more.",
    
    "When should you talk to your vet if your dog is shaking or trembling suddenly?":
        "If your dog shows symptoms like diarrhea, vomiting, limping, or other signs of distress, it's important to consult your vet immediately.",
    
    "What are some common reasons for dogs to shake or tremble?":
        "Excitement, pain, old age, nausea, poisoning, and seizure disorders are common reasons for dogs to shake or tremble.",
    
    "What are the signs of distemper in dogs?":
        "Signs of distemper include eye and nose discharge, fever, coughing, and tremors. It's most common in unvaccinated puppies and adolescent dogs.",
    
    "How is distemper in dogs treated?":
        "Treatment involves supportive care and may include antibiotics, airway dilators, physical therapy, and fluids to manage dehydration.",
    
    "What is Generalized Tremor Syndrome (GTS) in dogs?":
        "GTS, also known as white shaker dog syndrome, is characterized by tremors and is more common in small, white breeds. Treatment typically involves corticosteroids.",
    
    "What are some signs of nausea in dogs?":
        "Signs of nausea in dogs include listlessness, lip smacking, excessive salivation, hiding, yawning, vomiting, and shaking.",
    
    "How is nausea in dogs treated?":
        "Treatment for nausea depends on the cause, and it may involve contacting your vet or Animal Poison Control Center in cases of poisoning.",
    
    "What can cause tremors in older dogs?":
        "Old age and pain can cause tremors in older dogs, and it's essential to consult with your vet to rule out any underlying issues.",
    
    "What are some items that can be poisonous to dogs?":
        "Chocolate, cigarettes (nicotine poisoning), xylitol (found in gum), and snail baits containing metaldehyde are examples of items toxic to dogs.",
    
    "What are the symptoms of poisoning in dogs?":
        "Symptoms include tremors, weakness, disorientation, depression, drooling, vomiting, diarrhea, and seizures. Immediate vet consultation is crucial.",
    
    "What neurological disorder in dogs can cause seizures?":
        "Epilepsy is a neurological disorder in dogs that can cause seizures. Treatment may involve medications like keppra, phenobarbital, or potassium bromide.",
    
    "Why do some dogs shake or tremble out of excitement?":
        "Excitement, especially when greeting, can cause dogs to shake or tremble. Training and calm greetings can help manage these behaviors.",
    
    "What are some less common reasons for shivering in dogs?":
        "Less common reasons include chronic kidney failure, neurological problems, Addisonian crisis, demyelinating disorders, and full anal sacs.",
    
    "When should you consult your vet about your dog's shivering or trembling?":
        "If you have any concerns or questions about your dog's shivering or trembling, it's recommended to consult your vet for advice and examination."
}