[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Toy Fox Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Toy Fox Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_toy_fox_terrier"}, "datePublished": "May 13, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Toy Fox Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Toy Fox Terrier is a spunky little ball of energy whose mischievous nature and sharp wit lend to its playfulness. Owners of this breed require not only stamina but patience; in return, they are rewarded by the companionship of these spritely pups. Physical Characteristics This agile, athletic, and graceful breed has incredible stamina and strength to play throughout the day. Its gait is effortless and smooth, while its white, chocolate and/or tan coat is silky and short, making it perfect for cuddling. The Toy Fox Terrier also possesses the hunting traits of the Smooth Fox Terrier, making it essentially a miniature version of the Smooth Fox Terrier. Personality and Temperament The Toy Fox Terrier can entertain people for hours and when in need of a break, it is happy to find a warm lap. The breed is highly devoted to its owner and family, however, and does not enjoy socializing with strangers initially. Always the trickster, the Toy Fox Terrier has an abundance of energy and intelligence, but the tendency to &quot;show off.&quot; It enjoys inspecting cabinets, the yard, and other unexplored places. And while the Toy Fox Terrier makes the perfect companion for cautious older children, it cannot tolerate the rough-housing of small children. Care The Toy Fox Terrier loves a soft warm bed or a lap. Because it is not an outdoor breed, coat care remains simple. It should, however, be provided with a daily exercise routine and sufficient playmates. Fortunately, a small area and some toys make for an excellent playground. The dog tends to bark and dig when it does not get sufficient training, attention, and exercise. Health The Toy Fox Terrier, which has a lifespan of 13 to 14 years, is prone to minor health concerns such as patellar luxation, congenital hypothyroidism with goiter, Legg-Calve-Perthes, and demodicosis. In addition, von Willebrand&#039;s Disease (vWD) is occasionally seen in the Toy Fox Terrier. To identify some of these issues, a veterinarian may run knee, thyroid, and DNA tests on the dog. History and Background Pet owners and farmers have been fond of Smooth Fox Terriers for many years. The American farmer, for instance, was in search of a &quot;runt&quot; or smaller animal to exterminate rodents, and crossed the smaller fox terriers with toy dog breeds such as the Toy Machester Terrier, Italian Greyhound, and Chihuahua in the early 20th century. This resulted in a smaller variety of the Smooth Fox Terrier with some notable differences -- its fiery nature was slightly mellowed, for example. Pet owners, meanwhile, saw the Toy Fox Terrier as an enjoyable little companion and an excellent entertainer. The smallest of the crossbreeding efforts were eventually organized as one breed and recognized as the Smooth Fox Terrier by the United Kennel Club in 1936. The Toy Fox Terrier would not be recognized by name until 2003, when it was registered by the American Kennel Club (AKC). Prior to that, it was a popular non-AKC breed in the United States."}]