[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What’s the difference between an Alaskan Klee Kai vs. a Husky?", "acceptedAnswer": {"@type": "Answer", "text": "While Alaskan Klee Kai and Siberian Huskies share a lot of similarities, the biggest difference between the breeds is their size. Alaskan Klee Kai don’t grow larger than 25 pounds, while Huskies are medium-size dogs that weigh 35–60 pounds."}}, {"@type": "Question", "name": "Is an Alaskan Klee Kai expensive?", "acceptedAnswer": {"@type": "Answer", "text": "Alaskan Klee Kai typically cost $1,500–$3,000 for a puppy from a reputable breeder. You might also be able to find an Alaskan Klee Kai for adoption at a rescue."}}, {"@type": "Question", "name": "Do Alaskan Klee Kai bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Short answer: Yes. Alaskan Klee Kai are known to bark, whine, cry, yodel, squeak, talk, and make a variety of wild and loud noises—especially if they&#039;re bored. "}}, {"@type": "Question", "name": "Are Alaskan Klee Kai good apartment dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The Alaskan Klee Kai’s small size makes them a good physical fit for apartments. However, these dogs need lots of exercise to stay happy (and quiet!). As long as you can walk your dog for at least one hour every day, Klee Kai can be good apartment pets. Featured Image: Adobe/Andrey"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Alaskan Klee Kai", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/alaskan-klee-kai2.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/alaskan-klee-kai2.jpg"}, "author": {"@type": "Person", "name": "Jamie Frevele", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Alaskan Klee Kai", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/alaskan-klee-kai"}, "datePublished": "August 28, 2023", "dateModified": "October 13, 2023", "description": "Alaskan Klee Kai look like a mini Husky breed and share a lot of the same characteristics. Learn how to care for Alaskan Klee Kai puppies and dogs here.", "articleBody": "Love the fluffy coat and striking blue eyes of a Siberian Husky, but looking for a dog that’s a lot smaller? Meet the Alaskan Klee Kai. These diminutive dogs are descended from one small Husky, and they share a lot of characteristics with their sled dog cousins—while being a much more manageable size. Though all are small, there are three different Alaskan Klee sizes: The standard Alaskan Klee Kai is 15–17 inches tall and weighs 16–25 pounds. Miniature Alaskan Klee Kai stand 13–15 inches tall and weigh 10–18 pounds. Toy Alaskan Klee Kai are the tiniest, at under 13 inches tall and just 6–12 pounds. This small Husky breed got its start in the 1970s with Linda Spurlin, the first Alaskan Klee Kai breeder. According to the Alaskan Klee Kai Association of America (AKKAA), Spurlin fell in love with a petite 17-pound Husky named Curious, then went on to create the Klee Kai dog breed by crossing Huskies with other small dogs. In fact, “klee kai” means “small dog” in Alaska&#039;s indigenous Athabaskan language. Caring for an Alaskan Klee Kai Though Siberian Huskies are working dogs, Alaskan Klee Kai were bred to be cuddly companions. But they do share commonalities with their Husky cousins. Alaskan Klee Kai are generally playful, intelligent, and friendly, but they might be wary of strangers at first. Like Huskies, Alaskan Klee Kai have lots of energy and need about an hour of playtime and exercise every day to keep them from getting bored. And, again like Huskies, Alaskan Klee Kai are very vocal. If their vocalizing becomes bothersome, your pup might simply be bored and need more mental stimulation. In terms of grooming, Klee Kai are much more manageable than Huskies. They need to be brushed once a week to help with the loose fur that falls from their double coat, and this breed only needs baths a few times a year. Alaskan Klee Kai Health Issues Like many small dogs, Alaskan Klee Kai have a long life expectancy, especially if they are kept healthy. It’s not unusual for a Klee Kai dog to live 13–16 years. And while they’re a generally healthy breed, there are some common conditions in this mini Husky breed. Patellar Luxation As a small breed, the Alaskan Klee Kai is prone to patellar luxation. This happens when the kneecap (patella) slips out of place, or luxates. Dogs with a luxating patella may bunny-hop or skip, holding up the affected leg as they walk. Some dogs with a luxating patella can be treated with anti-inflammatory and/or pain medication, while others that are severely affected will need surgical correction. If you notice your dog limping or having any changes to their gait, take your pup to the vet for an examination. Autoimmune Thyroiditis Autoimmune thyroiditis is a genetic condition that can cause a few health issues in your Klee Kai. This can lead to your dog showing signs of hypothyroidism, which include: Weight gain Lethargy Chronic skin and/or ear infections Dry and brittle coat A simple blood test will identify if your Alaskan Klee Kai has any thyroid issues. The condition is treated with lifelong medication. Heart Murmurs A heart murmur in your dog is an irregularity in their heartbeat that causes an extra sound, like a &quot;whoosh,&quot; that is picked up by your vet&#039;s stethoscope. If your vet hears a heart murmur, they may tell you to monitor your dog&#039;s respiration rate; rates above 35 breaths per minute could mean your dog&#039;s heart isn&#039;t pumping enough oxygenated blood. A heart murmur could also be a sign of a more serious condition, so talk to your vet about the best course of action.   Factor VII Deficiency Alaskan Klee Kai are prone to factor VII deficiency, a genetic blood disorder that causes excessive bleeding. Factor VII is a blood protein that signals clotting; without it, your Klee Kai’s blood won&#039;t clot. This is particularly dangerous if your dog needs surgery or experiences a trauma. While this can be life-threatening, it is treatable. And with the proper treatment, your Klee Kai can live a long, healthy life.  What To Feed an Alaskan Klee Kai It’s important to feed your Alaskan Klee Kai a high-quality, well-balanced dog food. The brand should meet nutritional guidelines set by the Association of American Feed Control Officials (AAFCO). Talk with your vet about how to choose the best food for your dog.   How To Feed an Alaskan Klee Kai Alaskan Klee Kai should eat two meals each day, one in the morning and one at night. Alaskan Klee Kai puppies need to eat more frequently—three or four times every day on a consistent feeding schedule. Because these pups are so smart and require ample mental stimulation, feeding them with a puzzle toy, snuffle mat, or slow feeder bowl will give them a brain-engaging game to play as they eat. How Much Should You Feed an Alaskan Klee Kai? The amount of food you give your Klee Kai dog depends on a few factors, including your pup’s age, health, and size: A standard Klee Kai will eat a lot more than a toy Alaskan Klee Kai! Though your dog food packaging will give guidance on portion sizes, always talk with your vet for the best advice on how much to feed your dog. Nutritional Tips for Alaskan Klee Kai Talk to your vet if you think your Klee Kai would benefit from a supplement. Do not give your dog any supplements until you’ve consulted with your veterinarian. Behavior and Training Tips for Alaskan Klee Kai Alaskan Klee Kai Personality and Temperament Klee Kai live to please the people they love, and these pups have a friendly, sweet temperament. But that may not extend to the clumsy hands of small children, so always teach kids how to properly interact with dogs, and supervise all interactions between children and animals. Much like Huskies, Klee Kai are high-energy dogs and need regular playtime to keep them from getting bored. If they do grow bored, Alaskan Klee Kai will complain about it—and loudly. Alaskan Klee Kai Behavior Alaskan Klee Kai can get along with other dogs, especially when socialized from a young age. But if you have smaller pets at home, Klee Kai might think of them as something to chase after. These pups can also be nervous around strangers unless properly socialized. At home, Klee Kai will happily join their humans on a long walk or for a backyard playtime session. And when all that energy is spent, Klee Kai dogs make the perfect cuddle companions for movie night. Alaskan Klee Kai Training Alaskan Klee Kai are smart dogs who are eager and willing to learn. Be gentle and patient during training, and always use positive reinforcement to get the best results from your dog. Fun Activities for Alaskan Klee Kai Agility training Dock diving Running and racing Obedience school Scent work Weight pulling  Carting Alaskan Klee Kai Grooming Guide Alaskan Klee Kai have thick double coats that can be black and white, gray and white, or red and white. These dogs have a reputation for being attentive self-groomers (much like cats), but there are still steps pet parents need to take to keep their Klee Kai clean. Skin Care The Klee Kai’s thick coat gives their skin a lot of protection. But if your pup has a thyroid condition—to which the breed is prone—this can affect their skin’s health. Talk to your vet if you see signs of hair loss, dry skin, or any changes to your dog’s skin. Coat Care Like their Husky cousins, the Alaskan Klee Kai’s thick coat sheds heavily twice a year. They benefit from a weekly brushing and occasional combing. They don’t need frequent baths; once every few months is fine. Eye Care In general, Alaskan Klee Kai are not prone to many health problems. They may develop occasional tear stains that can be cleaned with a pet-friendly eye wipe. If you notice any changes in your dog’s eyes, such as discharge or redness, talk to your vet. Ear Care The Klee Kai’s thyroid issues can also cause recurring ear infections. If you notice any redness, odor, or discharge, talk to your vet about the best course of action. Cleaning your pup’s ears can also be beneficial. Considerations for Pet Parents The Alaskan Klee Kai is a mini-Husky with a loud mouth, big energy, and a loyal heart. These dogs love being close to their family, and if they don’t get what they want, they will tell you. Because of their tendency to bark and howl, Klee Kai might not be the best fit for an apartment or home with shared walls. Smart and curious, Alaskan Klee Kai are always ready to learn new tricks and go on adventures. As long as they have something to keep them occupied and stimulated, Klee Kai are well-behaved and cuddly housemates."}]