[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Pomeranian a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Pomeranians have a bright attitude, intelligence, and an active nature they can make great family dogs. However, special consideration should be given if there are or will be young children in the home. Pomeranians are small, so rough play or dropping them can cause injuries and even broken bones. Consideration should also be given to the housing situation. Because of their large personalities, Pomeranians can disrupt neighbors with their barking."}}, {"@type": "Question", "name": "Are Pomeranians smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, Pomeranians are very intelligent."}}, {"@type": "Question", "name": "What are the drawbacks of a Pomeranian?", "acceptedAnswer": {"@type": "Answer", "text": "Because of their small stature and large personalities, they are targets for birds of prey when outside and they are at risk for injury when playing with children. Pomeranians also have guarding tendencies, and even with strict training they can bark excessively, causing disruptions in the home or disturbing neighbors."}}, {"@type": "Question", "name": "Why is a Pomeranian called a Pomeranian?", "acceptedAnswer": {"@type": "Answer", "text": "Pomeranians get their name from Pomerania, a region on the Baltic Sea that is in both Poland and Germany. This region is where they developed into the current breed that is known today. Featured Image: iStock.com/Ruta Lipskija"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pomeranian", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/pomeranian.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/pomeranian.jpeg"}, "author": {"@type": "Person", "name": "Autumn Madden, DVM", "url": "https://www.petmd.com/author/dr-autumn-madden"}, "keywords": "Dog, Breed, Zoo Pomeranian Pack, Zoo Small Dog Pack, Pomeranian", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/pomeranian"}, "datePublished": "June 22, 2022", "dateModified": "October 13, 2023", "description": "Pomeranians are small bundles of fluff with lots of energy and lots of personality. They can be prone to various health issues, making pet insurance a good investment. Learn more about caring for Pomeranians here.", "articleBody": "Pomeranians are a miniaturized descendent of the Spitz sled dog breeds—Akita, Alaskan Malamute, Chow Chow, and Samoyed—just to name a few. Originally, they were much larger, about 30 pounds, and were used for herding. However, once they gained popularity with Queen Victoria, they were bred to reduce their size to what we recognize now. Today, Pomeranians stand an average of 6 to 11 inches tall and weigh between 3 and 7 pounds. Their fur can be black, white, brindle, chocolate, orange, or red. They have a fox-like face, thick scruff around the neck, a square body, and a fluffy double coat. Caring for a Pomeranian Pomeranians are large personalities in tiny bodies. They will never hesitate to face an adversary many times larger than themselves. They do well with other pets and love attention. They are great companions for older people because they do not require lots of outdoor activity and are great at alerting for danger by barking. Their long, fluffy coat requires regular upkeep and grooming. They can also have health problems commonly found in the breed, including dental disease, tear duct issues, trachea collapse, cataracts, and hip and joint problems. Pomeranian Health Issues When considering a Pomeranian for a pet, it may be beneficial to consider health insurance and budgeting for any medical issues that may arise. The following are more likely to occur in the Pomeranian than some other breeds: Hypoglycemia Hypoglycemia is a sudden drop in blood sugar. This condition commonly affects small dogs and puppies under 3 months of age. Clinical signs include weakness, lack of appetite, stumbling, shaking, twitching muscles, and seizure. Most cases of hypoglycemia are caused by either not feeding enough or feeding a low-quality diet. If your Pomeranian experiences an episode of hypoglycemia it is vital that you contact your veterinarian and seek out medical immediately. Your veterinarian can work with you to find the right food and feeding schedule to prevent another episode. They can also recommend glucose gels, which provide instant doses of glucose to help your dog bounce back. Dry Eye Keratoconjunctivitis sicca (KCS), commonly known as dry eye, is a condition caused by inadequate tear production, which can cause damage and irritation to the cornea. Typical signs of dry eye are painful, red, or irritated eyes that cause a dog to squint, blink excessively, or hold their eyes shut. In many cases, there will be a discharge that is thick and yellowish in color. To diagnose dry eye, your veterinarian will perform a Schirmer tear test, which uses a special piece of paper to measure the amount of tears produced in one minute. If corneal ulceration or other eye injuries are present, your veterinarian may recommend additional diagnostics. Dry eye requires treatment to protect your dog’s eye health by replacing tear film and stimulating tear production. The most common treatment is eye drops that will be required daily, typically every 2 to 6 hours. Tear Duct Issues Tear duct issues such as excessive tearing can be caused by infection, genetics, inflammation, or other issues that can contribute to tear stains—dark or reddish marks that appear beneath the eyes—or a narrowing or clogging of tear ducts. The treatment will depend on the root cause of the issue, but it is important to pay attention to your Pomeranian’s eyes and make sure that their tear production or tear stains do not appear to be excessive. Cataracts Cataracts are an opacity, or clouding, of the eye lens. This is a progressive disease, meaning without treatment it will worsen over time. Pomeranians can have a genetic predisposition for cataract development, or it can be secondary to diabetes mellitus. If you notice your dog’s eyes becoming cloudy, make an appointment with your veterinarian to get them checked out. Your veterinarian will perform a few tests to determine the stage of the cataracts, as well as set a baseline to track their progression over time. Currently, the only option available for treating cataracts is surgical intervention to remove the diseased lens. Distichiasis Distichiasis is a condition in which the presence of one or more rows of eyelashes grow abnormally inward toward the eye. This condition causes irritation of the eye. Signs of distichiasis depend on the severity, but will typically include: Inflammation of the eye Eye discharge Pain (excessive blinking, squinting, watering eyes) If left untreated, distichiasis can lead to corneal ulceration. To diagnose the issue, your veterinarian will perform tests such as fluorescein staining and the Schirmer tear test. Treatment will vary for this condition. For mild cases where a dog is not experiencing any negative symptoms, no treatment may be recommended. For dogs with mild cases, a management program might be recommended. This would most likely be the use of an eye lubricant to protect the cornea by coating the extra eyelashes with a lubricant film. For severe cases, surgery is recommended. The goal of the surgery is to remove the irritating eyelashes as well as destroy the hair follicles so they cannot grow back. Collapsing Trachea Collapsing trachea is a condition that typically presents as a “goose honk cough.” It predominantly occurs in small dogs, especially those who are walked with a collar around their neck. The trachea is your dog’s windpipe, connecting the throat to the lungs. A tracheal collapse occurs when the small rings of cartilage that maintain the tube shape of the trachea become too flexible, losing their strength and firmness. When a dog pulls air into their airway, the tracheal rings flatten and it is difficult to get air into the lungs. To diagnose the condition, your veterinarian will x-ray your dog’s throat or use an endoscope or bronchoscope to see down the trachea. Treatment can include surgery, management through medication, or both. Medications used for treatment can include: Antibiotics Anti-inflammatories Cough suppressants Sedatives Bronchodilators If your dog suffers from tracheal collapse, harnesses are recommended for walking instead of collar. Avoid situations that cause your dog to get overexcited, and avoid exposing your dog to irritants like tobacco smoke. Dental Disease It is very common for smaller dogs to be more predisposed to dental disease because of the smaller size of their mouths. A smaller mouth means more potential for teeth becoming overcrowded or growing in at odd angles. This can lead to increased amounts of trapped food, which leads to tartar buildup. The best treatment for dental disease is proactive prevention. Your veterinarian can recommend dental care routines to help maintain tooth health, and can even recommend specialized food that supports dental hygiene. Pet parents can also talk with their  veterinarian about dental cleanings, which are typically done annually and require anesthesia. These cleanings allow your vet to remove plaque and tartar on teeth and below the gumline before it can accumulate and lead to periodontal disease and other dental issues. Hip Dysplasia Hip dysplasia is caused by a shallow hip socket or a small/deformed femoral head. Without treatment, hip dysplasia can cause significant pain and lead to arthritis. However, due to the small size of Pomeranians, cases of hip dysplasia typically cause minimal pain or discomfort and can be managed with medications or joint supplements. There are surgical treatment options, but they are rarely needed for Pomeranians. If you suspect that your Pomeranian could be dealing with hip dysplasia, talk with your veterinarian about a PennHIP screening. These specialized x-rays of a dog’s pelvis can detect if a dog will develop hip dysplasia in their lifetime. Legg-Calvé-Perthes Disease Legg-Calvé-Perthes disease is also known as Legg-Perthes disease, Perthes disease, coxa plana, and aseptic or avascular necrosis of the femoral head. It is a condition that affects the head of the femur and the hip joint. In cases of Legg-Calvé-Perthes disease, the femoral head experiences a loss of blood supply, which causes it to shrink and eventually leads to necrosis.   It typically occurs in young dogs and is a hereditary condition with no known cause. The most common symptom is the slow progression of lameness in the hind limb. This can be very painful for a dog, so it is not uncommon for them to become increasingly irritable. Your veterinarian will perform x-rays to confirm a diagnosis. The most common treatment for Legg-Calvé-Perthes disease is a surgery called Femoral Head Ostectomy (FHO). This surgery has a very good prognosis, and many dogs are back to running and playing within months. Patellar Luxation Patellar luxation is a condition that can range from mild to severe where the kneecap (patella) shifts sideways away from its normal position at the front of the knee. Most commonly, a luxating patella is shifting inward or toward the other limb. This is typically a hereditary condition, but in some cases it can be caused by trauma. Signs of patellar luxation can be similar to hip dysplasia: Intermittent limping Bowlegged stance in hind limbs Hunched lower back The diagnosis of a luxating patella can happen during a routine wellness exam, but your vet will recommend imaging (x-rays, CT scan, or MRI) to confirm. Medical treatment for a luxating patella can involve anti-inflammatory medication, weight loss, and temporary exercise restrictions. Pet parents can also take steps to prevent your dog from doing high-impact activities such as running up and down stairs or jumping on and off furniture. Treatment could take a few weeks before you see any improvement, and it could recommended throughout your dog’s lifetime, depending on flare-ups of the condition. Surgical treatment is typically used for more severe cases. However, there is a risk of recurrence with surgery. What to Feed a Pomeranian Because Pomeranians are more likely to develop hypoglycemia than many other breeds, it’s important that they are fed a high-quality dog food. An Association of American Feed Control Officials (AAFCO)-approved food is a good place to start to ensure that it meets standard nutritional requirements and regulations for pet foods. You can then discuss with your veterinarian the best choice for your pet. In some cases, your veterinarian may recommend a dental diet that with special-shaped kibbles that help clean your dog’s teeth as they eat. Lifestage diets are very important for Pomeranians, so be sure to feed yours a food that is appropriate for their age. How to Feed a Pomeranian Pomeranian puppies should be fed frequently with multiple mealtimes a day, due to their high metabolism and their lack of fat stores. Adult and Senior Pomeranians should be fed at least 2–3 times a day to continue to prevent the risk of hypoglycemia. Senior Pomeranians should also be fed a diet with antioxidants, which can help prevent free-radical damage and help slow down some effects of aging such as cognition decline. How Much Should You Feed a Pomeranian The exact number of calories your Pomeranian may need is dependent on multiple factors including activity, age, and if there are any underlying medical issues present. Less activity equals fewer calories per day, more activity equals more calories. Treats, chews, and toppers also need to be factored into the number of calories your Pomeranian will get in a day to prevent diseases such as obesity. To figure out how much food to feed your Pomeranian, consult your veterinarian as well as the feeding recommendations on the bag of dog food. Nutritional Tips for Pomeranians Pomeranians can have skin issues and joint issues, so it may be helpful to talk to your veterinarian about adding omega-3 fatty acids and joint supplements (such as chondroitin and glucosamine) into their diet as well. Pomeranians also have small mouths, which can predispose them to dental disease. To help slow down dental disease, a portion of their calories should be allotted to dental treats and chews. Behavior and Training Tips for Pomeranians  Pomeranian Personality and Temperament Pomeranians are intelligent with very large personalities. It’s not uncommon for Pomeranians to act as watchdogs, which means they are quite vocal and will bark more than the average dog. Their intelligence also means that Pomeranians enjoy learning and do well with training and mentally stimulating activities for dogs. Pomeranians like their independence, and because of this, they prefer to walk on the ground rather than to be carried. Despite being high-energy, their small frame ensures that they can get plenty of exercise running around the home. Pomeranian Behavior While Pomeranians can make great companions for a lot of homes, try to learn about training and socialization to ensure they develop into well-adapted dogs. Socialization will be a vital part of a Pomeranian’s development. Without proper socialization and training, behaviors such as excessive barking, reactive behavior, separation anxiety, hyperactivity, nipping, and territorial guarding can emerge. Pomeranian Training Pomeranians respond well to clicker training and praising. They also enjoy mentally stimulating activities like training exercises and games. Since Pomeranians require lots of grooming, learn about touch desensitization, so they are well-behaved and calm while at grooming appointments. Pomeranians can be on the trickier side to house train, so you will need to be consistent and patient. Fun Activities for Pomeranians Walks Fetch Agility Obedience training Flirt poles Puzzle toys Pomeranians can also be a great breed for therapy dogs. Pomeranian Grooming Guide Pomeranians require consistent grooming routines to maintain their coat and skin health. Skin Care Pomeranians can have dry skin. It may be beneficial to talk to their veterinarian about adding fish oil to their diet to help moisturize the skin. Coat Care Pomeranians have very thick fur, and because of how dense and long their hair can be, routine trips to a professional groomer can be helpful to maintain coat health. A groomer can also provide a sanitary shave, which removes the hair around the genitals and rectum so that bodily waste does not get caught and accumulate in the coat. In between grooming appointments, Pomeranians should be brushed at least once or twice a week. During shedding seasons (twice a year), they should be brushed daily. Eye Care If your Pomeranian is experiencing excessive tearing, it can be beneficial to take a clean cotton ball and eye wash solution to remove any debris in the area once or twice a day. Long hair around the face has the potential to get into the eye and cause irritation and infection. Talk with your veterinarian or groomer to help trim the hairs around the eyes. Because Pomeranians can have hair issues around the eyes, call your veterinarian if you see any of the following: Squinting Green or yellow discharge Considerations for Pet Parents If you are purchasing a puppy, make sure the parents have been genetically tested for hip and eye problems and the results of these tests recorded with the OFA (Orthopedic Foundation for Animals) and CERF (Canine Eye Registry Foundation) respectively. If you are adopting a dog from a rescue or shelter, it’s unlikely that these pets have been registered. You can still work with your veterinarian to get the necessary genetic testing to learn if your dog is at risk. Pomeranians also require quite a bit of grooming and upkeep for their thick, long coats. They are also known for being quite vocal, so you can expect some barking. This breed is known for being a big personality in a pint-sized body. Also, because Pomeranians are small and fluffy like many prey species like rabbits, be very diligent about watching them while they are outside. Predatory birds and animals may mistake your dog for their usual prey. Significant changes to the eye Swelling Ear Care Since a Pomeranian’s ears are erect, they are less likely to get ear infections than their floppy-eared counterparts. After a bath or an activity where your Pomeranian gets wet, it can be helpful to use an ear drum-friendly, self-drying ear cleaner to remove any water out of the ear canal. Talk to your Pomeranian’s veterinarian about which products they recommend and the best technique for regular ear cleaning."}]