[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long do Rat Terriers live?", "acceptedAnswer": {"@type": "Answer", "text": "The lifespan of a Rat Terrier is impressively long at 12–18 years. Celebrating their 15th birthday is quite common for this hardy little breed."}}, {"@type": "Question", "name": "How big do Rat Terriers get?", "acceptedAnswer": {"@type": "Answer", "text": "This is a relatively small dog that reaches only 10–25 pounds, both in the standard and the miniature size. They tend to have a big personality in that small package, though!"}}, {"@type": "Question", "name": "Is the Rat Terrier a good family pet?", "acceptedAnswer": {"@type": "Answer", "text": "Rat Terriers tend to love their family, especially if they’re included in whatever the family is doing. They’re often wonderful with children, especially if introduced to them from a young age."}}, {"@type": "Question", "name": "Do Rat Terriers bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "While a bored Rat Terrier might become a bit yappy, this is not a breed that barks much without reason. In other words, if your Rattie sounds an alert, it may be a good idea to pay attention!"}}, {"@type": "Question", "name": "Where do I find a Rat Terrier puppy?", "acceptedAnswer": {"@type": "Answer", "text": "If you’re interested in Rat Terrier adoption, Kallas says there are several national rescue groups that do excellent work for the breed—and because they all work a bit differently, it’s wise to chat with each of them to see which one might work best for your family. “Any time you contact a rescue about any breed, it is important to clarify any background information you can get on the individual dog you are considering,” she adds.  For those looking to connect with a breeder, Kallas suggests keeping in mind that it takes time and money to raise sound, healthy dogs. “If you like the way [a breeder’s] dogs look and act as compared to anything else you have seen, you are recognizing that time and money,” she says, “so be willing to pay for that.” Featured Image: iStock/cweimer4"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rat Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/rat-terrier.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/rat-terrier.jpg"}, "author": {"@type": "Person", "name": "Kristen Seymour", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Zoo Rat Terrier Pack, Rat Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/rat-terrier"}, "datePublished": "March 6, 2023", "dateModified": "October 13, 2023", "description": "Rat Terriers are smart and crafty little dogs that need lots of attention and positive reinforcement to thrive. Though the Rat Terrier lifespan is long, they are prone to certain health issues. Learn more about caring for Rat Terrier puppies and dogs.", "articleBody": "Rat Terriers are every bit as tenacious and active as they are entertaining and funny, which makes this adorable little dog a fantastic fit for some families—but a challenge for those who aren’t patient or ready to laugh at their antics. Between this, their intelligence, and their energy levels, they’re typically best suited to experienced pet parents. Bred to hunt rats, as their name suggests, Rat Terriers are bright and nimble. While they can still certainly excel in the hunt, this is a very family-oriented dog that wants to join in with whatever his people happen to be doing. This breed comes in two compact sizes: a miniature Rat Terrier dog that stands 10–13 inches tall, and the standard size that’s 13–18 inches tall. The Rat Terrier lifespan is generally 12–18 years.  Caring for a Rat Terrier  “Rat Terriers are, in general, the ‘jack-of-all-trades’ of the terrier world,” says Tracey Kallas, an AKC judge, vice president and judges education coordinator for the Rat Terrier Club of America and owner of K2 Rat Terriers. She’s been breeding, training, showing, and loving the breed for 30 years. Rat Terriers are incredible hunters, containing the intelligence and sense of humor that you’d expect in a terrier. They also have a strong desire to be with their people; this is not a breed that enjoys being left alone for long periods. Athletic and playful, Rat Terriers are feisty, funny dogs that need an appropriate outlet for their energy. If they’re restless or bored, they may use their bright mind to come up with a way to entertain themselves that you’re unlikely to appreciate. Grooming, however, is generally a cinch thanks to their slick, tight coat—but be aware that they do still shed. As much as they love their family, this breed was bred to hunt vermin—and their natural prey drive reflects that, so early (and consistent!) socialization and training is a must. “Ratties,” as they’re often called, typically get along well with other pets (including cats!) if they’re raised with them. That said, they can view pocket pets like hamsters as snacks rather than siblings. Rat Terrier Health Issues Rat Terriers that have their nutritional, environmental, and social needs met and come from responsible breeders tend to be healthy dogs. However, there are a few potential health issues for which the national breed club recommends testing. Hip Dysplasia Hip dysplasia occurs when the hip joint has developed abnormally and creates a loose joint. Dogs with this condition generally show signs of discomfort including reduced mobility, less interest in activity, or simply moving stiffly. Talk to your vet about whether joint supplements, anti-inflammatory medications, or even surgery may help your pup. Patellar Luxation This condition, where the kneecap (or patella) shifts out of place, is common in Rat Terriers and other small dog breeds. Dogs with patellar luxation might “skip” or “bunny hop,” lifting a hind leg as they walk. Treatment might not be necessary in mild cases, but joint supplements might be helpful with this condition. Surgery might be recommended if the luxation is severe. Legg-Calvé-Perthes Disease Dogs with Legg-Calvé-Perthes disease experience a disintegration of their hip joint at the head of their femur bone. This can lead to pain and osteoarthritis. Your vet will diagnose the condition with X-rays, and treatment is often done with surgery. Dogs usually recover very easily from this surgery and go on to live long, pain-free lives. Primary Lens Luxationlens luxation may have painful, reddened eyes; iris or lens trembling; or other abnormalities that your veterinarian will be able to observe. This condition can lead to glaucoma and, if left untreated, total blindness. Cardiac Disease Rat Terriers, especially as they age, can develop heart disease. They may have a heart murmur that your vet will detect, but other symptoms may include coughing, weight loss, fatigue, or fainting from excitement or exercise. It’s also possible for a dog to have heart issues with no symptoms. Your veterinarian will advise you on whether changes to diet and exercise are in order, and in some cases your Rat Terrier might need lifelong medications. What To Feed a Rat Terrier A balanced diet of high-quality dog food is best for a Rat Terrier. Opt for commercially available food approved by the Association of American Feed Control Officials (AAFCO) to make sure your food of choice provides proper nutrition and meets all necessary regulations. A dog food designed for small dog breeds would be appropriate, and—because Rat Terriers can be prone to skin allergies from various causes—Kallas says she looks for kibble with a fish-based protein (otherwise, she supplements with fish oil). How To Feed a Rat Terrier  Rat Terriers tend to be good eaters, so feed them a measured amount of a food appropriate for their life stage (puppy, adult, or senior) twice a day. Free-feeding, or leaving food out all the time, is not recommended; this can easily cause them to become overweight or obese. How Much Should You Feed a Rat Terrier?  Although they’re small and active, Rat Terriers are prone to obesity, says Iram Sharma, DVM and veterinary writer. This is particularly concerning due to their potential for joint and cardiac issues. Always make sure you’re feeding your Rat Terrier the proper amount. Your AAFCO-approved dog food will have portion recommendations on the bag, and your vet can help with any feeding questions. Nutritional Tips for Rat Terriers  Because Rat Terriers are prone to joint issues, Sharma recommends pet parents talk to their vet about incorporating joint-friendly supplements that contain chondroitin and glucosamine into their dog’s diet. Behavior and Training Tips for Rat Terriers Rat Terrier Personality and Temperament   Rat Terriers are persistent and tenacious when it comes to problem-solving and getting a job done. Kallas loves this about the breed, but she admits it can also be downright difficult for inexperienced dog parents who aren’t prepared to set (and stick to!) firm and consistent rules. Ratties need plenty of physical and mental stimulation; remember, these are bright pups with a curious nature, so it’s on you to keep them out of trouble.  If a Rat Terrier is introduced to new people (including children), other dogs, and cats early on, they’ll likely get along with everyone. As with any dog, supervision with children is recommended. “Rat Terriers can be very affectionate and good with children; however, not all dogs like kids, just like not all humans like kids,” Kallas says. She strongly recommends working closely with a reputable Rat Terrier breeder to find a puppy that’s a good fit for your situation.  Rat Terrier Behavior  As members of the terrier group, Rat Terriers can have a propensity to dig, particularly if they aren’t receiving enough attention. Paired with their insatiable curiosity and athletic nature, this can make them talented escape artists, so this is not a dog you should leave alone in your backyard. They’re not generally nuisance barkers but, again, if they’re feeling bored or lonely, they may let you know. Regular exercise is non-negotiable, but they don’t need to be kept moving at all times. The important thing is that your Rat Terrier feels engaged in what their family is doing. “They are smart enough and social enough to want to be a part of everything, to want to know and understand what is going on around them, and to try to be part of the fun,” Kallas says.  Rat Terrier Training   Socializing your Rat Terrier puppy (in addition to providing them with appropriate mental and physical stimulation) is essential. And while that should begin with your breeder, that’s only the start. “[Breeders] do their job for the first eight weeks, and it’s your job to work on that for at least the next year. And it is a job,” Kallas says. “The best thing you can do for your new family member is get them out into the world and experience it with them.” Rat Terriers do best with positive reinforcement, patience, and clear boundaries—though, Kallas says, they will test those boundaries. Training sessions should be kept short, fun, and full of rewards for good behavior. Introducing them to crate training early on is wise, because it will keep them (and anything they can get their teeth on) safe if you need to leave them alone for a bit. Fun Activities for Rat Terriers  Agility  Obedience training Flyball Scent work/tracking Swimming Jogging Hiking Playing with toys Cuddling on the couch Being with their people Rat Terrier Grooming Guide With their short, dense coat, Rat Terriers are low maintenance in the grooming department. But it should be noted that they shed mildly throughout the year, with a heavier seasonal shed in the spring and fall.  Pet parents need to keep up with weekly nail trims, and Kallas recommends annual dental cleanings. “These are tough little dogs who use their mouths to interact with the world,” she says, “so keeping their teeth healthy is important for their happiness.” Skin Care  “Rat Terriers’ skin is quite sensitive, especially around the belly region,” Sharma says. “They are prone to chronic allergies and scratching, which often results in secondary bacterial infections.” If you notice your Rattie scratching or licking more than usual or any red bumps or hair loss, talk to your veterinarian right away to reduce the risk of a more serious infection. Coat Care  The Rat Terrier’s coat doesn’t require too much to stay smooth and shiny. A quick brushing every week or so will help remove dead hairs and reduce shedding. Ratties might need a bath now and then, Kallas says, but that’s mostly only if they begin to smell. But you should not bathe them more frequently than once a month or so, she adds, as this will strip them of the natural oils that keep their skin healthy.  Eye Care  Because Rat Terriers are prone to certain eye issues, take a good look at them when you sit down for a grooming session so you can note any changes. Another tip: When bathing your Rat Terrier, Sharma says to take care to prevent shampoo and water from getting into their eyes. “Rat Terriers don’t have long fur around their eyes and ears like some breeds do, which makes them more susceptible to water entering and causing irritation.” Ear Care  Aside from doing your best to keep water out of your Rat Terrier’s ears, there’s not much in the way of special ear care required. However, because they can be more prone to environmental allergies than some breeds, keep an eye out for any itching of the ears, which could lead to infection. Considerations for Pet Parents  Before you add a Rat Terrier to your family, make sure you’re prepared to meet their needs. They require firm boundaries, regular exercise, and lots of love and attention from their family to feel safe, secure, and happy. “Because they’re very malleable and smart, they can adapt to most situations and make a really nice addition to your family, no matter what your family likes to do,” Kallas says. However, if you’re a bit of a pushover for puppy-dog eyes, prefer to let your pooch set the rules, can’t see the humor in your dog trying to outsmart you, or don’t have a lifestyle you can easily incorporate your dog into (now and for the next 15 years), this is not the right breed for you. "}]