[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Norfolk Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Norfolk Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_norfolk_terrier"}, "datePublished": "October 6, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Norfolk Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Norfolk Terrier is one of the smallest working terriers. While on the hunt, it is a little demon, showing versatility in handling small vermin, bolting a fox, or going to ground. The Norfolk is also very capable of working in a pack.  Physical Characteristics The Norfolk Terrier, with its short legs and small, compact body, has a low and driving gait. It is slightly longer than its cousin the Norwich Terrier, but similarly has a weather-resistant double coat (which is generally red, wheaten, or black and tan in color) with a wiry, hard, straight outer layer and a long ruff. Unlike the Norwich Terrier, the Norfolk has &quot;drop,&quot; or folded ears. Personality and Temperament The strong-willed, playful, and independent Norfolk is a true terrier. Touted as a &quot;demon&quot; in the field, it loves to investigate and hunt and is known for its cleverness. Care This terrier can live outdoors in warm and temperate climates, but as it is more of a family-oriented dog, it is suited for indoor living. Daily exercise, in the form of a boisterous game session or short leash-led walk, is necessary to keep the dog calm and fit. If you do allow it to remain outdoors, be wary that it does not escape to hunt an animal. The dog’s wire coat requires combing every week, in addition to stripping the dead hair at least three times a year. Health The Norfolk Terrier, which has an average lifespan of 13 to 15 years, is susceptible to minor health issues like allergies, and serious conditions like canine hip dysplasia (CHD). It also may occasionally suffer from patellar luxation. To identify some of these issues early, a veterinarian may recommend hip and knee tests for dogs of this breed. History and Background Though the early histories of the Norfolk Terrier and the Norwich Terrier are identical, the dogs are now recognized as two separate breeds. It was Frank &quot;Roughrider&quot; Jones, in the early 20th century, who first developed a breed of working terrier that was fearless and had good sporting instincts. Early on the Norwich Terrier, as Jones&#039; breed was first named, came in a variety of sizes, types, colors, and ear carriages. But soon after dog fanciers began entering the breed in show rings in the 1930s, they realized crossing the drop- and prick-eared varieties produced unique offspring. The prick-eared strain remained the most popular variety in Europe, until Miss Macfie of Colansays brought the drop ears back into fashion in the 1940s. There was much debate concerning the standard of the Norwich Terrier and whether drop-eared Norwich dogs should even be accepted. However, this was finally resolved in 1964, when the English Kennel Club identified them as two separate breeds -- the drop ear variety as the Norfolk and the prick ear as the Norwich. The American Kennel Club later followed suit in 1979, and separated each breed by their ear carriage type."}]