[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lancashire Heeler", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-lancashire-heeler-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-lancashire-heeler-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Lancashire Heeler", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_lancashire_heeler"}, "datePublished": "September 6, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Lancashire Heeler Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Although small, the Lancashire Heeler became known as a cattle herder when it originated in Great Britain. This dog is small but full of energy, making a great family pet. Physical Characteristics This small but sturdy dog generally weighs anywhere from 6 to 13 pounds at a height of 10 to 12 inches. The Lancashire Heeler has a dense double coat, seen in a black and tan or a liver and tan coloring. Personality and Temperament This dog breed is smart and happy, making a good family pet. Due to its history, the Lancashire Heeler has a tendency to want to herd and may nip at people’s heels if it is not trained obedience at an early age. This breed is known for an innate ability to hunt mice and rabbits. Care This dog breed requires minimal coat maintenance; however, the Lancashire Heeler is very active and requires daily exercise. This small dog will do fine without a backyard as long as it has plenty of play and exercise. Health The Lancashire Heeler is considered a generally healthy breed, living anywhere from 12 to 15 years. Some common diseases seen in the Lancashire Heeler include Collie eye anomaly, primary lens luxation, and persistent papillary membrane, all of which affect the dog&#039;s sight. History and Background The exact origin of the Lancashire Heeler is unknown, however it is generally accepted that the breed resulted as a mix between the Corgi and a black and tan terrier. Because these dogs are self-made from breeding on their own, it is unknown if there were any other dog breeds added into the making of the Lancashire Heeler. Originating in Great Britain, this dog breed was used by farmers for cattle driving. Although much smaller than the usual cattle driving dog, the Lancashire Heeler did its job by keeping the cattle moving without injuring itself or the stock. The Lancashire Heeler was recognized by the United Kennel Club in 2009. Featured Image: iStock.com/TanyaLittle"}]