[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dandie Dinmont Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Dandie Dinmont Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_dandie_dinmont_terrier"}, "datePublished": "July 29, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Dandie Dinmont Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Dandie Dinmont Terrier was bred to go to underground. A working terrier, it’s long and low with a distinctive large head. The Dandie also has a soft, wise expression and a sturdy, flexible body. Physical Characteristics The Dandie’s characteristic coat is partly comprised of two-inch long, soft hair and hard hair (about one-third soft hair and two-thirds hard hair). Its head, meanwhile, is large and is covered with silk, soft hair. The silky tassels on the tips of the ears enhance the dog’s appearance, and the topknot gives the dog a dignified, determined, wise, and soft expression. The Dandie is not like the typical terrier, as it has a series of curves, ending in a moderately long, scimitar-shaped tail. Built to chase tough quarry, the dog&#039;s length is twice its height, and its front legs are shorter than the hind legs, giving it an easy and free gait. Personality and Temperament People of all age groups will love this loyal companion. However, it should be exercised every day lest it get frustrated. This independent and intelligent breed has a tendency to be shy with strangers but aggressive towards unknown dogs. Some also dig. Do not consider a Dandie Dinmont to be a fancy, &quot;dandified&quot; dog. It is boisterous, loves to tumble and is always ready for hunting. In spite of this, the dog is a very decent and affectionate, but not doting, house pet. Care The dog’s coat needs to be combed twice a week, in addition to regular shaping and trimming. For show dogs, continuous shaping is required. But clipping and stripping just four times a year is sufficient for pet Dandie Dinmonts. The Dandie loves to explore and hunt, so make sure it does this in a secure area. To remain fit, the Dandie should be walked regularly. Additionally, Dandies should be allowed to sleep inside, but may be kept outdoors during the day. Health The Dandie Dinmont, which has an average lifespan of 11 to 13 years, may suffer from cheyletiella mites infections, or minor health issues such as intervertebral disk disease and glaucoma. Eye tests are suggested for this dog. History and Background Although the unusual appearance of the Dandie Dinmont Terrier makes it look different, it bears the same ancestry as other terriers. The first Dandie appeared in the 18th century near the border of England and Scotland. Here, gypsies and farmers owned these terrier dogs and used them for killing badgers, otters, and foxes and for pulling. There was a time when they were also known as Hindlee, Catcleugh, and Pepper and Mustard terriers. James Davidson owned most of the reputed dogs and named nearly all of them as Mustard or Pepper, with some suitable adjectives. Some view the character of Dandie Dinmont and the dogs in Sir Walter Scott&#039;s 1814 novel, Guy Mannering, as being modeled after James and his dogs. In fact, a letter by James Davidson claimed that all Dandies actually came from Tarr and Pepper, two of his own dogs. The general group of Scotch Terriers that covered many short-legged terriers, also included the Dandie. In 1873, however, the Dandie was recognized as a separate breed. According to an old Scottish saying, &quot;A Dandie looks at you as though he&#039;s forgotten more than you ever knew.&quot; Though it remains one of the lesser-known terriers today, it is still moderately popular among dog fanciers."}]