[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Finnish Spitz", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Finnish Spitz", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_finnish_spitz"}, "datePublished": "July 16, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Finnish Spitz Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "A dog bred for hunting small game and birds, the Finnish Spitz looks rather fox-like: pointed muzzle, erect ears, dense coat and curled tail, which are all due to its northern heritage. The people of Finland are proud to recognize the Finnish Spitz as their national dog. Physical Characteristics The Finnish Spitz is square-proportioned, light, and quick-footed. Both its temperament and conformation are perfect for tireless and active hunting, even in the coldest weather. Its fox-like appearance and other characteristic features (dense double coat, small erect ears, curled tail) are a tribute to its northern heritage. Its double coat, comprising a straight and harsh outer coat and a short soft undercoat, provides warmth in cold weather. Personality and Temperament The playful, alert, and curious Finkie (as it is affectionately known) is a sensitive dog that is completely devoted to its human companion. Similar to other spitz breeds, the Finkie is stubborn and independent, but unlike them, it enjoys hunting. Even though the breed is good with other pets and children, it can be scrappy towards strange dogs. It is also suspicious, aloof, and reserved with strangers. The Finkie takes pride in its ability to bark a lot, even showing off this trait at every opportunity. Some male Finkies can be dominating, and are aware of their positions in the hierarchy. Care Although the Finnish Spitz can survive outdoors in cool and temperate climates, it prefers living indoors, as it craves social contact. Because it is lively and active, the Finnish Spitz requires daily physical exercise such as a long on-leash walk or a run around the park. One should be careful, however, that this hunting breed does not go hunting on its own. Its double coat requires occasional brushing every week and more often during the shedding season. The Finkie is not oily and generally remains clean. Health The Finnish Spitz, which has an average lifespan of 12 to 14 years, is prone to some health concerns, including canine hip dysplasia (CHD), epilepsy, and patellar luxation. History and Background Originating from northern spitz dogs that roamed with early Finno-Ugrian tribes in their travels throughout Eurasia and Finland, the Finnish Spitz has a rich ancestral history. These dogs were probably watchdogs and camp followers, and then later developed into hunting dogs. As the breed was isolated until the early 19th century, it remained pure. In the 1800s, the pure Finnish Spitz was almost wiped out due to inter-breeding when other people came to the region with their dogs. Two Finnish sportsmen, however, discovered some pure Finnish Spitzes in the late 1800s and were determined to rescue the breed. It was originally known by many names, including the Finnish Cock-Eared Dog, Suomenpystykorva, and Finnish Barking Bird Dog. When it first arrived in England, for instance, it was referred to as Finsk Spets (a tribute to its Swedish name); in 1891, however, Finnish Spitz became its official name. The nickname &quot;Finkie&quot; was later adopted. The Finish Spitz did not arrive in the United States until the 1960s. In 1988, it was officially placed in the American Kennel Club&#039;s Non-Sporting Group. The Finnie is still used as a hunter in Finland, although in America it is mainly considered a house pet."}]