[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Plott Hound a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Plott Hounds make a great family dog for those who can dedicate plenty of time to the dog’s physical and mental stimulation. The breed might do best with older children who can keep up with their active nature."}}, {"@type": "Question", "name": "Is a Plott Hound a medium or large dog?", "acceptedAnswer": {"@type": "Answer", "text": "Plott Hounds land somewhere in the middle. They can range from 20–25 inches tall and usually weigh 50–60 pounds."}}, {"@type": "Question", "name": "How long do Plott Hounds live?", "acceptedAnswer": {"@type": "Answer", "text": "The average Plott Hound lifespan is 12–14 years."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Plott Hound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/plott-hound.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/plott-hound.jpg"}, "author": {"@type": "Person", "name": "Sarah Kloepple", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Zoo Plott Pack, Plott Hound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/plott-hound"}, "datePublished": "June 5, 2023", "dateModified": "October 13, 2023", "description": "Plott Hounds are the North Carolina State Dog and known for their brindle coats and hunting prowess. Learn how to care for Plott Hound puppies and dogs.", "articleBody": "The Plott Hound has a curious origin story compared to other hounds found in the U.S. These scent hounds were originally bred in North Carolina (where they’re now the state dog), and the name traces back to Johannes Plott, a German gamekeeper who arrived stateside in the 18th century with his Hanoverian Scenthound hunting dogs. He settled in what is now Cabarrus County, North Carolina, and his family began what would become a long history of breeding their own strain of these dogs, then known as “Plott’s hounds.”  Today, Plott Hounds are known for their distinct brindle-colored coat, as well as their penchant for hunting and confident, courageous personality. They can reach up to 25 inches tall and can weigh as much as 60 pounds. Caring for a Plott Hound By the look of them, it’s easy to see why Plott Hounds have often been described as tenacious. This surely is because of their hunting roots—it’s not uncommon to see them with their nose to the ground or up a tree—but Plotts are also described as great family dogs who are loyal and eager to please. This breed requires minimal coat care, and Plotts adore both human and canine companionship. They also love to be active, whether it’s during a hiking expedition, a swim in the lake, or a long walk (with plenty of exciting smells) through the park. Plott Hound Health Issues Plott Hounds have an average lifespan of 12–14 years and are not prone to any major health concerns. But they can be susceptible to some. Elbow and Hip Dysplasia Elbow dysplasia refers to abnormalities in a dog’s elbow where the joint doesn’t develop properly. Hip dysplasia is a similar condition, where the hip joint doesn’t fit together correctly and becomes loose. If left untreated, both can lead to arthritis. Ask your vet for a screening if you notice symptoms such as lameness or limping, an abnormal gait, or a swollen joint. Treatment can include joint supplements, weight management, and surgery if the case is severe. Ear Infections Because Plotts have floppy ears, there can be trapped moisture and decreased air circulation within their ear canals. This makes it easier for bacteria and yeast to grow and cause ear infections. Common signs of an ear infection in dogs include redness, itching or scratching, odor, excessive debris in the ears, and shaking of the head. Dog ear infections require vet treatment and medication to restore a healthy ear canal. They’re preventable, though—just be sure to keep your dog’s ears clean and dry. What To Feed a Plott Hound Feed your Plott Hound a high-quality diet that matches their life stage (puppy, adult, or senior). Also, choose a dog food approved by the Association of American Feed Control Officials (AAFCO). This means it’s certified to have the standard ingredients and nutritional components for a balanced diet. Plotts can be prone to obesity, so keep an eye on their calorie intake. How To Feed a Plott Hound A Plott Hound puppy’s meal schedule should include at least three measured meals a day, preferably at the same time every day. To find the best puppy feeding times, develop a schedule that works with your weekday routine and can also be followed on weekends.  As your Plott reaches adulthood, their active lifestyle means you should feed them twice a day (in the morning and evening). How Much Should You Feed a Plott Hound? The amount of food your Plott Hound needs varies by dog. Factors influencing their portions include your dog’s lifestyle, age, weight, and activity level. Dog food bags often have a feeding guide that typically recommends a total amount of food that should be given to your dog over a 24-hour period. But always talk to your veterinarian for the best guidance.  Nutritional Tips for Plott Hounds To help preserve your Plott Hound’s mobility, especially as they age, consider joint supplements like glucosamine or fish oils, which are high in omega-3 fatty acids. Always talk to your veterinarian before giving your pet supplements. Behavior and Training Tips for Plott Hounds Plott Hound Personality and Temperament Plott Hounds can be headstrong, but they’re very social pups who love to play with other dogs and their humans. They’re often alert and quick to learn. Plott Hounds are known for their distinct brindle-colored coat, as well as their penchant for hunting and confident, courageous personality.Although they possess inherited hunting instincts, they’re loving, people-pleasing dogs who would be a fit for any family. The breed might do best with older children who can keep up with a Plott’s active nature. Plott Hound Behavior Plott Hounds are scent hounds, so their attention is easily pulled by smells. This, coupled with a high prey drive, means they might be tempted to dash off after smaller animals. Always keep your Plott Hound inside a fenced yard or on a leash whenever they’re outside.   They’ve been known to let out long, steady barks (they’re hounds, after all). And though Plotts are sometimes suspicious of strangers, they can befriend them quickly with a proper introduction. Plott Hound Training Because they’re alert and intelligent dogs, Plott Hounds love having tasks to complete, although they can be stubborn. Start your Plott puppy’s training and socialization early, and use a positive, creative training approach that keeps them on their toes. If you make it a game, your Plott (and you!) will have more fun. Fun Activities for Plott Hounds Nose work Agility Hunting Puzzle toys Running Hiking Swimming Plott Hound Grooming Guide When it comes to grooming, Plott Hounds are a low-maintenance breed. Their coat is short and easy to clean. Skin Care While no special skin care is required for Plott Hounds, a basic bathing routine may be needed to help maintain healthy skin. Coat Care Plott Hounds have a short, low-maintenance coat. A simple weekly brushing can keep their coat in top shape and prevent too much shedding. Because they’re active, outdoor-loving pups, ask your vet about flea and tick prevention, and give your dog a good once-over with a flea comb in the summer.  Eye Care Plott Hounds don’t need special eye care, but routine cleaning with a soft, damp cloth will help prevent normal tearing from building up around the eyes. Ear Care Because Plott Hounds are prone to ear infections, clean your pup’s ears regularly (especially if they love to swim). Cleaning is best accomplished with a professional dog ear cleaning product. These typically have been specifically formulated for effective pH ranges for dogs and contain drying agents. Considerations for Pet Parents Although they’ve long been known as fearless hunting dogs, Plott Hounds today are an intelligent, active breed that is loyal to their humans. Although they don’t need a ton of grooming, Plott Hounds do need regular exercise to keep them good-tempered and entertained. They’ll thrive if your home has a big backyard for them to stretch their legs and follow exciting scents. "}]