[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Kerry Beagle", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Kerry Beagle", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_kerry_beagle"}, "datePublished": "March 14, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Kerry Beagle Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Not your average beagle, the Kerry Beagle is better qualified as a hound. This dog is believed to be one of the oldest of all the Irish dog breeds, originally introduced to Ireland by the Celts. Although they are best know as a hunting dog, the Kerry Beagle is known as a friendly dog, ideal for families. Physical Characteristics The Kerry Beagle differs in size from the traditional beagle breed, weighing up to 60 pounds and standing 22 to 24 inches tall. This dog breed can be seen in a variety of coat colors, including black and tan, tan and white, tricolor of black-tan-white, blue mottled and tan, and solid black. Personality and Temperament Although this Irish dog breed is a specialized hunter, the Kerry Beagle makes a good family pet, interacting well with children and other dogs. This energetic dog requires a good amount of exercise. They are quick, however, so leash Kerry Beagles when in public is strongly recommended. Regardless of its background in hunting, this breed is known for being gentle and friendly. Care A home with a spacious yard is best for the energetic Kerry Beagle, though it can be kept in apartments as well, as long as it is given the opportunity for daily exercise. Simple grooming, including occasional brushing of the coat and bathing when necessary, is all that is required for this dog breed. Health Kerry Beagles have an expected life span of 10 to 14 years. There are no known health problems specific to this breed. History and Background Of all Irish Hounds, the Kerry Beagle is believed to be one of the oldest breeds. It is said that the “gadhar,” a dog written about in ancient Irish texts, is a direct ancestor of the Kerry Beagle. It was most likely introduced to Ireland during the Middle Ages with the arrival of the Celtics. Although the exact history of this dog breed is under dispute, it is said that the Kerry Beagle is a descendant of the Old Southern Hounds. The Kerry Beagle was developed over time, mixed with other hound breeds, possibly to create an ideal dog for hunting. There was a great decline in the number of Kerry Beagles in later centuries, nearly leading to the breed&#039;s extinction. However, the breed’s popularity eventually did increase, and even spread to other areas like the United States. The Kerry Beagle was formally recognized by the Irish Kennel Club in 1991."}]