[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Norwegian Lundehund", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Norwegian Lundehund", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_norwegian_lundehund"}, "datePublished": "April 25, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Norwegian Lundehund Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The small and energetic Norwegian Lundehund, dating back to the 16th century, was originally developed to hunt Puffin birds along the cliffs in Norway. Because of its unusual hunting grounds, the Norwegian Lundehund developed characteristics unlike any other dog breed, including six toes per front paw and a double-jointed neck. Physical Characteristics The Norwegian Lundehund is a small, rectangular dog breed with characteristics unlike any other. It has six toes on each front paw, one on each resembling a human thumb, while the rest of the toes are triple-jointed rather than the average double-jointed seen in other breeds. To enable its ability to hunt in small spaces, the Norwegian Lundehund also has a very flexible neck that can bend backwards to the spine, as well as flexible shoulder structure and ears that close both forwards and backwards. The coat of a Norwegian Lundehund is generally tan or reddish, some with black hair tips. It weighs about 15 pounds and stands at a height of 12 to15 inches. Personality and Temperament The Norwegian Lundehund is a very friendly and happy small dog breed, and gets along well with children and strangers. If the dog is not properly socialized as a pup, it may be shy, especially around strangers, but it does not have aggressive tendencies. The Norwegian Lundehund is protective of its family in a non-violent way and can still be traced back to its Norwegian roots as it loves to dig and stash food as if preparing for winter. Care The Norwegian Lundehund is known to shed a great deal, requiring daily coat brushing with a firm bristle-brush. It can also tend to be a shy breed, so the dog should be socialized at a young age. The Norwegian Lundehund enjoys just about any outdoor activity and is very energetic. A large yard is best for this dog breed; however the intelligent Lundehund is good at escaping, so a secure fence is suggested. Health The Norwegian Lundehund lives an average of 12 years, though those inflicted with Lundehund Syndrome may live less. This disease occurs when the dog’s digestive tract does not function properly, unable to absorb necessary nutrients. Lundehund Syndrome is pervasive in this breed, and although there is currently no cure, there are helpful management techniques to control the disease and side effects. History and Background Dating back to the 1500s, Norwegian Lundehunds were written about for their talent in hunting Puffin birds in Norway. This dog breed was specifically created for this task, specializing in scaling up steep, rocky cliffs and maneuvering their way into small crevices where the birds stayed. In the 19th century, hunting Puffin birds for meat and feather crop became illegal when the bird was named a protected species. After this the Norwegian Lundehund declined greatly in numbers as the farmers had less use for them. Around the time of World War II, the Norwegian Lundehund neared extinction; however a few Norwegian breeders revived the breed. The Lundehund was recently recognized by the American Kennel Club in 2011, and still remains small in numbers."}]