[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Wirehaired Pointing Griffon", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Wirehaired Pointing Griffon", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_wirehaired_pointing_griffon"}, "datePublished": "July 7, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Wirehaired Pointing Griffon Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "This breed is a versatile, capable hunting dog, pointer and gundog. Of medium size, with a noble, square-shaped head and rough never curly coat, it’s bred to work in any terrain. Loyalty and a friendly disposition mean the nickname of &quot;supreme gundog&quot; is well-earned. Physical Characteristics The perfect shape and size of this friendly-looking breed make it ideal as both a pointer and retriever. Its body is slightly long and not very tall and it can adapt to almost any kind of terrain. Its strength and resilience are its most prominent features. Medium-length, wiry and straight steel gray hair with brown markings covers its body, while the undercoat is thick, downy, and fine. This offers it protection in marshy places and even protects it from the cold. The movement of this breed is very fast and efficient. Personality and Temperament The Wirehaired Pointing Griffon is a versatile animal that is affable as both a pet and hunting dog. As a family pet, it is extremely loyal, friendly, always willing to please, funny, and amiable. It also behaves well with other pets, dogs, and even strangers. The Wirehaired Pointing Griffon also has a number of skills that make it very popular. It is a good field dog, skilled in retrieving and pointing. It always remains within the gun range of the hunter. It follows the instructions of the hunter and, at the same time, acts independently. Care This breed loves all kinds of exercise like running in the field, playing games, and jogging. It loves swimming the most. A daily exercise routine is necessary for the Wirehaired Pointing Griffon. To avoid ear problems, a Wirehaired Pointing Griffon&#039;s ears should be kept clean and the hair from the canal region should be plucked regularly. Brushing its coat once or even twice weekly is good. In addition to this, it is essential to remove dead hair at least twice a year. It can be kept outdoors, provided a warm shelter is provided. However, the best option is to treat it as an indoor as well as an outdoor dog. Health The Wirehaired Pointing Griffon, which has an average lifespan of 12 to 14 years, rarely suffers from any major diseases. However, it may suffer from minor health problems such as canine hip dysplasia (CHD), otitis externa, ectropion, and entropion. To identify these issues early, a veterinarian may recommend hip and eye tests for the dog. History and Background Also known as “the supreme gundog,” the Wirehaired Pointing Griffon is a very popular breed. Although the dog has Dutch roots, most people think it is actually a French breed. It is found in low numbers but it is adored for its excellent qualities as a retriever and pointer. Its faithfulness and versatility make it even more lovable. Mr. Edward Korthals of Holland is often attributed to refining the moderm form of Wirehaired Pointing Griffon. Hence, around the globe many also refer to the breed as the Korthals Griffon. However, the development of this breed can be traced back to the mid-1800s. (The first successful breed was the Cherville Griffon, created by crossing the pointer with the setter.) Korthals began his experimentation in 1874 by crossing 20 dogs belonging to a variety of breeds, including German and French pointers, griffons, spaniels, setters, and water spaniels. According to legend, Korthals carried his new breed around with him while traveling throughout France, thereby popularizing it. He took it to all kinds of places like business meetings, bench shows, fields, and other places. In this manner, the Pointing Griffon became immensely popular in France, and the French willingly adopted it. People loved the dog’s nose and its trait of being a very cautious hunter. In 1887, the Wirehaired Pointing Griffon was considered a standard and stable breed. The following year, in England, show classes for the dog were arranged. It was common for people to assume any properly-furred dog to be Siberian. Thus, many dog-lovers called it the Russian Retriever or Setter. (It is interesting to note that in 1887 in America, the first Wirehaired Pointing Griffon was formally registered as a Russian Setter.) It was inevitable that this lovable breed should become popular. However, its popularity diminished during World War II. Fortunately for pet owners and hunters, the Wirehaired Pointing Griffon regained its demand immediately following the war."}]