[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How big do Alaskan Malamutes get?", "acceptedAnswer": {"@type": "Answer", "text": "Alaskan Malamutes typically grow to stand between 23-25 inches tall and weigh 75-85 pounds."}}, {"@type": "Question", "name": "Are Alaskan Malamutes good pets?", "acceptedAnswer": {"@type": "Answer", "text": "Alaskan Malamutes make fantastic pets as long as they have plenty of exercise, training, and stimulation."}}, {"@type": "Question", "name": "Do Alaskan Malamutes bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Alaskan Malamutes tend to be very vocal, but keeping them well-exercised will help keep the “awoos” to a minimum."}}, {"@type": "Question", "name": "What’s the difference between Alaskan Malamutes vs. Huskies?", "acceptedAnswer": {"@type": "Answer", "text": "Alaskan Malamutes and Siberian Huskies look similar and both come from Northern regions, but the two breeds differ in some significant ways. For one, Alaskan Malamutes, at 23-25 inches tall and up to 85 pounds, are larger than Huskies, who stand 20-23.5 inches tall. Huskies are also more adaptable to warmer climates, while Alaskan Malamutes can have trouble in hot weather because of their thick coat."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Alaskan Malamute", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/alaskan-malamute.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/alaskan-malamute.jpg"}, "author": {"@type": "Person", "name": "Zack Newman", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Alaskan Malamute", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/alaskan-malamute"}, "datePublished": "January 10, 2023", "dateModified": "October 13, 2023", "description": "Alaskan Malamutes are large dogs with thick double coats. They need a lot of exercise, stimulation, and daily upkeep to stay happy. Learn more about caring for Alaskan Malamute puppies and dogs.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. Alaskan Malamutes have a storied history of helping humans complete some of the world’s hardest jobs. Alaskan Malamutes first came to be alongside the native Mahlemut tribe in Alaska, according to the Alaskan Malamute Club of Belgium (AMCB), when the dogs were relied on to “hunt the seals, scare polar bears and to pull heavy loads.”  Alaskan Malamutes were prized during the Klondike Gold Rush of 1896, according to The Alaskan Malamute Assistance League, because of their hardworking nature and reliability to haul sleds. Today, pet parents cherish their Malamutes for their ample energy and smarts—regardless of whether or not they plan to head to the Alaskan wilderness.  Caring for an Alaskan Malamute Alaskan Malamutes are dedicated companions that require quite a bit of attention. They need lots of exercise to be happy—remember, their ancestors pulled sleds for generations! And while most pet parents can’t provide a sled, a daily run with their human or alongside a bike helps keep these energetic dogs satisfied.  Alaskan Malamutes are known to be spunky and talk back with “awoos” that can make you feel like you’re arguing with a child. They are brilliant dogs that are unafraid to use their wile to get what they want—which can range from a snack on top of the counter to escaping the yard for an unsupervised stroll around the neighborhood.  Along with ample attention and exercise, Alaskan Malamutes need near-constant brushing and care for their robust coats. Alaskan Malamute Health Issues Alaskan Malamutes are generally healthy dogs with a lifespan of 10-14 years, but the breed does have a few common health concerns. Pet parents might want to consider buying pet insurance before bringing home an Alaskan Malamute puppy. Hip and Elbow Dysplasia Large dogs such as Alaskan Malamutes commonly experience hip dysplasia or elbow dysplasia. Both conditions happen when the hip or elbow joint develops abnormally, causing pain and arthritis if left untreated. Signs of dysplasia include limping, trouble standing, and unusual sitting positions. Mild cases can be managed with pain medication, but more severe cases can require surgery.  Cataracts Cataracts are a vision disorder that causes gradual loss of sight. This can be caused from aging and other factors, like eye inflammation or low blood calcium levels. Once diagnosed, the condition will worsen unless the cataracts are surgically removed. Hypothyroidism Alaskan Malamutes are susceptible to hypothyroidism, a condition where a dog’s body doesn’t produce enough thyroid hormone. Signs of hypothyroidism include weight gain despite no changes in diet or exercise, lethargy, heat-seeking behavior, dry and brittle hair, and increased skin and ear infections. If you notice any of these symptoms, talk to your veterinarian. Chondrodysplasia Chondrodysplasia is a genetic disorder where Alaskan Malamute puppies are born with limb deformities, producing “dwarf puppies,” according to the Alaskan Malamute Club of America (AMCA). Responsible Alaskan Malamute breeders must test their dogs before breeding them to ensure the puppies won’t be born with this genetic condition. Polyneuropathy According to the AMCA, polyneuropathy is a disorder that affects many aspects of the nervous system and has been reported in Alaskan Malamutes. Signs may include: Frequent falling Walking on the tops of the feet Abnormal gait Exercise intolerance Loss of muscle mass Changes in voice There is no cure or treatment for Alaskan Malamutes with polyneuropathy, but dogs with mild cases can live relatively normal lives. More severe cases may be cause for euthanasia.  What To Feed an Alaskan Malamute Alaskan Malamutes need to be fed a dog food approved by the Association of American Feed Control Officials (AAFCO) to receive a complete and balanced diet.  How To Feed an Alaskan Malamute   Adult Alaskan Malamutes should be fed two meals a day, while puppies are fed three meals per day. According to the Texas Alaskan Malamute Rescue (TAMR), these pups should never be “free-fed,” as they will wolf down every scrap of food in their bowl until they’re stuffed—and obese. A slow feeder bowl can help these hungry dogs pace themselves while eating.  How Much Should You Feed an Alaskan Malamute? How much you should feed your specific Alaskan Malamute depends on the dog’s age, size, exercise level, and many other factors. The bag of dog food will give you recommendations on how much to feed your Malamute, but the best way to determine your dog’s portions is to ask your veterinarian.  Nutritional Tips for Alaskan Malamutes Alaskan Malamutes’ food should include supplements for joint, eye, and coat health. Supplements rich in fatty acids with omega-3s and vitamin C can also help keep your Malamute healthy. Behavior and Training Tips for Alaskan Malamutes Alaskan Malamute Personality and Temperament Life with Malamutes can be remarkably rewarding, though it can also be challenging if you don’t know what to expect. They are gregarious and “happiest when treated as an intelligent partner,” according to the Polaris Alaskan Malamute Rescue. Alaskan Malamutes love their human pack, and when they are well-trained with positive reinforcement, they can be excellent companions for families. That said, Alaskan Malamutes might be too much for young children because of their large size and high energy. Interactions between children and all dogs, no matter the breed, should always be supervised to make sure nobody is accidentally knocked over or injured. Pet parents need to socialize their Alaskan Malamute puppy early, so they get along with other pets and learn that smaller animals are not something to chase, as Malamutes can have a high prey drive.  Alaskan Malamute Behavior According to Alaskan Malamute Rescue of New England, &quot;a tired malamute is a happy malamute!&quot; This breed needs a lot of exercise, whether that be running, pulling a sled through the snow, or skijoring (a combination of cross-country skiing and dog sledding). If they don’t get enough exercise, they might find other ways to entertain themselves—like chewing up your couch. Once they get their fill of exercise, Alaskan Malamutes make delightful couch companions and crave affection from their favorite people. They are curious pups and love being the center of attention at home. Alaskan Malamutes will definitely let you know if they’re bored, have lots of pent-up energy, or are unhappy. They are a highly vocal breed and aren’t shy about using their loud voice to get what they want.  Alaskan Malamute Training Alaskan Malamutes are intelligent and thrive when trained with positive reinforcement. Though, they can be too smart for their own good—Alaskan Malamutes may hear and understand a command, but refuse to follow it if they don’t see the point. The TAMR describes them as having “selective hearing,” so pet parents need to have patience during training sessions. Fun Activities for Alaskan Malamute Walking  Jogging Biking Backpacking Skijoring Tracking Pulling sleds  Alaskan Malamute Grooming Guide  Alaskan Malamutes are beautiful dogs with luscious coats designed to keep them warm in frigid conditions. But that fluff comes with responsibility, and it requires regular brushing. Skin Care Caring for an Alaskan Malamute’s skin starts with the coat. These dogs have a thick double coat that needs daily brushing, which will remove any dirt and debris, prevent excess shedding, and spread oils to moisturize the skin, according to the AMCA.  Coat Care Along with daily maintenance with a slicker brush, Alaskan Malamutes need a bath every 6-8 weeks. This helps keep their coat healthy, smelling fresh, and free from matting. Frequent brushing can also help keep an Alaskan Malamute’s shedding under control, which can be overwhelming as hair clings to your couch, carpet, and clothes. Eye Care The AMCA recommends checking Alaskan Malamutes’ eyes daily for debris that can build up in the corners. Wiping them with a wet cloth or paper towel stops bacteria from causing problems.  Ear Care Pet parents should check their Alaskan Malamute’s ears once a week to make sure they’re free from infection. Healthy ears should be pink and free from any buildup. The AMCA recommends using disposable ear wipes to keep your pup’s ears clean.  Considerations for Pet Parents Alaskan Malamutes won’t do well in homes where they are left alone all day. They need attention, mental stimulation, and regular intense exercise to be satisfied. And it’s not just activity—Alaskan Malamutes need hands-on training and daily grooming. If you’re willing to put in the work, these active dogs made great companions. "}]