[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do Komondor dogs naturally have dreadlocks?", "acceptedAnswer": {"@type": "Answer", "text": "In a sense, yes. Although Komondor puppies are not born with “dreads,” their cords usually form by the time a Komondor is 2 years old. The cords require regular maintenance to keep them neat and clean."}}, {"@type": "Question", "name": "Is it OK to shave a Komondor?", "acceptedAnswer": {"@type": "Answer", "text": "If maintaining a Komondor’s “dreadlocks” look becomes unmanageable, it is OK to shave them. If you decide to shave down your dog at home instead of enlisting a professional, ensure you follow best grooming practices, such as starting with a clean, dry coat. You must also take care around thin skin, the underarms and hocks, and where the rear leg meets the belly."}}, {"@type": "Question", "name": "How much does a Komondor cost?", "acceptedAnswer": {"@type": "Answer", "text": "The Komondor is a rare breed. According to MASKC, the average Komondor price varies, but usually is between $500 and $900. Featured Image: Getty/Daria Vorontsova"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Komondor", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/komondor-dog-breed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/komondor-dog-breed.jpg"}, "author": {"@type": "Person", "name": "Sarah Kloepple", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Komondor", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/komondor"}, "datePublished": "October 10, 2023", "dateModified": "October 13, 2023", "description": "Komondor pups are dogs that look like mops because of their white cords. These “dogs with dreadlocks” need lots of grooming upkeep. Here’s what to know about caring for Komondor puppies and dogs.", "articleBody": "Covered in a heavy coat of white cords (sometimes referred to as “dreadlocks”), the Komondor dog breed has one of the most distinct looks. According to the Komondor Club of America (KCA), Hungary was home to this ancient breed for many centuries, and they were bred to guard flocks of sheep and other livestock from predators. As you may have guessed, the Komondor’s cords helped them more easily blend in with the sheep. Another fun fact: The plural of Komondor is Komondorok. When it comes to size, a female Komondor can weigh more than 80 pounds and stand taller than 25.5 inches, while a male can weigh more than 100 pounds and stand taller than 27.5 inches. Their average lifespan is 10–12 years. Caring for a Komondor Caring for a Komondor’s coat is an involved process. If you’re considering adding a Komondor to your household and want to maintain their “dog with dreads” look, ensure you are able to dedicate the time and effort to keep their coat healthy. Thanks to their history as guardian dogs, Komondorok are typically calm and steady. They are also intelligent, affectionate, and usually gentle with children. As with all dogs, training and socialization while young will help them become well-adjusted adult dogs who will react appropriately to new dogs and people.   Komondor Health Issues Komondorok are not prone to many genetically linked health issues. However, as a large dog breed, they are susceptible to several common ailments. Elbow and Hip Dysplasia Elbow dysplasia refers to the abnormal development of a dog’s elbow joint. Hip dysplasia is a similar condition, where the bones of an abnormally formed hip joint do not fit together correctly, which leads to joint instability. Left untreated, both conditions will lead to arthritis. See your vet if you notice symptoms such as lameness or limping, an abnormal gait, or a swollen joint. Treatment may include joint supplements, weight management, and, surgery for severe cases. Entropion Entropion describes a condition where a dog’s eyelid turns inward, causing their eyelashes to rub against their cornea (the clear part of the eye). The most common eyelid abnormality in dogs, entropion can affect the lower eyelid, the upper eyelid, or both. Symptoms of entropion include excessive tear production and staining, eye discharge, redness, and squinting. Entropion treatment involves surgery to remove excess skin above or below the eyelid to return it to a normal position. Ear Infections The Komondor dog’s floppy ears can trap moisture in the ear canal, allowing bacteria and yeast to overgrow and cause ear infections. Common signs of an ear infection in dogs include redness, itching or scratching, odor, excessive debris in the ears, and shaking the head. Dog ear infections require a veterinary diagnosis for proper treatment. Ear infections can be prevented by keeping your dog’s ears clean and dry. What To Feed a Komondor As working dogs, Komondorok require a high-quality, age-appropriate diet to meet their nutritional needs. It is highly recommended that all dogs eat a diet approved by the Association of American Feed Control Officials (AAFCO), which ensures that the ingredients meet established standards. Basic vitamin and mineral supplements are not usually needed if your dog eats an AAFCO-approved food. Don’t offer your dog table food or animal bones, as these can cause stomach upset, vomiting, diarrhea, or an intestinal obstruction. These foods can also have a much higher fat content than dog food and can lead to pancreatitis. How To Feed a Komondor  Full-grown Komondorok do well with twice-daily feedings, one in the morning and one in the evening. Komondor puppies need to eat more frequently—three or four daily feedings on a consistent schedule. How Much Should You Feed a Komondor? The amount of food a Komondor needs varies. Dog food packaging has a feeding guide that typically recommends the total amount of food that should be given over a 24-hour period. You can use this as a general guide, but always talk to your veterinarian for the best advice.   Nutritional Tips for Komondorok As long as you feed your Komondor an AAFCO-approved, well-balanced diet, they will get all the nutrients they need from their food. Your vet may recommend nutritional supplements for your dog if they’re needed, but never give supplements to your Komondor without first talking to your vet. Behavior and Training Tips for Komondor Dogs Komondor Personality and Temperament Because they were bred to be guardian dogs, Komondorok love watching over their family and home. They are typically quiet, independent dogs. Although Komondorok are independent, they are an affectionate breed. With proper socialization, they are typically gentle with children and other animals. They can be wary of strangers, so exposing your Komondor puppy to a variety of new people and situations will help them become more comfortable with new experiences. Komondor Behavior As large working dogs, Komondorok are certainly not shy and will bark when something requires their full attention. With appropriate socialization and training, a Komondor is less likely to display unwanted behaviors. Komondor Training Komondorok were bred to be independent thinkers, so they can present a challenge to the average trainer. They can become bored with repetition, and they love to learn new skills. Keep training sessions short and varied, and always use positive reinforcement. Fun Activities for Komondorok Agility training Puzzle toys Fetch Long walks Komondor Grooming Guide You may wonder how the Komondor’s coat gets its distinctive, mop-like look. A Komondor’s coat is made up of a soft and wooly undercoat and a coarser and curlier outercoat. According to the Mid-Atlantic States Komondor Club (MASKC), the outercoat catches shedding from the undercoat to form the cords, usually by the time the dog is 2 years old. A fair amount of maintenance is required to keep up this look. Skin Care As with any long-haired dog, a skin check should be part of your regular grooming routine. Look for ticks, fleas, and any changes in your dog’s skin, such as redness or flakiness. Coat Care Caring for a Komondor’s coat may seem daunting, but it’s manageable with a consistent routine. As the cords develop, they should be separated regularly to prevent matting and the buildup of excess dirt. To help keep their coat white and pristine, quickly address any mess your Komondor gets into. For example, if they find their way into a mud puddle, they may need only a quick rinse. Drying your Komondor’s coat with fans or a hair dryer after a bath or if it gets wet can also help to keep it clean and healthy. Eye Care No special eye-related grooming care is necessary for this breed. However, if you notice squinting or discharge, contact your veterinarian. These can be signs of a serious eye condition. Ear Care Clean your dog’s ears with a veterinary-approved cleaner every two weeks to help prevent ear infections. Considerations for Pet Parents While the Komondor is among the most attractive dogs in the show ring, they also make wonderful family companions. It’s important to remember that Komondorok are intelligent working dogs with deeply rooted guarding instincts who love having a job. With early socialization, they tend to live happily with other dogs and animals. The Komondor’s mop-like coat requires regular maintenance, and the required grooming is an important consideration for potential pet parents.  "}]