[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Xolo dogs good pets?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, well-trained and socialized Xolos are great pets! They are a good fit in active families where they can get at least 20 minutes of exercise every day. "}}, {"@type": "Question", "name": "How much do Xolo dogs cost?", "acceptedAnswer": {"@type": "Answer", "text": "Xolos can cost $2,000–$4,000. The Xoloitzcuintli Club of America has a directory of vetted ethical breeders you can use to find a puppy."}}, {"@type": "Question", "name": "Are Mexican Hairless dogs hypoallergenic?", "acceptedAnswer": {"@type": "Answer", "text": "While no dog is completely hypoallergenic, Xolos can be a good fit for some people with allergies. But before you bring home a Xoloitzcuintli puppy, spend time with the breed to see how your allergies react."}}, {"@type": "Question", "name": "How do you pronounce Xoloitzcuintli?", "acceptedAnswer": {"@type": "Answer", "text": "Xoloitzcuintli is pronounced “show-low-eets-queent-lee.” The common abbreviation for their name, Xolo, is pronounced “show-low.”"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Xoloitzcuintli (Mexican Hairless)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/Mexican-Hairless-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/Mexican-Hairless-dog.jpg"}, "author": {"@type": "Person", "name": "Kaitlyn Arford", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Xoloitzcuintli (Mexican Hairless)", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/xoloitzcuintli"}, "datePublished": "May 10, 2023", "dateModified": "October 16, 2023", "description": "The Xoloitzcuintli (also called the Mexican Hairless or Xolo), is a hairless dog from Mexico that developed naturally over hundreds of years. Learn about caring for Xoloitzcuintli puppies and Xolo dogs.", "articleBody": "A rare breed, the Xoloitzcuintli (pronounced “show-low-eets-queent-lee”) is a highly intelligent, calm, and compact dog. Also known as the Xolo and the Mexican Hairless, this breed is loyal and loving. While their baldness, admittedly, isn’t for everyone, the Xoloitzcuintli Club of America says Aztec tribes revered them for their healing properties. The Nahuas, a Latin American indigenous group, believed the Xolo guided souls through the underworld. After hundreds of years by their pet parents’ sides, the Xoloitzcuintli is now recognized as the official dog of Mexico. Caring for a Xoloitzcuintli Xoloitzcuintles tend to be healthy dogs. They live a long life of 13–18 years and are happy to spend it with their family, both human and canine. According to the breed club, Xolos come in three sizes: The Toy Xoloitzcuintli, which stands 10–14 inches tall The Miniature Xoloitzcuintli, which is 14–18 inches tall The Standard Xoloitzcuintli, at 18–23 inches tall No matter their size, Xolos have a very distinctive look that developed naturally over the centuries. They have big ears, a long muzzle, and almond-shaped eyes, but what’s most eye-catching is their coat (or lack thereof). These hairless dogs from Mexico are mostly naked, but some can have coarse hair on the top of their head, on their feet, and on the tip of their tail. Xoloitzcuintli Health Issues Xolos are a very healthy breed that, thanks to their natural development, aren’t prone to many of the health conditions a lot of domestic dogs have. While the breed club recommends hip, cardiac, patella (kneecap), and ophthalmology tests for your Xolo dog, common conditions affecting these body parts aren’t super prevalent in the breed. Skin Conditions Adolescent Xolos are prone to acne on their lips and muzzle. Dogs with acne will have red bumps, pimples, or blackheads on their skin that can become scarred, especially if the dog scratches at them. To help keep your Mexican hairless dog’s skin clear, Xolos need regular baths with special shampoo. You’ll also need to help them keep their face clean and dry, especially after eating, drinking, or rooting in the dirt. Consider using a special pet wipe to help. Due to being hairless, Xolos are also prone to having sensitive skin. Care should be taken to ensure they are not exposed to chemicals, sun, or extreme changes in temperature. Consider a doggy sunscreen or a pet-friendly moisturizer to keep their skin healthy. Orthopedic Conditions Xolos are prone to a few orthopedic conditions, such as hip dysplasia and patellar luxations. Hip dysplasia is an abnormal development of the hip joint, while patellar luxations are caused by laxity in the tendons of the kneecap that cause the bones to slide off each other. These are both conditions that occur during development and, depending on severity, may or may not cause symptoms in your pup. Lameness or limping, a bunny-hopping gait, and trouble with stairs are common symptoms in affected dogs. Your vet will treat your Xolo with anti-inflammatory medications and joint supplements, and surgery is recommended in severe cases. Obesity According to the breed club, Xolo dogs love to eat. This means that, if you don’t stick to scheduled, measured-out meals, their appetite easily leads to obesity. Obesity in dogs can cause all sorts of additional health problems, including: Arthritis Pancreatitis Kidney disease Increased risk of cardiovascular disease Exercise intolerance What To Feed a Xoloitzcuintli Mexican hairless dogs need to eat a dog food that meets the Association of American Feed Control Officials (AAFCO) nutritional guidelines. Xoloitzcuintli puppies should eat a puppy-specific food until they’re 1 year old, when they can transition to adult food. How To Feed a Xoloitzcuintli Xolo puppies should eat at least three times a day on a regular feeding schedule. Start feeding them twice a day once they reach adulthood. If your Xolo is eating too fast, reduce the gobbling with a slow feeder bowl. How Much Should You Feed a Xoloitzcuintli? How many calories your dog gets depends on their health, current weight, and lifestyle. Because there are three different Xoloitzcuintli sizes, the range these pups can eat varies a lot. Use your dog food packaging to find basic guidance on how much food your Xolo dog needs. Talking to your vet will give you a better estimate, as they can take into account your specific dog’s health history. Nutritional Tips for the Xoloitzcuintli As long as your Xolo is eating a well-balanced dog food, they shouldn’t need supplements. That said, your vet might prescribe supplements on an as-needed basis if your pup’s health requires them. Behavior and Training Tips for the Xoloitzcuintli Xolo dogs are known for their smarts and loyalty, making them a good fit for new pet parents and experienced families alike. They need about 20 minutes of exercise every day, whether that’s a long walk, neighborhood jog, or afternoon hike. “Xolos need daily exercise and enjoy long walks and some brief opportunities to run,” says Paola Cuevas, MVZ. “Daily mental and physical stimulation helps prevent the development of destructive or aberrant behaviors.” Xoloitzcuintli Personality and Temperament As a working dog, Xolos are often reserved and wary of strangers, the breed club says. But while they’ll never shower strangers with affection, they form strong bonds with their pet parents. They are also playful and can be great friends to kids who know how to properly interact with pets. But remember: Interactions between children and dogs always need to be supervised. These dogs also have a high prey drive and might dart after squirrels, rabbits, and other small animals. Introduce this dog to a cat slowly and carefully, so they understand kitties aren’t something to chase. Always keep your Xolo on a leash or inside a fenced yard when they’re outside. Xoloitzcuintli Behavior Xolos are small, but their bark is big. They’ll often use their loud voice to alert their family to passersby, but they won’t bark for no reason. “Xolos will for sure let you know if anyone is near your door,” Cuevas says. “Like most dogs, Xolos like to watch their home. And if they are not properly desensitized and used to visitors, they might get anxious about newcomers.” Xoloitzcuintli Training As with all dogs, Xoloitzcuintles respond best to positive reinforcement training where they are rewarded for good behavior. Though they’re smart and can quickly pick up on cues, the breed club says this breed requires consistent training. It’s also important to socialize your Xolo puppy so they don’t grow up suspicious of new people.  Fun Activities for the Xoloitzcuintli Walking Playing in the backyard Running Puzzle toys Hide-and-seek Tug-of-war Fetch Trick training Obedience training Snuffle mats Obstacle courses Frisbee Flyball Xoloitzcuintli Grooming Guide Because they lack a full coat, Xolos don’t require the grooming routine many other dog breeds have. However, their skin needs regular attention. Skin Care As a hairless dog, Xolos need regular bathing. Between baths, you’ll need to: Wipe them down with a washcloth to keep their skin clean. Keep their skin hydrated with dog-friendly lotions and creams. Lather them in doggy sunscreen before they go outside, to prevent sunburns. Never use sunscreen made for humans on dogs, as the ingredients in them can be toxic for our canine companions. Because acne is common for Xolos, you may need topical or oral medications to treat their skin. Chat with your veterinarian to see how you can help reduce your dog’s acne. Eye Care Xolos shouldn’t need special eye care. But if you see your Xolo pawing at their eye, squinting, or having eye discharge, take your dog to the vet to check for an eye infection. Ear Care Clean your dog’s ears after every bath. Using a dog-specific ear cleaner will help prevent ear infections from occurring. Considerations for Pet Parents A Xolo is happy being by your side, whether you’re in an apartment or a house—as long as they get daily exercise, that is. Keep these hairless dogs on a leash when you’re out on your run or walk. Their high prey drive means they will run after smaller neighborhood animals. While Xolos love the people they’re close to, it can take a long time for them to warm up to strangers. You must socialize your Xoloitzcuintli puppy early and often to help with their natural wariness. Featured Image: Adboe/Masarik"}]