[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Nederlandse Kooikerhondje", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-in-garden-picture-id692456320.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-in-garden-picture-id692456320.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Nederlandse Kooikerhondje", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_nederlandse-kooikerhondje"}, "datePublished": "February 6, 2019", "dateModified": "October 13, 2023", "description": "Learn everything about Nederlandse Kooikerhondje Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "By Paula Fitzsimmons With a distinctive tail and ears, lively gait, and a bold orange-on-white coat, the Nederlandse Kooikerhondje is hard to miss. This newly inducted dog breed of the AKC sporting group originated in 17th century Netherlands as a duck decoy dog but has since become cherished as a companion. Considering this dog breed’s endearing qualities that include intelligence, sensitivity and a kind nature, it’s easy to understand why these pups are so beloved. Physical Characteristics One of the Nederlandse Kooikerhondje’s most easily recognizable features is her soft and vibrant coat, consisting of distinctive orange-red patches on white. Other prominent features include a well-feathered tail and hanging ears—also known as earrings—which may have black hair at the tips, says Gina DiNardo, executive secretary of the American Kennel Club (AKC) in New York City. The Kooikerhondje is a small, strong-boned, athletically built dog breed who walks with a springy gait. Height differs by sex; males are taller, standing at 16 inches tall, while females are 15 inches.  Personality and Temperament People most familiar with Nederlandse Kooikerhondjes describe them as smart, eager to please, good-natured, cheerful and easygoing. They also have a sensitive side, so they can startle easily, and they may not get along with everyone. While they do well with older kids, they’re not necessarily a great fit for families with younger, more unpredictable children. They’re also not very tolerant of rough-playing dogs, but can become buddies with well-behaved ones. Because they’re intelligent, good-natured and willing to please, however, they’re also highly trainable.  As a member of the AKC sporting group, Kooikerhondjes are lively and driven and have maintained their prey instinct. Because this pup is sensitive, it’s best to use firm but gentle training methods. Care Nederlandse Kooikerhondjes aren’t hyperactive dogs, but they are lively, so they will benefit from regular physical and mental activity. They love to explore the outdoors where “they enjoy hiking, swimming, retrieving and hide-and-seek,” says DiNardo. An enclosed backyard would provide a good outlet for this dog breed’s moderate activity level. Expect to brush your Kooikerhondje’s medium-length coat on a weekly basis. Brushing helps redistribute a dog’s natural oils and is a good way to get rid of unwanted hair, dirt and dandruff. All dog breeds benefit from being brushed, but the longer the coat, the more essential good grooming habits become. Kooikerhondjes require just an occasional bath, “as to not rid the breed from its natural protective oils,” says DiNardo. Health The Kooikerhondje is a relatively healthy breed, says Susanne Martin, who is a member of the Northern California Nederlandse Kooikerhondje Society. “Health concerns include the following: patellar luxation, renal disorders, polymyositis (inflammation of the muscles) and other auto-immune diseases.” With optimal care, their life expectancy averages 14 years, but “An old age of 16 to 17 years is not unheard of,” says Martin, who serves on the Society’s Health and Genetics Committee. Working with a responsible Nederlandse Kooikerhondje breeder is essential to raising a healthy pup. “Responsible breeders work hard to better their breed by doing the recommended health testing,” says DiNardo. The five tests recommended for this dog breed are a patella exam, an eye exam, hip dysplasia screening and blood work to test for carrier status for hereditary necrotizing myelopathy (a neurological disease) and Von Willebrand’s disease, a blood-clotting disorder, says Martin. History and Background Kooikerhondjes can be traced back to the Netherlands into the Middle Ages, most notably as subjects in paintings by Dutch master artists Rembrandt Harmenszoon van Rijn and Jan Steen. They were also used in a practice called Eendenkooi. “Originally known as Dutch decoy dogs, they were used to lure ducks into traps with their playful behavior,” says DiNardo. After the First World War, Eendenkooi largely dwindled in popularity, resulting in a decline in the breeding of Nederlandse Kooikerhondjes, and by the Second World War, they were almost extinct. Through a breeding program initiated by Dutch noble Baronesse von Hardenbroek van Ammerstol in 1939, Kooikerhondjes made a comeback. Eendenkooi is rarely practiced today. “However, this breed is active in various dog sports including agility, scent work, barn hunt, Fast CAT, rally and obedience,” says Martin. (Fast CAT, or Coursing Ability Test, is an AKC sport in which dogs are timed for running speed.) The AKC officially recognized the Nederlandse Kooikerhondje as one of its new dog breeds in January of 2018."}]