[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Flat-Coated Retrievers rare?", "acceptedAnswer": {"@type": "Answer", "text": "While other retrievers, like Goldens and Labradors, are some of the most popular dogs in the U.S., Flat-Coated Retrievers are fairly rare."}}, {"@type": "Question", "name": "Are Flat-Coated Retrievers good pets?", "acceptedAnswer": {"@type": "Answer", "text": "Flat-Coated Retrievers can be great pets for families who invest time in grooming, exercising, and stimulating their dog."}}, {"@type": "Question", "name": "What’s the difference between a Flat-Coated Retriever and a Golden Retriever?", "acceptedAnswer": {"@type": "Answer", "text": "Though they’re both bird dogs with origins in the United Kingdom, there are differences to consider when choosing a Flat Coated-Retriever versus a Golden Retriever. Flat-Coated Retrievers have shiny black coats and longer heads than a Golden Retriever, which has golden fur and a boxier head. Both are happy and outgoing pups, but Flat Coated-Retrievers are typically more independent than Golden Retrievers."}}, {"@type": "Question", "name": "What’s the life expectancy of a Flat-Coated Retriever?", "acceptedAnswer": {"@type": "Answer", "text": "The average life expectancy of a Flat-Coated Retriever is 8–10 years. Featured Image: iStock/s5iztok"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Flat-Coated Retriever", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/flat-coated-retriever.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/flat-coated-retriever.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Flat-Coated Retriever", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/flat-coated-retriever"}, "datePublished": "September 13, 2023", "dateModified": "October 13, 2023", "description": "Flat-Coated Retrievers are brown or black retrievers bred to hunt. These dogs have beautiful coats that shed, and they maintain a puppy-like personality their whole life. Learn more about caring for Flat-Coated Retriever puppies and dogs here.", "articleBody": "The Flat-Coated Retriever, occasionally dubbed the ebony retriever, is the image of vitality and charm. With roots tracing back to 19th-century Britain, these dogs were initially bred for retrieving game. But as a family pet, the Flat-Coated Retriever is an intelligent, affectionate, and adaptable breed, according to the Flat-Coated Retriever Society of America (FCRSA). These are good-sized dogs, standing 22–24.5 inches tall and tipping the scales at 60–70 pounds. Their sleek fur is either black or brown and gives them a distinctive, regal appearance. When you first spot one, you might think you’ve seen a black Golden Retriever! Caring for a Flat-Coated Retriever These retrievers are cheerful pups, and their boundless energy is complemented by a friendly nature. In fact, Flat-Coated Retrievers are known for their puppy-like charm that sticks with them well into their senior years. Like all retrievers, these dogs need ample opportunity to expend their energy through neighborhood walks, hikes, swim sessions, or backyard playtime. When well-exercised and mentally stimulated, Flat-Coated Retrievers will be happy and adaptable at home. Flat-Coated Retriever Health Issues The Flat-Coated Retriever is a healthy breed with a typical lifespan of 8–10 years, yet they aren&#039;t immune to certain ailments. Investing in pet insurance might be a good choice if you’re looking to bring home a Flat-Coated Retriever puppy. Hip Dysplasia Hip issues, such as hip dysplasia, are common among many breeds, including the Flat-Coated Retriever. Hip dysplasia happens when the bones of the hip joints do not align appropriately. This causes rubbing and grinding of the bones that over time results in deterioration of the joint, loss of function, and arthritis. Hip dysplasia can be a hereditary condition that affects Flat-Coated Retrievers, but it can also be exacerbated by other contributing factors such as exercise habits, weight, and nutrition. Regular vet visits and weight management can mitigate potential problems. Cancer This breed has an elevated risk for a type of cancer called malignant histiocytoma. This is a type of soft-tissue sarcoma that can present in many different forms, such as: Lymphoma Mast cell tumors Bone cancer Because these cancers affect different areas of the body, periodic health screenings are important because early detection and treatment can significantly affect your pup’s prognosis. Glaucoma Flat-Coated Retrievers are susceptible to glaucoma, an inherited disease in which pressure builds up inside the eye. According to the FCRSA, the breed is typically affected around ages 5–6. Glaucoma can be painful and lead to blindness without lifelong treatment. Gastric Dilatation and Volvulus Gastric dilatation and volvulus (GDV) is a severe form of bloat in dogs that can affect any deep-chested breed, including Flat-Coated Retrievers. Gastric dilatation or bloat typically happens when a large amount of food and gas in the stomach, such as after a big meal, prevents the normal outflow of the stomach. The increase in pressure from the gas buildup causes the stomach to expand. This puts pressure on the diaphragm, preventing normal breathing, as well as on major veins returning blood to the heart. Decreased blood flow causes a loss of blood to the stomach, and when combined with the high pressure inside, can lead to rupture. Many deep-chested dogs will undergo a prophylactic stomach tacking (gastropexy) surgery to help prevent GDV during their spay or neuter surgery. It’s important to know when your Flat-Coated Retriever may be showing signs of GDV, as this is a life-threatening condition. Seek immediate veterinary care if any of these signs are noted: Distended abdomen Retching without producing vomit General signs of abdominal pain, such as standing and stretching Drooling What to Feed a Flat-Coated Retriever Flat-Coated Retrievers do best on a high-quality, nutrient-dense, protein-rich dog food to fuel their active lifestyle. Choose a food that meets standards set by the Association of American Feed Control Officials (AAFCO). It’s always best to consult with your veterinarian for specific dietary recommendations for your pet. How to Feed a Flat-Coated Retriever It’s important to feed your Flat-Coated Retriever two to three small meals throughout the day (instead of one big meal) to help prevent bloat and GDV. Avoiding elevated bowls and exercise right before or after eating will also help stave off the life-threatening condition. Scheduled meals, instead of free feeding, will also help keep your dog from gaining an unhealthy amount of weight. Flat-Coated Retriever puppies should eat more frequently: three or four times every day. As smart dogs, your Flat-Coated Retriever might benefit from a slow feeder bowl, snuffle mat, or another puzzle feeder for some extra mental stimulation. How Much Should You Feed a Flat-Coated Retriever? The exact amount you’ll feed your Flat-Coated Retriever depends on their life stage, activity level, weight, and health history. While your dog food packaging will give you guidance on portions, always talk with your vet about how much to feed your dog. Nutritional Tips for Flat-Coated Retrievers As long as your dog is eating a well-balanced dog food, they’ll get all the nutrients they need. That said, your vet may recommend omega-3 supplements for a radiant coat and glucosamine for joint health, particularly for Flat-Coated Retrievers experiencing hip dysplasia. Always speak with your vet before giving your dog a supplement. Behavior and Training Tips for Flat-Coated Retrievers Flat-Coated Retriever Personality and Temperament Flat-Coated Retrievers are spirited dogs who maintain a puppy-like personality well into adulthood; they’re sometimes called a canine Peter Pan. They generally mesh well with kids and other furry friends, especially with proper introductions and socialization. As a working breed, these retrievers flourish when given tasks to focus on—especially ones their family is involved in, like hiking or dog sports. Flat-Coated Retriever Behavior Inherently inquisitive, Flat-Coated Retrievers love adventures and are terrific hunting dogs, according to the FCRSA. But while their adventurous nature makes them a go-to partner in the field, it might cause problems at home if they don’t have an outlet for their energy and curiosity. Bored Flat-Coated Retrievers with pent-up energy can dig up your yard, chew your shoes, roll in mud puddles, or scale a fence in an attempt to find something interesting to do. Flat-Coated Retriever Training Training is a great way to keep your Flat-Coated Retriever tired and mentally engaged. Retrievers are naturals at obedience and agility drills, and they can learn cues and tricks quickly thanks to their smarts. Like with every dog breed, always use positive reinforcement during training. Fun Activities for Flat-Coated Retrievers Obstacle courses Scent tracking Dock diving Swimming Disc games Field tasks Flat-Coated Retriever Grooming Guide A Flat-Coated Retriever’s dark fur, while beautiful, sheds moderately and requires regular care. Skin Care Flea and tick prevention is essential for the Flat-Coated Retriever, a dog that loves spending time outside. Their voluminous brown or black fur can make it especially tricky to spot ticks or fleas, but pet parents should still search their dog’s fur regularly. Coat Care A twice-weekly brushing routine is ideal to maintain their luxurious coat, and an occasional spa day (where your Flat-Coated Retriever gets a bath and a nail trim) every month or two will be beneficial. Eye Care Make sure your Flat-Coated Retriever’s eyes are clear of debris and long fur. Keep their eyes clean as needed by using a veterinary-approved wipe. If you notice changes in your dog’s eyes, such as redness or discharge, talk to your veterinarian. Ear Care Cleaning your dog’s ears every week or two can help stave off potential ear infections. Along with this consistent cleaning schedule, clean your Flat-Coated Retriever’s ears after they spend any time in water, such as after bathing or swimming. Their floppy ears make it easy for moisture to become trapped in the canal, leading to infection. Considerations for Pet Parents Before bringing home a Flat-Coated Retriever puppy, it’s important to recognize their need for physical and mental stimulation. They are best suited for households that will offer a variety of engaging activities, particularly ones outdoors. For this reason, apartment living may not be a good option for this breed, as they prefer to have lots of space to run and play. But when their mental and physical needs are met, Flat-Coated Retrievers are wonderful family dogs that generally do well with children and other pets."}]