[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Cotons de Tulear hypoallergenic?", "acceptedAnswer": {"@type": "Answer", "text": "There is actually no such thing as a truly hypoallergenic dog. But the Coton’s coat is low-shedding, meaning they can be a good fit for some people allergic to dogs. Spend time with the breed before bringing home a Coton de Tulear puppy to see how your allergies react.  "}}, {"@type": "Question", "name": "Are Cotons de Tulear high-maintenance?", "acceptedAnswer": {"@type": "Answer", "text": "Cotons require near-daily grooming to keep their coat soft and healthy. They also need lots of attention and engagement from their pet parents."}}, {"@type": "Question", "name": "Is a Coton de Tulear a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, the Coton de Tulear makes an excellent family dog. They make good playmates for kids who know how to properly interact with pets."}}, {"@type": "Question", "name": "What’s the difference between a Havanese and a Coton de Tulear?", "acceptedAnswer": {"@type": "Answer", "text": "The Coton de Tulear bears a striking resemblance to another small dog breed: the Havanese. Although both are descended from the same ancient European breed, the Coton has a longer and thicker coat. And while Cotons are always white, Havanese have a wider variety of coat colors such as black, gold, and fawn. Featured Image: Adobe/Lunja"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Coton de Tulear", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/coton-de-tulear.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/coton-de-tulear.jpg"}, "author": {"@type": "Person", "name": "Elise Schmelzer", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Coton de Tulear", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/coton-de-tulear"}, "datePublished": "May 16, 2023", "dateModified": "October 13, 2023", "description": "The Coton de Tulear is a cotton ball dog from Madagascar. Their white, fluffy fur requires a lot of upkeep, but they’re typically healthy pups. Learn more about caring for Coton de Tulear puppies and dogs.", "articleBody": "The easygoing and sunny nature of the Coton de Tulear makes sense when you know their origins: These pups are island dogs. The small, fluffy breed resembles a cotton ball and is named for the port city of Toliara in Madagascar, where the breed originates. Although their history is somewhat spotty, the dogs likely arrived on the island by ship in the 15th century and bred with local wild dogs. When France colonized Madagascar in the 1700s, the rare breed became the must-have dog for every noble on the island, according to the United States Coton de Tulear Club (USCTC). Others were forbidden from having Coton de Tulear’s, earning the breed the nickname “Royal Dog of Madagascar.” Full-grown Coton de Tulear dogs stand 9–11 inches tall at the shoulder and weigh 8–15 pounds. Most have primarily white coats, though some have spots or can appear grayer in color.  Caring for a Coton de Tulear  The Coton de Tulear is an adaptive and happy breed that does well in most living situations. While they love a good romp around the yard, they do not need constant entertainment or activity to be happy. They do, however, adore their humans and do best in homes where they are not left alone for long stretches of time. Cotons also make excellent family pets and travel buddies. The only things the adaptable Coton de Tulear asks of her humans is that they give lots of love and keep her fluffy white coat groomed. Coton de Tulear Health Issues  Coton de Tulear dogs live long lifespans (typically 15–19 years), are generally healthy, and rarely get sick, according to the USCTC. But that’s no guarantee you won’t run into health issues with your Coton dog, and they are susceptible to a few conditions.   Luxating Patella Cotons, like many small dogs, can develop luxating patellas, where the kneecap slips out of place. Symptoms of this common hereditary condition include sudden lifting of a hind leg, a hunched position, bunny hopping, and/or popping noises when the knee bends. Mild cases of patellar luxation can be treated with rest, anti-inflammatory medication, and weight loss. More severe cases may require surgery. Talk to your Coton de Tulear breeder about any health testing their puppies and doggy parents have gone through. Progressive Retinal Atrophy Coton de Tulear dogs can also be susceptible to a condition that causes slow loss of vision, called progressive retinal atrophy. The term refers to a handful of genetic disorders that can lead to blindness. Dogs that suddenly hesitate to go into dark rooms or outside at night may be developing the disorder. PRA, which is inherited, cannot be treated. But blind dogs can live long, happy lives with a bit of extra attention. Canine Degenerative Myelopathy  Growing weakness in the hind legs can be a sign of degenerative myelopathy, which can affect the Coton de Tulear. The disease slowly destroys nerves in the spinal cord and can lead to paralysis of the hind legs. The disease isn’t painful, but there is no cure for the nerve damage. The disease generally begins in middle or older age (often those over 8 years old), and symptoms include dragging paws and wobbly walking. What To Feed a Coton de Tulear  Pet parents should feed their Cotons high-quality dry or wet foods (or a mixture of both) approved by the Association of American Feed Control Officials (AAFCO). The American Coton Club recommends foods with a protein content of about 30% to keep your pup healthy.  How To Feed a Coton de Tulear Coton de Tulear puppies need to eat three or four meals a day on a regular schedule. Adult Cotons generally eat twice a day, in the morning and evening. How Much Should You Feed a Coton de Tulear? The amount of food your Coton needs to eat every day depends on: The type and brand of dog food Your dog’s health history Your dog’s age Your dog’s current and desired weight Your Coton’s dog food packaging will give basic guidance on portions, and your veterinarian can provide further guidance. Nutritional Tips for Cotons de Tulear As long as your Coton de Tulear is eating AAFCO-approved food, she should receive all the nutrients she needs. However, your vet may recommend supplements for your pup. The American Coton Club recommends probiotics and enzymes to help the Coton’s digestive system, as well as fish oil to help maintain that soft, cotton ball-like coat. Senior Cotons can also benefit from joint supplements containing glucosamine. Never give your dog a supplement without speaking to your veterinarian first. Behavior and Training Tips for Cotons de Tulear  Coton de Tulear Personality and Temperament Coton de Tulear dogs are friendly, fun-loving fluff balls of energy that thrive on affection. They generally get along great with children and other pets—especially when introductions are done properly—and are easily trained. While they need daily playtime and walks around the neighborhood, they are not particularly hyper dogs that require constant stimulation. But what they do need is near-constant attention. In fact, a Coton de Tulear can develop separation anxiety if her pet parents leave her alone for more than a few hours at a time. Coton de Tulear Behavior In general, Cotons are clown-like dogs who love to play with their pet parents. These little Madagascan dogs are friendly and adaptable, but they do tend to bark at strange noises or surprising movements. With proper training and early socialization, however, your Coton de Tulear puppy will learn that every passing person isn’t something to be concerned about. Coton de Tulear Training Cotons are people-pleasers, making them a relatively easy dog to train. But they won’t do well in military-style drills; their curious minds need variety and fun. Keep training sessions positive, short, and like a game. Socialization is equally important. Coton de Tulear puppies must be exposed to a variety of new places, people, and experiences so they grow into confident, well-adjusted dogs.  Fun Activities for Cotons de Tulear Agility Swimming Fetch Obedience training Cuddling with their pet parents Coton de Tulear Grooming Guide  The Coton de Tulear’s fluffy coat is one of the breed’s hallmarks, which is why they’re sometimes called the “cotton ball dog.” But that fluff requires a lot of maintenance to stay soft and free of tangles. Skin Care Cotons don’t usually require special skin care aside from a once-a-month bath. That said, pet parents should regularly check their dog’s skin for excessive dryness or any other changes. If you notice anything unusual, chat with your vet. Coat Care Coton de Tulear pet parents must brush these little fluffballs three to four times per week. Their hair can grow to be 4–6 inches long, and the best tool for brushing it is a pin brush. Brushing helps minimize matting, which can be particularly troubling behind the ears, legs, and elbows, according to the USCTC. The club recommends using a spray-on detangler to help with trickier knots and mats. Eye Care The Coton de Tulear’s beautiful white coat can easily develop tear stains. Routinely washing of your pup’s face with lukewarm water or using an eye wipe can help minimize the staining and keep your Coton clean. Ear Care Check your Coton de Tulear’s ears at least once a week for signs of infection. Hair growing inside the ear cavity should be trimmed, and ear wipes can help minimize the buildup of dirt and wax.  Considerations for Pet Parents The charming Coton de Tulear gets along with any family member, both two-legged or four. Their small statures make these adaptable dogs a great fit for apartments and houses alike. Cotons thrive on attention and affection, so they’re best in a family of homebodies or with people who will take them along on adventures and errands. Though hardy and healthy, these cotton ball dogs need special attention paid to their fluffy white coats, which can be prone to matting and tear stains. But as long as you have the time to keep up with their grooming—and schedule daily one-on-one playtime and snuggles—your Coton will be happy."}]