[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Grand Basset Griffon Vendéen", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/sand-bearded-grand-basset-griffon-venden-picture-id516793232.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/sand-bearded-grand-basset-griffon-venden-picture-id516793232.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Grand Basset Griffon Vendéen", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_grand-basset-griffon-vendeen"}, "datePublished": "February 6, 2019", "dateModified": "October 13, 2023", "description": "Learn everything about Grand Basset Griffon Vendéen Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "By Paula Fitzsimmons A new addition to the AKC hound group, the Grand Basset Griffon Vendéen is a dog breed that’s steeped in history. Once pack hunters in 16th century France, these medium-size, sturdy scent hounds (also called Grands) now excel at search and rescue. Grands are energetic with an independent streak but are also friendly, outgoing and willing to please, making them a good fit for families, couples or people living alone. Physical Characteristics The Grand Basset Griffon Vendéen is a rugged and muscular dog breed that weighs between 40 and 55 pounds. Don’t let their sturdiness deceive you, however. They’re also quick and light-footed, says Gina DiNardo, executive secretary of the American Kennel Club, based in New York City. At 18 by 15.5 inches, they’re slightly longer than they are taller, says Corey Benedict, president of the Grand Basset Griffon Vendéen Club of America. A look at their history provides insight into why they’re built this way. “They were bred to endure in the rough terrain in Vendée, France. They have to have the correct balance because form follows function,” he says. The Grand’s trademark features are straight legs, a deep chest, a moderately-long muzzle and neck, long ears and a long tail, says DiNardo. “This breed also has a noble head with a mustache and beard and protective, long eyebrows,” she adds. Their ears should lie like a corkscrew, says Benedict. “You should see the corkscrew fold in their ear when relaxed.” These pups have shaggy but wire-textured coats. A rough coat may have helped protect them while running through brambly fields. They present in a variety of color combinations, including black and tan, white and tan, white and orange, and tri-colored. Personality and Temperament Grands are a good fit for households of any size. Those who know this breed best mention their willingness to please their humans and their ability to get along well with other dogs. “They’re also outgoing, fun-loving, warm and friendly,” says DiNardo. Expect an energetic, fast-moving pup with lots of stamina. The Grand is a scent hound that likes to chase smaller animals—they used to successfully hunt rabbits and hares in ancient France. Experts says this dog breed can be stubborn and independent, so you need to be prepared to lead. “If you’re not a strong leader, this probably isn’t a breed for you. It’s also not a dog breed suitable for a first-time pet owner,” Benedict says. Care The Grand Bassett Griffon Vendéen isn’t the type of dog that will be content to curl up on the sofa all day. In fact, “They require vigorous daily exercise and enjoy the company of other dogs and people during playtime,” says DiNardo. Having an enclosed backyard where your pup can play and release energy is a definite plus. While they can be trained for obedience and agility work, they don’t generally excel in this area, says Benedict. With their rough coats, Grands may not require the same level of maintenance as dogs with longer and bushier coats, but DiNardo says they still need to be brushed weekly to remain mat-free. He adds that “an occasional bath will keep him looking clean.” They also need to be stripped at least three times a year, says Benedict. Hand stripping is the process of pulling out old hairs on wire-coated dog breeds to make room for new ones.   Health Overall, the Grand Basset Griffon Vendéen is a healthy dog breed with few health problems, but Benedict says that hip dysplasia and eye disorders can occur. Pet parents, of course, play an essential role in a pup’s health by providing optimal nutrition and care, but they also need to choose a Grand breeder wisely. “Responsible breeders work hard to better their breed by doing the recommended health testing, including hip, eye, heart, thyroid and patella evaluations,” says DiNardo. With optimal upbringing and lifetime care, the Grand Basset Griffon Vendéen can live between 12 and 15 years old, experts say. History and Background The Grand Basset Griffon Vendéen’s lineage can be traced back to 16th century Vendée, a western region of France noted for its beaches, winding rivers and rough, brambly terrain. In their native country of France, Grands were efficient pack hunters, chasing mostly after rabbits and hare. King Louis XII kept Grands, as well as Petit Basset Griffon Vendéens, Grand Griffon Vendéens and Briquet Griffon Vendéens as one litter. They were considered one breed and referred to as the King’s White Hounds, says Benedict. The first pups entered the US through Holland in 1990, but the AKC didn’t officially recognize them as a new dog breed in their hound group until January of 2018, says DiNardo."}]