[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Affenpinscher", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-06/affenpinscher-dog-breed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-06/affenpinscher-dog-breed.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Affenpinscher", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_affenpinscher"}, "datePublished": "May 28, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Affenpinscher Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Affenpinscher is a wiry-haired terrier-like toy dog. It makes a good house pet due to its intelligence and cordialness towards other animals. With its big beard and long eyebrows, the dog is visually exquisite but tough in nature, as it was bred to chase vermin. In France the breed is described as the &quot;moustached little devil,&quot; due to its mischievous trait. Physical Characteristics The Affenpinscher’s facial expression, with a beard and long eyebrows, makes it look like a monkey and even comically serious. Its rough coat is an inch long throughout the body and a little longer on the chest, head, neck, legs, and stomach. Originally, the function of it coat was to provide protection from harsh weather conditions and vermin. The medium bone, sturdy, compact, and square-proportioned Affenpinscher is a smaller variety of a working terrier, but is not as delicate as it appears. It is very tough, active and nimble enough to chase and catch rats and mice. The dog&#039;s gait, meanwhile, is confident and light. Personality and Temperament The Affenpinscher is distinguished from other terriers by its quality of being good with pets and other dogs. This small dog is at its best with its family, which enjoys humor and entertainment. It is a real &quot;monkey&quot; terrier with respect to its character as well as its appearance: it may be an inquisitive, bold, busy, and stubborn terrier by nature but it is also mischievous, playful and fond of behaving like a monkey. The Affenpinscher also has a tendency to climb and bark. Care Some lively indoor games, short walks on a leash or outdoor romps can meet the exercise requirements of the active and energetic Affenpinscher. The dog cannot live outside but loves to play outdoors. The rough coat requires combing two or three times a week and shaping once every three months. Shaping is done for pets by clipping, while show dogs need stripping. Health The Affenpinscher, which has an average lifespan of 12 to 14 years, has a tendency to suffer from minor diseases like patellar luxation and corneal ulcers. Respiratory difficulties, patent ductus arteriosus (PDA), and open fontanel are sometimes seen in this breed as well. To identify some of these issues, a veterinarian may run knee and cardiac tests on the dog. History and Background Referred to as the &quot;Diablotin Moustachu&quot; or the &quot;moustached little devil&quot; in France, the Affenpinscher is among the oldest of toy breeds. Its name offers an apt description of the breed: affen, which means monkey, and pinscher, meaning terrier. The origins of the Affenpinscher are not so clear. While Dutch painters often sketched dogs that resemble this curious breed in the 15th century, there is no proper evidence to support the breed’s origin. In 17th-century central Europe, several small terriers were experts in dispatching rats. These terriers were also used in Germany to keep kitchens and stables free from rodents. There were smaller types of the same dog that functioned as women’s lap dogs, could kill mice, and entertain the house with their funny antics. Later, it is believed, this small strain developed as the Affenpinscher, which was then improved by crossing with the German Pinscher, Pug, and German Silky Pinscher. Many wire-coated toys, including the Brussels Griffon, descended from the Affenpinscher. The breed is most popular in Germany, often claimed to be its native land. The American Kennel Club granted it recognition in 1936, but the Second World War reduced its popularity. Today the breeds remains rare in the United States and even in Germany."}]