[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lakeland Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Lakeland Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_lakeland_terrier"}, "datePublished": "April 30, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Lakeland Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "A relative of the Bedlington and Fox Terriers, the Lakeland Terrier was originally used for fox hunting. Playful and quick, the Lakeland Terrier makes a great companion for active and fun-loving owners. It could easily spend all day outdoors, exploring and playing, if it has a nice, indoor home to retreat to and rest at the end of the day. Physical Characteristics The small, square-proportioned, short-backed Lakeland Terrier has a sturdy build resembling a workman. Its deep and narrow body allows the Lakeland Terrier to squeeze itself through narrow passages after the quarry, and its long legs enable it to run fast and travel through the tough shale terrain of the mountain countryside, where the Lakeland Terrier originated. The ground covering and smooth gait of the dog has good drive and reach. This terrier’s double coat is comprised of a hard and wiry outer coat, which comes in a variety of colors including blue, black, liver, red, and wheaten, and a soft undercoat. Its expression, meanwhile, ranges from happy to intense or playful, perfectly reflecting its mood. Personality and Temperament Although reserved with strangers, the Lakeland Terrier may act overtly aggressive towards small animals and other dogs. This stubborn, independent, and clever breed can become mischievous at times, too. Therefore, the sensitive Lakeland Terrier requires a patient trainer and one that incorporates playful games. Care The Lakeland Terrier’s wire coat requires combing once or twice a week. Shaping and scissoring should be done about four times a year. Stripping is good for show dogs, while clipping suits pets. Clipping also helps in softening the coat and lightens the color. A moderate leash-led walk or an energetic game in the yard is all this active dog needs to satisfy its exercise requirements. But when given a chance, it loves to wander around, investigate, and hunt. And although the dog enjoys spending its day in the yard, it should be given plenty of time to rest indoors at night. Health The Lakeland Terrier, which has an average lifespan of 12 to 16 years, is prone to minor health concerns such as lens luxation and distichiasis, and major health issues like Legg-Perthes disease and von Willebrand&#039;s Disease (vWD). A thorough eye exam is recommended for the Lakeland Terrier. History and Background Farmers of the Lake District in the United Kingdom were the first to keep Lakeland Terriers, using them as well as packs of hounds to hunt foxes. The Lakeland Terrier was also successfully at chasing and exterminating vermin and otter. Despite the lack of documentation for the breed, it is believed the Lakeland Terrier shares a similar ancestry with the Bedlington, Fox, and Border Terriers. Originally referred to as Elterwater, Patterdale, and Fell Terrier, it was formally recognized as the Lakeland Terrier in 1921. The American Kennel Club would later register the breed in 1934. Today it is considered an important dog show competitor and a fun-loving pet."}]