[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hokkaido", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-hokkaido-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-hokkaido-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Hokkaido", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_hokkaido"}, "datePublished": "September 5, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Hokkaido Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "First known as the Ainu, this dog breed was named after the people it lived with and later the area of Japan it was believed to have originated in. The Hokkaido is known as a great hunter as well as loveable and loyal pet. Physical Characteristics The Hokkaido is a medium-sized dog breed that weighs anywhere from 45 to 65 pounds at a height of 18 to 22 inches. This spitz type breed has small, triangular upright ears and small eyes with triangle markings. The Hokkaido has a thick and harsh double coat that comes in red, brindle, sesame, black or black and tan/white. Personality and Temperament A strong hunter, the Hokkaido is brave, smart, and has a great sense of direction. In addition to this, the Hokkaido is known as a faithful and loving dog that does well with children when it is socialized early enough. The Hokkaido would not make the best apartment dog, as it is an active breed that does best with a large yard. Care Due to its thick coat, the Hokkaido requires daily brushing to maintain the coat and needs moderate daily exercise to stay in shape such as a long walk. Health Considered a generally healthy breed, there are no known health issues specific to the Hokkaido. This breed lives an average life span of 11 to 13 years. History and Background The Hokkaido, which was named after the area where it was developed, is said to have originated when Ainu migrants brought the small dog with them to Japan in the 1140s. In 1937 it was designated a protected species in Japan. In 1996 it was recognized by the UKC. Today the Hokkaido continues to be a popular hunting dog. Featured Image: iStock.com/Shoko Shimabukuro"}]