[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Icelandic Sheepdog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-icelandic-sheepdog_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-icelandic-sheepdog_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Icelandic Sheepdog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_icelandic_sheepdog"}, "datePublished": "April 25, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Icelandic Sheepdog Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "A native Icelandic breed, the Icelandic Sheepdog is a great herding breed as well as family dog and companion. This medium-sized dog is loveable, friendly, and very devoted to its master. Physical Characteristics The Icelandic Sheepdog looks almost rectangular from the side, at a height of 16 to 18 inches and weighing anywhere from 20 to 30 pounds. This breed comes in two different coat types, short-hair and long-hair, both with two layers. The downy undercoat is thick and soft, with a thinner straight coat lying on top. The Icelandic Sheepdog has a curly, bushy tail with pointy ears and comes in a variety of coat colors, including brown, black, gray and all tan shades. Personality and Temperament Although this dog breed was mainly used in herding, the Icelandic Sheepdog is very friendly and contains little hunting instincts. This sheepdog truly enjoys human interaction and makes a good family pet. In fact, the Icelandic Sheepdog is not only a happy dog but an intelligent one. Care With such a thick coat, this dog breed does require weekly brushing. An active exercise plan is best for the Icelandic Sheepdog. It should never be left alone for too long as isolation may result in anxiety issues. Health The Icelandic Sheepdog generally has little health issues with an average life expectancy of 12 to 16 years. Main health concerns associated with the Icelandic Sheepdog include hip dysplasia and an eye disorder called distichiasis. History and Background This breed is Iceland’s only native dog breed, spawning from the Icelandic Sheepdog’s ancestors that were brought over with the Nordic people in the 9th century. Due to the harsh conditions of Iceland’s climate, the dog breed developed to survive on the rough terrain and became an ideal farming dog. As farming needs declined into the 20th century, the Icelandic Sheepdog neared extinction. Recently breeders in Iceland and other countries have helped to reestablish the Icelandic Sheepdog, though it is still small in number. Featured Image: iStock.com/HunterBliss"}]