[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Papillon a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Papillons are great family dogs, since they are affectionate with the people they have bonded with and have the energetic personality to keep up with children. Their small size, however, puts them at a slight risk around young children who may be clumsy and inadvertently injure the dog."}}, {"@type": "Question", "name": "Are Papillons smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Papillons are among the most intelligent and obedient of breeds, which makes them highly trainable."}}, {"@type": "Question", "name": "How much does a Papillon cost?", "acceptedAnswer": {"@type": "Answer", "text": "A Papillon from a reputable breeder with a good pedigree will cost $1,000-$2,000"}}, {"@type": "Question", "name": "How much space do Papillon dogs need?", "acceptedAnswer": {"@type": "Answer", "text": "Being a toy breed, Papillons do not require a big space and can do well in apartment or studio settings. They will still require exercise, but these needs can be met with daily indoor playing or walking."}}, {"@type": "Question", "name": "Do Papillons need a lot of exercise?", "acceptedAnswer": {"@type": "Answer", "text": "Papillons require abundant physical and mental stimulation to prevent undesired behaviors. The good news is that because of their toy size, this activity can be done in almost any setting. Papillons prefer activities that involve their humans, and they are quite happy to fetch or learn tricks as enriching play.   Featured Image: iStock.com/Zoran Kolundzija"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Papillon", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/Papillon-dog.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/Papillon-dog.jpeg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Zoo Small Dog Pack, Papillon", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/papillon"}, "datePublished": "September 23, 2022", "dateModified": "October 13, 2023", "description": "Caring for a Papillon dog breed means being informed about the dogs&#039; health issues, behavior, and grooming needs. Learn everything about caring for Papillon puppies and dogs here.", "articleBody": "Papillon is the French word for butterfly, and it’s easy to see why these dogs were given that name, with their wispy ears that resemble a butterfly’s wings. The Papillon is one of the oldest toy dog breeds, and Papillons have been depicted in artwork dating to the 16th century. Papillons are still extremely popular today, the image of versatility. At 8-11 inches tall, this toy breed is compact and adaptable. Despite their dainty stature and elegant coats, Papillons do well in any climate or setting. They are happy, friendly dogs and love spending time with their families. They also excel in the agility ring. Caring for a Papillon Papillons require frequent brushing and monthly professional grooming to maintain their long, silky coat and plumed tail. They are very active and intelligent, and require daily physical and mental stimulation. Their high energy paired with an eagerness to please makes training a fun activity for the whole family. Papillon Health Issues Papillons are generally a healthy breed with few concerns; however, there are some potential inherited conditions to be aware of. Open Fontanelle Responsible breeders will screen for an open fontanelle in the skull of their puppies. An open fontanelle is a condition similar to the soft spot of a human baby’s skull and normally closes around 9-12 weeks of age, but in some dogs, it can persist to adulthood. This is an inherited condition that is more commonly seen in toy or small-breed puppies. If the open fontanelle persists, it typically does not affect the dog but could increase susceptibility to brain injury upon impact to the head. There is no treatment other than abstaining from breeding the dog to keep this genetic defect from being passed down. Luxating Patella Papillons can develop luxating patella, an inherited condition where one or both kneecaps pop in and out of place. This is typically screened for by responsible breeders. Although patellar luxation is not considered a painful condition, it may cause a dog to favor one leg and can predispose dogs to other knee injuries, such as a cranial cruciate ligament tear, or arthritis. Depending on the severity of the luxating patella, surgical correction may be recommended to prevent further injury and improve quality of life. Dental Disease Like all other toy breeds, Papillons require regular at-home dental care as well as routine dental cleanings to prevent periodontal disease. What to Feed a Papillon Selecting the best diet for a Papillon is often based on the needs of the individual dog. While it is always important to choose a diet with high-quality ingredients, it is best to discuss this with your veterinarian, who can make a recommendation based on your dog’s medical history. If they are not physically active, Papillons can be prone to obesity. It is vital to avoid overfeeding to maintain proper body conditioning and weight. How to Feed a Papillon Due to their toy size, Papillon puppies can be susceptible to hypoglycemia (low blood sugar) if they do not consume enough food throughout the day. This can be avoided by feeding small meals 3-4 times a day until the dog is about four months old. At this age, the dog’s body is more developed and better suited to regulate glucose levels, and you can make the transition to two or three meals a day. Adult Papillons typically do well with two meals a day—morning and evening. How Much Should You Feed a Papillon? It is important to follow the guide provided by the food manufacturer to ensure the dog is receiving appropriate essential daily nutrients. For an adult Papillon, based on an average weight of 5 to 10 pounds, this will range from 1/4 to 1/2 cup of dry food daily, divided into two meals. Nutritional Tips for Papillons For Papillon dogs with luxating patellas, it can be beneficial to supplement with glucosamine and chondroitin to help keep the joints healthy. Additionally, omega-3 supplements can aid in maintaining joint health and help keep skin and coat lush and soft. Behavior and Training Tips for Papillons Papillon Personality and Temperament Papillons are an intelligent breed and prefer an active lifestyle to meet their high-energy needs and keep them mentally stimulated. The good news is that their petite size makes this task easy, indoors or outdoors. Papillons are happy to play with toys inside the home or run around in a fenced-in yard. True to their toy breed nature, Papillons are quite vocal and use their voice to communicate both positive and negative emotions to their humans. Papillon Behavior Papillons are companion dogs at heart and are eager to please their humans. This can make training fun. However, some Papillons may develop separation anxiety if left alone for too long. This can result in undesired behaviors, such as excessive vocalization or destructive activities. Papillon Training Papillons take well to training with positive reinforcement. Potty training can be challenging, but consistency paired with positive reinforcement will yield the best results. Their athletic build and intelligence help them to excel in the agility ring, as they are frequent winners in competitive sporting activities. If their household is not interested in competitive dog sports, Papillons can also learn a variety of tricks. Fun Activities for Papillons Walking Indoor/outdoor playing with their people Obedience Agility Papillon Grooming Guide Despite their long, silky coat, Papillons do not require excessive grooming because they do not have an undercoat. They do shed moderately, and their coat should be brushed or combed daily at home. Monthly bathing or grooming is often sufficient to keep their skin and coat healthy and clean. Skin Care Skin care for the Papillon can vary depending on the dog’s needs; however, this breed does not typically have sensitive skin. Regular brushing and bathing to maintain a luxurious coat is the best way to keep a Papillon’s skin healthy as well. Coat Care Their long coats can be prone to collecting debris and tangles, which can cause skin infections if not cared for properly. Daily brushing to remove debris and tangles is important. When bathing your Papillon, be sure to thoroughly rinse and then dry their hair to prevent skin irritation or infection from the shampoo and moisture. Eye Care Routine cleaning with a soft, damp cloth will help keep tears from building up around the eyes. Ear Care Routine cleaning with a veterinarian-approved ear cleanser is vital in maintaining healthy ear canals in Papillons. This should also be done any time a Papillon is in water, such as after swimming or bathing. To clean the ears, fill the ear canal with the cleansing solution, massage at the base of the ear to loosen up any debris, and then gently wipe any excess cleanser with a cotton ball. It is not necessary to remove all the cleanser from the canals, and it is not advised to use a cotton-tip applicator (Q-tip) to clean in the canals. Considerations for Pet Parents The Papillon’s silky, long coat can be very attractive, and this breed will do best in a home that is able to provide the necessary daily maintenance of that coat. Papillons are highly intelligent and active dogs and enjoy participating in activities with the whole family, indoors or outdoors. They are affectionate and responsive to the people they have bonded to, which can sometimes lead to separation anxiety when their humans are away for long periods of time. Luckily, Papillons can also bond to other pets, which can sometimes prevent unwanted behaviors."}]