[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Scottish Deerhound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Scottish Deerhound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_scottish_deerhound"}, "datePublished": "October 6, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Scottish Deerhound Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "A rare breed with a great deal of class, the Scottish Deerhound is one of the oldest Greyhound-like breeds. A rather large dog, it has coarse hair that is generally blue-gray in color. Physical Characteristics Although it resembles the Greyhound in build, the Scottish Deerhound dogs are more big-boned, with coarse hair that is about three to four inches in length. The coat, being weatherproof, helps them in harsh conditions. Additionally, these dogs have an easy but speedy gait. Personality and Temperament The Scottish Deerhound has a pleasing personality. And though some Scottish Deerhound may chase strangers, it usually behaves politely with other dogs and pets, and plays nicely with children. A subdued and easy-going breed, it makes for a great indoor pet; however, the Scottish Deerhound also enjoys going outdoors. Care The Scottish Deerhound breed loves to spend time inside the home with its human family. Nevertheless, the dog can adapt to living outdoors in warm or cool climate. Routine exercise is essential for the breed, ideally in the form of a long walk or running in an enclosed area. The hair should be clipped on occasion to prevent it from tangling; combing, meanwhile, will help remove any dead hair. Additionally, the hair around the dog&#039;s face and ears should be stripped. Health The Scottish Deerhound breed, which has an average lifespan of 7 to 9 years, is susceptible to major health issues such as cardiomyopathy, gastric torsion, and osteosarcoma. Hypothyroidism, neck pain, atopy, and cystinuria may also plague this dog. To identify some of the issues early, a veterinarian may recommend regular cystinuria and cardiac exams for this breed of dog. History and Background The Scottish Deerhound is a rare and old breed. It bears a resemblance to the Greyhound, but experts are not quite sure why. It is, however, assumed that the breed has existed as early as the 16th and 17th centuries. The nobles of that time, especially those who were avid deer hunters, were very fond of the breed. In fact, a Scottish Deerhound could not be acquired by anyone lower than the rank of earl during the Age of Chivalry. The decline of the deer population in England caused a concentration of the breed in the Scottish Highlands, where deer still existed in large numbers. Highland chieftains looked after this breed, but with the fall of the clan system after the Battle of Culloden, Scottish Deerhounds lost their popularity by the middle of 18th century. The arrival of breech-loading rifles in the 19th century further aggravated their decline as deer were much easier to hunt. It was early in 1860s that the first Deerhound club was established in England. They were also displayed at dog shows from that time. It was not until about 1825, when Archibald and Duncan McNeill undertook a restoration of the breed, that the Scottish Deerhound regained his former glory. And though the destruction of World War I greatly reduced the breed&#039;s numbers throughout Europe, the Scottish Deerhound of today closely conforms to the original standard established in the 18th and 19th centuries."}]