[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much is a Chinese Crested dog?", "acceptedAnswer": {"@type": "Answer", "text": "Purchasing a Chinese Crested puppy from a reputable breeder can cost several thousand dollars. The breed club provides a list of recommended breeders you can reach out to."}}, {"@type": "Question", "name": "Are Chinese Crested dogs high-maintenance?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, Chinese Cresteds are high-maintenance when it comes to grooming. The hairless variety needs their skin moisturized and protected from the sun and cold, while Chinese Crested powderpuffs need frequent at-home brushing as well as trips to the groomer."}}, {"@type": "Question", "name": "Are Chinese Cresteds good pets?", "acceptedAnswer": {"@type": "Answer", "text": "When well-trained and socialized, Chinese Crested dogs make good pets for families, singles, and older adults alike. Featured Image: iStock/Ekaterina Gorokhova"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chinese Crested", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/chinese-crested-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/chinese-crested-dog.jpg"}, "author": {"@type": "Person", "name": "Erica Vasquez", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Chinese Crested", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/chinese-crested"}, "datePublished": "July 20, 2023", "dateModified": "October 13, 2023", "description": "Chinese Crested dogs are unique-looking pups that can be nearly naked or have lots of long, silky hair. Though hairless Chinese Cresteds and Chinese Cresteds with hair have different grooming needs, both varieties need lots of attention and love from their pet parents.", "articleBody": "The Chinese Crested is a unique dog known for her hairless appearance and elegant, graceful nature. Standing 11–13 inches tall and weighing 8­­–12 pounds, this toy breed comes in two varieties: hairless and powderpuff. The hairless Chinese Crested has smooth, soft skin accentuated by silky hair on her head, feet, and tail. The powderpuff Chinese Crested has a full coat of long locks. Despite the breed’s name, it’s unlikely these hairless dogs originated in China—a genetic study actually points to Mexican origins. But no matter where they came from, the Chinese Crested has been bred to be an affectionate companion for centuries. Caring for a Chinese Crested The Chinese Crested’s cheerful disposition means she fits in well with most families, including those with kids and other pets. But all interactions between kids and this breed should be supervised, as Chinese Cresteds are so small and “fine-boned” that they can easily be hurt accidentally when playing. These pups are also a good fit for older adults or those who live in small apartments. It’s easy to get them the relatively small amount of exercise they need to stay healthy, and they’re often happy spending time playing indoors or lounging on the couch. In fact, the American Chinese Crested Club (ACCC) describes the breed as having a “cat-like” personality. Chinese Crested Health Issues Chinese Crested dogs are generally healthy and tend to live a long life (up to 18 years!), but they are prone to certain health conditions. Regular checkups and a healthy lifestyle can help minimize the risk of these issues. To reduce the incidence of health problems in the breed, the Orthopedic Foundation of America (OFA) recommends that prior to breeding, Chinese Cresteds be screened for the following: Eye problems Patellar luxation Heart problems Primary lens luxation Progressive retinal atrophy Congenital deafness Hip dysplasia Legg-Calvé-Perthes disease Before purchasing a Chinese Crested puppy, ask breeders for the results of any screening tests that they have run on the puppy’s mother and father. Dental Problems  Many tiny dog breeds have trouble with their teeth, and the Chinese Crested is no exception. This dog is known to have dental issues such as early tooth loss and gum disease. Pet parents must brush their dog’s teeth at home and schedule dental cleanings as recommended by a vet to keep their Crested’s mouth healthy. Poor dental health isn’t just bad for a dog’s teeth—it can cause organ damage as well. Eye Problems Some Chinese Cresteds may be susceptible to eye conditions such as progressive retinal atrophy (PRA), primary lens luxation (PLL), and dry eye. While some issues (such as PLL) can sometimes be surgically corrected, others (such as PRA) are untreatable and lead to total vision loss. If you notice any changes in your dog’s eyes or vision, talk to your vet. Deafness Some Chinese Crested puppies are born deaf. While deaf dogs can certainly live full and happy lives, pet parents must make special arrangements, such as training them with hand signals, to keep them safe.  Orthopedic Issues Patellar luxation is a common health concern found in Chinese Cresteds. It occurs when the kneecap slips out of place. This can cause your dog to skip or walk with a bunny-hopping gait. Some mild cases of patellar luxation do not need treatment, while others can be managed with anti-inflammatory medications and nutritional supplements that support joint health. In severe cases, surgery may be recommended. Chinese Crested can also develop hip dysplasia or Legg-Calvé-Perthes disease, two genetic conditions affecting the hips. Treatment can include medications and supplements to reduce pain and inflammation, physical therapy, and surgery. Skin Problems Hairless areas of skin require special protection from the sun and cold temperature. Even with an extra level of skin care, Chinese Cresteds can develop dry skin, comedones (blocked pores), and other skin problems. What To Feed a Chinese Crested When choosing the best dog food for your Chinese Crested, select one that meets the nutritional requirements of the Association of American Feed Control Officials (AAFCO) and is formulated for your dog’s life stage (puppy, adult, or senior). Popular high-quality brands include Royal Canin, Hill’s, and Purina. When in doubt, ask your vet for recommendations on what to feed your Crested. How To Feed a Chinese Crested Most Chinese Crested adults do well with two meals daily, one in the morning and one in the evening. Chinese Crested puppies, however, require more frequent meals to support their growth and development—about three or four small daily feedings.  How Much Should You Feed a Chinese Crested? The amount of food to give your Chinese Cresteds varies based on her age, weight, activity level, health, and the brand of dog food.  While you can follow the feeding guidelines on the dog food packaging for portion guidance, it’s also important to get your vet’s input about a feeding regimen tailored specifically to your dog. Nutritional Tips for Chinese Cresteds A well-balanced and nutritious diet will meet the nutritional needs of Chinese Cresteds. Do not give your dog supplements unless your vet recommends them. Behavior and Training Tips for Chinese Cresteds Chinese Crested Personality and Temperament Chinese Cresteds are happy and alert dogs, according to the ACCC. They tend to be friendly toward everyone, even people they’re just meeting. That said, socializing your Chinese Crested puppy early and consistently is important for her to be comfortable in new situations. Chinese Crested Behavior The Chinese Crested is a dog with some rather cat-like quirks—according to the breed club, the breed is known to perch on the back of couches, much like felines do. But they’re also eager to please their people and form strong bonds with those they love. Cresteds crave attention, and they might get a little needy if they don’t get enough affection. Chinese Crested Training As with all dog breeds, Chinese Crested puppies need early socialization and exposure to new animals, people, and situations. The breed club recommends enrolling your puppy in the AKC S.T.A.R. Puppy Program. Always use positive reinforcement when training your Chinese Crested. But keep an eye on how many treats you’re giving her, as those calories can add up in a dog so small. Fun Activities for Chinese Cresteds Interactive puzzles Short walks Agility training  Scent work Dock diving Playing fetch Learning new tricks Gentle tug-of-war Cuddling Chinese Crested Grooming Guide Though hairless Chinese Cresteds and Chinese Crested powderpuffs have very different grooming needs, both require care that is pretty involved. Hairless dogs need additional care for their exposed skin, and powderpuffs need regular brushing and professional grooming sessions. Skin Care Hairless Chinese Cresteds have smooth, soft skin that needs a little extra TLC. If your hairless dog spends time in the sun, her skin needs to be protected with dog-safe sunscreen or clothing. You will also need to regularly moisturize their skin to prevent it from drying out and becoming damaged. A warm sweater or coat may also be necessary even on relatively mild days. Coat Care Powderpuff Chinese Cresteds don’t need as much skin care as hairless ones do, but her long locks—a double coat consisting of a soft undercoat and a longer, silky topcoat—do require special attention. As a pet parent, you’ll need to brush your powderpuff at least a few times a week to prevent painful matting. You’ll also need to schedule routine trips to the groomer for a trim when their hair grows too long. Eye Care Stay vigilant for any changes in your Crested’s eyes, as this can be a sign of a developing eye condition. Stay up to date with yearly wellness exams, and contact your vet if you notice anything amiss, such as redness, cloudiness, or discharge. The breed can also develop normal tear staining. Wiping your dog’s eyes with a dog-safe wipe or damp washcloth will keep their face clean. Ear Care Keeping your Chinese Crested’s ears clean and the canals free of debris is essential for preventing ear infections. Call your vet if you notice any redness or odor in your pup’s ears, as this could be a sign of an infection. Nail Care Since Chinese Cresteds tend to spend much of their lives indoors, pet parents may find that they need to trim their toenails frequently. Check your dog’s toenails once a week and trim them back when they start getting a little long. Considerations for Pet Parents While bringing home any new pet is a long-term commitment, the commitment with a Chinese Crested puppy is longer than most, as this breed regularly lives to be 13–18 years old. Over that long life, you’ll get a loving, affectionate, and quirky companion. But you must keep up with your Crested’s grooming needs, whether she’s a hairless or a powderpuff."}]