[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Irish Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Irish Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_irish_terrier"}, "datePublished": "March 16, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Irish Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Speculated to be among the first of terrier breeds, the Irish Terrier is very true to typical terrier traits with its loyalty, adaptability, and spunk. This breed is very well-rounded and makes for an excellent companion. Physical Characteristics Even though this terrier has a strong and sturdy body, its movement is lithe and active. With a racy (appearing powerful yet limber) and graceful outline, the Irish Terrier has a moderately long body and does not possess the short back trait of many long-legged terriers. This breed combines agility, speed, power, and endurance, enabling it to perform a range of tasks. Its intense expression matches its nature. The dog’s broken coat, meanwhile, is wiry and dense, and short enough to not disturb the body shape. This coat is usually bright red, golden red, red wheaten, or wheaten. However, puppies may have black hair at birth, which should disappear before they are full grown. In addition, whole-colored dogs may have a small patch of white on the chest. Personality and Temperament The Irish Terrier is fond of chasing, exploring, hunting, and running. It requires sufficient mental and physical workout in a secure place daily; this will give it a dignified, calm demeanor indoors. This loyal companion is also very entertaining. Known to be a daredevil, the Irish Terrier is bold, assertive, brash, independent, strong-willed, curious, good-natured, and ever ready for adventure and action. It is reserved with unknown people, but is generally aggressive towards small animals and other dogs. Care The Irish Terrier’s wire coat requires combing about twice a week, in addition to shaping and trimming about four times a year. Show dogs need stripping. For household pets, clipping is enough -- it helps in softening the coat but may make the color dull. An active breed, the Irish Terrier requires daily exercise and entertaining games. Apart from making a good jogging and walking companion, it is also a preferred hunting and hiking partner. (Training the Irish Terrier&#039;s ears is necessary for producing and honing their skills as effective hunters.) Health With an average lifespan of 12 to 15 years, the Irish Terrier may suffer from minor health problems like urinary stones. History and Background As the name suggests, the Irish Terrier, an old and a typical long-legged terrier breed, originated in Ireland. It is said to have descended from a wheat-colored terrier (perhaps a similar progenitor to the Soft Coated Wheaten Irish Terrer) and old Black and Tan Terrier, breeds that were found in Ireland and employed for hunting vermin, fox, and otter. As it resembles the Irish Wolfhound, many people also believe that this terrier may partly share its ancestry with the breed. Being one of the raciest of the Terrier Group, the Irish Terrier has longer legs and a longer body than the other terriers. Earlier Irish Terriers had different colors, including brindle, black and tan, and gray. But by the end of the 19th century, the solid red color was standardized among the breed. In 1875, the first Irish Terrier was introduced to the public and by the 1880s, it became the fourth most popular breed in England. And though people at the time considered it stylish to crop the terrier’s ears, the Irish Terrier Club of England would ban the practice in 1889. This decision had far-reaching implications for dogs, as it led to the debate regarding ear cropping and finally to the complete abolition of cropped ears in breeds of dogs displayed in England. In the United States, this terrier became very popular, gaining the 13th rank among all breeds of the 1920s. Today, it is regularly featured in dog show rings across the country."}]