[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Kuvasz", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Kuvasz", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_kuvasz"}, "datePublished": "September 17, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Kuvasz Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "A working dog with a wonderful expression and pure white coat, the Kuvasz is a large and sturdily built dog that was descended from giant Tibetan dogs. Despite their size, the breed is active and energetic. Physical Characteristics As the breed has traditionally been a hunter, herder, and guardian, its agility and power is paramount. And though large, the Kuvasz is not bulky. In fact, its medium-boned body enables the dog to move swiftly and smooth, with a free gait. Its protective double coat, meanwhile, is medium and coarse, ranging from straight to wavy. Personality and Temperament Although the Kuvasz has a sweet expression, it is fearless when guarding and protecting its family and home. It gets along well with children, but sometimes misinterprets rough play among children as an attack on its human family. Additionally, some Kuvasz dogs may become dominating and show aggression toward strange people and dogs. However, it is generally loyal, dedicated, and especially gentle with livestock and other family pets. Care Coat care consists of weekly brushing; however, daily brushing is required when the dog undergoes its seasonal shedding. The dog needs daily exercise in the form of a good run in an enclosed area and a long walk. It is fond of cold weather and can survive outside in cool and temperate climates. Despite this, Kuvasz experts recommend allowing the dog to spend time both in the yard and indoors. Health The Kuvasz, which has an average lifespan of 9 to 12 years, is susceptible to serious health issues such as canine hip dysplasia (CHD) and Osteochondritis Dissecans (OCD), and minor problems like hypothyroidism. It also may suffer from panosteitis and Hypertrophic osteodystrophy (HOD). To identify some of the issues early, a veterinarian may recommend hip, elbow, and thyroid exams for this breed of dog. History and Background The Kuvasz is likely to have descended from giant Tibetan dogs, though it is regarded as a Hungarian breed. The name is actually Turkish, not Hungarian, and is derived from the word &quot;kawasz,&quot; which means &quot;armed guard of noblemen.&quot; This is because during the Middle Ages only nobleman favored by members of the royal family had could keep these dogs. Kuvasz breeding in the 15th century was meticulously planned and documented, and the dogs became very popular on huge Hungarian estates, functioning as hunting and guard dogs. They were excellent in safeguarding the estate against predators and could handle large game like wolf and bear. King Matthias I, a Kuvasz fancier, worked hard to improve the breed&#039;s quality and built a large kennel on his property to forward research. Centuries later common villagers were able to acquire Kuvasz as livestock dogs, and it was at that time that the breed&#039;s name was corrupted to its current spelling. The two World Wars caused a serious decline in the numbers of the breed, but German stock was used as a reliable source to maintain continuity. In the 1930s, some dogs were imported to the United States, and in 1931 the American Kennel Club formally recognized the breed."}]