[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "German Pinscher", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, German Pinscher", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_german_pinscher"}, "datePublished": "June 18, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about German Pinscher Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The German Pinscher is a medium-sized, short-coated dog. An excellent watchdog and companion, it combines elegance and strength with endurance and agility. Physical Characteristics Having gained status as a watchdog and loyal companion of ideal size, the German Pinscher is a popular pet. This medium-sized dog has a muscular, square build and is generally fawn or black and blue in color. Its lightness makes it very agile, though it derives its strength from its solid body type. The dog’s sensitive senses allow it to hunt throughout the day. Once it finds a rodent, it can easily catch and kill it. When it is suspicious about a stranger, it will bark until the person withdraws. Personality and Temperament The German Pinscher is affectionate, playful, and good with children. However, it is suspicious of strangers and may not be suitable for homes with small pets, particularly rodents. The tenacious, courageous, and lively German Pinscher looks after its master’s property, regardless if it has been trained to do so. Its tendency to bark is not meant as a nusiance, but a warning to housemates of oncoming intruders. And although it is a quick learner, it will only obey under its own volition. Care The grooming requirements for the German Pinscher is fairly simple: the occasional brushing and wash. German Pinschers love to be involved in family activities and hate to be left in the kennel or alone. They are very dedicated to their family, their devotion going to the extent of supervising housework, providing entertainment in the evenings, guiding gardening, and sharing their master’s bed. As the dog is full of energy it should be given good mental and physical exercises or it can get bored and frustrated. Health The German Pinscher, which has an average lifespan of 12 to 15 years, is not troubled with any major or minor health problems. However, hip and eye tests are suggested for this breed of dog. History and Background The German Pinscher, one of the reputed Pinscher breeds, originated from two older breeds: the German Bibarhund (from the 1200s) and the Tanner (from the 1300s). These strains were crossed with Black and Tan Terriers in the 1600s to produce the Rattenfanger, a good watchdog and versatile working ratter. This dog then became the Pinscher, remaining a hard-working breed for many centuries and held in high regard for its ability to catch rodents. The late 1800s saw the advent of dog shows and the growing popularity of the Pinscher. In 1884, the breed standard for the Pinscher was chosen for the first time. The breed did gain popularity from dog lovers initially, causing their numbers to quickly diminish. The World Wars also hindered efforts to register, count, and exhibit Pinschers. By the end of World War II the breed was nearly extinct, not a single Pinscher litter registered in West Germany between 1949 and 1958. In order to survive, the Pinscher had to depend on the Miniature Pinscher, its descendent. In 1958, the Pinscher-Schnauzer Klub of West Germany chose and registered four oversized Miniature Pinschers. Three separate &quot;MinPin&quot; males were bred with a Pinscher female that was secretly smuggled from a place in East Germany, where Pinschers could still be found. Nearly all present-day German Pinschers are descended from these dogs. In the late 1970s, German Pinschers were introduced to United States. The American Kennel Club first placed the breed in the Miscellaneous class in 2001; two years later the German Pinscher was placed in the Working Group."}]