[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pumi", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-pumi-breed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-pumi-breed.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Pumi", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_pumi"}, "datePublished": "February 6, 2018", "dateModified": "October 13, 2023", "description": "Learn everything about Pumi Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "By Lynne Miller The Pumi is a medium-sized breed that belongs to the herding group. Friendly and energetic, the Pumi is better known in other countries than in the United States. “I don’t think a lot of people know about the breed,” says Gina DiNardo, executive secretary of the American Kennel Club. “They are sweet, adorable-looking dogs.” Physical Characteristics The Pumi looks distinctive with its long head, semi-erect ears, intelligent brown eyes, whimsical facial expression, muscular body, and unique coat. The Pumi’s short coat can be black, white, gray, or shades of fawn. Never straight, the Pumi’s hair is wavy and curly, in corkscrews or curls. Ideally, the dogs weigh between 22 and 29 pounds, making them ideal for families looking for smaller pets. “They’re a nice compact size,” DiNardo says. Personality and Temperament Athletic dogs, Pumik (that’s plural for Pumi) relish adventures and activities with their loved ones. Like other intelligent breeds, the Pumi tends to be aloof when meeting strangers for the first time, DiNardo says.  Bred to be independent, a Pumi is not an ideal pet for passive or meek personalities. “You have to teach the Pumi that you’re the boss,” DiNardo says. “You need to train the dog and make sure the dog knows what’s expected of him.” Teaching a Pumi a new trick may require patience and perseverance. While a Pumi is easy to train, that doesn’t mean the dog will respond to training cues right off the bat. “They can be a little stubborn,” DiNardo says. “When you tell them to sit, they may not want to sit. They may not do it the first time you ask them to do it. They’re bred to be independent thinkers out on the farm.” While Pumik usually get along with children, owners should be careful when introducing the dog to a new pet, Di Nardo says. Care A Pumi is not a good choice for a household of couch potatoes. Since they are naturally athletic and smart, Pumik need plenty of outlets for their physical and mental well-being, DiNardo says. A Pumi could be a good companion for someone who is physically healthy, active, and able to take the animal on walks and provide daily playtime with a tennis ball or frisbee in the backyard or indoors when the weather is bad. These dogs also enjoy canine sports. With its non-shedding coat, the Pumi does not require a lot of grooming. The AKC advises owners to comb the dog’s hair every two to three weeks, followed by wetting the hair down to let the coat curl back up. The Pumi’s ears should be checked regularly to avoid a buildup of wax and debris, which can lead to an infection. Health A healthy breed in general, the Pumi has an average lifespan of 12 to 13 years. Hip dysplasia, degenerative myelopathy and patellar luxation are the most common health problems known to affect this breed, DiNardo says.    History and Background Originating in the 17th or 18th centuries from the Puli, another high-energy herding breed, the Pumi has its roots in Hungary. Pumik were bred to help shepherds gather, drive, and control cattle, sheep, and pigs. Unlike other dogs who herded farm animals in large circles, Pumik worked in areas that didn’t have big open fields. They herded animals down narrow straight paths, moving back and forth, barking and nipping to keep the herd moving and off neighboring property. “They are a fearless breed,” DiNardo says. Farmers relied on Pumik to eradicate vermin. The name “Pumi” was introduced for the first time in 1815 to describe a kind of sheepdog. Since their arrival in Finland in 1972, Pumik have become the most popular of the Hungarian herding dogs in that country. The AKC officially recognized the Pumi in 2016."}]