[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Cocker Spaniel a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "The American Cocker Spaniel is generally a well-tempered and friendly dog, typically a good family pet that does well with people (and other pets) of all ages."}}, {"@type": "Question", "name": "Are Cocker Spaniels smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "American Cocker Spaniels are intelligent dogs, making them a fun and easy breed for training, especially for high-energy activities such as agility."}}, {"@type": "Question", "name": "Do Cocker Spaniels like to cuddle?", "acceptedAnswer": {"@type": "Answer", "text": "Many American Cocker Spaniels enjoy being close to their people, and it’s not uncommon for one to wiggle in next to you (or on top of you) for cuddles."}}, {"@type": "Question", "name": "What is the main color of American Cocker Spaniels?", "acceptedAnswer": {"@type": "Answer", "text": "American Cocker Spaniels come in many colors, including black, red, and brown. The most popular Cocker Spaniel coat color is buff."}}, {"@type": "Question", "name": "What’s the difference between the American Cocker Spaniel and English Cocker Spaniel?", "acceptedAnswer": {"@type": "Answer", "text": "While the two look quite similar, there are subtle differences between American Cocker Spaniels and English Cocker Spaniels, mainly in appearance. American Cocker Spaniels tend to be slightly larger and stand taller than the English breed. While both have the characteristic droopy ears and long coats, American Cocker Spaniels tend to have longer ears and a thicker coat than their English counterparts. Featured Image: iStock/DevidDO"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cocker Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-612634282.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-612634282.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Cocker Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/cocker-spaniel"}, "datePublished": "October 14, 2022", "dateModified": "October 13, 2023", "description": "Cocker Spaniels are friendly dogs who love their family. And while their floppy ears are cute, those ears can be prone to infections. Learn more about living with and caring for American Cocker Spaniel puppies and dogs.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. The Cocker Spaniel, also called the American Cocker Spaniel, is one of the world’s most-loved dog breeds because of their big, round eyes, long ears, and a playful personality to match their sweet faces. American Cocker Spaniels were bred to be hunting dogs and have the size to keep up in the field, but they’re also small enough to travel well and cuddle on the couch. They make excellent companions for adults and children alike. Caring for a Cocker Spaniel Standing at about 14-15 inches tall, the American Cocker Spaniel is the American Kennel Club’s smallest sporting spaniel. They have characteristically long, furry ears and come in 15 different standard coat colors. The body shape is well-balanced and strong, which allows them to be both sturdy and agile. The typical Cocker Spaniel lifespan is between 10-14 years, so they’ll be a longtime companion. Those famously lush ears, however, can make them susceptible to ear infections. Additionally, their long coats can predispose them to skin infections if not properly groomed and maintained. Cocker Spaniel Health Issues Despite the Cocker Spaniel&#039;s long lifespan, they are predisposed to a few health issues.  Ear Infections (Otitis) Otitis, or inflammation of the ear, can affect the outer ear (otitis externa), the middle ear (otitis media), or the inner ear (otitis interna). These ear infections are typically associated with yeast and/or bacteria, and they can occur secondarily to a predisposing factor or disease. The ears’ floppy shape predisposes American Cocker Spaniels to otitis because moisture can become trapped in their ear canals, making it easy for bacteria and yeast to thrive. Otitis can often be prevented with regular ear cleaning, especially following a bath or swimming session. Skin Infections Pyoderma, or skin infections, occur when long hair coats are not routinely groomed. Their long hair becomes tangled and forms tight mats—trapping moisture and bacteria, which can cause an infection. Routine brushing and grooming can help prevent this. What to Feed a Cocker Spaniel The needs of the individual dog often dictate the best diet for a Cocker Spaniel, but it is always important to select a dog food with high-quality ingredients. Your Cocker’s veterinarian can make dietary recommendations based on the pup’s specific medical history. American Cocker Spaniels that serve exclusively as family pets—rather than sporting dogs—can easily become overweight. It’s important to maintain proper body conditioning and weight by avoiding overfeeding. How to Feed an American Cocker Spaniel Most American Cocker Spaniels follow a standard feeding schedule like most other adult dogs. Typically, giving your pup two meals, one in the morning and one in the evening, is best for this breed. Because Cocker Spaniels have long, lush coats, food can often get tangled in their hair as they eat. After meals, clean off any food from their fur to prevent matting. How Much Should You Feed an American Cocker Spaniel? Always follow the feeding guide provided by your specific food brand to ensure that your dog is receiving the appropriate essential daily nutrients—you can often find this on the bag. Nutritional Tips for American Cocker Spaniel For an American Cocker Spaniel that participates in sporting activities, it’s a good idea to supplement them with glucosamine and chondroitin to help keep their joints healthy. Omega-3 supplements can also aid in protecting joint health and keep their skin and coat lush and soft. Behavior and Training Tips for Cocker Spaniels American Cocker Spaniel Personality and Temperament While the American Cocker Spaniel is a sporting breed, they aren’t one that requires high levels of exercise to stave off excess energy. They typically enjoy playing with toys, fetching a ball, or walking with their family members as forms of exercise. At home, these sweet-tempered pups love being close to their people. American Cocker Spaniel Behavior American Cocker Spaniels offer a friendly personality, both with people and other animals. That said, some have been known to be more reactive in nature. This can be a result of poor breeding, and proper training and socialization can help with this issue. American Cocker Spaniel Training American Cocker Spaniels want to please their pet parents, meaning they’re often easily motivated by rewards of food and praise. Start socialization and training classes early so your Cocker Spaniel puppy learns good manners. This breed also enjoys performance activities, such as agility training. Fun Activities for American Cocker Spaniels Agility Walking Fetching a ball or toy Playing with housemates (human or dog) Cocker Spaniel Grooming Guide Frequent and regular brushing is required to maintain an American Cocker Spaniel’s fairly high-maintenance coat and help prevent matting. Regular brushing will also help manage shedding, which is a year-round affair for this breed thanks to their double coat. Skin Care Skin care for the Cocker Spaniel varies depending on the individual’s needs. However, the breed does not typically have sensitive skin. Coat Care An American Cocker Spaniel’s long coat can be prone to matting, which can cause skin infections if not cared for properly. Frequent brushing is important to prevent these issues. When bathing your dog, it’s important to thoroughly rinse the hair, as soap residue on the skin can cause irritation. Dry the hair completely with a low-heat dryer to prevent moisture from lingering in the hair and skin. Residual moisture can lead to matting and infections. Eye Care Routine cleaning with a soft, damp cloth will help prevent tear stains from building up around your Cocker’s eyes. Ear Care Routine cleaning with a veterinary-approved ear cleanser is vital in maintaining healthy ear canals. This should be done any time after an American Cocker Spaniel is in water, such as after swimming or bathing. Considerations for Pet Parents The American Cocker Spaniel’s predisposition for developing ear infections can often lead to chronic conditions when not taken care of properly. Depending on how bad and often the infections occur, a total ear canal ablation (TECA) surgery might be recommended. This procedure removes the ear canal completely to preserve the dog’s quality of life."}]