[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Otterhound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Otterhound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_otterhound"}, "datePublished": "September 24, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Otterhound Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Otterhounds are large, rough-coated dogs with great strength, dignity, and a wonderful musical voice that can be heard from a great distance. A packhound, it was originally bred to hunt its quarry on land or water, but will fit in as a family companion. Physical Characteristics The strong and athletic Otterhound can tolerate long, tiring hunts, and the harshest of weather. Its large feet offer good grip on slippery and rough terrain. It also has a large and stocky build, with a long body, thus allowing it to trot slowly and steadily for a long time without getting tired. The dog&#039;s coarse and rough outer coat, which can be found in a variety of colors, offers protection from brambles. Its soft, wooly, and oily undercoat, meanwhile, insulates the dog while crossing cold streams. This breed’s easy-going temperament is reflected by its open and friendly expression. Its acute sense of smell is due to its large muzzle and nose, which easily accommodate the dog&#039;s millions of olfactory receptors. Personality and Temperament Being a natural hunter, the Otterhound has the urge to chase animals and is completely determined once set on the trail. However, because of its instincts and training, it does not kill its prey once found. In addition to trailing, this pack-hound enjoys swimming, sniffing, and hunting. It is friendly towards other dogs and while indoors, the dog is lively, easy-going, and amiable. It is also gentle with children. Despite this, because it was not originally bred as a pet, it is not always responsive with instructions. Care The Otterhound is not a breed that can brag of its tidiness, as food often gets trapped in its mouth a face, or mud in its hairy feet. Therefore, the dog should be brushed and combed at least once a week. Moreoever, the Otterhound requires a daily exercise regimen. It can sleep outdoors in cool and temperate climates if given proper shelter. Health The Otterhound, which has an average lifespan of 10 to 13 years, is prone to minor health issues such as elbow dysplasia and canine thrombopathia (CTP), and more serious problem like canine hip dysplasia (CHD) and gastric torsion. Epilepsy is also seen on occasion in this breed. To identify some of these issues, a veterinarian may recommend elbow and hip for dogs of this breed, as well as DNA exams to confirm CTP. History and Background Closely resembling the Petit Basset Griffon Vendéen, the Otterhound may have its roots in France. Being a very unusual member of the Hound Group, the Otterhound is a hardy scenthound, whose origin is unknown. The Otterhound may have its roots in breeds such as the Welsh Harrier, Bloodhound, Southern Hound, or a kind of water spaniel. Although there is not much to be said about the genetic makeup of the breed, it was a prized otter hunter in England as early as the 13th century. In 1212, King John kept the earliest documented Otterhound packs. This dog was used for searching for otters, which were exhausting the fish in local streams. The dog trailed the prey to its hideout and bayed after locating it. After the hunters arrived, they would take away the Otterhound and use small terriers to kill the otter. Although otter hunting was not a popular sport -- as it lacked the formality of foxhunting and took place in wet weather conditions -- the breed rose in popularity during the later part of the 19th century, when more than 20 packs hunted in England. However, this sport started losing its prominence after World War II. The first Otterhound was introduced to the United States at the turn of the 20th century; soon thereafter, the American Kennel Club would formally recognize the breed. Unfortunately, this ancient English breed is slowly becoming extinct. Otterhound fanciers are often not in favor of breeding the dog for dog shows and thus it has not been very popular as a pet or show dog."}]