[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Bichon Frise a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "The Bichon Frise makes an excellent family dog. They are good with kids and other animals. They have a lot of energy, making them great company for children."}}, {"@type": "Question", "name": "Are Bichons smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The Bichon Frise is a smart dog and easy to train. They quickly pick up basic cues and can learn fancier tricks, too."}}, {"@type": "Question", "name": "How much does a Bichon Frise cost?", "acceptedAnswer": {"@type": "Answer", "text": "Because Bichons are affectionate, well-behaved, and allergy-friendly dogs, they can be quite expensive. Bichon Frise puppies typically cost over $1,000, though prices vary depending on region and the breeder.  "}}, {"@type": "Question", "name": "How do you pronounce Bichon Frise?", "acceptedAnswer": {"@type": "Answer", "text": "Bichon Frise is pronounced “BEE-shon Free-ZAY.” Featured Image: iStock/MilanEXPO"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bichon Frise", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/bichon-frise-at-the-park.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/bichon-frise-at-the-park.jpg"}, "author": {"@type": "Person", "name": "Tiffany Paul, DVM", "url": "https://www.petmd.com/author/dr-tiffany-paul"}, "keywords": "Dog, Breed, Zoo Small Dog Pack, Bichon Frise", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/bichon-frise"}, "datePublished": "October 17, 2022", "dateModified": "October 13, 2023", "description": "The Bichon Frise is a little but spunky dog who&#039;s filled with energy and love for their pet parent. Learn more about caring for a Bichon Frise.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy.  The Bichon Frise is a small dog that’s a playful and affectionate member of the non-sporting group. Good with children and friendly with other dogs, Bichons are curious and enjoy meeting new friends. Despite their big personality, the Bichon Frise stands just under 1 foot tall and weighs an average of 12-18 pounds. Bichons enjoy a long life (typically 14-15 years) and, because they are considered “hypoallergenic” dogs, make popular pets for people with dog allergies. Caring for a Bichon Frise The Bichon Frise likes to play, be social with their family, and play some more. They love to play with their favorite toys and, in their downtime, they’re content to lounge with their family on the couch. Due to their small stature, Bichons make good apartment dogs. They tend to bark when alerted to foreign sounds, but they are easily trainable because they’re so eager to please their humans. They even can be trained to do specialty tricks, like dancing. Bichon Frise Health Issues Bichons are known for their long lifespan of 14-plus years, but they can have a few common health conditions. The Bichon Frise is an overrepresented breed for diabetes mellitus and eye problems, such as corneal dystrophy and cataracts. Diabetes Mellitus Diabetes is a disease of the pancreas that results in a failure to regulate blood sugar. This causes high blood sugar that requires insulin injections to be administered daily. Common symptoms of diabetes are: Increased thirst Increased urination Weight loss Increased appetite If you notice any of these symptoms in your Bichon Frise, take your dog to the vet for a physical examination, a comprehensive blood panel, and urinalysis.  Corneal Dystrophy Corneal dystrophy is suspected to be inherited and can occur when your dog is just 2 years old. This disease is characterized by an opaque area that develops in the center of the cornea (the outermost clear surface of the eye). If the lesion becomes extensive, it can affect the Bichon’s vision. Corneal dystrophy doesn’t usually cause pain or require treatment unless it becomes advanced and results in an ulceration of the cornea. In these cases, Bichons may be referred to an eye specialist. Cataracts Cataracts, which is likely hereditary in Bichons, is when the eye lenses harden. The rate of advancement varies, but cataracts can start developing when Bichon Frise puppies are just 6 months old. Cataracts affect vision but can be treated with surgery. Bladder Stones Urolithiasis, commonly known as bladder stones, occurs when stones made of calcium oxalate, cystine, struvite, or calcium phosphate are made in the bladder. This can be hereditary, secondary to urinary infections, or diet-related. Symptoms of bladder stones may include bloody urine, malodorous urine, or straining to urinate. Bladder stones may be surgically removed or dissolved by a special diet prescribed by a veterinarian. Dental Disease As with all small dogs, the Bichon Frise may develop dental disease. Prevention is the best weapon against dental disease—it’s recommended that Bichons get their teeth examined and cleaned by a vet once a year to prevent infection and tooth loss. Brushing your dog’s teeth at home will help, too. What To Feed a Bichon Frise Bichons do well with a high-quality commercial diet approved by the Association of American Feed Control Officials (AAFCO). If they develop bladder stones, your veterinarian will likely recommend a prescription diet to treat the stones or prevent them from returning. How Much Should You Feed a Bichon Frise? Closely follow the dog food manufacturer’s feeding recommendations so you give your Bichon Frise the proper portions. Discuss your Bichon’s nutritional needs with your veterinarian if your Bichon’s weight becomes abnormal or concerning. How To Feed a Bichon Frise The Bichon Frise is active and not predisposed to obesity, so these pups may be free fed or fed several small meals throughout the day. Feeding habits should always be discussed with your veterinarian. Nutritional Tips for the Bichon Frise Because the Bichon Frise can be predisposed to dental disease, feeding them a food designed to clean their teeth is beneficial. A diet or treats approved by the Veterinary Oral Health Council (VOHC) will help keep your Bichon’s teeth healthy between dental checkups and cleanings. Bichon Frise Training and Behavior Tips Bichon Frise Personality and Temperament The Bichon Frise is a high-energy dog, but she’s also very adaptable to her surroundings. These traits are what make Bichons good with small children. And because they are very social with humans and other pets, Bichons fit right in to most families and make ideal lap dogs. Bichon Frise Behavior Even though they’re small, Bichons can try to “protect” their space and family, so they will bark at anything when on alert. But, because the Bichon is so social and smart, they warm up to new people and animals quickly. At home, Bichons are gentle, playful, and loving dogs. Bichon Frise Training The Bichon Frise is highly trainable. They are eager to please their humans and can learn a variety of tricks. Potty training and simple cues such as “sit” and “stay” are typically mastered quickly due to their intelligence. Fun Activities for the Bichon Frise Tug of war Fetch Lounging in their human’s lap Bichon Frise Grooming Guide The Bichon Frise has a long double coat of curly white hair. They are minimal shedders and can be great pets for some people who experience dog allergies. But because there’s no such thing as a 100% hypoallergenic dog, spend time with the breed before bringing home a Bichon Frise puppy so you can see how your allergies react. Skin Care Bichons should be bathed at least monthly. A good-quality dog shampoo and conditioner will help your Bichon’s coat stay soft and white. That said, excessive bathing should be avoided to prevent drying out the skin and coat. Coat Care Ideally, a Bichon Frise should be brushed every day to prevent matting. Monthly trips to the groomer will likely be required to keep them neat and trimmed, too. As with all dogs, it’s recommended to keep their nails trimmed; this helps them keep their balance and grip on the floor as they zoom around. Eye Care Because Bichons are predisposed to ocular diseases such as corneal dystrophy and cataracts, a thorough physical exam should be done annually by your vet. Any excessive tearing, squinting, or vision impairment should be discussed with your veterinarian immediately. Ear Care A Bichon Frise should have her ears cleaned once a month. This can be done by your groomer or at home using an over-the-counter ear cleanser. Occasionally, Bichons can have excessive amounts of ear hair that can predispose them to ear infections. If your pup is scratching excessively at their ears, or if their ears are smelly or painful, take your Bichon to your veterinarian for an examination. Considerations for Pet Parents The Bichon is a great family pet and highly suitable for families with younger children. They will do well in apartments due to their small stature and can work out most of their energy with some living room playtime. Although they may bark at strange noises, they are not considered to be excessive barkers. They are very social dogs, and strangers quickly become friends of the Bichon Frise. But they are high-maintenance when it comes to grooming—Bichons do require daily brushing and monthly baths to keep their hair from matting."}]