[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Silky Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Silky Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_silky_terrier"}, "datePublished": "May 13, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Silky Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Originally a cross between the Yorkshire and Australian Terriers, the Silky Terrier was eventually recognized as a separate breed. It is a friendly and joyful lapdog with a beautiful blue and tan coat. Physical Characteristics The Silky Terrier&#039;s refined body, which is long compared to its height, enables the dog to have a light-footed and free gait. Originally bred to terminate small rodents, this miniature variety of a working terrier retains the features required for a vermin hunter. Its expression is keen, while its blue and tan coat is silky, straight, and glossy, countering the body instead of falling to the ground. Personality and Temperament The clever Silky Terrier can be mischievous and has a tendency to bark excessively. It is unlike any other soft lapdog: feisty, curious, playful and bold. Because of this, some Silky Terriers are known to be scrappy towards other pets or dogs. Care Even though this terrier is hardy, it is not suited for outdoor living. The Silky Terrier is also an active breed, requiring more exercise than the average toy terrier. Its exercise requirements can be met with vigorous indoor or outdoor games, or a moderate on-leash walk; however, it prefers an opportunity to roam and explore on its own (just make sure it is done in a secure area). Its coat, meanwhile, requires combing or brushing on alternate days. Health The Silky Terrier, which has a lifespan of about 11 to 14 years, may suffer from minor problems like patellar luxation and Legg-Perthes disease. Diabetes, epilepsy, allergies, tracheal collapse, and Cushing&#039;s disease may sometimes be seen in this breed as well. To identify some of these issues, a veterinarian may run knee and elbow exams on the dog. History and Background The ancestor of the Silky Terrier, developed in Australia in the late 19th century, was the Yorkshire Terrier. Early on the Silky Terrier had an attractive tan and steel blue coloration, which was crossed with blue and tan Australian Terriers to enhance its color of the coat while retaining its robust form. The dogs that stemmed from these crosses were originally referred to as Australian Terriers or Yorkshire Terriers. Some breeders, however, thought they initiated the development of a different breed altogether and displayed these dogs as Silky Terriers. But by interbreeding the Silky Terriers, a true breeding strain developed. As two disparate areas in Australia were chosen for the breed’s development, different breed standards were set in 1906, and again in 1909 and 1926. The most popular name for the breed in Australia was Sydney Silky Terrier, but in 1955 it was altered to the Australian Silky Terrier. In the same year, the Sidney Silky Terrier Club of America held its first meeting, later changing its club name to the Silky Terrier Club of America. It was not until 1959 that the American Kennel Club recognized the breed. Today, it is considered a joyful yet mischievous lapdog."}]