[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much does a Leonberger cost?", "acceptedAnswer": {"@type": "Answer", "text": "The typical Leonberger price is anywhere from $2,000–$4,000 in the U.S. Cost varies depending on the breeder, breeding lines, and genetic testing for puppies."}}, {"@type": "Question", "name": "Are Leonbergers good family dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Leonbergers are great family dogs. They love affection and quality time with their pet parents, and they’re also generally good with children and other pets."}}, {"@type": "Question", "name": "Is a Leonberger a rare breed?", "acceptedAnswer": {"@type": "Answer", "text": "The Leonberger is a relatively rare breed—in fact, they almost became extinct in the 20th century."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Leonberger", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/leonberger.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/leonberger.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Breed, Leonberger", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/leonberger"}, "datePublished": "March 14, 2023", "dateModified": "October 13, 2023", "description": "Leonbergers are giant dogs that need daily grooming sessions and lots of love. Learn more about caring for Leonberger puppies and dogs.", "articleBody": "The Leonberger is a giant dog breed whose name is derived from the town of Leonberg, Germany. According to legend, the reddish-gold dog was bred in the 17th century by crossing Newfoundlands, Saint Bernards, and Great Pyrenees to resemble the lions on Leonberg’s coat of arms. The breed became popular with European royalty because of the dogs’ friendly temperaments and long coats, and the Leonberger worked on farms as well. After nearly going extinct during World War I and World War II, today the Leonberger dog breed is most often found working in search-and-rescue and living alongside their humans as companions. The Leonberger size is impressive—these dogs stand 25–32 inches tall and can weigh as much as 170 pounds. And because of their stature, the Leonberger life expectancy is shorter than the average dog, at only 7 years. Caring for a Leonberger Leonbergers are strong, muscular dogs that, if appropriately socialized and trained, are gentle giants. They are loyal to their family, gentle with children, patient, calm, and confident pups. Along with their easygoing temperament, Leonbergers are intelligent, easy to train, and prefer to have a job to focus on. They love to play but don’t mind being a couch potato either. Whatever family they’re in, they want (and need!) a lot of affection from everyone. Leonbergers are a sexually dimorphic breed, meaning males and females have different appearances. Male Leonbergers are powerful and masculine, with a lion mane-like scruff around their neck. Females are more slender and graceful. But no matter which gender your Leonberger is, they require a great deal of grooming due to their beautiful, long coat. Leonberger Health Issues Leonbergers have a few discernible health issues that are seen in most giant-breed dogs. If you’re bringing home a Leonberger puppy, it’s smart to consider purchasing pet insurance. Gastric Dilatation and Volvulus (GDV) One of the most concerning health conditions Leonbergers can develop is gastric dilatation and volvulus (GDV), a severe form of bloat. This is a condition where the stomach twists on itself, causing decreased blood flow to the stomach and continued gas distention, leading to a very enlarged stomach. This condition is a medical emergency and fatal if left untreated. Clinical signs of GDV in dogs include: Non-productive retching Drooling Lethargy Abdominal swelling Weakness or collapse A preemptive surgical procedure called gastropexy is often performed on young Leonbergers to eliminate the risk of their stomach twisting in the future. This procedure does not eliminate bloat, but it does eliminate torsion. Joint Problems Leonbergers are also prone to joint issues, including hip dysplasia. This condition is when the hip joint doesn’t develop properly, becoming loose and painful. Thankfully, hip dysplasia has become less of an issue for Leonbergers as breeders screen their dogs for the inherited condition. Arthritis is common in this giant breed as they age, due to their immense size. Weight management, joint supplements, and controlled exercise are excellent preventative actions against arthritis in Leonbergers. Cancer According to the Leonberger Health Foundation, cancer is the leading cause of death in Leonbergers. These dogs are susceptible to osteosarcoma (bone cancer) and hemangiosarcoma (a cancer that develops in the blood vessels). Heart Disease Dilated cardiomyopathy is another common cause of death in Leonbergers. This is when the heart becomes enlarged and doesn’t function properly. Symptoms of dilated cardiomyopathy include: Lethargy Lack of appetite Panting or labored breathing Coughing Collapse Treatment for dilated cardiomyopathy typically includes medications to help the heart pump and manage arrhythmias. Cataracts Older Leonbergers can develop cataracts, a condition where the eye lens becomes cloudy and hinders vision. If left untreated, cataracts can lead to blindness. Fortunately, this can be treated with surgery. What To Feed a Leonberger  Leonbergers should be fed a high-quality, well-balanced diet either commercially manufactured by a reputable company such as Hill’s Science Diet, Royal Canin, or Purina. They should be fed a formula that’s appropriate for their life stage: puppy, adult, or senior.  Giant-breed dogs such as the Leonberger are prone to obesity, which can worsen arthritis. So it’s very important to monitor their calories, weight, and body condition.  How To Feed a Leonberger Leonberger puppies should be fed giant-breed puppy food. They need three or four smaller meals on a regular schedule until they’re 5–6 months old. Once they reach adulthood, these meals can be changed to twice-daily feedings, one in the morning and one in the evening. Because Leonbergers are susceptible to bloat and GDV, pet parents need to take precautions when feeding their dog: Do not feed your Leonberger their entire daily allotment of food at once. Do not use elevated food bowls. Avoid exercise right before and after mealtimes. How Much Should You Feed a Leonberger? Every dog is different, so the number of calories they need to keep weight and health stable also varies from dog to dog. Discuss the best dog food brands and how much to feed your Leonberger with your veterinarian. Many giant-breed dog food diets contain vitamins and nutrients that support joint health, as Leonbergers are prone to degenerative joint disease as they age. These commercially formulated diets also have heart-healthy ingredients such as taurine and L-carnitine, which can help lessen the risk for heart disease.  Nutritional Tips for Leonbergers Joint supplements such as glucosamine and chondroitin can be helpful for Leonbergers. These should be started as soon as your dog reaches their full adult size. Talk with your vet before giving these supplements (or any others) to your pet. Behavior and Training Tips for Leonbergers Leonberger Personality and Temperament Leonbergers are loving and playful with those they trust. They’re great with children, amenable to other dogs, and welcoming to strangers when well-socialized. They are generally calm and quiet, but they require brisk exercise at least once every day, such as a long walk or hike. Leonberger dogs prefer to have a job, whether it be pulling sleds, swimming, or agility training. Leonberger Behavior Leonbergers are usually calm and do not bark or dig much. While laid-back, they require a lot of interaction with people and don’t do well when left alone for long periods of time. They would prefer around-the-clock love and attention, if possible, and need to be in a house of homebodies. Leonberger Training Though bred to be independent, Leonbergers are also highly trainable with experienced pet parents or professional trainers who are familiar with the breed. They respond well to training that’s consistent, repetitive, and positive. Fun Activities for Leonbergers Agility Cart-pulling or sled-pulling Swimming Walking Hiking Leonberger Grooming Guide Leonbergers require a lot of grooming due to their dense double coat. They shed persistently throughout the year, with even heavier shedding periods twice a year. Leonberger dogs should be with a family that is committed to grooming them thoroughly and frequently.  Skin Care Leonbergers need regular bathing and brushing. Typically, they should be bathed every two to four weeks. Leonbergers can have allergies, which lead to a flaky, dry coat. Consider supplementing with omega-3 fatty acids if your pup has skin allergies or is older in age. Coat Care Leonbergers should be brushed every day—without this rigorous grooming, they are prone to matted fur, especially behind the ears, on the back of the legs, throughout their undercarriage, and on their chest. Eye Care Luckily, Leonbergers do not require a great deal of eye care. The hair on their face is shorter and usually doesn’t affect their eyes. Tear staining is minimal, if there at all. But because Leonbergers are prone to cataracts as they age, pet parents need to monitor their dog for any progressive sight issues and/or cloudy eyes. Ear Care Routine ear cleaning is important for this breed because of their propensity for allergies and their floppy ears. Ear cleaning with a veterinarian-approved product that contains a drying agent should be used (such as Epi-Otic or TrizULTRA) every two to three weeks.   Monitor for redness, discharge, pain, and itching, as these could be signs of an ear infection. If you notice any of these symptoms, make an appointment with your vet. Considerations for Pet Parents The perfect home for a Leonberger is one with a loving, attentive family that is willing to exercise and groom their dog daily. Leonberger dogs do well in homes with or without kids and other pets, but the breed is not cut out for city life. This large breed needs a big yard with a strong fence that they can run around and play in. Leonbergers also don’t do well in homes where they are often left on their own. They are affectionate and loyal dogs that love their family and want to be around them as much as possible."}]