[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Löwchen", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Löwchen", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_lowchen"}, "datePublished": "September 17, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Löwchen Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The &quot;little lion dog&quot; is a small, bright, and lively animal. It was a companion breed in pre-Renaissance Europe. Ladies of the court groomed it to look like a little lion. Lively, positive and outgoing, the breed has great style.  Physical Characteristics The compact and small Löwchen is long in proportion to its height and is strong-boned. Its movement is effortless, with a good drive and reach. Its dense and long coat, which is generally clipped into a lion trim, is moderately soft with moderate waves. The Löwchen also has a short broad skull and muzzle, and a lively, watchful, and intense expression. Personality and Temperament The Löwchen is responsive to commands and generally willing to please, showing proper devotion to its family. Some dogs may dig or bark a lot. This affectionate, curious, and lively dog also combines qualities of a calm soul-mate and playful spirit, thus making it a nice companion for a calm family. Care Although the Löwchen is not meant for living outdoors, it loves access to a yard during the day. Short daily walks or a vigorous game is sufficient to satisfy the exercise needs of the Löwchen, but it is especially fond of mental challenges. Its dense coat requires combing or brushing on alternate days. Clipping, meanwhile, should be done once or twice a month, in order to preserve the lion trim, the preferred choice among pet owners. Health The Löwchen, which has an average lifespan of 13 to 15 years, may suffer from minor health problems like patellar luxation or be prone to serious heart conditions. To identify some of these issues early, a veterinarian may recommend knee and cardiac exams for dogs of this breed. History and Background Admitted into the American Kennel Club&#039;s (AKC) Non-Sporting Group in 1999, the Löwchen or Little Lion Dog, was also known by the name of Le Petit Chien Lion in France. It shares a common background with other dogs belonging to the Bichon family, including the Havanese, Bichon Frisé, and others. France, Germany, and Russia claim to be the native lands of the breed, but the exact place or time of the dog’s origin is obscure. However, certain dogs looking like the Löwchen and having a lion trim have been seen in 16th-century German art. The coat, according to the conventional lion trim, is clipped to a short length from the last rib to the hock joint. The front legs, above the pastern, are clipped from the elbow. The feet are also clipped and roughly half the tail is given a clipped look, with a plume at its tip. Long hair in other parts is not clipped. The breed&#039;s numbers diminished greatly in the &#039;60s but, through the attempts of two breeders, many dogs were brought from Germany to Britain. Those dogs were crossed extensively, which led to the formation of the breed in the United States and Britain. By 1996, the Löwchen gained entry into the AKC Miscellaneous class."}]