[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Black and Tan Coonhound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Black and Tan Coonhound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_black_tan_coonhound"}, "datePublished": "July 17, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Black and Tan Coonhound Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Black and Tan Coonhound is a working dog. It is accustomed to difficult terrains and trails, and the tree games of summer or winter seasons. The Coonhound hunting skills are pure, working by scent alone. Physical Characteristics The eager, amicable, and alert expression of the Coonhound makes it very lovable. With its tail and head held high, the Coonhound moves about with graceful strides. Its long structure is moderately bony, but its build gives it strength, speed, and agility. The Black and Tan Coonhound&#039;s coat, meanwhile, is dense and short, which provides protection in all kinds of weather. Its deep muzzle provides sufficient room for its olfactory apparatus, while its deep voice assists the hunter in finding the dog when it has trapped the game. It also has long ears that help stir up ground scents. Personality and Temperament The Black and Tan Coonhound is not the typical house dog, but it still makes a notable and unusual pet. The dog remains quiet, calm, mellow, and friendly indoors, but outdoors, its hunting instincts become dominant -- once tracking begins, it is unwilling to let go of a trail. This stubborn, independent, and strong dog sometimes howls and bays, shows reticence with strangers, though it is calm and tolerant with kids. Care Grooming a Black and Tan Coonhound consists of the occasional brushing of the coat and regular ear checkups. Exercise, meanwhile, may be satisfied with a long walk, short jog, or an excursion on a field. The Coonhound also loves to run a few miles and wanders on catching a scent. As the Black and Tan drools, it is a good idea to wipe its face regularly. Health The Black and Tan Coonhound, which has an average lifespan of 10 to 12 years, is prone to minor health concerns such as ectropion and hypothyroidism, and major issues like canine hip dysplasia (CHD). The Coonhound also occasionally suffers from Hemophilia B. To identify some of these issues, a veterinarian may recommend hip and thyroid tests for the dog. History and Background Bred mainly in the Blue Ridge, Appalachian, Smokey, and Ozark Mountains, Black and Tan Coonhounds were originally used for hunting bears and raccoons in rugged terrain. It should be noted that the Black and Tan Coonhound is an American breed that was developed by crossing the black and tan Virginia Foxhound with the Bloodhound. Much like their Bloodhound ancestors, the Black and Tan Coonhound trails with it nose to the ground, but at a faster pace. Trailing opossums and raccoons is its forte, but it is also good at trailing larger mammals. After trapping the quarry, the dog bays until the hunter arrives. In 1945, the American Kennel Club recognized the Black and Tan Coonhound, though the breed has been more popular as a hunting dog than a pet or show dog. Although the United Kennel Club arranges several bench shows for the coonhound breeds, in which Blue Tick Coonhounds, Black and Tan Coonhounds, Redbone Coonhounds, Plott Hounds, English Coonhounds, and Treeing Walkers participate."}]