[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dingo", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Dingo", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_dingo"}, "datePublished": "December 9, 2011", "dateModified": "October 13, 2023", "description": "Learn everything about Dingo Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Dingoes are one of the few successful cases of feral dogs thriving in the wild. And while it is illegal to keep one as a pet in its native Australia, there are some who do so anyway. The dingo is also known by several other Indigenous Australian names, including Joogong, Mirigung, Noggum, Boolomo, Papa-Inura, Wantibirri, Maliki, Kal, Dwer-da, Kurpany, Aringka, Palangamwari, Repeti and Warrigal. Vital Stats Height: 20 to 24 inchesWeight: 22 to 44 poundsLifespan: 12 to 15 years Physical Characteristics Compared to other similarly sized dogs, the dingo has longer canine teeth within its long muzzle, and a flatter skull. Its average weight is 22 to 44 pounds. Most dingoes are multicolored, with small white markings on the chest, muzzle, legs and/or paws. Its fur, which is mostly sandy to reddish brown in color, is typically short — though the hair&#039;s thickness and length will depend on the climate of the area. Personality and Temperament The dingo is generally shy toward humans. However, there are reports of dingoes that venture into parks, streets and suburban areas. The dingo is a highly social animal that, when possible, will form a stable pack with clearly defined territories. Unlike wolves, the dingo rarely hunts in packs, preferring to hunt as a solitary animal. It is nocturnal in warmer regions, but more active during the day in cooler weather. History and Background The first Dingo was registered at the London Zoo in 1828; it was simply referred to as the Australian Dog. However, the oldest known Dingo fossil dates to around 1450 B.C. (though it is suspected to be even older). It was originally brought to the Australian continent by human settlers several thousand years ago, but once the Dingo strayed away from human control it formed complex packs. A fast canine predator, the Dingo feeds off rabbits and other small wild animals, as well as farmers&#039; livestock. This is also why many in Australia and parts of Southeast Asia (where it migrated long ago) consider the dog to be vermin. In the Australian state of Queensland alone, it is estimated that there are between 200,000 and 350,000 dingoes. In recent years, organizations such as the Dingo Study Foundation and Australian Native Dog Foundation have dedicated themselves to studying this breed."}]