[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Soft Coated Wheaten Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Soft Coated Wheaten Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_soft_coated_wheaten_terrier"}, "datePublished": "March 16, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Soft Coated Wheaten Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "This medium-sized Irish terrier is not only powerful but gentle and affectionate. The Wheaten Terrier, most often noted for its warm, wheaten-colored coat, is also athletic and able to compete in dog trials or shows that require agility. A wonderful companion for those looking for a curious indoor dog. Physical Characteristics At a glance, the Soft Coated Wheaten Terrier looks graceful, happy, and alert. Powerful and medium in size, its square-proportioned body allows the dog to perform well as a farm worker, and yet it is agile enough to catch and exterminate vermin. The Wheaten Terrier can be differentiated from other terriers by its abundant single coat, which is soft, silky, long, slightly wavy and may be any shade of wheaten or rust color. The Wheaten Terrier also has a free gait and good drive, keeping its tail erect while moving. Personality and Temperament Unlike most terriers, the Wheaten Terrier is very gentle, congenial, and affectionate. Generally, it responds to its master’s commands, though it may be headstrong on occasion. An excellent companion and fun-loving partner, the Wheaten Terrier behaves well with children and is good with pets and other domestic dogs. However, some may become boisterous around small kids. Additionally, the breed tends to jump and dig holes. Care The Wheaten Terrier can live outside in cool weather, but it does best as an indoor dog. Its long coat requires combing or brushing once every two days; this is to prevent its hair from matting or tangling. As the Wheaten Terrier does not shed hair, alternating between trimming and bathing every month is essential to maintain the shape and look of the dog&#039;s coat. Generally, the coat is clipped to about three inches in length. The Wheaten Terrier is an athletic dog that requires exercise daily, most often in the form of a lively outdoor game or a moderate or long walk. This breed also loves chasing and hunting, and should be only be allowed to walk off-leash in a secure area. Health The Soft Coated Wheaten Terrier, which has a lifespan of 12 to 14 years, suffers from progressive retinal atrophy and canine hip dysplasia. It is prone to some minor health problems such as renal dysplasia and Addison&#039;s disease, and major problems like diseases causing protein loss. To identify some of these issues, a veterinarian may run hip and eye exams and urine protein screens on the dog. History and Background The Soft Coated Wheaten Terrier is one of three big Irish terriers. Bred as a versatile farm dog, it excelled at its tasks -- whether it be guarding the house (or barn) or exterminating pesky vermin -- for more than 200 years in Ireland. The Wheaten Terrier would later become an effective gundog, locating and retrieving game for hunters. The origin on the Wheaten Terrier&#039;s history has not been well documented, but it is said that the Kerry Blue Terrier is a direct descendant. Legend has it that when the Spanish Armada was sunk off the shores of Ireland, the blue dogs that swam ashore were welcomed by the terriers with a soft wheaten coat. Its presence as a show dog was not immediate. In fact, it was not until March 17, 1937 (a most fitting day for any Irishman) in Ireland that the Soft Coated Wheaten Terrier was granted breed status and allowed to enter the Irish Kennel Club Championship Show. In 1943, the English Kennel Club granted recognition to the breed, and in 1946, the Wheaten was introduced to the United States. U.S. dog fanciers were no more keen to the breed than their British counterparts initially. But once the Soft Coated Wheaten Terrier Club of America was established on St. Patrick&#039;s Day in 1962, it gained much popularity. The Americal Kennel Club would later admit the breed into registration in 1973. Today, the Soft Coated Wheaten Terrier is loved by both those seeking agile dogs for agility trials or a fun-loving, affectionate companion for the home."}]