[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Welsh Springer Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Welsh Springer Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_welsh_springer_spaniel"}, "datePublished": "June 24, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Welsh Springer Spaniel Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Welsh Springer Spaniel is a retriever dog originating from Wales. Loyal and dependable, it requires plenty of love. Bred to be a working dog, the Welsh Spring Spaniel also needs active owners that exercise with it daily. Physical Characteristics The Welsh Springer Spaniel has a soft and gentle expression; a hunting dog, its body is compact and muscular. Physically, it is a bit longer than taller. The Welsh Springer Spaniel also has a coat that is either straight or flat. This dense coat, which is red and white in color, defends it from harsh weather conditions. The breed&#039;s gait, meanwhile, covers much ground and is powerful. Personality and Temperament The Welsh Springer Spaniel is a sensitive breed. Easy-going by nature, it generally has a pleasing personality, but is alert and cautious around strangers. The Welsh Springer Spaniel loves human companionship, but enjoys independence. Despite this, this spaniel is considered extremely devoted to its owner. Care Brushing and combing a Welsh Springer Spaniel is necessary at least once or twice a week. Occasionally, its coat will need a trim. Routine exercise is a must for this breed, and should be accompanied by games and long walking sessions. It loves living inside the house with open access to a field, yard or lawn, as well as frequent outdoor expeditions. Health The Welsh Springer Spaniel, which has an average lifespan of 12 to 15 years, is prone to minor health concerns like otitis externa, glaucoma, and epilepsy, and minor ones such as canine hip dysplasia (CHD). To identify some of these issues, a veterinarian may conduct eye and hip tests on the dog. History and Background An excellent hunter, the Welsh Springer Spaniel is thought to have evolved from the crossing of the Clumber and English Spaniels. But before the Welsh Springer Spaniel emerged in Wales, land spaniels were in use there. The dogs that appeared in the first dog-shows in England were English and Welsh Springer Spaniels. Their difference lay in their color, but they have proved to be great hunters as well as show-dogs. The Welsh Springer Spaniel was recognized by the American Kennel Club in 1906, but failed to gain much popularity. By the end of World War II, it was nearly extinct. Fortunately, fresh imports from Wales and other European countries revived the breed. Since then, this breed with retrieving skills both on land and in water, has been able to garner a moderate popularity in the United States."}]