[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How big do Great Pyrenees get?", "acceptedAnswer": {"@type": "Answer", "text": "The Great Pyrenees size is extra-large. Adult males average 100–110 pounds and 31 inches tall, whereas females average 85–100 pounds and 28 inches tall."}}, {"@type": "Question", "name": "How long do Great Pyrenees live?", "acceptedAnswer": {"@type": "Answer", "text": "The average Great Pyrenees life span is 10–12 years."}}, {"@type": "Question", "name": "Is a Great Pyrenees a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Great Pyrenees are good family dogs and their calm nature is suitable for homes with children who understand how to appropriately interact with dogs. That said, because they’re so big, small children might accidentally be bumped and knocked over."}}, {"@type": "Question", "name": "What’s the difference between a Great Pyrenees vs. a Pyrenean Mastiff?", "acceptedAnswer": {"@type": "Answer", "text": "Great Pyrenees and Pyrenean Mastiffs are closely related and share many similarities in appearance, function, and personalities, as both were bred to protect livestock in the Pyrenees Mountains. However, Pyrenean Mastiffs are typically larger, have more color in their coats, and are inclined to bark more than Great Pyrenees. Featured Image: iStock/creativex"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Great Pyrenees", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/great-pyrenees.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/great-pyrenees.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Zoo Great Pyrenees Pack, Great Pyrenees", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/great-pyrenees"}, "datePublished": "December 7, 2022", "dateModified": "October 13, 2023", "description": "Great Pyrenees dogs are an independent and calm large breed. They are typically a healthy breed but can be prone to some health concerns. Learn more about caring for Great Pyrenees puppies and dogs.", "articleBody": "The majestic Great Pyrenees is a large working dog, bred for guarding livestock. Originally from the Pyrenees Mountains between Spain and France, the breed’s characteristic thick, white coat makes for perfect camouflage in the snowy landscapes where they would protect sheep from predators such as wolves. Often weighing over 100 pounds, Great Pyrenees are incredibly strong and fast. But at home, Great Pyrenees are usually quite calm and gentle around the people they love. Caring for a Great Pyrenees While excellent guardians, Great Pyrenees dogs aren’t overly active—after all, they need to conserve their energy for any threats to their flock. They were also bred for their independence, allowing them to be left in mountain valleys alone to guard their sheep. Often weighing over 100 pounds, Great Pyrenees are incredibly strong and fast. But at home, Great Pyrenees are usually quite calm and gentle around the people they love.This means that in home life, Great Pyrenees do not require a highly active lifestyle and value their alone time, which can make them more stubborn during training. Their grooming needs are not excessive (despite their abundant fur) because their long outer coat is dirt- and tangle-resistant. Weekly brushing helps maintain their soft undercoat and minimize shedding in the home. Great Pyrenees Health Issues Great Pyrenees are generally very healthy dogs, but reputable breeders should screen for a handful of health conditions the dogs can develop. Growth Disorders “Elbow dysplasia” and “hip dysplasia” are terms used to describe when the bones of the elbow or hip joints, respectively, do not align appropriately. This causes rubbing and grinding of the bones that, over time, results in deterioration of the joint and loss of function. Elbow dysplasia and hip dysplasia can be hereditary conditions that affect Great Pyrenees, but they can also be exacerbated by other contributing factors such as exercise habits, weight, and nutrition. Similarly, Great Pyrenees dogs can be predisposed to osteochondrodysplasia, which is another inherited condition that causes an abnormal growth of the bones and cartilage and, ultimately, bone deformities. Great Pyrenees should also be screened for chondrodysplasia (dwarfism), an inherited growth disorder seen in this breed that causes shortening of the limbs, trunk, and muzzle. All these conditions can be screened with radiographs, and treatment will vary depending on the severity. Patellar Luxation Great Pyrenees can develop luxating patellas, an inherited condition where one or both of the kneecaps dislocates, popping in and out of place. Although patellar luxation is not generally considered a painful condition, it may cause the dog to favor one leg and can predispose them to other knee injuries and arthritis. Depending on the severity of the luxating patella(s), surgery may be recommended to prevent further injury and improve the dog’s quality of life.   Eye Disorders Great Pyrenees dogs can be predisposed to a few eye disorders, such as: Entropion: when the eyelid grows inward, causing the eyelashes to rub against the surface of the eye Cataracts: clouding of the lens of the eye, which can cause vision impairment Canine Multifocal Retinopathy (CMR): an inherited disease of the eye that can lead to vision loss In most cases of entropion and cataracts, veterinarians can diagnose and treat the dog with surgical intervention. CMR, however, does not currently have any treatment, but it can be screened for with genetic testing. Neuronal Degeneration Neuronal Degeneration (NDG) is an inherited disease that causes degenerative changes to the entire nervous system, including the brain, spinal cord, and peripheral nerves. Clinical signs typically begin when Great Pyrenees puppies are less than 1 year old and may be mild (such as stumbling or dragging a paw). But the condition will progress until the dog is no longer able to stand or walk on its own. There is no current treatment for NDG, but it can be screened for with genetic testing. Gastric Dilatation and Volvulus Gastric dilatation and volvulus (GDV) is a severe form of bloat that can affect any deep-chested breed, including the Great Pyrenees. Gastric dilatation, or bloat, typically happens when a large amount of food and gas in the stomach prevents the normal outflow of the stomach. The increased pressure from the gas builds up, causing the stomach to expand and, in some cases, twist. Many deep-chested dogs undergo a gastropexy surgery (in which the stomach is tacked to the abdominal wall or the diaphragm) to help prevent GDV, often when they are spayed or neutered. Feeding your Great Pyrenees two or three smaller meals throughout the day (instead of one) can also help prevent this condition. GDV can be a life-threatening condition. Seek immediate veterinary care if any of these signs are noted: Distended abdomen Retching without producing any vomit General signs of abdominal pain, such as standing and stretching or drooling What To Feed a Great Pyrenees Selecting the best diet for a Great Pyrenees comes down to the needs of the individual dog. While it’s always important to select a diet with high-quality ingredients, it’s best to discuss this with your dog’s veterinarian, as they can make recommendations based on your pup’s specific medical history. In general, Great Pyrenees do well on a diet designed for large breeds that is appropriate for their current life stage. How To Feed a Great Pyrenees Great Pyrenees are considered deep-chested dogs, which means they can be susceptible to gastric dilatation and volvulus (GDV), or bloat. To help prevent this from happening, it’s best to feed your Great Pyrenees multiple (two or three) smaller meals throughout the day and avoid vigorous exercise around meal times. How Much Should You Feed a Great Pyrenees? Adult Great Pyrenees dogs can range from 100–110 pounds for males and 85–100 pounds for females, which means that the amount of daily food they require will vary. Depending on their weight and level of daily activity, you can expect your Great Pyrenees to eat anywhere from 4–6 cups of dry food per day. Nutritional Tips for Great Pyrenees For Great Pyrenees that have growth disorders affecting their joints, such as hip or elbow dysplasia or luxating patellas, it’s beneficial to give them nutritional supplements with glucosamine and chondroitin to help keep their joints healthy. Omega-3 supplements also aid in protecting joint health, as well as keeping their skin and coat healthy.  Behavior and Training Tips for Great Pyrenees Great Pyrenees Personality and Temperament As livestock guardians, Great Pyrenees tend to reserve their energy for responding to threats. So while they’re always very attentive, they are not overly active … as long as there are no wolves chasing after their herd. At home, this means that Pyrenees dogs are generally quite calm and subdued, while being very loyal toward their family. Their gentle demeanor makes them suitable in families with children who understand how to interact with dogs, but Great Pyrenees may be best in homes without smaller children who may be easily harmed by an accidental bump from a 100-pound dog. Great Pyrenees are good with other pets but value their alone time and may need a space where they can retreat for time away from other, more playful companions. Great Pyrenees Behavior Due to their long breed history of guardianship, Great Pyrenees dogs have a tendency toward barking, especially if they perceive a threat toward their home or territory. Great Pyrenees Training Great Pyrenees were originally bred to be independent flock protectors, and that independent personality has persisted over time. Their need for independence often comes off as stubbornness and can make training challenging. But, as with most breeds, consistency paired with positive reinforcement produces the best outcomes. Early socialization of Great Pyrenees puppies to as many different people, places, and animals is also critical so they learn that new people, pets, and situations aren’t something to be wary of. Great Pyrenees were originally bred to be independent flock protectors, and that independent personality has persisted over time.Fun Activities for Great Pyrenees Cart- and sled-pulling Working on farms Walks with their family Great Pyrenees Grooming Guide Great Pyrenees are known for their majestic white coat that, as a double-coated breed, has a long outer coat and soft undercoat. The silky outer coat tends to be resistant to tangles and dirt, which lessens the grooming requirements for this breed. That said, Great Pyrenees are heavy shedders, and more frequent grooming can help pet parents stay on top of the flying fur. Skin Care Skin care for the Great Pyrenees can vary depending on the individual’s needs. However, the breed does not typically have sensitive skin. Coat Care Because their outer coat is smooth, weekly brushing should be sufficient to keep the coat in good condition. This will also help mitigate shedding. Eye Care While Great Pyrenees are not typically prone to tear stains, some dogs might require special care or routine cleaning to prevent eye infections. Ear Care Routine ear cleaning with a veterinary-approved ear cleanser is important to maintain healthy ear canals in your Great Pyrenees. This should also be done any time a Pyrenees is in water, such as after swimming or bathing. Considerations for Pet Parents The generally placid lifestyle of the Great Pyrenees makes them good companions in an urban household. They are gentle and affectionate toward their family, but early socialization is key to help prevent any protective behaviors for which they have been bred for thousands of years. Great Pyrenees are not often found excelling in obedience championships because of their desire for independent thinking. But with patience and routine, they can be very well-mannered and trustworthy companions. And, of course, they excel as livestock guardians and can thrive in homes where they are able to roam with farm animals."}]