[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Saint Bernard a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, Saint Bernards make great family dogs. They are extremely affectionate and do well around young children."}}, {"@type": "Question", "name": "Are Saint Bernards smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, Saint Bernards are very intelligent and learn quickly in training. They aim to please their families and learn well with praise and dog treats"}}, {"@type": "Question", "name": "How much does a Saint Bernard cost?", "acceptedAnswer": {"@type": "Answer", "text": "A Saint Bernard puppy can cost between $1,000–$2,500. A dog from a champion line would be on the higher end of this price range."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Saint Bernard", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/saint-bernard.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/saint-bernard.jpeg"}, "author": {"@type": "Person", "name": "Michelle Diener, DVM", "url": "https://www.petmd.com/author/dr-michelle-diener"}, "keywords": "Dog, Breed, Zoo Saint Bernard Pack, Saint Bernard", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/saint-bernard"}, "datePublished": "September 27, 2022", "dateModified": "October 13, 2023", "description": "Saint Bernards are gentle giants that can weigh as much as 180 pounds. They are a healthy breed, but prone to a few health conditions. Learn all about caring for Saint Bernard puppies and dogs.", "articleBody": "Saint Bernards are giant, working-class dogs that were first trained by monks in the 1600s to locate and rescue people buried by avalanches in the Swiss Alps. These dogs have a shoulder height of 26–30 inches and weigh between 120–180 pounds. They have huge heads with small muzzles and are known to drool a lot.  Saint Bernards are extremely affectionate, protective, and do well around young children, making them wonderful family dogs. Their popularity soared after three family comedy movies from 1992 to 2000 starred a Saint Bernard named Beethoven.  Saint Bernards are predisposed to certain medical conditions such as bloat, hip dysplasia, and eyelid entropion. Caring for a Saint Bernard Saint Bernards enjoy playing with and being around their family members. They have a moderate energy level and need at least one 30-minute walk a day, but they will easily go on longer walks or hikes if offered.  Saint Bernards have two types of coats: short-haired and long-haired. All Saint Bernards, no matter the type of coat, require brushing once or twice weekly, but they need more frequent brushing when they shed twice yearly.  Saint Bernard Health Issues Overall, Saint Bernards are healthy dogs, but they are predisposed to certain medical conditions. It is important to work with a reputable breeder, someone who only breeds Saint Bernards that are healthy, PennHIP-certified (have undergone a hip evaluation), and represent the breed’s standards. Bloat and Gastric Dilatation-Volvulus Dogs with deep chests, such as Saint Bernards, are prone to bloat, which means that their stomach fills up with gas and suddenly makes their abdomen look distended. This condition is uncomfortable, but it is treatable by placing a temporary tube to remove the gas from the stomach. Sometimes, however, bloat can lead to a life-threatening condition called gastric dilatation-volvulus (GDV), which occurs when a gas- or fluid-filled stomach twists and cuts off blood circulation to the stomach and other organs. GDV is an extremely painful condition that can be fatal if emergency surgery is not performed immediately. A veterinarian diagnoses bloat and GDV by conducting a physical exam and taking abdominal x-rays. To minimize the risk of bloat and GDV in your Saint Bernard: Have a prophylactic gastropexy (stomach tack) done at time of spay or neuter Feed two to three meals a day, instead of one Prevent any exercise one hour before and one hour after eating Hip Dysplasia Hip dysplasia is an inherited orthopedic condition where the head of the femur, or thigh bone, does not fit snugly in the hip joint. As a result, the femur rubs against the hip socket and, over time, causes bony remodeling of the hip joint. This leads to pain and inflammation within the joint. Hip dysplasia can develop in one or both hip joints. Saint Bernard puppies can have congenital hip dysplasia (although this is rare); other dogs develop it in their senior years. PennHIP is a screening method performed on puppies as young as 16 weeks. It requires sedation or anesthesia. Specialized x-rays of the pelvis are taken to detect which dogs will likely develop hip dysplasia during their lifetime. Identifying these dogs through a PennHIP evaluation allows for early treatment. Treatment of hip dysplasia varies depending on the severity. In some cases, it is managed with supplements, medications, and reduced activity levels. In other cases, a dog may need to undergo surgery to correct this condition. Osteosarcoma Saint Bernards are predisposed to osteosarcoma, a very aggressive bone cancer. It can develop quickly, usually in the femur (thigh bone) or humerus (upper arm bone), but can be found in other bones as well.  Symptoms of osteosarcoma include lameness, bone pain, and firm swelling at the location of the tumor. X-rays are the best diagnostic tool for cancerous bone lesions, but a needle aspirate or bone biopsy is needed for a definitive diagnosis. If osteosarcoma is diagnosed, then further screening tests are recommended to determine if the cancer has spread to other areas of the body. Treatment options include pain medications, stereotactic radiation or surgery (often limb amputation), or chemotherapy, depending on the location of the tumor and whether the cancer has spread. Lymphoma Saint Bernards are also predisposed to another type of cancer called lymphoma or lymphosarcoma, which originates in the lymph nodes and typically spreads to other organs. Treatment usually involves chemotherapy. Cervical Vertebral Instability (Wobbler Syndrome) Cervical vertebral instability, or wobbler syndrome, is a neurological disease that results from developmental abnormalities in the neck or spine of a dog. Saint Bernards with wobbler syndrome tend to have neck pain, lack of coordination, and weakness in all four legs, and they may drag their feet. These symptoms can develop suddenly in young dogs, but more often wobbler syndrome is a slow, progressive disease. Wobbler syndrome is diagnosed with an exam, neck X-ray, MRI, or CT scan. Mild cases are treated with medication to minimize pain and inflammation in the neck. Severe cases require both medication and surgery. Limited exercise and the use of a harness instead of a collar are also important to reduce neck pain. Most Saint Bernards with this condition improve with treatment if their symptoms are not severe, and if they are diagnosed and treated early. Entropion Entropion is an eyelid abnormality that causes the eyelid to roll inward toward the eye. When this occurs, the eyelid fur and eyelashes can rub against the cornea, the surface of the eye. This is a very painful condition that can lead to corneal ulcers. Surgery is needed to correct entropion; it involves removing excess skin on the eyelid so that it no longer rolls inward. What to Feed a Saint Bernard Saint Bernards should be fed a high-quality large- or giant-breed dry dog food with some canned food mixed in. Their daily diet should consist of 90% dry and wet dog food and 10% treats.  How to Feed a Saint Bernard Saint Bernards should be fed a large- or giant-breed puppy formula until they are 18–24 months and then transitioned to a large- or giant-breed adult formula.  To minimize risk of bloat or GDV, the following recommendations can help at mealtime: Feed your dog two or three meals a day, instead of one Put the food bowl on the floor rather than elevate it If there are multiple dogs in the house, feed them separately to minimize stress Avoid exercise one hour before and one hour after a meal Add some canned food to the dry food Do not add water to the dry food, especially if the food contains citric acid Do not overfeed Use a slow-feeder bowl if your Saint Bernard eats quickly How Much to Feed a Saint Bernard It is best to follow the feeding guidelines on the dog food packaging and consult your veterinarian to determine the proper portion size to feed your Saint Bernard, based on ideal body weight and life stage. Measure out the food for each meal to ensure that you are feeding the proper amount.  Nutritional Tips for Saint Bernards Since fully grown Saint Bernards weigh well over 100 pounds, veterinarians recommend that they be given a joint supplement and an omega-3 fatty acid supplement starting at 2 years old. These two supplements support the joints by minimizing inflammation.   Behavior and Training Tips for Saint Bernards Saint Bernard Personality and Temperament Saint Bernards have a gentle demeanor and make a wonderful addition to the family. They are referred to as “nanny dogs,” as they are patient with young children and will protect them from harm. They are very affectionate and loyal toward their family members. During their puppy stage, Saint Bernards are energetic and playful, but as they get older, they become calmer. Most Saint Bernards have a low prey drive. They do well around other dogs if they are socialized at an early age. They rarely bark and are not known to be mouthy. Saint Bernards do like to dig. This digging behavior is indicative of their past training as search and rescue dogs. To protect your property, make sure to supervise your Saint Bernard if they are outside. Saint Bernard Behavior Saint Bernards are protective of their families and prefer to be with them as much as possible.  They can be destructive and have separation anxiety if left alone for long periods of time.  Saint Bernard Training Saint Bernards have a good temperament, but because of their size they can be very powerful and difficult to handle. Training from an early age is crucial when caring for a Saint Bernard. This breed is very smart and learns quickly, so they do well in socialization classes, puppy training classes, and obedience training. Obedience classes teach a Saint Bernard to obey commands so that you can train them to be calm around children, not to jump up on people, and not to counter-surf for food.  Saint Bernards are kind, loving, and have a strong desire to please their families, making it relatively easy to train them using praise and treats.  If a Saint Bernard is being considered as a search and rescue dog, special training is needed.  Fun Activities for Saint Bernards Fun activities that you can enjoy with your Saint Bernard include: Carting and drafting competitions Nose work Watching over young children Going on a hike Camping or backpacking Water fetch games Saint Bernard Grooming Guide The grooming routine of a Saint Bernard is the same for both long- and short-haired breeds. They both require frequent coat brushing, occasional bathing, and regular nail trimming. Skin Care Saint Bernards do not require much skin care. They only need an occasional bath to keep them clean. Just like with any other dog breed, a Saint Bernard needs frequent nail trimming so they do not break off or split. Coat Care A Saint Bernard’s coat can be long or short. A short coat is easier to care for, as it is less likely to get matted or tangled. However, both long-coated and short-coated Saint Bernards should be brushed once or twice weekly. Saint Bernards shed twice yearly, when brushing should be done daily to minimize shedding. A metal comb and slicker brush are the best grooming tools to use on a Saint Bernard’s coat. Eye Care Like many other dogs, Saint Bernards can have tear staining, so use a warm washcloth as needed to wipe their eyes. Ear Care Saint Bernards have large ear canals and love to swim, which can make them prone to ear infections. Cleaning their ears with an ear cleaner every two to three weeks and after baths and swimming will help prevent ear infections. Considerations for Pet Parents Saint Bernards are one of the most affectionate dog breeds. The perfect home for a Saint Bernard is a family with young children to love and protect.  This breed enjoys being around their family as much as possible. They can have separation anxiety and engage in destructive behavior when left alone for a long time. Consequently, people who work away from home for most of the day would not be the best pet parents for a Saint Bernard. Due to a Saint Bernard’s size, they need lots of space to move around. This breed would not do well in an apartment setting. They need a home with a backyard and someone to take them on a daily long walk or hike for exercise. They have a moderate amount of energy when they are young, so training is important to teach them not to jump up on people or pull on their leash, which could cause any person to fall.  Saint Bernards require brushing one or two times weekly, and daily when they shed twice a year. They only need an occasional bath and do not need their fur cut by a groomer.  Because they are powerful dogs, proper training at an early age is extremely important. All Saint Bernard puppies should take socialization classes, puppy training classes, and obedience classes so that they are well behaved around people and other dogs, following basic commands."}]