[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bedlington Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Bedlington Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_bedlington_terrier"}, "datePublished": "June 9, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Bedlington Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Bedlington Terrier is graceful and lithe, with no sign of coarseness. It is alert, full of energy and courageous. It runs at great speed and is notable for its endurance. A &quot;real wolf in sheep’s clothing.&quot; Physical Characteristics Although this terrier resembles a lamb, it has the qualities of a wolf and can fight and chase tough opponents. The lithe and graceful terrier has a well-marked, robust outline. The arched haunch provides it with agility and speed, and a springy, light gait. The Bedlington&#039;s protective coat, meanwhile, which is either blue, sandy, liver, and/or tan in color, is a combination of soft and hard hair that stands away from the skin. Personality and Temperament The Bedlington Terrier has proven itself loyal and a good companion. It is one of the softer terriers in temperament, feel, and look. A calm house dog, it will not start a fight but is not one to be frightened of other dogs and can become an aggressive fighter when forced. Additionally, the Bedlington Terrier may chase small animals outdoors, but it will live in harmony with other household pets. Care The Bedlington Terrier&#039;s coat needs to be combed every week and trimmed once a month to shape it. Normally the hair that sheds clings to the coat, instead of falling off. As the Bedlington loves to chase, it should be given daily workouts in a safe area. A vigorous romp or a nice long walk can also meet the dog’s exercise requirements. However, this breed is not suited for outdoor living. Health The Bedlington Terrier, which has an average lifespan of 12 to 14 years, is prone to major health ailments like copper toxicosis and minor ones such as renal cortical hypoplasia, retinal dysplasia, and distichiasis. At times, it may suffer from patellar luxation. DNA tests for copper toxicosis and liver biopsy are suggested, as are eye tests. History and Background The Bedlington Terrier, an extraordinary variety of the terrier group, is an English breed, originating in Northumberland’s Hanny Hills. Even though the exact origin is not known, it is speculated that the late 18th century saw the development of a variety of game terriers called Rothbury Terriers. Joseph Ainsley of Bedlington Town interbred two Rothbury Terriers in 1825 and named the offspring the Bedlington Terrier. There was occasional crossbreeding with other strains including the Whippet for pace and Dandie Dinmont Terrier for a better coat, but these crosses were not documented. Some breed historians even believe that these crosses never happened. Nonetheless, the result of interbreeding resulted in a sprightly game terrier that could chase otters, badgers, foxes, rabbits, and rats. The Bedlington Terrier gained popularity as a show dog in the late 19th century. And although dog fanciers first favored the dog&#039;s lamb-like appearance, the difficulties of trimming the coat quickly diminished the demand of the breed. With the availability of better grooming tools, however, the breed later regained its previous acclaim."}]