[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Clumber Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Clumber Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_clumber_spaniel"}, "datePublished": "September 14, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Clumber Spaniel Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Clumber Spaniel is one of the original nine breeds registered by the American Kennel Club. Long and low, it’s not as fast as other sporting dogs, but will work all day, trotting along in a slow, rolling gait. Dignified and pensive, but possessing great enthusiasm, the Clumber Spaniel also has a beautiful white coat. Physical Characteristics The Clumber Spaniel has a rectangular proportioned body, which is a bit long in proportion to its height. Due to its short legs, it tends to roll a bit while walking, but its pace remains easy-going. The Clumber Spaniel also has strong hindquarters and a solid bone structure, with a deep-chested body. Its white coat, meanwhile, is soft, straight, dense, flat, and weather-proof, which enables the dog to work in harsh and rough conditions. Its bushy eyebrows and soft expression give the dog a pleasing appearance. Personality and Temperament The Clumber Spaniel is hunter by nature, forgoing all other activities other than the hunt. Playful and cheerful nearly all the time, the Clumber Spaniel has proven to be a great family pet, behaving gently indoors if given proper care. Because of its love of outdoor walks, however, the breed is not always suitable for city living. Care The dense, flat coat of a Clumber Spaniel requires combing at least two to three times a week. Additionally, regular bathing is essential to keeping its coat clean and neat. Its exercise requirements, meanwhile, consist of daily outdoor walks or long, energetic games. Be aware that some Clumber Spaniels may snore occasionally or drool. Health The Clumber Spaniel, which has an average lifespan of 10 to 12 years, is susceptible to intervertebral disc disease (IVDD), a major health concern. Besides this particular disease, some of the other minor health problems that the breed is prone to are otitis externa, ectropion, and entropion, as well as seizures. To identify some of these issues, a veterinarian may recommend elbow, eye, and hip exams early on. History and Background The Clumber Spaniel is a breed that has a keen hunting capability. It is, however, not as popular as other spaniel breeds. The origin of the Clumber Spaniel dates back to as early as the latter part of the 16th century, eventually receiving its name during the period of the French Revolution of 1789. Legend holds that during the time of the revolution, the Duc de Noailles of France moved his kennel of spaniels to England for sanctuary, housing them at the Duke of Newcastle kennels at Clumber Park (thus the breed&#039;s name) in Nottinghamshire. One of the distinctive characteristics is that these dogs are compact in shape and size. Because of this, some suggest the low-bodied Basset Hound and the old, heavy-headed Alpine Spaniel may have been responsible for the evolution of the Clumber Spaniel. Clumbers were first shown in England in the mid-19th century. Instantly, the English nobility became attracted to the breed, often due to its great hunting ability. Although the breed appears to have entered the United States near the end of the 17th century, the first Clumber was not registered until the late 19th century, before the American Kennel Club itself was founded. Today, the Clumber Spaniel is considered a wonderful show dog and an excellent hunter."}]