[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Shetland Sheepdogs high-maintenance?", "acceptedAnswer": {"@type": "Answer", "text": "Shelties are both high- and low-maintenance dogs, depending on the traits you’re considering. Their grooming needs are greater than those of many other dogs because of their thick double coats, but they don’t need many baths. Physically, they require daily activity, but their compact size makes this easy to fulfill with a fenced yard or leashed walks."}}, {"@type": "Question", "name": "Do Shetland Sheepdogs bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Shelties are known to be quite vocal and will often bark when meeting a new person. They will also bark when excited."}}, {"@type": "Question", "name": "Are Shetland Sheepdogs good pets?", "acceptedAnswer": {"@type": "Answer", "text": "Sheltie dogs make good pets for those who are knowledgeable and prepared for the needs of the breed. While quite affectionate and sweet, they are working dogs and will be best suited in a home where their mind and body are kept busy."}}, {"@type": "Question", "name": "How long do Shelties live?", "acceptedAnswer": {"@type": "Answer", "text": "The average Sheltie life span is 12–14 years."}}, {"@type": "Question", "name": "What’s the difference between a Sheltie and a Collie?", "acceptedAnswer": {"@type": "Answer", "text": "The most obvious difference between a Sheltie and a Collie is the size. While a Sheltie will stand 13–16 inches tall and weigh 15–25 pounds, the average adult Collie stands at 24–26 inches and weighs 50–75 pounds. Additionally, Collies tend to have a calmer personality compared to the Sheltie’s perky temperament. Featured Image: iStock/yanjf"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Shetland Sheepdog (Sheltie)", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/shetland-sheepdog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/shetland-sheepdog.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Shetland Sheepdog (Sheltie)", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/shetland-sheepdog"}, "datePublished": "July 10, 2023", "dateModified": "October 13, 2023", "description": "The Shetland Sheepdog is a small and eager-to-please dog that fits well into many families. But this breed requires lots of exercise, grooming, and mental stimulation, so pet parents need to dedicate lots of time to their care. Learn more about Sheltie puppies and dogs here.", "articleBody": "The Shetland Sheepdog, affectionately known as a Sheltie, originated in the Shetland Islands of Scotland. The sparse vegetation and harsh conditions of the area favor small livestock—and thus, small herding dogs. So while many mistake the Sheltie for a miniature Collie, the Shetland Sheepdog is a distinct breed developed to meet the needs of the unique environment. Adult Shelties stand just 13–16 inches tall and weigh between 15–25 pounds. Similar to the Collie, Shelties have a wedge-shaped head with erect ears and a long, straight coat that comes in several color combinations. Shelties are intelligent and eager companions that excel in obedience and agility, while also being sensitive and loving toward their family members. This balance, and a compact size, make the Sheltie dog a welcomed member of the family. Caring for a Shetland Sheepdog  Shelties are a popular family dog because of their gentle and eager-to-please personalities. However, they are working dogs and prefer to be kept busy over lying around the house. Because of their energy, they require ample physical and mental stimulation to prevent unwanted behaviors. Shetland Sheepdogs can be wary of strangers and will often greet guests with barking, whether to alert their family or just out of excitement. And while their heavy coat requires frequent brushing, they tend to be a generally healthy breed, living an average of 12–14 years. Shetland Sheepdog Health Issues Shetland sheepdogs are generally healthy dogs, but they can be prone to certain inherited conditions. Here are some of the most common issues pet parents should watch for.  Hip Dysplasia Hip dysplasia is when the bones of the hip joints don’t align properly. This misalignment causes rubbing and grinding of the bones that, over time, leads to deterioration—causing pain, loss of function, and arthritis. Hip dysplasia can be a hereditary condition that affects Sheltie dogs, but it can also be exacerbated by other factors such as exercise habits, weight, and nutrition. Collie Eye Anomaly  Collie eye anomaly (CEA) is an inherited condition that affects the development of the eye, resulting in vision loss and, sometimes, complete blindness. CEA is diagnosed by ophthalmologic examination and is typically found in Sheltie puppies. While there is no treatment for this disease, genetic testing can look for the mutated genes; responsible Sheltie breeders will screen for this defect. Sheltie Skin Syndrome Sheltie skin syndrome (dermatomyositis) is an inherited disease that affects skin, muscles, and blood vessels, causing inflammation. Dogs with this condition may develop a range of signs, varying from small skin lesions to severe ulcerations of the skin and muscle loss. Sheltie skin syndrome is typically first seen in dogs less than 6 months old. There is no cure for the condition, but in some cases it can be managed at home. Thyroid Disease Hypothyroidism in dogs is a fairly common condition in which the thyroid gland is underactive. This causes regular body functions to slow down, which can lead to lethargy, weight gain, and changes in the skin and coat. A simple blood test can check for hypothyroidism, and the condition is treated with daily medication. With medicine, most dogs with hypothyroidism will live full lives with a normal life expectancy. Von Willebrand’s Disease Von Willebrand disease (vWD) is an inherited condition that affects the blood’s ability to clot. Dogs affected by vWD may show signs of: Bruising easily Bleeding from the gums or nose Bloody urine or stools Excessive bleeding after surgery vWD is diagnosed with blood tests, but there is no cure for the disease. However, dogs with vWD can live a normal life with proper management and medication. Epilepsy Epilepsy describes recurrent seizures without a known cause. The appearance of a seizure can vary widely—some affect only a small part of the body, while others affect the entire body. Some signs of a seizure in dogs may include: Stiffening and falling over, with shaking and vocalization Paddling of the limbs Loss of bladder and bowels Drooling Vomiting Seizures can last from a few seconds to a few minutes while the animal is unaware what is going on around them. Before and after the seizure, the pet may act abnormally, or they can appear anxious or confused, disoriented, or sleepy. Treatment is typically done with lifelong anticonvulsants. Once anti-seizure medication treatment begins, most pets live a fairly normal life. What To Feed a Shetland Sheepdog Selecting the best diet for a Sheltie is based on the individual needs of your dog. It’s important to choose dog food that contains high-quality ingredients. Ask your veterinarian what to feed your Sheltie dog based on their specific medical history. If your pup does not engage in extensive physical activity, they will be prone to obesity. So, it’s vital to avoid overfeeding your Sheltie so they maintain proper body conditioning and weight. How To Feed a Shetland Sheepdog Most Shetland Sheepdogs do not require special feeding instructions. Typically, feeding two meals (in the morning and evening) is well tolerated by this breed. A Sheltie puppy will need to eat more frequently, about three or four times daily. How Much Should You Feed a Shetland Sheepdog? Follow the feeding guide on your food bag to ensure your Shetland Sheepdog pup is receiving essential daily nutrients. Remember to divide the daily recommended portions into meals instead of serving it all at once. While the dog food label can give you good guidance on how much to feed your Sheltie, always talk to your veterinarian about your dog’s food. They can give recommendations on portions based on your dog’s weight, lifestyle, and health history. Nutritional Tips for Shetland Sheepdogs For a Sheltie involved in sporting activities, you can supplement them with glucosamine and chondroitin to help keep their joints healthy. Additionally, omega-3 supplements can aid in protecting joint health and help keep their skin and coat lush and soft. Always talk to your veterinarian before giving your dog supplements. Behavior and Training Tips for Shetland Sheepdogs  Shetland Sheepdog Personality and Temperament Shelties are working dogs that require ample physical and mental stimulation. Because they love to please, training a Sheltie can be fun for everybody. These pups have been known to excel in obedience and agility. Their playful and energetic nature makes Sheltie dogs suitable for families with children and other pets. Shelties are a popular family dog because of their gentle and eager-to-please personalities. However, they are working dogs and prefer to be kept busy over lying around the house.Shetland Sheepdog Behavior Shetland Sheepdogs tend to be quite vocal and will bark—not only to alert, but also when they are excited. True to their herding nature, Shelties will chase anything that moves. Keeping them on a leash or inside a fenced yard is crucial with this breed, which will dart after squirrels, rabbits, and even cars. Shetland Sheepdog Training Their intelligence and willingness to please make the Sheltie very trainable, and they excel in sports such as agility. As with any breed, early socialization is important and can help with their natural guardian behavior.   Fun Activities for Shetland Sheepdogs Fetch Obedience Agility Herding Tracking Working as a therapy dog Shetland Sheepdog Grooming Guide Pet parents must be prepared to maintain their Sheltie’s thick double coat with frequent brushing. This keeps their fur free of mats and can also help with the dogs’ heavy shedding. Skin Care Skin care for the Sheltie dog can vary. The breed does not typically have sensitive skin, but they will require dedicated care if they develop Sheltie skin syndrome. Coat Care Underneath the Sheltie’s long, straight outer coat is a dense undercoat—and both shed considerably. Shetland dogs should be brushed at least twice a week to prevent matting and to collect some of that loose hair. Bathing is only needed occasionally and may best be done by a professional groomer who can trim out mats, which often form behind ears or under legs. Eye Care Routine cleaning with a soft, damp cloth or pet-friendly face wipe will help prevent normal tearing and debris from building up around your Sheltie’s eyes. Stay alert for changes in your dog’s eyes (such as discharge) or if your pup seems to have trouble seeing, and take them to the vet if anything troubling pops up. Ear Care Routine ear cleaning with a veterinary-approved ear cleanser will help maintain your Sheltie’s healthy ear canals. Considerations for Pet Parents The Shetland Sheepdog has become a family favorite because of their playful yet sweet personality. And while their compact size works well with small homes or apartments, they prefer to keep busy rather than lie around all day. Ample physical and mental enrichment should be provided. Because they are eager to please, this can easily be done with interactive training such as obedience and agility. Shelties tend to bark and shed profusely. But if you can look beyond that, the Sheltie provides a well-balanced and lovable companion to any home."}]