[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tibetan Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Tibetan Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_tibetan_terrier"}, "datePublished": "July 7, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Tibetan Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Tibetan Terrier evolved in Tibet’s extreme climate and difficult terrain. It has a protective double coat, compact size, unique foot construction, and great agility. Physical Characteristics The Tibetan Terrier has a double coat, comprising a dense, fine, slightly wavy or straight, and long outer coat and a wooly, soft undercoat, which offers it protection from the difficult Tibetan climate. Its foreface and eyes remain covered in long hair. Having evolved as a versatile dog, Tibetan Terrier can follow its owner and perform any task. It has a powerful, compact, and square-proportioned build. The dog&#039;s large, round, and flat feet have a snowshoe effect for excellent grip in difficult terrain. Its stride is effortless and free. Personality and Temperament The Tibetan Terrier dog is fond of a nice snooze indoors, an adventurous excursion in the field, or a vigorous game in the yard. The amiable and gentle Tibetan Terrier is not only a dependable but a charming companion both outdoors and indoors. It is very companionable, sensitive, and always willing to please. Care Although the Tibetan Terrier can live outdoors in cool or temperate climates, it is best suited as an indoor dog with access to the yard. Its long coat requires proper combing or brushing once or twice a week. The Tibetan Terrier dog loves to explore and run, and requires daily exercise in a secure and enclosed area. Its exercise needs are easily met by a long on-leash walk or a lively game in the yard. Health The Tibetan Terrier breed, which has an average lifespan of 12 to 15 years, is prone to major health concerns such as progressive retinal atrophy (PRA) and lens luxation, as well as minor problems like patellar luxation, ceroid lipofuscinosis, cataract, canine hip dysplasia (CHD), and hypothyroidism. Often distichiasis is noticed in this breed; eye, hip, and thyroid tests are suggested for dogs of this breed. History and Background Registered by the American Kennel Club in 1973, the Tibetan Terrier breed’s history is as mysterious as the valleys and mountains where it originated. It was developed nearly two centuries ago in Lamaist monasteries. The dogs were treated as family companions and not as workers, but occasionally they helped in herding and other farm tasks. Known to be holy dogs or &quot;luck bringers,&quot; the breed’s history is regarded as a myth. One story asserts that a chief route to a valley was obstructed due to an earthquake in the 1300s. Just a handful of visitors journeyed to the &quot;Lost Valley,&quot; and they were given a luck-bringer dog to aid them in their return. These dogs were not sold, as they brought luck, but were presented as special tokens of gratefulness. In 1920, an Indian physician named Dr. A. Grieg received such a dog as a gift for providing medical treatment. He was so interested in the breed that he obtained more dogs and started breeding and promoting them. In 1937, the Tibetan Terrier breed was first recognized in India. It later became a common entrant in English dog shows, and in the 1950s it stepped into the U.S. ring. The Tibetan Terrier is actually not a terrier, but is named thus for its terrier-like size."}]