[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What’s the difference between a Pembroke Welsh Corgi and a Cardigan Welsh Corgi?", "acceptedAnswer": {"@type": "Answer", "text": "Pembroke Welsh Corgis often have shorter tails or may be born without tails, while Cardigan Welsh Corgis have long, bushy, foxlike tails. Their ear shapes are also different; Pembroke Welsh Corgis have small pointed ears, and Cardigans sport larger rounded ones. The coat colors vary in both breeds, but Cardigans can come with blue and brindle merle coats, which is less common in Pembrokes.  At 25–38 pounds, Cardigans are also larger than Pembrokes, which don’t exceed weights of 30 pounds."}}, {"@type": "Question", "name": "Are Cardigan Welsh Corgis rare?", "acceptedAnswer": {"@type": "Answer", "text": "Cardigan Welsh Corgis are considered a less common breed than other popular dog breeds. While they are not as familiar as their close relatives, the Pembroke Welsh Corgis, they are not extremely rare either. Featured Image: Getty/bruev"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cardigan Welsh Corgi", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/cardigan-welsh-corgi.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/cardigan-welsh-corgi.jpg"}, "author": {"@type": "Person", "name": "Erica Vasquez", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Cardigan Welsh Corgi", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/cardigan-welsh-corgi"}, "datePublished": "October 20, 2023", "dateModified": "October 20, 2023", "description": "Cardigan Welsh Corgis are one of two Corgi breeds. They have long, bushy tails and big ears. Learn how to care for Cardigan Welsh Corgi puppies and dogs here.", "articleBody": "Known for their laid-back demeanor, foxy faces, and long and bushy tails, the Cardigan Welsh Corgi—affectionately referred to as the Cardi or Cardigan—is a delightful dog breed. Corgis trace their origins back thousands of years to Wales, where the dogs worked as herders and vermin exterminators, according to the Cardigan Welsh Corgi Club of America (CWCCA). Cardigan Welsh Corgis are one of two Corgi breeds, the other being the Pembroke Welsh Corgi. The two were considered one breed until they were officially separated in 1934. Cardigan Welsh Corgis are medium-sized dogs, typically standing 10.5–12.5 inches tall at the shoulder and weighing 25–38 pounds. They have various coat colors, from red to the popular blue-merle pattern. The Cardi’s delightful temperament, steadfast loyalty, sturdy build, and 12-to-15-year lifespan make them a popular choice among dog lovers.  Caring for a Cardigan Welsh Corgi According to the CWCCA, one of the best features of Cardigan Welsh Corgis is their family-oriented personality. Intelligent and eager to please, Cardigans make great family dogs when given the proper training and socialization. Along with a winning demeanor, Cardigans have other traits that make them stand out, such as their low, sturdy build; fluffy, foxlike tail; and large, upright ears.  This adaptable breed is devoted to their family. They make especially excellent companions for families who can provide them with the attention, exercise (Cardis need a walk every day!), and grooming they need. Cardigan Welsh Corgi Health Issues Cardigan Welsh Corgis are generally healthy dogs, and with proper care they can live to be 16 or 17, according to the breed club. But, like many breeds, they are predisposed to several health issues. Pet insurance might be a good investment for a family bringing home a Cardigan Welsh Corgi puppy. Hip Dysplasia Though more common in large-breed dogs, Cardigan Welsh Corgis can develop hip dysplasia. This is a hereditary condition in which the hip joint doesn’t develop properly and becomes loose, leading to pain and arthritis. Mild cases of hip dysplasia can be managed with weight loss, pain medication, and joint supplements. Surgery may be recommended in severe cases. Progressive Retinal Atrophy Progressive retinal atrophy (PRA) refers to a group of eye conditions that cause vision loss. In the initial stages of the disease, Cardigans may experience night blindness. As the condition advances, they will lose their vision completely. There is no treatment for PRA, but blind dogs can live long and fulfilling lives with some modifications. Degenerative Myelopathy Degenerative myelopathy is a slow-onset destruction of the nerves in the spinal cord. This leads to a gradual onset of hind-limb paralysis and is primarily seen in elderly Cardis. Talk to your vet if you notice your dog struggling to get up, dragging their back paws, or stumbling while walking: All of these are signs of DM. Intervertebral Disc Disease (IVDD) Cardigans have long backs, predisposing them to spinal issues like intervertebral disc disease (IVDD). IVDD is a neurological condition affecting the discs of the spinal column, which in turn affects the spinal cord. This causes pain, nerve damage, and mobility problems that can even lead to paralysis if not caught and treated early. Treatment for IVDD ranges from medical management to surgery, depending on the case’s severity. What To Feed a Cardigan Welsh Corgi Choosing the right dog food for your Cardigan Welsh Corgi is essential to ensure their health and well-being. Look for dog foods that list high-quality protein sources, such as meat (chicken, beef, lamb, or fish), as the primary ingredient. The Association of American Feed Control Officials (AAFCO) can provide more information that defines the ingredients used in pet food. As a pet parent, it&#039;s important to consult your veterinarian when choosing a diet for your pup.  How To Feed a Cardigan Welsh Corgi The feeding needs of your Cardigan Welsh Corgi vary based on factors such as age, activity level, and individual health. It&#039;s also essential to ensure the meals you are feeding your Cardigan are appropriately portioned so you avoid overfeeding. To prevent overfeeding, establish a consistent feeding schedule for your Cardigan, ensuring they eat at the same time every day. Adult Cardis should eat twice a day; Cardigan Welsh Corgi puppies need to eat more frequently, up to four times a day. How Much Should You Feed a Cardigan Welsh Corgi? How much you feed your Cardi varies from dog to dog. Your AAFCO-approved dog food will provide feeding guidelines on the packaging that you can follow. But for the best guidance, talk to your vet. Your veterinarian will give you feeding instructions that are tailor-made for your dog. Getting acquainted with your new Cardigan Welsh Corgi puppy and buying supplies for your new best friend is exciting, and you need to choose the right food and water bowls. Purchase easy-to-clean stainless steel or ceramic bowls, which are most suitable for Cardigan Welsh Corgis. Avoiding plastic bowls is a good idea for any pet, as the material (combined with saliva) can irritate the skin on your pup’s chin while eating. Nutritional Tips for Cardigan Welsh Corgis A well-balanced, AAFCO-approved dog food should provide all of the necessary nutrients for your Cardigan, but some supplements may benefit their overall health under certain circumstances. Like any other breed, discuss supplements such as omega-3 fatty acids, probiotics, glucosamine, and chondroitin with your veterinarian to ensure they are suitable for your Cardigan Welsh Corgi. Behavior and Training Tips for Cardigan Welsh Corgis Cardigan Welsh Corgi Personality and Temperament [H3]  Cardigans are generally friendly and affectionate dogs, forming strong bonds with their families. They are highly intelligent and eager to learn, making them responsive to training. With a moderate energy level, they require daily exercise, like a 20–30-minute walk, but nothing too strenuous. Cardis can be a good fit for first-time pet parents. Cardigan Welsh Corgis are adaptable, according to the CWCCA, and can happily live on country acreage, city apartments, or anywhere in between. They can also live well with other pets and children, especially when raised with them and properly socialized. Cardigan Welsh Corgi Behavior Due to their herding background, Cardigans may exhibit herding behaviors, such as attempting to round up young children or other pets. Pet parents can help curb this behavior by providing their Cardi with ample mental stimulation through training and puzzle toys, and by teaching them that some things (like children and the family cat) are not appropriate to herd. Cardigans are alert dogs, and they tend to bark at perceived environmental threats or changes. They can also be prone to anxiety, mainly when left alone for extended periods.  Cardigan Welsh Corgi Training The key to a happy Cardigan Welsh Corgi is a combination of physical exercise and mental stimulation—and training is a good mix of both. Cardigans are highly intelligent and eager to please, which makes them quick learners. They respond well to positive reinforcement training methods and thrive with various mentally stimulating activities. Cardigans are a naturally curious breed. Their curiosity can be harnessed during training, allowing them to engage their inquisitive nature as they learn new cues and tricks. Fun Activities for Cardigan Welsh Corgis Obedience training Agility courses Fetch Hiking Swimming Herding trials Daily walks  Interactive toys Tug of war Hide and seek Cardigan Welsh Corgi Grooming Guide Cardigan Welsh Corgis have a double coat that sheds, but regular brushing and basic grooming care can help keep their coat in good condition—and minimize shedding around the home.  Skin Care Cardigan Welsh Corgis don&#039;t have specific skincare needs unique to their breed, but pet parents should be attentive to their dog&#039;s skin and coat health. This means regular grooming, and promptly addressing skin issues to ensure they always have healthy and comfortable skin. Coat Care Regular brushing can help maintain a Cardigan&#039;s coat health and appearance, prevent matting, and ensure they are comfortable and happy. Eye Care Cardigans can benefit from regular eye care to ensure their health and comfort. Some Corgis may be prone to tear stains, resulting in reddish-brown discoloration around the eyes. Pet parents should regularly inspect their Corgi&#039;s eyes for signs of irritation, redness, discharge, or foreign objects. This will help ensure their eyes stay clean and clear of allergies. Ear Care Routine ear care, like regular inspection and cleaning, is essential for Cardigan Welsh Corgis. It helps prevent ear infections and keeps their ears clean and healthy. Considerations for Pet Parents As a pet parent, if you want to bring a Cardigan Welsh Corgi into your home, you&#039;ll need to prepare to provide an ideal home for them. A perfect home for a Cardigan provides ample love, attention, and mental stimulation, as they are intelligent and thrive on companionship. Cardigans are well-suited for families, singles, or seniors. Keep in mind this breed must receive daily exercise and playtime. "}]