[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Welsh Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Welsh Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_welsh_terrier"}, "datePublished": "September 9, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Welsh Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Welsh Terriers are sturdy, rugged dogs with a coarse wire-textured coat. A rather old breed, the Welsh Terrier is notably only one of two terrier breeds that originated in Wales. Physical Characteristics The Welsh Terrier’s double coat is comprised of a hard, wiry, and dense outer coat and a soft, short undercoat. The dog’s jacket, which spreads up onto the neck and down onto the tail and into the upper thighs, is usually black. Its legs, quarters, and head, meanwhile, are clear tan. The dog’s tail is often docked to length meant to maintain the image of a &quot;square dog.&quot; This medium-sized, sturdy, and compact dog can run very fast for long distances and can dispatch or bolt at its quarry. Its movements are easy and its gait is free, with good drive and reach. The Welsh Terrier also has an alert and confident expression, which is complimentary to its demeanor. Personality and Temperament The Welsh Terrier is milder in manner than most terriers, but can be mischievous and playful. Though shy in front of strangers, the curious and independent Welsh Terrier can also be scrappy with pets and other dogs. It is, however, considered a reliable house pet. To minimize its barking and digging urges, the Welsh Terrier should be kept on a strict daily exercise routine as well as challenging and entertaining games. Care The terrier’s wiry jacket requires combing two or three times a week, in addition to shaping every three months. For pets, shaping is done by clipping and for show dogs stripping is the best method. Clipping alters the coat’s color and softens its texture. The ears of Welsh Terriers should also be trained to guarantee proper adult shape. The Welsh Terrier requires a moderate on-leash walk or a lively play session daily. As it has a tendency to get hurt, it should only be allowed to run on its own in a safe place. During good weather the Welshie is happy to live outdoors, but in cold weather it should sleep indoors. It is at its best when it can easily move between the house and yard. Health The Welsh Terrier, which has an average lifespan of 12 to 14 years, may suffer from minor health problems like lens luxation and glaucoma. The breed is also susceptible to allergies and seizures. Veterinarians often advise for eye tests for Welsh Terriers. History and Background The Welsh Terrier is one of only two terrier breeds that originated in Wales and is said to have come down from the Black and Tan Rough Terrier, a popular breed in Britain in the 1700 and 1800s. Ynysfor, a unique strain, was used for running alongside Otterhounds in North Wales in the late 18th century. There was also a dog known as the Old English Broken Haired Terrier of a similar type that was developed in northern England around the same time. These two varieties shared so many similarities, with respect to their looks and abilities, that they were originally categorized together. After some time, all these dogs were referred to as Welsh Terriers, regardless of their native land. Both the varieties were used for hunting badger, otter, and fox, sharing nearly identical backgrounds. The English Kennel Club granted recognition to the breed in 1886. In an attempt to improve the dog’s show ring capabilities, breeders began to cross it with the racy Wire Fox Terrier. This resulted in a dog that resembled a miniature Airedale Terrier. However, the dog was not as successful in the show ring as the small and long-legged terriers. Today, the Welsh Terrier is considered an entertaining, compact, and intelligent house pet. Wonderful for active families or show dog fanciers."}]