[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How big do Goldendoodles get?", "acceptedAnswer": {"@type": "Answer", "text": "Full-grown Goldendoodles vary in size from small to large, depending on their Poodle lineage. A large Standard Goldendoodle can stand 20–24 inches tall and weigh 50–90 pounds, while Mini Goldendoodles (who have Miniature Poodle genes) are only about 13–20 inches tall and 15–35 pounds.  "}}, {"@type": "Question", "name": "How much do Goldendoodles cost?", "acceptedAnswer": {"@type": "Answer", "text": "The average price of a Goldendoodle puppy can range from $1,500–$5,000, depending on the breeder or rescue, size, lineage, location, and other factors. While a puppy is a worthy investment, potential pet parents should also consider the costs of caring for a Goldendoodle, which includes vet visits, grooming, training, and food. "}}, {"@type": "Question", "name": "How long do Goldendoodles live?  ", "acceptedAnswer": {"@type": "Answer", "text": "On average, the lifespan of a Goldendoodle is 10–15 years. Doodles bred from smaller-stature Poodles tend to live longer than those bred from Standard Poodles.  "}}, {"@type": "Question", "name": "What’s the difference between Goldendoodles vs. Labradoodles?  ", "acceptedAnswer": {"@type": "Answer", "text": "While Goldendoodles and Labradoodles are both popular doodle dogs with gentle natures, playful personalities, and low-shedding coats, they have distinctive differences. The Goldendoodle is the result of a Golden Retriever bred with a Poodle, while the Labradoodle is the result of a Labrador Retriever bred with a Poodle. Goldendoodles tend to have a longer lifespan and a calmer energy level than Labradoodles (though both breeds require regular exercise). "}}, {"@type": "Question", "name": "Are Goldendoodles hypoallergenic?", "acceptedAnswer": {"@type": "Answer", "text": "Because Goldendoodles don’t shed much, they are considered a preferred breed for people with allergies and are commonly referred to as “hypoallergenic” dogs—though no dog breed is 100% allergen-free. Pups that are 75% Standard Poodle and 25% Golden Retriever (aka a F1B Goldendoodle) are born with curlier Poodle coats that can be better for allergy-sensitive pet parents. That said, the amount of sensitivity to a dog’s allergens varies from person to person, so spend time with the breed before bringing home a Goldendoodle puppy.  Featured Image: iStock/LSOphoto"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Goldendoodle", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/goldendoodle.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/goldendoodle.jpg"}, "author": {"@type": "Person", "name": "Patricia Kaowthumrong", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Zoo Goldendoodle Pack, Goldendoodle", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/goldendoodle"}, "datePublished": "December 7, 2022", "dateModified": "October 13, 2023", "description": "Goldendoodles are energetic, happy hybrid dogs bred from Golden Retrievers and Poodles. Learn about caring for Standard and Mini Goldendoodles.", "articleBody": "First bred in the late 1960s as guide dogs, the Goldendoodle—a crossbreed of a Golden Retriever and a Poodle—became a popular household pet in the United States during the 1990s. Since then, the dogs have been coveted companions that are beloved for having low-shedding qualities, a clever-yet-highly-trainable personality, and a patient family-friendly nature.    The standard large-size, wavy-haired Goldendoodle can grow to 20–24 inches tall and about 50–90 pounds, but also come in smaller sizes as Mini Goldendoodles. It all depends on which Poodle parent they have—the Standard Poodle or the Miniature Poodle.   Caring for a Goldendoodle  The Goldendoodle is bred to exhibit the best qualities of both the Golden Retriever and the Poodle. The result is a smart, fun-loving pup that’s a wonderful addition to any size household, if given the proper amount of exercise to satisfy her high energy level and training from a young age.   Goldendoodles are very intelligent and do well in obedience classes and agility training. While they can live happily with other dogs, cats, and children, the pups can be prone to separation anxiety. That’s why pet parents should ensure their Doodle gets plenty of social activity every day and avoid leaving them alone at home for long periods of time (more than eight hours). Goldendoodle Health Issues Goldendoodles are generally healthy dogs that can live 10–15 years, but they are prone to common health conditions of the Poodle and Golden Retriever breeds.    While you can’t ensure your Goldendoodle will be free of health problems, you can purchase your puppy from a reputable breeder, says Jamie Whittenburg, DVM. “Breeders should be thoroughly testing their breeding stock by performing OFA or PennHip testing on their hips, echocardiograms with a cardiologist, and extensive genetic testing, prior to breeding.”  Hip Dysplasia   Hip dysplasia is a common issue for large- and giant-breed dogs and happens when the hip joint develops abnormally, resulting in a loose joint. It can happen during a Goldendoodle puppy’s growing phase.   Discomfort is commonly displayed by pups via limited mobility, which can include reduced activity, difficulty going up stairs, or even difficulty just getting up. There are many options for treating hip dysplasia, from nutrition supplements to anti-inflammatory medications to surgery, but it’s vital to consult your vet to find the best treatment for your Goldendoodle.  Heart Disease   Goldendoodles are genetically predisposed to heart disease, particularly a congenital variation called subvalvular aortic stenosis (SAS). This is when the heart’s aortic valve narrows, creating an obstruction. The heart must work harder than normal to pump blood through this narrowed area, causing heart muscle abnormalities, says Whittenburg. “There are no foods, or things to avoid, that will prevent an inherited heart defect,” she says. “However, it is important to not add to the issue by feeding a food that has been linked to heart disease. Grain-free and boutique brand foods should be avoided.”  Congenital Eye Issues  Goldendoodles are susceptible to two eye conditions: glaucoma and cataracts. Glaucoma is an eye disease involving increased pressure. Symptoms pet parents should look out for include bulging eyeballs, watery discharge, redness to the whites of the eyes, and dilated pupils. The condition can be treated with long-term medication. If left untreated, glaucoma can lead to blindness.     Cataracts is a common condition in dogs that causes clouding in the eyes and can lead to vision loss. If you notice that one or both of your Goldendoodle’s eye lenses has a cloudy or opaque appearance, or that their vision has become more limited, consult a veterinary professional. Cataracts can be treated with surgery but, left untreated, can lead to complete loss of vision.  What To Feed a Goldendoodle  A balanced diet will help your Goldendoodle maintain a healthy weight and avoid obesity-related health conditions. That means ensuring your pup eats the proper amount of high-quality dog food and always has access to fresh water.   First bred in the late 1960s as guide dogs, the Goldendoodle—a crossbreed of a Golden Retriever and a Poodle—became a popular household pet in the United States during the 1990s.How To Feed a Goldendoodle  Goldendoodles are part Golden Retriever, a breed prone to heart disease. To help reduce the risks of heart disease, avoid feeding your dog grain-free and boutique brand foods, Whittenburg says. Instead, pet parents should look for Association of American Feed Control Officials–compliant dog foods, such as Purina® Pro Plan, Hill’s Science Diet, and Royal Canin.   “These dogs should always be fed smaller amounts, at least twice daily, and not allowed to [inhale] their food or to exercise for up to an hour after eating,” she says. “These measures will reduce the likelihood of life-threatening gastric dilatation and volvulus, or GDV.”    How Much Should You Feed a Goldendoodle?   To determine the appropriate amount of food to give your Goldendoodle, chat with your veterinarian, who will assess your pup’s lifestyle, health, reproductive status, allergies, and breed to determine how many kilocalories your dog should consume daily.   “Take the food, or a picture of the nutrition label, to the vet with you and they will calculate the amount of that food that you should be feeding,” Whittenburg says. “If you are preparing a homemade diet, the veterinary nutritionist will calculate this for you.”  Generally, Goldendoodle puppies under 6 months old should be fed a minimum of three times a day and adult dogs should be fed twice a day, depending on their stage of life (adolescent versus senior age). “While adults can technically be fed once a day, this can lead to anxiety and hyperfixation on meals,” Whittenburg says. “It is better for the dog’s metabolism and mental health to be fed every 12 hours.”  Nutritional Tips for Goldendoodles   Excess protein and calories are not necessary for pet dogs, even active ones such as Goldendoodles, and may lead to obesity and kidney issues, says Whittenburg. Treats should make up only 10% of your dog’s calorie intake and never replace a diet.   Unless recommended by a veterinarian, dogs fed a complete and balanced commercial food diet should not need any nutritional supplements, which means it’s important to pick a food catered to your Goldendoodle’s life stage, whether she’s a puppy, adult, or senior.  Behavior and Training Tips for Goldendoodles  Goldendoodle Personality and Temperament  If socialized properly as puppies, Goldendoodles can certainly live in homes with other canines. “They are also generally good around cats and children, although there may be some initial adjustment period as they get used to new family members,” says Sophie Whoriskey, DVM.   Goldendoodles are energetic dogs that require 30–60 minutes of physical exercise per day, which can encompass a combination of everything from walks and runs to hikes and playtime.    Goldendoodle Behavior   Because Goldendoodles cherish time spent with their family, they are prone to separation anxiety if they don’t receive the proper amount of social stimulation. Pet parents should avoid leaving their four-legged friends at home alone for too long.   Goldendoodles are energetic dogs that require 30–60 minutes of physical exercise per day.While these laid-back canines aren’t big barkers, they can become vocal to alert their humans. Overall, Goldendoodles are known for their gentle temperament, making them ideal for households with kids and elders. “They especially benefit from having a strong bond with their human family and being part of the daily routine,” Whoriskey says.     Goldendoodle Training  Goldendoodles are known for being intelligent and easily trained, so they excel in activities like agility and obedience classes. They respond well to positive reinforcement techniques, using treats to reward good behavior.   It’s also important to train Goldendoodle puppies at a very young age to ensure they develop good habits that will last throughout their lifetime and minimize mischievous behavior. “With patience and consistency, you will be able to teach your Goldendoodle many tricks and commands,” Whoriskey says.  But Mindy Waite, CAAB, CPDT-KA warns pet parents not to be outsmarted by their Goldendoodle’s cleverness. “They are so smart that they easily train their [pet parents] to suit their own purposes,” she says. “Because of how easy they are to train, they respond well to positive-reinforcement training methods, although [pet parents] need to be careful that they are not manipulated by their highly intelligent dogs.”  Fun Activities for Goldendoodles  Walking or running  Hiking  Frisbee Swimming  Dock diving  Hunting  Dog park  Tug-of-war  Chase  Agility training  Cuddle time  Goldendoodle Grooming Guide  Because they’re a mix of Golden Retriever and Poodle, Goldendoodles are known for their beautiful curly coat that sheds minimally. But Goldendoodle pups require a high-maintenance hair care routine, including regular brushing and appointments with a professional groomer.  Skin Care   While Goldendoodles don’t require a regular bathing routine, your dog may benefit from a splash in the shower or tub if they get wet or dirty from adventures outside.   Coat Care  To avoid unruly tangles and matting, Goldendoodles need constant and regular grooming. Regular brushing at home is also a must. “Training these dogs from a young age to allow for this consistent grooming is absolutely critical,” Waite says. “In addition, [pet parents] must be prepared to spend a good deal of money on grooming every four to eight weeks.”  Eye Care   Trim your pup’s bangs to ensure their voluminous locks don’t block their vision. Because Goldendoodles are prone to congenital eye conditions such as glaucoma and cataracts, pet parents should also keep an eye on respective symptoms and contact their veterinarian if needed.    Ear Care   To prevent infections in your Goldendoodle’s ears, always keep them clean and dry, especially after a bath or a swim.  Considerations for Pet Parents   The Goldendoodle is a friendly, bouncy, high-energy breed that comes in many sizes, making them an ideal companion for any household. They can live in any type of home but prefer one with a yard and plenty of room to roam.    Because Goldendoodles don’t shed much, they are considered a preferred breed for people with allergies and are commonly referred to as “hypoallergenic” dogs—though no dog breed is 100% allergen-free.When bringing home a Goldendoodle puppy, be prepared to provide your pup with proper positive-reinforcement training and attention to ensure she doesn’t become easily excitable, mouthy, and prone to frustration. Goldendoodles require ample amounts of training and exercise every day, particularly in their early puppy years, to stay entertained, tired, and happy, Waite says.  "}]