[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bolognese Dog Breed", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-bolognese-dog_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-bolognese-dog_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Bolognese Dog Breed", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_bolognese"}, "datePublished": "September 6, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Bolognese Dog Breed Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Bolognese dog was prized in its early existence in Italy, and has always been regarded as a great companion to people. This small Bichon type breed is calm and known to be very intelligent and playful, but is still a rare breed in the United States. Physical Characteristics Similar to other Bichon type breeds, the Bolognese has a long, fluffy, pure white coat. The single layer coat falls in long ringlets on the body and shorter on the face. This small breed weighs anywhere from 5 to 9 pounds, with a stocky, square build. Personality and Temperament This breed is a very loyal and loving family dog known for the bond it forms with its owners. Although the Bolognese is described as serious and docile, it is also known to be very happy and playful. This small dog is friendly with strangers and is a cheerful companion. Care This toy dog breed does not require an excessive amount of exercise, but should you be the exercising type, the Bolognese is likely to be able to keep up with you. The breed hardly sheds, but brushing its coat daily or a few times a week will keep the coat healthy and tangle free. The Bolognese can be an ideal apartment dog as it will do fine without a yard. Health The Bolognese has a life span of 12 to 14 years and has no known breed-specific health disorders. History and Background Although it is thought that the Bolognese existed some time before it gained popularity in Italy, there is no clear record before the eleventh century. This breed was named after the northern Italian city Bologna, and was a prize dog of the courts and the wealthy in Italy. The Bolognese remained a popular pet until Europe’s aristocracy fell from favor. The breed was almost extinct by the end of World War II, but Italian breeders were able to restore the Bolognese to popularity again. In attempts to bring more attention to the breed in the U.S., the Bolognese Club of America was founded in 1986 and currently holds the only U.S. registry for the breed. The Bolognese was recognized by the United Kennel Club in 1995, though it is still considered a very rare breed in America. Featured Image: iStock.com/sssss1gmel"}]