[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is the Lhasa Apso a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "The Lhasa Apso is affectionate and loyal but does best with adults and older children."}}, {"@type": "Question", "name": "Are Lhasa Apsos smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Lhasa Apsos are very intelligent, which makes them excellent candidates for obedience training."}}, {"@type": "Question", "name": "How much does a Lhasa Apso cost?", "acceptedAnswer": {"@type": "Answer", "text": "In 2022, purchasing a Lhasa Apso from a breeder cost between $1,000-$2,000. Dogs of certain lineage may cost more. Lhasa Apsos can also be found in rescues and shelters."}}, {"@type": "Question", "name": "Do Lhasa Apsos like to cuddle?", "acceptedAnswer": {"@type": "Answer", "text": "Most Lhasa Apsos enjoy being close to their owner to cuddle and sit on their laps. They may be wary of new people."}}, {"@type": "Question", "name": "Do Lhasa Apsos make good watchdogs?", "acceptedAnswer": {"@type": "Answer", "text": "While small, the Lhasa is an attentive watchdog that will alert his owner to any active noises."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lhasa Apso", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/lhasa-apso.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/lhasa-apso.jpeg"}, "author": {"@type": "Person", "name": "Virginia LaMon, DVM", "url": "https://www.petmd.com/author/dr-virginia-lamon"}, "keywords": "Dog, Breed, Lhasa Apso", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/lhasa-apso"}, "datePublished": "September 23, 2022", "dateModified": "October 13, 2023", "description": "The Lhasa Apso is a small dog with lots of fur—and lots of grooming needs. Learn more about caring for Lhasa Apso puppies and dogs here.", "articleBody": "The Lhasa Apso breed was introduced about 1,000 years ago to serve as watchdogs and pets in Tibetan monasteries and palaces. They were also given as gifts to local and foreign leaders. Loosely translated, the name means “bearded lion dog.” The Lhasa Apso’s long, thick coat helps them stay warm in the freezing Himalayan temperatures, living up to 13,000 feet above sea level. Today, this 10- to 11-inch-high dog serves as a good companion for families. They weigh 12-18 pounds and, with proper care, can thrive for around 15 years, although the record holder lived 29 years. Caring for the Lhasa Apso The Lhasa Apso is a small but smart and affectionate individual that makes a solid watchdog. This also means they may bark excessively, and some can be overly protective. They are known for their flat, floor-length coat, usually parted in the center. This long coat requires extensive brushing and care, which leads some people to have them groomed to a shorter length, or “puppy cut.” The Lhasa has a flat face and short nose, which can cause them to overheat easily. They need frequent ear, eye, and skin care. Overall, they are a healthy breed but have a few conditions that affect them. Lhasa Apso Health Issues Eye Conditions The Lhasa Apso is predisposed to several different eye conditions. If you see redness, squinting, discharge, an unusual appearance, or decreased vision, consult your veterinarian immediately. Progressive Retinal Atrophy Progressive retinal atrophy (PRA) is a group of diseases that causes the breakdown of the photoreceptor cells (rods and cones) on the retina. Initially, the dog may have difficulty seeing in the dark, but over time the condition will result in complete blindness. In most cases, PRA is an inherited disease, so dogs with this condition should not be bred. There are currently no effective treatments available. Cataracts Cataracts are common in Lhasa Apsos. In most cases, the condition develops in older dogs as proteins and fibers in the lens of the eye break down, causing an opacity of the lens. This leads to blurred vision, which can progress to blindness. In most cases, this is an inherited condition, but cataracts can also be seen with diabetes mellitus or after injury to the lens. In some cases, cataracts cause inflammation and discomfort that requires medication. There are no medications to slow their progression or prevent vision loss. Cataracts can be surgically removed by a board-certified veterinary ophthalmologist, and the procedure usually restores vision. Glaucoma Glaucoma is a painful condition that causes increased pressure within the eye. This can occur without an obvious cause (primary glaucoma) or it can be caused by conditions such as cataracts or lens luxation (secondary glaucoma). The most common signs of glaucoma are pain (squinting), discharge from the eye, lethargy, bulging eye, or a cloudy/bluish color of the eye. If not treated quickly, blindness may occur. Keratoconjunctivitis sicca (Dry Eye) Keratoconjunctivitis sicca (KCS), or dry eye, occurs when the eye does not produce enough normal tear film. Tears help lubricate the eye, so the lack of adequate lubrication causes the eye surface and the inside of the eye lid to rub against each other, leading to inflammation. A thick mucus may develop instead of normal tears. Most dogs with KCS will have red eyes that are painful, which leads to squinting or rubbing the eye. Ulcers on the cornea are common and need immediate treatment. KCS is treated with topical eye medications and often tear replacement/lubricant. Patellar Luxation The patella (kneecap) is a small bone that normally sits in a groove within the femur at the knee.  In dogs with patellar luxation, the patella moves (luxates) outside of its assigned groove when the knee is flexed. This inappropriate movement of the kneecap can cause discomfort and may lead to arthritis.  Many pets will skip or run on three legs when the patella is out of place. In some cases, this may only last a few steps until the patella returns to its proper alignment. In more severe cases, the patella remains out of place. In mild cases, joint supplements or anti-inflammatory medications are used to control pain and prevent arthritis. In the more severely affected dogs, surgery may be recommended. Dental Disease Dental disease is one of the most common conditions seen in dogs as they age, especially in small breeds like the Lhasa Apso. Bacterial tartar and plaque lead to inflammation of the tissues around the teeth and eventually to tooth and bone decay. The best way to prevent dental disease is with daily tooth brushing with a dog-specific toothpaste. Some diets, treats, and chew toys also help to prevent plaque and tartar. Routine dental cleanings are recommended to evaluate the mouth, remove plaque and tartar, polish teeth (to prevent future build up), and treat or extract teeth that are significantly unhealthy. X-rays of the teeth and surrounding bone are also recommended. As with humans, dental disease can be a painful condition and may even affect the health of the internal organs. Renal Dysplasia Renal dysplasia (familial nephropathy) is a hereditary disease seen in several dog breeds, including the Lhasa Apso. In this condition, the kidney develops abnormally in utero and kidney function rapidly deteriorates. This type of kidney disease is often diagnosed in young Lhasa Apsos, including puppies. Symptoms of renal dysplasia include increased thirst, increased urination, decreased appetite, slow growth, and eventually kidney failure. Blood tests and abdominal ultrasound findings may point toward this diagnosis. However, a biopsy (removal of a small sample of the kidney) is necessary for a definitive diagnosis. There is no cure for renal dysplasia, but supportive treatment can prolong quality and length of life. As this is a heritable condition, dogs with renal dysplasia should not be bred. What to Feed a Lhasa Apso Feeding an Association of American Feed Control Officials (AAFCO) kibble or wet food is a good way to make sure your Lhasa Apso receives a complete and balanced diet.  Puppies should be fed a diet formulated specifically for puppies. In adults, diets focused on dental health may be recommended to help prevent dental disease.  How to Feed a Lhasa Apso Adult Lhasa Apsos should be fed a measured amount twice a day, and puppies should be fed at least three meals a day to prevent low blood-sugar levels. Check with your veterinarian to ensure you are providing the right amount of food, depending on your Lhasa Apso’s age. How Much Should You Feed a Lhasa Apso? Just like humans, the recommended caloric intake required varies between individuals based on  physical size, metabolism, neuter status, and activity level. The best way to determine the feeding quantity is to talk with your veterinarian, who can calculate your dog’s caloric needs.  Additionally, the feeding guide labels on your dog food will provide valuable information. Nutritional Tips for Lhasa Apso The Lhasa Apso may benefit from the addition of omega-3 fatty acids (DHA/EPA) into their diets. Omega-3 fatty acids can be found in skin and joint supplements, fish oil, and even in some specially formulated dog foods. These fatty acids act as natural anti-inflammatories that help support skin, coat, kidneys, joints, and heart. Be sure to discuss recommended supplements with your veterinarian first. Behavior and Training Tips for the Lhasa Apso Lhasa Apso Personality and Temperament The Lhasa Apso is an energetic and very intelligent breed. They were bred to be watchdogs, which can make them wary of strangers and very protective of their pet parents. This history led to their frequent sharp, loud barks. They were bred to be companions in Tibetan monasteries, which makes them very affectionate with people they know. Some individuals have a strong prey drive, which could make them difficult for a child or an unsteady adult to walk, as they may bolt at the sight of cats or other small animals. Lhasa Apso Behavior Despite their history as a watch dog, Lhasa Apsos can be fun, affectionate family dogs. They may be protective or even snippy, so early socialization with children, strangers, and other animals is critical. They may also have a strong prey drive, which could lead to chasing small animals, including cats. Keep in mind, the Lhasa Apso loves to bark. Lhasa Apso Training The Lhasa Apso should begin obedience training and socialization at an early age. They need to be exposed to children, strangers, and other animals in a supervised setting so they can become  accustomed to new environments and people. The Lhasa Apso is easily trained relative to other breeds. They are generally food- and toy-motivated. Training games and positive reinforcement using treats or toys work best. Fun Activities for the Lhasa Apso Fetch Hiking in the mountains Obedience training Agility Scent work Lhasa Apso Grooming Guide Skin Care Lhasa Apsos should be bathed every two to four weeks. For most Lhasa Apsos, a gentle shampoo and conditioner is best. Coat Care Brushing three to four times weekly will help remove tangles and knots, especially in Lhasa’s with a long coat. Detangling and dematting spray-on conditioner is helpful for breaking down tangles. Eye Care Wiping the eyes daily with a soft, moist cloth will help remove debris. The hair around the eye should be carefully trimmed to keep it from irritating the eye. If squinting or eye discharge is noted, a trip to the veterinarian is recommended. These can be signs of more serious eye conditions. Ear Care Cleaning the ears every one or two weeks for maintenance helps to prevent ear infections. If redness, odor, or debris is noted, an infection may be present, and a veterinarian should be consulted."}]