[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Bernese Mountain Dog a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "The Bernese Mountain Dog is a great family dog when thoroughly socialized and trained as a puppy. They have an easygoing, calm temperament and are typically laid-back."}}, {"@type": "Question", "name": "Are Bernese Mountain Dogs smart?", "acceptedAnswer": {"@type": "Answer", "text": "Bernese Mountain Dogs are extremely intelligent, which make them easy to train."}}, {"@type": "Question", "name": "Do Bernese Mountain Dogs have a lot of energy?", "acceptedAnswer": {"@type": "Answer", "text": "The Bernese Mountain Dog is ready to play when encouraged, but they tend to be a calm breed that likes to lie on the couch or in a comfy dog bed."}}, {"@type": "Question", "name": "Do Bernese Mountain Dogs make good watchdogs?", "acceptedAnswer": {"@type": "Answer", "text": "The Bernese Mountain Dog is attentive and alert to his surroundings. When properly trained, these traits can help make them a good watchdog."}}, {"@type": "Question", "name": "Do Bernese Mountain Dogs bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Though they’re a pretty easygoing dog, Berners have a very loud bark. When they think something is amiss, that bark is certain to get their pet parents’ attention. Yet, they are not a particularly “barky” breed and typically raise their voice only when needed. Featured Image: iStock/K R E M"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bernese Mountain Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/smiling-bernese-mountain-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/smiling-bernese-mountain-dog.jpg"}, "author": {"@type": "Person", "name": "Virginia LaMon, DVM", "url": "https://www.petmd.com/author/dr-virginia-lamon"}, "keywords": "Dog, Breed, Bernese Mountain Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/bernese-mountain-dog"}, "datePublished": "October 17, 2022", "dateModified": "October 13, 2023", "description": "Bernese Mountain Dogs are big, furry, and friendly dogs. Learn more about caring for, living with, and training Bernese Mountain Dogs.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. The big, beautiful Bernese Mountain Dog originated in Switzerland. They were imported to the United States to work as farm dogs during the 1920s, but now these gentle giants are mostly family pets. Standing 23-27.5 inches at the shoulder and weighing up to 115 pounds, Bernese Mountain Dogs are super-sized pups and have a big heart to match. Caring for Bernese Mountain Dogs The Bernese Mountain Dog, with his distinct markings, is generally affectionate and patient with people and other pets. They are often calm but can easily be enticed to play. They require a moderate amount of grooming care because they have medium to long fur and a thick double coat. Bernese Mountain Dog Health Issues The Bernese Mountain Dog tends to be a healthy breed, but they can be predisposed to some health issues. Gastric Dilatation-Volvulus (GDV) Gastric dilatation-volvulus (a severe form of bloat in dogs) is a condition that occurs suddenly and requires immediate life-saving intervention. This happens when the stomach fills up with food or gas, causing expansion and increased pressure. The stomach can then rotate, which causes inadequate blood supply to the spleen and stomach. If not treated quickly, shock, tissue damage, and even death can occur. Increased risk is seen in: Older dogs that have a deep chest (like the Bernese Mountain Dog) Dogs that are fed from elevated bowls Dogs that are fed only once per day Immediate veterinary intervention is needed to stabilize and treat GDV. The longer a dog has this condition without intervention, the greater the risk of death. To prevent GDV, a surgiery called prophylactic gastropexy can be performed to secure the stomach to prevent it from twisting. This is often done at the same time as the dog’s spay or neuter surgery. Hip Dysplasia Hip dysplasia is a condition when the hip joint doesn’t develop properly, causing a loose joint. This can be influenced by growth rate, hormones, diet, and/or exercise. Hip dysplasia can cause degenerative joint disease and osteoarthritis to develop. This arthritis leads to pain, limping, and difficulty standing. Maintaining a lean body is important for preventing arthritis. Many vets recommend low-intensity exercise, omega-3 fatty acids, glucosamine, and chondroitin supplementation for dogs diagnosed with hip dysplasia. In severe cases, your vet might need to perform surgery. Elbow Dysplasia Elbow dysplasia is a condition where the elbow joint develops abnormally. This is usually influenced by genetics, abnormal/rapid growth, diet, and trauma. The condition can cause pain, limping, and lameness, which can progress into arthritis. Treatment of elbow dysplasia varies based on the severity, but surgery is required in most cases. Cancer/Histiocytic Sarcoma Bernese Mountain Dogs are prone to several types of cancer; one of the most common is called histiocytic sarcoma. There are three forms of histiocytic sarcoma: Localized histiocytic sarcoma occurs as a localized tumor, often in the bones, skin, lungs, and joints. Disseminated histiocytic sarcoma affects multiple areas at the same time. Hemophagocytic histiocytic sarcoma starts in the spleen and spreads rapidly. Signs of histiocytic sarcomas vary based on the location in the dog’s body, but many dogs will be lethargic, lose weight, and eat less. Treatment varies case by case and can entail surgery, chemotherapy, and/or radiation. What To Feed a Bernese Mountain Dog Feeding commercial kibble or wet food that’s compliant with the Association of American Feed Control Officials (AAFCO)’s standards is a good way to make sure your Bernese Mountain Dog receives a complete and balanced diet. As a giant breed, Bernese Mountain Dog puppies need to grow at a steady rate so that muscles and bone grow in unison. The bone and joints can become weak if their bones grow too quickly, and additional body weight places extra strain on these weak spots. Hip dysplasia and elbow dysplasia can also happen due to rapid growth. To maintain a healthy growth rate in Bernese Mountain Dog puppies, proper amounts of fat, protein, and carbohydrates are necessary. They can get all of their nutrition through AAFCO-compliant foods that are designed for giant and large dogs. But as always, discuss with your veterinarian which diet is best for your individual dog. How To Feed a Bernese Mountain Dog Adult Bernese Mountain Dogs do best when they’re fed every 12 hours. Elevated bowls should be avoided, as these may increase the risk of gastric dilatation-volvulus or bloat. How Much Should You Feed a Bernese Mountain Dog? Just like with humans, the recommended caloric intake for Bernese Mountain Dogs varies between individual dogs—it all comes down to their size, metabolism, neuter status, and activity level. Additionally, the caloric content for each food may vary drastically from one brand to the next. The best way to determine how much to feed a Bernese Mountain Dog is to talk with your veterinarian. They can calculate how much you should feed your dog. Additionally, the feeding guide labels on your dog food provide valuable information about portions. Nutritional Tips for Bernese Mountain Dogs Bernese Mountain Dogs can benefit from omega-3 fatty acids (DHA/EPA) in their diet. Omega-3 fatty acids can be found in skin and joint supplements, fish oil, and even in some specially formulated dog foods. These fatty acids will act as natural anti-inflammatories that help to support the skin, coat, kidneys, joints, and heart. Behavior and Training Tips for the Bernese Mountain Dog Bernese Mountain Dog Personality and Temperament In general, the Bernese Mountain Dog is an intelligent and affectionate dog. They are eager to please, which makes them good with training. They may be a little shy around people they don’t know, but the Bernese Mountain Dog tends to be patient with children and other dogs. That said, interactions between kids and dogs of all breeds should always be supervised. And while Bernese Mountain Dogs were bred as working farm dogs, today most prefer to lie on the couch all day. Bernese Mountain Dog Behavior The Bernese Mountain Dog is relatively adaptable to change and minor stressors, but these sweet pups may be shy in new settings. When properly socialized to dogs, cats, and people as puppies, a “Berner” is more adaptable and less likely to develop anxiety as an adult. Many Bernese Mountain Dogs dislike being left alone, and some may develop separation anxiety. Bernese Mountain Dog Training The Bernese Mountain Dog is exceptionally intelligent and eager to please, making them a highly trainable pup. Training is most successful when based on positive reinforcement with lots of treats for good behavior. Due to their large size and intense strength, training the Bernese Mountain Dog to walk nicely on a leash and not jump up on people is crucial. Fun Activities for Bernese Mountain Dogs Obedience training Nose work Hiking Cart pulling Bernese Mountain Dog Grooming Guide The Bernese Mountain Dog has a medium- to long-haired double coat. They require regular brushing and bathing to help control the heavy shedding, which is worse in warmer weather. Skin Care The Bernese Mountain Dog should be bathed using dog shampoo every 2-4 weeks. Coat Care The Bernese Mountain Dog’s thick double coat requires brushing several times per week to prevent matting and to help control the heavy shedding. Deshedding tools like the FURminator help to remove the undercoat. Eye Care Gentle cleaning with a moist cloth may be needed if debris collects around the eyes. Excessive discharge should be evaluated by a veterinarian, as this could indicate eye trauma or disease. Ear Care The Bernese Mountain Dog&#039;s floppy ears can easily trap moisture, which can lead to an ear infection. Regular ear cleaning is important to keep this breed healthy, and always clean your Berner’s ears after he’s in water (such as during bathtime or after a swimming session). Considerations for Pet Parents The Bernese Mountain Dog is a great family dog when properly socialized from puppyhood. As noted, most Berners are relatively calm and eager to please, making them great companions for people of any age. They should be kept inside during hot weather, as their heavy coat makes them sensitive to overheating. Living with a Bernese Mountain Dog means dealing with heavy shedding, so make sure you have a strong vacuum cleaner and plenty of lint rollers."}]