[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Norwich Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Norwich Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_norwich_terrier"}, "datePublished": "July 9, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Norwich Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Norwich Terrier is one of the smallest working terriers. It’s a spirited, stocky breed, with prick ears and an almost weatherproof coat. Resembling the Norfolk Terrier, the Norwich Terrier has the true spirit of a terrier and is always ready for excitement and adventure: it can work in a pack and moves with great power. Physical Characteristics The double coat of the Norwich is comprised of a straight, hard, and wiry outer coat, which fits close to the body and is red, wheaten, black, or tan in color. The hair around its mane, meanwhile, is thick, offering the dog protection. The expression of the Norwich Terrier is slightly foxy in nature. In fact, this square-proportioned, stocky, sturdy, and spirited dog is among the smallest working terriers. Its small size help it follow fox or vermin through narrow passages. And its large teeth help it dispatch its quarry effectively. The tail is long enough to hold on firmly, so that it is not pulled from a hole. Personality and Temperament As the Norwich is a good hunter, it may chase small animals. This amusing, lively, and independent dog is also a good companion, though challenging at times. It is perfect for those who have a great sense of humor and adventure. Care The Norwich Terrier functions better as a house dog with access to the yard, but it can also live outdoors during daytime in temperate or warm climates. Its wiry coat requires occasional weekly combing, and stripping of dead hair three or four times a year. The Norwich is fond of exploring and running, but off-leash forays should be done only in secure areas. It is also recommended that you allow the dog to run short distances and stretch out its legs every day. Health The Norwich Terrier, which has an average lifespan of 13 to 15 years, may suffer from patellar luxation, cataract, cheyletiella mites, and deafness. It is also prone to minor health problems such as allergies and seizures, and major issues like canine hip dysplasia (CHD). To identify some of these issues, a veterinarian may recommend hip and knee tests for this breed of dog. History and Background In England, short-legged ratters have always been valued. However, during the 19th century, smaller breeds like the Norfolk and Norwich Terriers (known as CanTabs and Trumpington Terriers at the time) began to emerge; it was even popular for students of Cambridge University to own one of the small ratters. Near the turn of the 20th century, a Trumpington Terrier named Rags emerged from a stable near Norwich as the sire to numerous dogs, and is often considered the main ancestor to the modern Norwich Terrier. One of his descendants was introduced to the United States in 1914; the breed became popular in America quickly thereafter. Even today, people refer to the Norwich as &quot;Jones&quot; Terrier, a tribute to the original owner of the first American Norwich Terrier. In 1936, the American Kennel Club formally recognized the breed. At first the breed included both the drop and prick-eared variety; however, in 1979 the Norfolk Terrier only became associated with the dropped-eared strain. Even though the Norfolk terrier does not possess the flashing speed of other long-legged terriers, it is a good competitor to have in a show ring. The Norfolk Terrier is also a loyal and sensitive companion to have."}]