[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Dogo Argentino a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Dogo Argentinos can be difficult to own as family dogs due to their high prey drive, inherent wariness around strangers, and stubborn nature. This breed is better suited to be working dogs or hunting partners."}}, {"@type": "Question", "name": "Are Dogo Argentinos smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Dogo Argentinos are highly intelligent animals. Because of this, they require training that involves significant mental stimulation, and they also make wonderful working dogs when trained for military or police work, search and rescue, or service work."}}, {"@type": "Question", "name": "Is a Dogo Argentino a Pit Bull?", "acceptedAnswer": {"@type": "Answer", "text": "While Dogo Argentinos and American Pit Bull Terriers look similar, they are two separate dog breeds. The Dogo Argentino was historically developed from crossing many different breeds, including the Boxer, Great Dane, Bull Terrier, Irish Wolfhound, English Pointer, and the Dogue de Bordeaux."}}, {"@type": "Question", "name": "Is the Dogo Argentino allowed in the U.S.?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, Dogo Argentinos are legal in the U.S. However, they are banned in a few other countries, including in the U.K."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dogo Argentino", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/white-dogo-argentino.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/white-dogo-argentino.jpg"}, "author": {"@type": "Person", "name": "Heather Newett, MPH, DVM", "url": "https://www.petmd.com/author/dr-heather-newett"}, "keywords": "Dog, Breed, Dogo Argentino", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/dogo-argentino"}, "datePublished": "October 13, 2022", "dateModified": "October 13, 2023", "description": "The Dogo Argentino is a large, white dog that, while typically healthy, is susceptible to some size-related health conditions. Learn about caring for Dogo Argentino puppies and dogs here.", "articleBody": "The Dogo Argentino was developed in the Republic of Argentina by a breeder named Dr. Antonio Nores Martinez. He focused on crossbreeding large, hardworking dogs to create an excellent partner for big-game hunting. As a giant breed, the Dogo Argentino’s weight ranges from 80-100 pounds and his height reaches up to 27 inches at the shoulder. This breed is muscular and was developed to be tenacious, intelligent, and loyal. Because the Dogo Argentino was bred to be a hunting partner, it is extremely loyal, protective, and energetic. Caring for a Dogo Argentino The Dogo Argentino has a short-haired, smooth, white coat with black mucous membranes around its eyes and lips. Occasional bathing is recommended, but intensive brushing and coat maintenance is not necessary; they do shed regularly.   This breed is thick and muscular from the neck through to the limbs and has a bulky, boxy head with heavy jowls—making them moderate droolers. Because these dogs are athletically built and energetic, they do require moderate to high levels of exercise daily. They can become destructive when they are bored, so regular exercise is also important for maintaining their mental well-being as well as their physical health. They can be stubborn when it comes to training, so a Dogo Argentino requires experienced pet parents and professional trainers to ensure an appropriate upbringing. Dogo Argentino Health Issues The Dogo Argentino is generally very healthy, but he can suffer from some specific disorders due to his size. Hip Dysplasia Hip dysplasia is a common orthopedic disorder affecting large dog breeds. It results from a congenital issue causing loosening in the hip joint, which can develop severe arthritis. This is a debilitating disease that causes progressive pain and difficulty moving as the dog ages. Periodontal Disease Dental disease is a common ailment among all domesticated cats and dogs. The Dogo Argentino isn’t susceptible to more dental diseases than other giant breeds, but pet parents still need to maintain their dental hygiene at home to prevent tartar buildup and gingivitis. Once tartar starts to accumulate on teeth, it can be very difficult to remove. Brushing a Dogo Argentino’s teeth at least three times per week is recommended. Annual dental cleanings with a veterinarian are also strongly advised once these dogs reach 3 or 4 years of age. Gastric Dilatation and Volvulus (GDV) GDV, also called bloat, is an emergency condition that occurs in large, deep-chested dogs. It consists of the stomach bloating and flipping over itself in a way that eliminates blood supply to the organ. If not addressed immediately, GDV is fatal. To prevent this from happening, a procedure called a gastropexy is recommended in young large-breed dogs at the time of their spaying or neutering surgeries. The gastropexy secures the stomach to the interior body wall, preventing it from flipping in cases of bloat. Deafness Deafness is a genetic disease that occurs in Dogo Argentinos and is characterized by an individual of this breed having complete lack of hearing from birth. It is generally related to their white coloration. White pigmentation not only affects the coats of dogs, but also the development of other regions of a dog’s skin. In some animals, the genetics of their white coloration causes the cells that are necessary for transmission of sound within the ears not to develop, leading to lifelong deafness. Laryngeal Paralysis Laryngeal paralysis is typically caused by a disorder with the nerve that opens and closes the larynx, or vocal folds, of large-breed dogs. This disorder causes the folds to open only partially or to not open at all. A poorly functioning larynx can cause increased breathing sounds or actual difficulty with breathing. This disorder can be managed surgically in moderate to severe cases. Hypothyroidism Hypothyroidism (underactive thyroid) occurs when a dog’s thyroid gland doesn’t produce an adequate amount of thyroid hormone. Low levels of thyroid hormone can cause weight gain, disorders with a dog’s coat, increased susceptibility to infections, and low energy. Dogo Argentinos and other large or giant dogs are more likely than smaller breeds to develop hypothyroidism. What to Feed a Dogo Argentino  Any food that is offered to a domesticated pet should be approved by the Association of American Feed Control Officials (AAFCO). AAFCO regulates the contents of animal feeds to ensure that proper nutrients are included in foods—to produce a complete and well-balanced diet. Dogo Argentinos should be fed food that is specifically developed for large or giant breeds. Because dental disease is a common ailment in all animals, including our canine counterparts, prescription dental diets are a great option for Dogo Argentinos. How to Feed a Dogo Argentino Most adult large-breed dogs can be fed successfully one to three times daily. As puppies, they should be fed more often—up to for to six times daily—to avoid the life-threatening effects of low blood sugar. All puppies are unable to maintain appropriate blood sugar levels without regular feedings because the organs that produce hormones for processing their food are still developing. Dogo Argentinos can be particularly eager eaters, so slow-feeding bowls come in handy to prevent rapid food ingestion. Dogs that eat too quickly often inhale large amounts of air, which can lead to bloating and life-threatening episodes of GDV. How Much Should You Feed a Dogo Argentino? When considering that an adult Dogo Argentino’s average weight ranges from 80-100 pounds, their resting energy requirement (RER) would range from 1,000-1,200 calories per day. With exercise, a Dogo Argentino should be fed slightly more than their RER. Obese animals should be fed slightly less than their RER. Always work with your veterinarian to determine the appropriate amount of food to feed your dog. Nutritional Tips for the Dogo Argentino Fish oil is a strongly recommended addition to a Dogo Argentino’s diet. This product contains omega-3, -6, and -9 fatty acids that are used to help support the health of the skin and haircoat, heart, kidneys, and joints. A joint supplement containing methylsulfonylmethane (MSM), glucosamine, and chondroitin is also strongly recommended because Dogo Argentinos are prone to developing arthritis and hip dysplasia. This supplement should be started at an early age. Your veterinarian will be able to direct you to specific brands of supplements and will let you know at what ages and in what amounts these dietary additions can be administered safely. Behavior and Training Tips for Dogo Argentinos Dogo Argentino Personality and Temperament Dogo Argentinos are very energetic and affectionate animals. They enjoy lounging with the family as much as they enjoy intense exercise. They are also proud and protective of their family. Dogo Argentinos may be standoffish with children, but once properly introduced can be playful with them due to their high need for activity. Always supervise children and dogs when they are together. These dogs tend to be quiet and won’t bark excessively, but they do have a strong prey drive and need to always be leashed or kept inside of fenced-in areas to prevent them from running away. Dogo Argentino Behavior Because of their protective instincts, Dogo Argentinos make excellent watchdogs for their household. They can be standoffish toward strangers, but with proper introductions they can be friendly and laid-back. The most trouble they want to get into involves chasing small animals (remember, they were bred to be hunters) or wandering away from the home. Dogo Argentino Training Dogo Argentinos can be hard to handle due to their high energy, prey drive, and protective instincts, so they are typically not recommended for first-time pet parents. They are intelligent, but can be stubborn and instinctual, which makes them hard to train. Special care should be taken in training their sociability with other dogs and humans outside of their household. Fun Activities for Dogo Argentinos Playing ball Walking or running on leash Working (as police or military dogs) Hunting wild game Dogo Argentino Grooming Guide Dogo Argentinos have short, soft coats and are moderate shedders. They should be bathed no more than once weekly (though twice a month is probably a good schedule to keep) or as needed when excessively dirty. They do not have coats that require detangling or clipping. Skin Care Dogo Argentinos do not have sensitive skin, but they can have non-pigmented regions of skin under their white hair, making them prone to sunburn. Avoid allowing them to lounge in direct sunlight for long periods of time—this includes hanging their head out of the car window during long drives. Coat Care Dogo Argentinos have short coats that are not at risk of matting but will shed moderately. They are not considered hypoallergenic dogs. Eye Care Because of their white coats, Dogo Argentinos could possibly develop tear stains under their eyes in the event of chronic excessive tearing. Fortunately, they are not typically dogs that develop excessive tearing—consult with your veterinarian if you notice tearing under their eyes. Ear Care Dogo Argentinos do not have special needs regarding regular ear care. Your veterinarian will advise you if a regular ear cleaning schedule is recommended in the case of chronic ear infections, and how often to clean their ears at home. Considerations for Pet Parents Dogo Argentinos should not be adopted into homes that already house small animals (miniature/toy dog breeds or cats, especially) due to their strong prey drives. They should be provided a fenced-in yard to help with moderate exercise and their large size. They are typically not recommended for apartment living. These dogs do require significant training and need pet parents that can accommodate their energy requirements. They do best with a pet parent who has time to devote to the energy of these dogs. Ultimately, Dogo Argentinos are a special breed that require a significant amount of training but are affectionate and loyal partners."}]