[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Berger Picard", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-berger-picard.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-berger-picard.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Berger Picard", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_berger_picard"}, "datePublished": "February 6, 2018", "dateModified": "October 13, 2023", "description": "Learn everything about Berger Picard Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "By Lynne Miller Bred centuries ago to herd sheep on farms and in the fields, the Berger Picard is an active, medium-sized breed that belongs to the herding group. While North American moviegoers saw these smart, scruffy-looking dogs in the film, “Because of Winn Dixie,” the Picards are hard to find in the U.S. and attract attention when they make an appearance. On walks, owners of Picards can expect to hear the question, “What kind of dog is that?” from curious admirers. Also called the Picardy Shepherd, Picards are known for their whimsical appearance, intelligence, and independence. Physical Characteristics Sturdily built and well-muscled, the Picard looks rustic and tousled. The dogs have shaggy, wiry topcoats and short, dense undercoats, in shades of fawn, gray, and brindle. Picards have brown eyes, erect ears, and a distinctive smile. Typically, the dog weighs between 50 and 70 pounds. Personality and Temperament Picards are friendly and good-natured, says Gina DiNardo, executive secretary of the American Kennel Club. But while Picards like people and are usually patient with children, they can be reserved around people they don’t know. They are alert, protective of their families and good watchdogs. Socialization can help the dogs have successful relationships, according to the Berger Picard Club of America, the official AKC parent club, which advises owners to make sure the dogs spend time with their families, go on outings, and visit places where they’ll meet people or other dogs. Picards usually get along with other animals, though how well can depend on the personalities of the animals, DiNardo says. While they can be stubborn, the dogs are eager to please their owners and respond well to positive training, she says. Picards do not bark excessively. Care Like other herding dogs, this high-energy breed needs plenty of physical activity to stay happy and out of mischief. “They need exercise and outlets for their intelligence and stamina,” DiNardo says. “A Berger Picard needs an active family with time to give it exercise and keep it from getting bored. Herding breeds are not for people who are couch potatoes or for elderly people who are not super mobile.” Picards love to walk, swim, and run. They will happily jog alongside their bike-riding owners, DiNardo says. With its weatherproof coat, the Picard enjoys hiking even when the weather is bad. When it comes to grooming, these dogs are low maintenance. While they do not shed much, their coats need brushing at least once a month to prevent matting, with occasional baths. Hand-stripping the hair by the ears will keep the dog looking neat. Health The Picard, which has an average lifespan of 12 to 13 years, is prone to eye disorders including cataracts and progressive retinal atrophy, which is similar to macular degeneration in humans, according to the Berger Picard Club of America. Owners should make sure to schedule the dogs for an eye examination. Hip dysplasia also affects the breed. More information about health issues will likely emerge as this relatively new (to America) breed becomes more popular.  History and Background Berger is French for “shepherd” and Picardy is the region in northern France where these dogs originated. The breed’s ancestors were sheep herding dogs who were brought to northern France and the Pas de Calais during the second Celtic invasion of Gaul around 400 B.C. During the Middle Ages, images of dogs who looked like Picards appeared on tapestries, engravings, and woodcuttings. The dogs nearly became extinct after Picardy was devastated during World Wars I and II. In 1925, the Picard was officially recognized as a breed in France, and more recently, Picards began to arrive in the States. American buyers who were interested in the dogs connected with European breeders online. The AKC officially recognized the Picard in 2015."}]