[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Do Anatolian Shepherds bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Because of their long history as livestock guardians, Anatolian Shepherds do tend to bark, especially when they perceive a threat to their flock or home."}}, {"@type": "Question", "name": "Are Kangal dogs and Anatolian Shepherds the same?", "acceptedAnswer": {"@type": "Answer", "text": "At first glance, it’s easy to confuse a Kangal dog and an Anatolian Shepherd, as they have many similar characteristics. However, the Kangal dog is slightly larger and has a longer coat. And while both were bred as independent livestock guardians, Kangal dogs are known to be more affectionate toward their families, while Anatolian Shepherds tend to prefer their independence."}}, {"@type": "Question", "name": "How big do Anatolian Shepherds get?", "acceptedAnswer": {"@type": "Answer", "text": "Adult males can weigh 110-150 pounds and stand an average of 29 inches. Female Anatolian Shepherds average 80-120 pounds and grow to be 27 inches tall. Featured Image: iStock/irinaorel"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Anatolian Shepherd", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/anatolian-shepherd.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/anatolian-shepherd.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Anatolian Shepherd", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/anatolian-shepherd"}, "datePublished": "February 8, 2023", "dateModified": "October 13, 2023", "description": "Anatolian Shepherds are large dogs that have worked as flock guardians for thousands of years. Because of their independent nature and imposing size, Anatolian Shepherd puppies need the right family to thrive. Learn more about caring for the breed.", "articleBody": "Ancestors of today’s Anatolian Shepherds are some of the oldest domestic canine bloodlines known, dating back thousands of years, according to the Anatolian Shepherd Dog Club of America (ASDCA). Originally bred in Turkey as livestock guardians, Anatolian Shepherd dogs made their way to the U.S. in the 1950s. Their ability to protect livestock has made them a highly sought-after working breed, and Anatolian Shepherds have even been employed to protect endangered cheetahs in Namibia, Africa. With males weighing 110-150 pounds and standing an average of 29 inches, and females 80-120 pounds and 27 inches, the Anatolian Shepherd’s size can easily intimidate threats to their flock. Bred for their ability to independently guard livestock, this hardworking breed is loyal to both their families and flock. Caring for an Anatolian Shepherd The Anatolian Shepherd’s ability to independently guard livestock makes them highly valuable as working dogs; however, in urban life this translates to a breed that can be difficult to keep happy. While they don’t require excessive activity and outdoor playtime in a securely fenced-in yard is typically sufficient, Anatolian Shepherds are naturally wary of strangers, and their independent nature can make training a challenge. Because of this, the dogs need an experienced pet parent to guide and socialize them. They require a family that understands the traits of the breed and can manage the responsibility that comes with them. Anatolian Shepherd Health Issues  Anatolian Shepherds are generally healthy and hardy, but reputable breeders should screen for certain growth and eye disorders. Growth Disorders Elbow dysplasia and hip dysplasia occur when the bones of the elbow or hip joints do not align appropriately. This causes rubbing and grinding of the bones that, over time, results in joint deterioration and loss of function. Elbow and hip dysplasia can be hereditary conditions in Anatolian Shepherds, but the conditions can also be exacerbated by contributing factors such as exercise habits, weight, and nutrition. Treatment varies depending on severity. Entropion Anatolian Shepherds can be predisposed to an eye disorder called entropion, which is when the eyelid grows inward and causes the eyelashes to rub against the eye’s surface. In most cases, veterinarians can easily diagnose and treat the dog with surgical intervention. Sensitivity to Anesthesia While Anatolian Shepherds can undergo anesthetic procedures such as spay/neuter surgery or dental cleanings, they can be more sensitive to anesthesia than other breeds. This means it can sometimes take longer for them to recover from anesthesia, and your veterinarian will be mindful of this and closely monitor your dog when anesthesia is used. Gastric Dilatation and Volvulus Gastric dilatation and volvulus (GDV) is a severe form of bloat in dogs that can affect any deep-chested breed, including Anatolian Shepherds. Gastric dilatation or bloat typically happen when a large amount of food and gas in the stomach, such as after a big meal, prevents the stomach’s normal outflow. The increase in pressure from the gas builds up, causing the stomach to expand and putting pressure on the diaphragm. This impedes normal breathing and prevents major veins from returning blood flow to the heart. Decreased blood flow causes a loss of blood to the stomach and, when combined with the high pressure from within, can lead to rupture. It&#039;s important to know when your Anatolian Shepherd may be showing signs of GDV, as this can be a life-threatening condition. Seek immediate veterinary care if any of these signs are noted: Distended abdomen Retching without producing vomit General signs of abdominal pain, such as standing and stretching or drooling What To Feed an Anatolian Shepherd Selecting the best diet for an Anatolian Shepherd comes down to the needs of the individual dog. While it’s always important to select a diet with high-quality ingredients, it’s best to discuss this with your dog’s veterinarian, as they can make recommendations based on your pup’s specific medical history. In general, Anatolian Shepherds do well on a large-breed diet formulated for their current life stage; Anatolian Shepherd puppies should be fed a large-breed puppy food before transitioning to an adult formula. How To Feed an Anatolian Shepherd Anatolian Shepherds are deep-chested dogs, meaning they can be susceptible to GDV or bloat. To help prevent this life-threatening condition, feed your Anatolian Shepherd at least two or three small meals throughout the day and avoid exercise around mealtimes. How Much Should You Feed an Anatolian Shepherd? Adult Anatolian Shepherds can weigh between 80-150 pounds, which means the amount of food they require daily can vary. It’s helpful to follow the instructions on your dog food bag, which has recommended portion sizes for your pup based on their weight. Nutritional Tips for Anatolian Shepherds For Anatolian Shepherds that have growth disorders affecting their joints such as hip or elbow dysplasia, it’s beneficial to give them nutritional supplements with glucosamine and chondroitin to help keep their joints healthy. Omega-3 supplements also aid in protecting joint health, and keep their skin and coat healthy.  Behavior and Training Tips for Anatolian Shepherds Anatolian Shepherd Personality and Temperament Anatolian Shepherd dogs are generally quite calm and subdued, but they won’t hesitate to leap into action if they perceive a threat to their family or flock. Their instinctive nature to protect their loved ones makes them good dogs in families with older children who understand how to interact with dogs. However, Anatolian Shepherds might be best in homes without smaller children, who can easily be knocked down by an accidental bump from a 150-pound dog. When Anatolian Shepherd puppies are introduced at a young age, they typically get along well with other pets. Anatolian Shepherd Behavior Anatolian Shepherds were bred for thousands of years to be guardians. This means they tend to bark— especially if they perceive a threat toward their home or territory. Close-by neighbors might not appreciate this behavior, so Anatolian Shepherds won’t make the best options for families with shared walls. Anatolian Shepherd Training Anatolian Shepherds were originally bred to independently guard a flock, and that independent personality has persisted over time. Their need for independence often comes off as stubbornness, and it can make training challenging. But as with all breeds, consistency and positive reinforcement provide the best outcomes. Anatolian Shepherd puppies need early socialization with many different people, places, and animals when they’re young, so they don’t grow up thinking every new experience is a threat.   Fun Activities for Anatolian Shepherds  Working on farms Walking Water sports and swimming Anatolian Shepherd Grooming Guide  Anatolian Shepherds have a short—but thick—double coat designed to protect them as they work outdoors. Though they shed moderately all year, their coats are relatively low-maintenance. Coat Care  Anatolian Shepherds have an undercoat that sheds twice a year, and pet parents need to keep up with thorough brushing every few days to remove dead hair. Outside of this biannual coat blowing, their short outer coat is smooth and only requires weekly brushing for maintenance.  Eye Care Though Anatolian Shepherd puppies can be born with entropion, a genetic eye condition, they are not typically prone to tear stains or other eye issues. If you notice excessive tearing, eye discharge, or redness, take your pup to the veterinarian, as these can all be signs of entropion. Ear Care Routine cleaning with a veterinarian-approved ear cleanser is important for maintaining your Anatolian Shepherd’s healthy ear canals. This should also be done any time your dog has been in water, such as after swimming or bathing. Considerations for Pet Parents The breed&#039;s long lineage as livestock guardians can make living with an Anatolian Shepherd challenging for pet parents who don’t know what they are getting into. These dogs do best in experienced homes with families that are prepared for the responsibility of owning this large, independent, and protective breed. Early socialization is key to help prevent an Anatolian Shepherd puppy from thinking everything new is a threat. And while Anatolian Shepherds are not often found excelling in obedience championships because of their desire for independent thinking, with patience and routine they can be very well-mannered companions."}]