[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Parson Jack Russell Terrier a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "The Parson Jack Russell Terrier is a wonderful pet for the active family when socialized early in life to other dogs and children. Children should be taught how to handle and behave around dogs. The Parson Jack Russel Terrier’s high energy means exercise is a requirement for a well-behaved dog."}}, {"@type": "Question", "name": "Are Parson Jack Russell Terriers smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "The Parson Jack Russell Terrier is an intelligent breed. Positive reinforcement training is very effective, although some individuals can be stubborn. "}}, {"@type": "Question", "name": "Is a Parson Jack Russell a good dog for kids?", "acceptedAnswer": {"@type": "Answer", "text": "The Jack Russell can be a good dog around children if socialized around them at an early age. But remember that every dog is an individual, and individual temperaments should be taken into account. The child should also be instructed on how to properly handle dogs and how to behave around them. Children should always be supervised around dogs, no matter the breed. "}}, {"@type": "Question", "name": "What does the name &quot;Jack Russell Terrier&quot; mean?", "acceptedAnswer": {"@type": "Answer", "text": "The name “Jack Russell” is named after Reverend John Russell, who bred some of the earliest terriers in this line for fox hunting. Their hunting job was to bring the fox out of its hole with their sharp bark."}}, {"@type": "Question", "name": "What’s the difference between Jack Russell Terriers, Parson Russell Terriers, and Russell Terriers?", "acceptedAnswer": {"@type": "Answer", "text": "Though you might hear three different names, there are only two distinct dog breeds. The Jack Russell Terrier and the Parson Russell Terrier are the same breed—the dogs were first called Jack Russells, but the name was changed by the American Kennel Club to Parson Russell Terrier. Despite this, it’s still common for Parsons to be called Jack Russell Terriers or Parson Jack Russell Terriers. The Russell Terrier is a related breed that broke off from the line and became its own dog. Though the dogs look nearly identical, the Russell Terrier is slightly smaller than the Parson and has shorter legs. Featured Image: iStock/Maksym Belchenko"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Parson Jack Russell Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/parson-jack-russell-terrier.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/parson-jack-russell-terrier.jpg"}, "author": {"@type": "Person", "name": "Virginia LaMon, DVM", "url": "https://www.petmd.com/author/dr-virginia-lamon"}, "keywords": "Breed, Dog, Parson Jack Russell Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/parson-jack-russell-terrier"}, "datePublished": "October 17, 2022", "dateModified": "October 13, 2023", "description": "Parson Russell Terriers, also called Jack Russell Terriers, are a small but highly energetic dog breed. Learn more about living with Parson Jack Russell Terriers.", "articleBody": "The Parson Russell Terrier, also called the Jack Russell Terrier or Parson Jack Russell Terrier, was originally developed in England during the mid-1800s to assist hounds in fox hunting. This compact little dog ranges in height from 12-15 inches at the shoulder and typically weighs between 13-17 pounds. They are bred with a nearly inexhaustible energy and remarkable intelligence. Caring for the Parson Jack Russell Terrier When socialized around children early on, the highly energetic Parson Jack Russell Terrier is a good dog for an active family. And while this breed requires extensive exercise, the Jack Russell Terrier does not need a lot of grooming care due to their short coat. Parson Jack Russell Health Issues The Parson Russell Terrier is generally a healthy breed, but they are predisposed to a few health conditions. Patellar Luxation The patella (or “kneecap”) is a small bone that normally sits in a groove within the femur at the knee. In dogs with patellar luxation, the patella moves (or “luxates”) outside of its assigned groove when the knee is flexed. This inappropriate movement can cause discomfort and may lead to arthritis.  Eye Conditions The Parson Jack Russell Terrier is predisposed to several types of eye problems, including some that can cause blindness and pain if not treated quickly. If a pet is squinting, rubbing his eyes, has red eyes, or has discharge, they should be seen by a veterinarian right away. Primary Lens Luxation: Primary lens luxation (PLL) is a hereditary condition seen in some lines of Parson Jack Russell Terriers. PLL occurs when the ligaments that hold the eye lens in place break down. This causes the lens to fall out of position, which can be painful and may lead to secondary glaucoma. Surgical removal may be recommended to control pain. Genetic testing for PLL is available.Glaucoma: Glaucoma is a painful condition that causes increased pressure within the eye. This can occur without an obvious cause (primary glaucoma) or due to a cause such as cataracts or lens luxation (secondary glaucoma). The most common signs of glaucoma are pain (squinting), discharge from the eye, lethargy, bulging eyes, or a cloudy/bluish color of the eye. If not treated quickly, blindness may occur.Cataracts: Cataracts are another common eye disease seen in Parson Russell Terriers. In most cases, the condition develops in older dogs as proteins and fibers in the lens of the eye break down, causing an opacity of the lens. This leads to blurred vision, which can progress to blindness. In most cases, this is an inherited condition, but cataracts can also be seen with diabetes mellitus or injuries to the lens.Dental Disease Dental disease is one of the most common conditions seen in dogs as they age, especially in small breeds like the Parson Russell Terrier. Bacterial tartar and plaque lead to inflammation of the tissues around the teeth and eventually to tooth and bone decay. The best way to prevent dental disease is with daily tooth brushing using a dog-specific toothpaste. Routine dental cleanings are recommended for your Jack Russell Terrier to evaluate the mouth, remove plaque and tartar, polish teeth to prevent future build up, and treat or extract teeth that are significantly unhealthy. Pulmonic Stenosis Pulmonic stenosis is a congenital disorder found in Parson Jack Russell Terriers. A heart murmur is almost always present with pulmonic stenosis. This heart defect occurs when there is an abnormal valve between the right ventricle and the pulmonary artery that causes an obstruction of blood flow from the heart to the lungs. What To Feed a Parson Jack Russell Terrier Feeding an Association of American Feed Control Officials (AAFCO)-compliant commercial kibble or wet food is a good way to make sure that the Parson Russell Terrier receives a complete and balanced diet.  Parson Jack Russell Terrier puppies should be fed a diet formulated specifically for puppies or designated for “all life stages.” For adults, dental-focused diets may be recommended by your veterinarian to help prevent dental disease. A light or diet meal may be recommended for a heavier dog to maintain a healthy body condition and weight. How To Feed a Parson Jack Russell Terrier The Parson Jack Russell Terrier is a highly energetic breed, but care needs to be taken to ensure that they don’t become overweight. Weight concerns can be addressed by feeding two to three small, measured meals per day. Some terriers may require a light or diet food. Consult your veterinarian on the best way to feed your Jack Russell. How Much Should You Feed a Parson Jack Russell Terrier Just like humans, the recommended caloric intake required varies between individuals due to differences in physical size, metabolism, neuter status, and activity level. The best way to determine the feeding quantity is to talk with your veterinarian, who can calculate caloric needs for the individual. Additionally, the feeding guide labels on your dog food provides valuable information. Nutritional Tips for the Parson Jack Russell Terrier Jack Russel Terriers may benefit from the addition of omega-3 fatty acids into their diets. Omega-3 fatty acids can be found in skin and joint supplements, fish oil, and even in some specially formulated dog foods. These fatty acids act as natural anti-inflammatories that help to support your dog’s skin, coat, kidneys, joints, and heart. Behavior and Training Tips for Parson Russell Terriers Parson Jack Russell Terrier Personality and Temperament The Jack Russell Terrier has almost as much personality as he has energy. This can present as a playful and clever dog who has a stubborn streak during training. They may be excessive barkers if their energy is not expended regularly, and they may also dig in the yard if not stimulated and exercised.  Some Jack Russell Terriers have a high prey drive, which could make them difficult to walk for a child or unsteady adult because they may bolt at the sight of smaller animals in the neighborhood, including cats. No matter what dog breed you have, it’s always important to microchip your pet in case they wander off. Parson Jack Russell Terrier Behavior The high-energy Jack Russell Terrier needs to expend a lot of energy—or he may become an excessive barker or digger. Pent-up energy can also present as anxiety. With appropriate socialization and training, the Jack Russell is a confident and entertaining pet. But because of their hunting roots, some Jack Russells also have a high prey drive and love to give chase. Parson Jack Russell Terrier Training Jack Russell Terriers should begin obedience training and socialization at an early age, and they should be exposed to children and other dogs in a supervised setting early as well. As such an intelligent breed, they may get bored with standard training. Positive reinforcement and training games will help keep them interested.  In addition to training, sports and exercise will help with behavioral concerns by keeping their minds active and their bodies tired. Some can be stubborn in training, so pet parents need to have patience. Fun Activities for Jack Russell Terriers Agility Flyball Obedience training Hiking Nose work Parson Jack Russell Terrier Grooming Guide While Jack Russel Terriers have three coat types—smooth, rough, and broken—they have minimal grooming needs and are mild to moderate shedders. Skin Care The Parson Jack Russell Terrier should be bathed every two to four weeks with a gentle, dog-specific shampoo. Coat Care Weekly brushing with a soft brush will help prevent excessive shedding.  A stripping comb can be used to remove dead hair if your Parson Jack Russell has a rough coat. Eye Care No special eye-related grooming care is necessary for this breed. However, if squinting or ocular discharge is noted, contact your veterinarian. These can be signs of more serious eye conditions. Ear Care Cleaning the ears every two weeks for maintenance helps to prevent ear infections. Considerations for Pet Parents The Parson Russell Terrier makes an extraordinary pet when given proper care, exercise, and early socialization. Due to their high energy levels, they need a lot of exercise. If their energy is not expended, you’ll be dealing with excessive barking, digging, or anxiety. Additionally, Parson Russell Terriers should be extensively socialized around other dogs and children, ideally at an early age. Due to their history as a hunting breed, some individuals may have a high prey drive. They have minimal grooming needs and are generally healthy."}]