[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Chesapeake Bay Retrievers good house dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Chesapeake Bay Retrievers are loyal companions and an excellent addition to an active family. They are good house dogs, but will become destructive and mischievous if they’re not stimulated properly or if they’re left alone for too long. "}}, {"@type": "Question", "name": "What dogs were bred to make a Chesapeake Bay Retriever?", "acceptedAnswer": {"@type": "Answer", "text": "Chessies can trace their roots to the now-extinct St. John’s Newfoundland dogs, Irish Water Spaniels, English Otter Hounds, Coon dogs, and Bloodhounds, according to Susan Elnicki Wade, author of A Tale of Two Chesapeake Bay Retrievers. "}}, {"@type": "Question", "name": "What’s the difference between a Lab and a Chesapeake Bay Retriever?", "acceptedAnswer": {"@type": "Answer", "text": "While the two retrievers share similarities, Chesapeake Bay Retrievers and Labrador Retrievers differ in many ways. Chessies aren’t as happy-go-lucky as Labs, who will love everyone they meet. Labs are more beginner-friendly, while Chesapeake Bay Retrievers are better suited for more experienced dog parents. "}}, {"@type": "Question", "name": "What are the colors of a Chesapeake Bay Retriever?", "acceptedAnswer": {"@type": "Answer", "text": "Chesapeake Bay Retriever colors vary from tans to browns. Officially, they can be “deadgrass,” “dark deadgrass,” brown, tan, sedge, “light deadgrass,” light brown, and dark brown.  Featured Image: iStock/ktatarka"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chesapeake Bay Retriever", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/chesapeake-bay-retriever_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/chesapeake-bay-retriever_0.jpg"}, "author": {"@type": "Person", "name": "Zack Newman", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Chesapeake Bay Retriever", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/chesapeake-bay-retriever"}, "datePublished": "June 24, 2023", "dateModified": "October 13, 2023", "description": "As the state dog of Maryland, the Chesapeake Bay Retriever was bred to work and swim in the frigid waters they were named for. These are serious working dogs, though they can also be goofy family pets. Learn more about caring for Chesapeake Bay Retriever puppies and dogs.", "articleBody": "Chesapeake Bay Retrievers, affectionately known as “Chessies,” are powerful dogs that allegedly trace their roots to an English shipwreck in the early 1800s. This state dog of Maryland was bred to help their humans hunt ducks and other birds along the iconic body of water for which the breed is named.  These smart pups have a gorgeous coat and stand 21–26 inches tall, weighing 55–80 pounds. Caring for a Chesapeake Bay Retriever Chesapeake Bay Retrievers are high-energy working dogs best suited for long days hunting waterfowl near iced-over bodies of water. They are relatively low-maintenance outside of needing regular brushing, but pet parents should be dedicated to providing constant exercise and stimulation.  Chesapeake Bay Retriever Health Issues Chesapeake dogs are generally healthy, but they do have a few health concerns. Many of the more serious conditions can be identified through genetic testing of both your Chesapeake Bay Retriever puppy and their dog parents. Gastric Dilatation-Volvulus (GDV) Chessies are at a special risk for gastric torsion because of their deep and narrow chests. This happens when a dog’s stomach bloats, twists, and cuts off blood to the stomach and spleen.  GDV is a medical emergency and can kill a pet in as little as 30 minutes if left untreated. If you have a deep-chested dog like the Chesapeake Bay Retriever, stay alert for signs of bloat, which include:  Restlessness Pacing Drooling Retching Distended stomach Stretching the body in a “downward dog” or “praying mantis” position Again, if these symptoms are present, take your pet to the vet immediately. Hip Dysplasia Hip dysplasia stems from the loosening of the hip joints, which can cause immense pain and eventually lead to arthritis. Warning signs can include an inability to get in and out of cars, limping, and lameness. Hip dysplasia can be managed with medication and joint supplements, but surgery may be recommended in severe cases. Progressive Retinal Atrophy (PRA) PRA causes cells in the eyes to eventually disintegrate, usually starting around ages 8–9 in Chesapeake Bay dogs, according to the Chesapeake Bay Retriever Club (CBRC). It eventually leads to blindness, and there is no cure. If you notice early warning signs, such as your dog’s inability to see in low light or at night, take them to the vet for a checkup.  Cataracts Another eye issue Chessies can develop is cataracts. While cataracts can develop as part of PRA, they can also occur outside of that degenerative condition. Cataracts also commonly occur in diabetic dogs. Cataracts are when the eye becomes cloudy, leading to vision loss. But unlike PRA, cataracts can be cured with surgery. Exercise-Induced Collapse While elevating their heart rate, some dogs can suddenly experience muscle weakness and wobbly hind legs. This neuromuscular condition can cause Chessies to collapse, according to the CBRC, but most dogs usually recover fully in 15–30 minutes. If your dog experiences an episode of collapse, they should be seen by their veterinarian for an exam as soon as possible. What To Feed a Chesapeake Bay Retriever Like all dogs, Chesapeake Bay Retrievers need to eat dog food approved by the Association of American Feed Control Officials (AAFCO). This ensures they are getting a well-balanced, nutritious diet.  How To Feed a Chesapeake Bay Retriever Chesapeake Bay Retriever puppies should eat at least three times a day on a consistent schedule. Once they reach adulthood, Chessies can cut down their mealtimes to twice a day.  Because Chesapeake dogs have a risk of GDV, follow these tips to prevent this life-threatening condition: Avoid using raised food bowls Feed your dog multiple meals a day instead of one big meal Introduce a slow feeder bowl if your dog is eating too quickly Do not let your dog exercise directly before or after eating How Much Should You Feed a Chesapeake Bay Retriever? The amount of food your dog needs depends on their size, lifestyle, and health history. While the dog food packaging can provide guidance on portions, talking with your vet about how much to feed your dog is best. Monitor your Chesapeake dog’s weight. If they are gaining weight and still quite active, food intake should be reduced to ward off obesity.   Nutritional Tips for Chesapeake Bay Retrievers  Chessies may benefit from supplements to help with joint pain such as hip dysplasia. Glucosamine helps protect joint cartilage. Fish oils, known as omega-3s, can assist with coat health, too.  Check with your veterinarian for what supplements (if any) would be best for your dog.  Behavior and Training Tips for Chesapeake Bay Retrievers Chesapeake Bay Retriever Personality and Temperament Chesapeake Bay dogs are high-energy and spunky. These pups are known to be independent thinkers that view themselves as an equal part of the family. They are loyal, often following you from room to room, and are extremely affectionate. With proper introductions and socialization, Chessies would be a great addition to a family. But remember: Interactions between kids and all dogs, Chessie or not, should be supervised.  Chesapeake Bay Retriever Behavior Chesapeake Bay Retrievers have a bright and cheerful disposition, according to the Chesapeake Bay Retriever Relief &amp; Rescue. They tend to be quite goofy and have earned the moniker “Brown Clown.”  Chessies thrive when they have a job to do. In fact, they’re often used on jobs within drug enforcement agencies, hospitals, and nursing homes. While putting your Chessie on a job would help keep them happy, a job isn’t necessary as long as you stick to a robust exercise plan and keep your pup mentally stimulated. Chesapeake Bay Retriever Training Chesapeake Bay Retrievers are smart dogs who need to be kept stimulated and busy. If they’re bored, they can become destructive. A good way to keep your pup busy is through training.  These dogs need consistent positive reinforcement training. Because they’re so smart, they’re quick to pick up basic cues and thrive when learning special skills, like how to seek out waterfowl in frigid water. If you’re looking for a hunting dog, the Chessie is a great option. Fun Activities for Chesapeake Bay Retrievers Running  Swimming Hunting  Fetch Dock diving Hiking Chesapeake Bay Retriever Grooming Guide  The Chessie’s nearly waterproof coat requires regular brushing, especially near the spring when they shed more frequently. But overall, Chesapeake Bay dogs are hardy pups, and most of their issues can be tackled with routine basic care.  Skin Care The Chessie’s skin needs its natural oils to be healthy and water-resistant. These dogs only need to be bathed every couple of months—or when they’ve spent a lot of time outside and are starting to smell. Coat Care Chesapeake Bay Retrievers have a unique coat that is thick and water-resistant. The wavy outer coat conceals a dense, wooly undercoat within. They need to be brushed weekly, and a slicker brush is a go-to for smoothing matted fur.  Eye Care Because the Chesapeake Bay Retriever is prone to PRA and cataracts, the CBRC recommends regular eye screenings. Reputable breeders will do genetic testing on their puppies, but if you get your dog from a Chesapeake Bay Retriever rescue, you may need to have a genetic screening done for them.  Ear Care Chessies need their ears cleaned routinely, especially if they are doing what they are bred to do—swim constantly! If their ears aren’t kept clean and dry, debris can cause ear infections. Warning signs of an infection include lots of head shaking, odor, or frequently touching their ears.  Considerations for Pet Parents A perfect home for a Chesapeake Bay Retriever is dedicated to fitness, training, and keeping busy. A Chessie would flourish somewhere they can consistently swim or run with their humans, which would help take the edge off their bountiful energy. While they thrive as hunting dogs, they don’t need to be in a family of hunters as long as there are plenty of other things to do. And while they have some required grooming like any other dog, Chessies are relatively low-maintenance pups. "}]