[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Manchester Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Manchester Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_manchester_terrier"}, "datePublished": "September 17, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Manchester Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Manchester Terriers are sleek, short-coated dogs with a black and mahogany coat. Compact and muscular, they are bred to kill vermin and course small game. There is a Toy variety as well as the Standard Terrier. Physical Characteristics This breed combines agility and power to track and kill vermin and small game. It is said that the raciest and the sleekest of terriers is the Manchester Terrier, with its compact, smooth, slightly long, and muscular body and an arched topline. The dog’s gait is effortless and free, while its expression is alert and keen. It has a very glossy and smooth coat. Personality and Temperament The Manchester Terrier shows a more responsive nature than other terriers and is a very well-mannered house dog (although some have been known to dig incessantly). As it is reserved with strangers, independent, impeccably clean, and sensitive, this terrier is often described as &quot;catlike.&quot; It shows utmost devotion to its family, and loves to sleep beside its favorite person. On other occasions, it is rambunctious, looking for a game or adventure Care Minimal coat care is required for the Machester Terrier. It is an active and alert breed that should be led on moderate on-leash walks, off-lead outings in safe areas, or fun romp in the garden. Although it likes to spend the day in the yard, it should not be allowed to live outdoors and it needs a soft, warm bed. Health Although it does not suffer from any major health issues, the Manchester Terrier may be susceptible to minor problems like von Willebrand&#039;s Disease (vWD), hypothyroidism, and cardiomyopathy. Some other common health concerns include patellar luxation, Legg-Perthes disease, and progressive retinal atrophy (PRA). To idenitfy some these problems early, a veterinarian may advise DNA, eye, hip, and thyroid tests for this breed, which has an average lifespan of 15 to 16 years. History and Background It is essential to understand the background of the Black and Tan Terrier, one of the most proficient and popular terriers of 16th-century England, to learn about the Manchester Terrier. As a talented dispatcher of rats, the Black and Tan could perform this task in pits or along watercourses. During the age of industrialization, rat killing with Whippets, Black and Tans, and other dogs was a common sport, enjoyed by the working class in English towns. With this in mind, John Hulme, a dog fancier in Manchester, crossed the two breeds to create one that would be excellent in both chasing and dispatching rats. It resulted in a superior black and tan terrier that had a somewhat arched back. Other regions saw similar crosses, as this new variety was common there. However, the breed was more popular in Manchester. The name of Manchester Terrier, however, was disputed by many locals, as similar dogs had the same name in many parts of England. Therefore, the breed was mainly referred to as Black and Tan Terrier until 1860. In 1923, the name for the breed became official when the Manchester Terrier Club of America was formed. Always having a big size range, Toy and Standard Manchesters were displayed as two different breeds until 1959, even though inter-breeding was practiced. Soon the breed was reclassified as a single breed with two strains, thus making inter-breeding legitimate. Apart from size, the two varieties differ in cropping, which is allowed only in Standards."}]