[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Afghan Hound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/afghan_hound88.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/afghan_hound88.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Afghan Hound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_afghan_hound"}, "datePublished": "May 28, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Afghan Hound Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Dignified and aloof, the Afghan is an aristocrat among dogs. It is an excellent hunter, though mostly appreciated for its spectacular appearance and as a show dog. Physical Characteristics Covered with thick, silky hair, which comes in various colors, the Afghan Hound, in fact, resembles a greyhound in build and is known for its ability to chase fleet game and double-suspension gallop. Its high pelvis and a short back, meanwhile, allow the breed to turn easily and jump great heights, both must-have characteristics for a dog that originally chased game on rocky terrain. The Afghan Hound&#039;s big feet also offer it protection from injuries incurred from running on rough ground, while the silken coat is effective in beating cold. Moving with the tail and head held high, its expression is proud and dignified and its gait is bouncy and elastic. Personality and Temperament Although a slightly reserved and occasionally timid breed, the Afghan Hound loves to hunt and chase. However, an Afghan Hound can live happy life indoors. The breed is not rough with children (who love its clownish and happy temperament), but the dog may become moody at times and behave badly. Some might even say the Afghan Hound almost resembles a cat in its independent nature. Care This perfect house dog requires careful brushing and combing of its coat. Special care should be given at the time when the dog sheds its puppy coat. The Afghan Hound also requires daily exercise such as a long walk or a short sprint. In fact, this hound loves to run at a fast pace in small areas. Afghan Hound lovers should make it a point to provide the dog outdoor access and a nice, soft bed. Health The Afghan Hound, which has an average lifespan of 12 to 14 years, is not susceptible to any major health concerns. It should be noted that the breed can suffer from tail injuries and reacts to barbiturate anesthesia. Health ailments like canine hip dysplasia (CHD), cataract and necrotic myelopathy are also occasionally seen in the breed. To identify some of these issues, a veterinarian may run hip and eye exams on the dog. History and Background The Afghan Hound is an ancient breed. It belonged to the Middle Eastern sighthounds, and its ancestors date back to the time of the Egyptian pharaohs. Initially, the breed was used a coursing hound by nomadic tribes to hunt for meat and hare, with the help of falcons, who swooped down at the prey. Gradually, after several generations on the mountainous lands of Afghanistan, the Afghan Hound developed into a nimble, swift dog with great stamina and leaping ability. For centuries, the breed was isolated in the Afghan Mountains and was first brought to England during the first half of the 20th century. These dogs were originally referred to as Barukhzy Hounds or Persian Greyhounds. Diverse in nature, it was the Zardin variety that eventually became the most favored. The breed quickly became the prize of the glamor world, and soon became popular in other circles, such as dog shows. The Afghan Hound reach the apex of its popularity in the 1970s, but still well known throughout the world. SaveSave"}]