[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bearded Collie", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Bearded Collie", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_bearded_collie"}, "datePublished": "November 14, 2008", "dateModified": "October 13, 2023", "description": "Learn everything about Bearded Collie Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Lovingly referred to as the Beardie, the Bearded Collie is an intelligent, curious-looking dog breed that loves to play with children. Thought to be originally from Britain, it later spent some time in Scotland as a sheep and cattle herder before coming to America. The Bearded Collie is now mostly bred for dog shows, though it makes an excellent family companion. Physical Characteristics The Bearded Collie has a sturdy medium-sized body. Its long, lean body provides it both power and agility, essential qualities in a sheep herding dog. Besides its ability to make smooth, quick movements, the Bearded Collie possesses a double coat, which is soft and furry underneath with a straight, flat, and coarse outer coat. This outer coat comes in either black, blue, brown, or fawn, with or without white markings. Its facial expression is both bright and keen. Personality and Temperament The Bearded Collie is extremely smart, cheerful, playful, and always active. Full of enthusiasm and energy, the dog is obedient in nature and prefers to spend time with people. It can have an independent attitude at times, but loves playing with children; and although it can become too boisterous with children, it is never intentionally aggressive. Otherwise, the Bearded Collie is pleasant to live with. Care Although the Bearded Collie can live outside in cool climates, it prefers to remain indoors with its master and family. Walking and playing sessions are recommended for keeping the dog in optimum form, and herding is its favorite activity. The Bearded Collie should be combed and brushed regularly to keep its coat lustrous and tangle free. Health With a lifespan of about 12 to 14 years, the Bearded Collie is susceptible to some minor health problems, including colonic disease, canine hip dysplasia (CHD), hypoadrenocorticism, pemphigus, and epilepsy. Other diseases that can be occasionally seen in the breed are cataracts, progressive retinal atrophy (PRA), von Willebrand&#039;s disease (vWD), and persistent pupillary membrane. To identify some of these issues, a veterinarian may run thyroid, hip, and eye exams on the dog. History and Background Occasionally referred to as the Highland Collie, the Mountain Collie, or simply Beardie, the Bearded Collie is one of Britain&#039;s oldest breeds. Its origins are thought to date back to the early 1600s, with a relation to the Polish Lowland Sheepdog breed. The earliest known picture of the Bearded Collie, however, was not until 1771, when a dog of similar appearance was placed in a portrait with the Duke of Buccleuch. A description of the breed was later published in an 1818 edition of Livestock Journal. The dog proved to be an excellent sheep and cattle herder, both in the rough terrain of England and in Scotland. It was only afterwards, during the Victorian era, that the Bearded Collie came to be regarded as a popular show dog. This occurred when the two breeds of the Highland strain with gray and white coats, and the brown and white way coat Border strains were crossbred to form a single breed. The Bearded Collie was introduced to the United States in the late 1950s, and by July 1969, the Bearded Collie Club of America was founded. The breed became eligible to be shown in the American Kennel Club&#039;s (AKC) Miscellaneous Class in 1977 and was given full status as part of the AKC&#039;s Herding Group in 1983."}]