[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chinook", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-chinook-dog_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-chinook-dog_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Chinook", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_chinook"}, "datePublished": "September 17, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Chinook Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Recognized as the official state dog of New Hampshire, the Chinook was developed to be the perfect sled and working dog. Now popular as a family dog, the Chinook is a friendly and smart large breed. Physical Characteristics The Chinook can weigh anywhere from 55 to 90 pounds and stands at a height of 21 to 27 inches. This breed is very muscular, with a long snout and pointed ears. The coat is a tawny color, ranging from a light tan to a deeper reddish coloring with black markings at the end of the snout, around the eyes, and inside the ears. Personality and Temperament This breed is known as a kind and friendly dog that is good with people and other animals. Although large, the Chinook is not aggressive and has even been known to be shy at times. Originally bred as a weight-bearing sled dog, the Chinook is very intelligent. Care The coat of a Chinook requires little grooming, but because of its thickness it does shed, so a daily brushing may help to keep the shedding manageable. It requires moderate exercise and is a good family pet. Health There are no breed-specific health problems associated with the Chinook. However, common hereditary problems can occur, such as hip dysplasia, epilepsy, and atopy. Chinooks live an estimated lifespan of about 10 to 15 years. History and Background The Chinook dog breed can be traced back to one ancestor — a puppy that was born into a litter of three in 1917 and that was aptly named &quot;Chinook.&quot; Arthur Walden of Wonalancet, New Hampshire is credited with the first &quot;Chinook.&quot; That first puppy was a combination of a Mastiff, Saint Bernard type on the father’s side, and a Greenland Husky on the mother’s side. Chinook grew into a dog that was powerful and intelligent enough to lead a team of sled dogs — the Perry North Pole Team — and friendly and gentle enough with children to be a good family dog. One of the things that made the original Chinook so interesting was that he did not resemble either of his parents, although his physical characteristics would be passed on to his offspring. Eventually the Chinook breed would become known for its immense size and strength, as well as its stealthy speed. In fact, most Chinooks were used as sled dogs, and were well regarded for their ability to carry heavier loads for further distances than other breeds. The core of the breeding stock would pass from Walden to Perry and Honey Greene, who promoted the dog breed for many years. However, in 1965, the Chinook was declared the rarest dog in the world by the Guinness Book of World Records. The Chinook breed eventually saw somewhat of a rebound in numbers as it spread to other countries around the world, and was recognized by the United Kennel Club in 1991. Featured Image: iStock.com/Robbie Ross"}]