[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sloughi", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-sloughi-dog_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-sloughi-dog_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Sloughi", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_sloughi"}, "datePublished": "September 17, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Sloughi Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Sometimes physically compared to a cheetah, this unique dog breed is built with natural agility and speed. The Sloughi is an ancient breed that originated somewhere in North Africa and spread to Europe and then America, though it is still a fairly rare breed in the United States. Physical Characteristics This medium-sized dog breed weighs anywhere from 50 to 65 pounds at a height of 24 to 29 inches. The Sloughi has a uniquely long head with floppy ears and has a short and smooth coat that comes in a range of colors — from a light cream color to a red fawn coloring or, less often, a nearly black color. Personality and Temperament The Sloughi has a unique personality that can sometimes be compared to a cat as it can seem detached and aloof. Although enthusiasts of this breed call the Sloughi a loving and loyal dog, this breed may do best as a one-person dog. The Sloughi can do well with children and other animals if it is socialized early enough. Care The Sloughi requires little grooming and a good amount of daily exercise with plenty of space to run. Health Considered a generally healthy dog breed, the Sloughi lives an average life span of 12 to 15 years. Health concerns with this breed include progressive retinal atrophy and sensitivity to vaccines, anesthesia and other medicines. History and Background The exact date and origin of the Sloughi is unknown; however, the dog breed is believed to have developed in North Africa in the thirteenth century if not earlier. One of two African Sighthound breeds, the Sloughi was used to hunt desert game such as foxes, deer, gazelles and more. The Sloughi reached Europe in the late nineteenth century and became popular in France. As with other dog breeds, the World Wars nearly brought extinction to the Sloughi. However, dedicated dog breeders were able to save, but not fully revive the Sloughi population. Although the Sloughi was introduced to the United States in 1973, it remains a relatively unpopular dog breed in America. Featured Image: iStock.com/AlenPopov"}]