[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Schnauzer a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Schnauzers thrive on family life. They are loyal and protective until they trust newcomers into their territory or around their loved ones. "}}, {"@type": "Question", "name": "Are Schnauzers smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Schnauzers are highly intelligent, inquisitive dogs. But this cleverness may also cause them to be stubborn and can get them into trouble if they become bored. "}}, {"@type": "Question", "name": "Do schnauzers need a lot of grooming?", "acceptedAnswer": {"@type": "Answer", "text": "Schnauzers require a moderate amount of grooming, with twice-weekly brushing and at least quarterly professional grooming appointments. Featured Image: Adobe/everydoghasastory"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Standard Schnauzer", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/standard-schnauzer.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/standard-schnauzer.jpeg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Breed, Standard Schnauzer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/standard-schnauzer"}, "datePublished": "October 14, 2022", "dateModified": "October 13, 2023", "description": "Standard Schnauzers are intelligent and fun-loving pets that can make great family dogs. Learn more about the health and care required for a Standard Schnauzer.", "articleBody": "The Standard Schnauzer originated in Germany in the Middle Ages, where the breed served as a ratter, hunter, and farm watch dog. The name is derived from the German word schnauze, which means snout and alludes to  the Schnauzer’s distinctive nose and beard. The Schnauzer was likely derived from cross-breeding Poodle and spitz breeds.  The Standard Schnauzer became popular on the dog show circuit around 1900, under their original breed name Wire-Haired Pinschers. This is when the first records of the dogs are noted in the U.S.; the American Kennel Club (AKC) first recognized the breed in 1904. Today, Standard Schnauzers are considered one of the leading all-around performance event dogs. They also are used as therapy, service, and rescue dogs. There are three types of Schnauzers: the Standard, Miniature, and Giant. Caring for the Standard Schnauzer These dogs have a compact, square-proportioned, stalky body with a stiff, wiry outer coat and pronounced bristly eyebrows, whiskers, and mustache. The Standard Schnauzer’s size is 18-19 inches tall, and the average Standard Schnauzer weight falls between 25-45 pounds. They commonly come in two colors: black or salt-and-pepper, though dark or silver-gray coats can also be seen. Their medium-length, wiry coats require a lot of grooming, including twice-weekly combing, quarterly trimming, and professional shaping. While show dogs typically see a groomer for stripping (a process where the fur is removed from the root instead of trimmed), a regular clipping is OK for Schnauzers who are family pets. Known to be energetic and intelligent, Standard Schnauzers are an easily trained and loyal breed—though they can be a bit stubborn. These smart pups bore easily and need to be kept busy with at least 30 minutes of activity every day so they don’t develop anxiety and become destructive. Standard Schnauzers enjoy playing at the park or in a fenced-in yard, working puzzle toys, and going on walks in a sturdy harness. This breed does best with patient, experienced pet parents. Standard Schnauzers don’t drool much, but they have a moderate tendency to dig and bark when they’re bored. To keep them on their best behavior, guide them with positive reinforcement training and make sure they’re well-socialized. Standard Schnauzers tend to be reserved around unfamiliar people and other animals, but they’re loyal, joyful, and devoted to their family, including other family pets and children.     Standard Schnauzer Health Issues The average Standard Schnauzer lifespan is 13-16 years, and the breed doesn’t suffer from any major health conditions. However, they can be susceptible to a few medical issues throughout their life. Canine Hip Dysplasia  Hip dysplasia is a deformity of the hip joint that occurs during growth, causing looseness in the joint. This will eventually lead to degenerative joint disease or osteoarthritis if left untreated. Most Standard Schnauzer breeders have their dogs tested for hip dysplasia before adopting out any Standard Schnauzer puppies. Hip dysplasia is not curable, but it can be treated with physical therapy, holistic methods, medications, and (in severe cases) total hip replacement. Cataracts  Cataracts are a cloudy lens in the eye. The lens focuses light to the retina, which then allows for vision. If this lens is opaque, vision is impaired. There are different types of cataracts, and many can be corrected with surgery by a veterinary ophthalmologist. Retinal Dysplasia  Also known as progressive retinal atrophy (PRA), this is an abnormal development of the retina. It’s normally diagnosed during breeding examinations or puppy examinations by the Canine Health Information Center, so your Standard Schnauzer puppy should be cleared before you bring them home. During PRA, cells of the retina degenerate over time, leading to blindness.  There is no treatment or cure, but the condition is not painful. Pulmonic Stenosis  This is a suspected inherited congenital heart defect that affects the pulmonic valve, which is between the heart’s right ventricle and pulmonary artery. Pulmonic stenosis can be mild to severe; some mild cases require no therapy while more severe cases may require a surgical balloon valvuloplasty to open the valve. Other cases can sometimes be stabilized with oral medications. If the condition is severe and left untreated, congestive heart failure may result. Hypothyroidism  Hypothyroidism is a condition where there’s an insufficient level of thyroid hormone in the bloodstream due to disease of the thyroid glands. It’s a common condition in all three Schnauzer sizes and is thought to have a genetic basis. This condition can cause weight gain, skin infections, hair loss, heat-seeking behavior, and lethargy. It’s typically treated with oral medication.   Hemophilia A  This is the most common inherited blood clotting disorder in dogs. It’s caused by a genetic mutation that prevents blood from clotting normally, causing mild to severe bleeding. There’s no cure for this condition, but treatments can be administered if bleeding is noted and/or if a surgical procedure is required to lessen the likelihood of bleeding. Bladder Stones  Bladder stones are stone-like mineral formations in the bladder. They can cause inflammation and even lead to urinary tract infections or blockages. Some types of bladder stones can be dissolved with diet changes or with medications that change the urine’s pH, but others require surgical removal via cystotomy. Follicular Dermatitis  This is a condition affecting the skin where the hair follicles become inflamed, typically due to bacteria, though it can be secondarily caused by allergies. This is a treatable condition, but—if caused by allergies—often incurable. What to Feed a Standard Schnauzer Adult Standard Schnauzers need a balanced diet with appropriate age specifications: puppy, adult, or geriatric. If they become overweight, caloric restriction and increasing activity is recommended. How to Feed a Standard Schnauzer  There are no breed-specific guidelines on feeding for Standard Schnauzers, though most puppies should be fed smaller meals three to four times a day. Adult dogs do well with a twice-daily feeding schedule. Some Schnauzers are known to eat too quickly. If you notice your dog scarfing down their food, feeding them with a slow feeder bowl or offering multiple small meals throughout the day can help avoid regurgitation, belly upset, or vomiting. How Much Should You Feed a Standard Schnauzer  Standard Schnauzer puppies grow quickly, which means it’s important to feed them high-calorie puppy food until they are about 1 year old to help them grow appropriately. Follow the feeding guidelines on the back of the bag of the puppy formula, based on their age and expected body weight. Your veterinarian can help guide you on how to add or remove food based on your puppy’s growth, weight, and lifestyle. Once a Standard Schnauzer turns 1, you can slowly transition them to an adult-formula diet that has fewer calories. Again, your veterinarian can guide you during this transition and at annual health exams, so your dog maintains healthy weight and food intake. Nutritional Tips for Standard Schnauzer  There are no specific recommended supplements for the Standard Schnauzer at this time. Daily probiotics, joint supplements containing glucosamine, chondroitin, and omega-3 fish oils can be considered for this breed. Behavior and Training Tips for the Standard Schnauzer Life is never boring with a Standard Schnauzer. They are fun-loving, energetic, and intelligent dogs that are social and thrive in a family environment, especially around children. Because of their guarding instincts, they are moderate barkers, though usually only to alert others around them of something they find concerning. Standard Schnauzers may bark when new people come to your home, but once they get to know these visitors, they quickly accept them.   Standard Schnauzer Behavior  This breed is high-energy, smart, quick to learn, and inquisitive, but Standard Schnauzers can get bored easily if they’re not exercised physically and mentally. They are constantly exploring new surroundings and require a moderate amount of exercise and mental games to keep them from destructive behavior, which they usually turn to out of boredom. If they don’t get enough exercise, they will exercise themselves—and likely in ways that you won’t appreciate, like running through the house, chasing children, and chewing up whatever’s on the floor. Standard Schnauzers prefer to be around their family rather than isolated in a kennel. Standard Schnauzers can also be territorial and watchful over their family and home. Pet parents will need to be patient and calm their pet’s worries about visitors with proper training and socialization. Standard Schnauzer Training Standard Schnauzers are clever but headstrong. As puppies they learn quickly, but they often use their intelligence to avoid obeying commands. Because of this, early socialization and training is necessary.  Training should begin at home as soon as your Standard Schnauzer puppy is 8 weeks old, and then include some type of socialization and puppy classes when they’re 10-12 weeks old (as long as your veterinarian approves this type of training, dependent on vaccine status and health of the dog).  This breed requires a patient, stable, and strong-willed trainer who can redirect misbehavior immediately (remember, Schnauzers can be bold and often mischievous). They tend to learn quickly with repeated consistent training, plenty of controlled exercise, and reward-based exercises involving food and games.  Fun Activities for Standard Schnauzers Long walks Games of fetch Puzzle toys Nose work Standard Schnauzer Grooming Guide The Standard Schnauzer’s coat is medium-length and wiry, with long mustache and eyebrow hairs that make them look like distinguished gentlemen. They have a double coat—a wiry outer coat and a dense, softer undercoat. Regular grooming is essential with twice-weekly brushing, monthly bathing, quarterly hair clipping, and nail trims and ear cleanings every one to two weeks. Standard Schnauzer shedding is minimal, which makes them a desired pet for many people.   Skin Care  Monthly bathing with oatmeal-based dog shampoos is recommended, depending on your pet’s health and lifestyle. Coat Care Twice-weekly brushing with a pin brush to help untangle and smooth out the fur works best for giving your Standard Schnauzer a shiny coat. The undercoat may also need to be professionally stripped a few times a year.  Eye Care  To obtain (and maintain!) the distinctive eyebrows of the Standard Schnauzer, take your dog to quarterly professional appointments with an experienced Schnauzer groomer.  Ear Care  Routine ear cleanings every one or two weeks are recommended as basic care for a Standard Schnauzer. Keeping the ears clean and dry will help prevent ear infections, but check them periodically for any odor, redness, or sensitivity. If any of this is present, contact your veterinarian for an exam. Considerations for Pet Parents If you’re looking for a dog breed that’s full of energy, loves their family, protects the children in their life, and loves exercise, you may have the perfect breed in a Standard Schnauzer. But remember: They can be stubborn and may push your boundaries, so a strong, patient pet parent is best for this breed.  "}]