[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a German Shepherd a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "German Shepherds are good with kids if they are appropriately trained and well socialized. It is equally as important that children are taught the appropriate ways to engage with dogs, including not occupying their space unless they ask first."}}, {"@type": "Question", "name": "Are German Shepherds smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "German Shepherds are very smart dogs. According to the American Kennel Club (AKC), German Shepherds are one of the 10 smartest breeds of dogs out there."}}, {"@type": "Question", "name": "What are the drawbacks of a German Shepherd?", "acceptedAnswer": {"@type": "Answer", "text": "German Shepherds are very active dogs that require having space and the ability to exercise them, which can be difficult in some living environments such as apartments or other smaller spaces. German Shepherds are also a big commitment. They require lots of socialization and training to become well-mannered and socialized adult dogs."}}, {"@type": "Question", "name": "Are German Shepherds aggressive?", "acceptedAnswer": {"@type": "Answer", "text": "German Shepherds are energetic and fiercely loyal dogs, among other wonderful traits. Their protectiveness can quickly transform into aggression if the situation arises—especially if they are not trained properly, handled correctly, or have not been well socialized. Featured Image: iStock.com/SashaFoxWalters"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "German Shepherd", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/german-shepherd.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/german-shepherd.jpeg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Breed, Zoo German Shepherd Dog Pack, German Shepherd", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/german-shepherd"}, "datePublished": "June 28, 2022", "dateModified": "October 13, 2023", "description": "German Shepherds are highly active—and highly shedding—companions. Learn more about caring for German Shepherd puppies and dogs.", "articleBody": "German Shepherds are large yet agile, muscular, highly intelligent, and loyal dogs. Today, the German Shepherd is one of the most popular dog breed in the United States. They are in the herding breed group, which means they are high-energy and love having a job or an outlet for regular exercise. They are known for their confidence, loyalty, and bravery, as well as their ability to thrive with expert levels of dog training and obedience. German Shepherds are commonly used as working dogs in the military and police for patrolling, bomb sniffing, and search and rescue. This large dog breed has an average weight ranging from 65–90 pounds. They are typically 22–26 inches tall with a life expectancy of 10–12 years. Caring for a German Shepherd German Shepherds are incredibly active dogs that require intense training and regular exercise to keep them out of trouble physically and mentally. They are best for active families and experienced pet parents. Socialization and consistent training will be essential when a German Shepherd is a puppy. This will help them to grow out of unruly behaviors such as nipping and jumping. German Shepherds have a double coat that sheds a lot. They will also typically go through a molting, which is a period of excessive shedding, one to two times a year. German Shepherd Health Issues While German Shepherds have a long life expectancy for a large breed dog, they are prone to several health problems. A trustworthy breeder will screen both male and female dogs being bred for health conditions such as degenerative myelopathy and hip and elbow dysplasia. German Shepherds commonly also get gastric dilation and volvulus (GDV), commonly known as bloat, as well as cancer, allergies, heart disease, and a few other conditions. Pet parents of German Shepherds should be highly educated on the symptoms to look for, as early detection is the key to a good prognosis for any serious condition. Degenerative Myelopathy Degenerative myelopathy is a neurologic disorder that affects the spinal cord, slowly causing paralysis of the back legs. Early signs of degenerative myelopathy include weakness in the hind end and difficulty standing up. Watch your dog carefully for signs of pain and discomfort that come on gradually rather than suddenly. Check their claws at least once a month to watch for signs of uneven wear which would indicate a subtle lameness.  There is no treatment for this condition, but physical therapy can help strengthen muscles and protect their ability to use their legs. While there is no cure, you can test for this condition using a DNA-based blood test submitted to the University of Florida or the University of Missouri. Elbow and Hip Dysplasia Elbow dysplasia is a degenerative joint disease that can cause lifelong pain in the front limbs. Hip dysplasia is another degenerative joint disease that affects the hind end. According to the Orthopedic Foundation of Animals, about 20% of German Shepherds have hip dysplasia. Clinical signs include limping, decreased range of motion, and other signs of pain—especially later in life, as arthritis sets in because of this disease process. The treatment for all degenerative joint diseases includes weight loss, reduced activity, joint protection supplements, anti-inflammatory and pain medications, or surgery. There is testing available, such as the PennHIP, that can predict your dog’s risk of having hip dysplasia during their lifetime.   Cancer Cancer can develop in German Shepherds at any age, but usually occurs later in life. Common cancers include hemangiosarcoma and bone, lung, and intestinal cancers. Hemangiosarcoma is a malignant tumor that is most often detected in blood-rich organs such as the spleen and the heart. The signs of hemangiosarcoma are usually related to internal bleeding, with symptoms such as weakness, white or pale gums, trouble breathing, a distended abdomen, and collapse. Other signs are usually nonspecific and indicate overall malaise, including lethargy, panting, anorexia, vomiting, diarrhea, or weight loss. Depending on the extent of the cancer, treatment plans can include chemotherapy, radiation, or surgery. Bloat (Gastric Dilation and Volvulus) Bloat, or gastric dilation and volvulus (GDV) is a sudden life-threatening condition when the stomach enlarges with gas (bloat) and then twists upon itself (GDV). This happens commonly in deep-chested, large-breed dogs such as German Shepherds. If you notice your dog’s stomach area enlarge quickly or they have abdominal pain (for example: whining with or without touching belly, stretching with front legs down/back legs up, reluctance to walk, not eating,), take them to the vet immediately. While bloat can sometimes be treated with aggressive medical intervention, a GDV does require emergency corrective surgery to save the dog’s life. To limit the risk of GDV, German Shepherds should wait at least 30 minutes to one hour after eating to resume exercising. Another way to help prevent your German Shepherd from developing a life-threatening GDV would be via gastropexy. This surgery is most successful when done at the same time the dog is spayed/neutered when young. A gastropexy permanently attaches the stomach to the inside body wall. This fixation of the stomach prevents the stomach from being able to twist upon itself. Allergies Allergies in German Shepherds can be first seen with symptoms such as itchy skin, skin infections, ear infections, or digestive upset such as vomiting, diarrhea, or weight loss.  A thorough medical history and physical examination, diagnostic testing of skin and ears, blood work, and fecal tests are warranted if you suspect that your dog has allergies. Allergies in dogs can be treated by avoiding the cause and the allergen and managing the symptoms that exist with diet therapy and medications. Heart Disease Heart disease, specifically DCM (dilated cardiomyopathy), valvular disease, and heart murmurs, can be common in German Shepherds. It’s important to have your dog’s heart evaluated during their yearly physical examination, usually by listening to the heart with a stethoscope and taking an x-ray of the chest, including the heart and lungs.    The treatment plan for a dog diagnosed with heart disease typically includes several medications that help increase the heart’s pumping ability and manage any arrhythmias. A special diet should also be considered to restrict sodium intake and to increase the amount of certain amino acids to promote heart health. Any changes to your dog’s diet should be discussed with your dog&#039;s primary veterinarian first, to ensure that it is safe for them to eat with their given medical condition. Dogs with significant heart disease should not be pushed to exercise beyond their limits. Exocrine Pancreatic Insufficiency (EPI) Exocrine pancreatic insufficiency (EPI) is a digestive health issue that occurs when the cells of the pancreas do not produce enzymes and hormones normally. The most common symptom is weight loss, despite your pet having a ravenous appetite. Other symptoms of EPI include soft stool or diarrhea; excessive gas; desire to eat feces and other unusual objects;  flaky skin; or rough coat. Unfortunately, there’s no cure for EPI in dogs. Once the pancreas is damaged to the point that symptoms of EPI develop, you must give your dog pancreatic enzyme supplements and other treatments for the rest of their life. Nevertheless, with proper management, your dog can still live a happy life with this condition. Pannus Pannus, or superficial keratitis, is an immune-mediated painful eye condition that can cause blindness if not managed properly. It occurs more often in dogs that live at high altitudes, those with increased exposure to UV light, and in areas with severe air pollution. Keeping dogs indoors during the sunniest part of the day, providing a doghouse shelter, or trying a specialty pair of doggie sunglasses like Rex Specs may prove very helpful in preventing this issue. Epilepsy/seizures, bleeding disorders, and immune-mediated disease are all relatively common in German Shepherds. Most of these conditions have a genetic component and can be avoid by good breeding and preventive screening practices. What to Feed a German Shepherd German Shepherds are considered the all-purpose working dog. They require a high-quality, age-appropriate diet to meet their nutritional needs. These diets are usually labeled puppy, adult, or senior. Any dog food that is labeled for “all life stages” should only be used for puppies, as they are not usually formulated for older dogs. It is highly recommended that all dogs eat an Association of American Feed Control Officials (AAFCO)-approved diet, which ensures that the ingredients meet established standards. Basic vitamins and mineral supplements are not needed if your dog’s food is AAFCO-approved. Offering table food and animal bones should be avoided, as they can cause stomach upset, vomiting, diarrhea, and anorexia, and they also have a much higher fat content than dog food. High-fat foods can also cause pancreatitis. How Much to Feed a German Shepherd In general, puppies should be fed 3–4 times per day and adult dogs should be fed twice a day. How much you feed is determined by the specific food your German Shepherd eats. You can ask your veterinarian, follow the package instructions, or contact the dog food manufacturer, as AAFCO-approved diets have veterinary nutritionists who help determine these requirements. There are some theories that German Shepherds that are fed smaller, more frequent meals have a lower incidence of bloat and stomach problems. How to Feed a German Shepherd  Although there is a genetic component, science shows that rapid long bone growth in puppies such as German Shepherds and other large- and giant-breed dogs contributes to development of joint and bone conditions. Rapid bone growth is suspected to be caused by overfeeding and calcium supplementation. German Shepherds that are fed free-choice or overfed are at higher risk of rapid bone growth. It’s recommended that large- and giant-breed dogs be switched from puppy to adult food when they are 12 to 18 months old, respectively. It’s important to consult with your dog’s veterinarian to calculate the proper amount of food to feed. Maintaining lean body weight will also help to decrease the rate of bone growth. Calcium supplements and adult dog foods rich in calcium should never be given to German Shepherd puppies under 6 months of age, as they cannot absorb calcium appropriately when they are that young. Conditions caused by rapid long bone growth and excess calcium supplementation can include: Hip and elbow dysplasia Osteochondrosis dissecans of the shoulder, knee, wrists, and ankles. This is improper growth and blood supply in a joint, which requires surgery to prevent osteoarthritis from developing. Hypertrophic osteodystrophy (HOD). This is inflammation of the bone under the growth plate; it can cause severe joint swelling, pain, fever, anorexia, lameness, and not wanting to move. Panosteitis. This is an inflammation of the long bones and associated blood vessels. Joint swelling is uncommon, but the symptoms are similar to HOD. Nutritional Tips for German Shepherd  A few dietary supplements might be considered for your German Shepherd. Joint Supplements Glucosamine, chondroitin, and MSM supplements are great to promote joint health. MSM has all-natural anti-inflammatory properties. Omega-3 fatty acids (high-quality fish oil) are thought to have anti-inflammatory properties as well when given at appropriate doses. Research shows that reducing inflammation helps to control pain associated with osteoarthritis, which is a common problem in dogs with joint issues. Probiotics Probiotics such as Purina Calming Care can be helpful not just for digestive issues, but with minor behavioral issues as well. Digestive enzymes come in powdered form to assist dogs who have pancreatic issues, such as German Shepherds with exocrine pancreatic insufficiency. Other vitamin and mineral supplements are generally not needed for healthy puppies and adults, as they get all they need from their AAFCO-approved diet daily. Behavior and Training Tips for German Shepherd German Shepherd Personality and Temperament  German Shepherds were initially bred to be herding and guard dogs. The breed is considered to be smart and easy to train. They are known to be gentle family dogs and loyal protectors of those they trust. This loyalty can make German Shepherds seem more standoffish around strangers. It does take them some time to gain the trust of other people and other pets. German Shepherds are a very active and athletic breed that require a ton of exercise for both their physical and mental health. Without exercise they will develop unfavorable behaviors, due to irritation and pent-up energy. Controlled leash walks and supervised free play in safe, fenced-in areas should be started when they are puppies. Keeping a German Shepherd on a leash at all times when in public places is a good rule of thumb, as even the most well-trained dog can be distracted and not follow regular commands, leading to a possible confrontation. A German Shepherd’s temperament can also be genetic in nature. The American Temperament Test Society and the German Shepherd Dog Club of America will issue a “TT” certificate after temperament testing. These results should be provided to a pet parent by the breeder of the German Shepherd before the dog is purchased. Not all temperament and behavioral issues are evident in a growing puppy, and it is impossible to predict whether a dog will be free of these problems. Find a trustworthy breeder who is committed to breeding the healthiest animals possible.   German Shepherd Behavior German Shepherds, like other herding dogs, tend to be on the nippy side. They have very powerful jaws, and unfortunately, they frequently bite. Most aggressive German Shepherds are aggressive because of their owners. The German Shepherd dog is a pack animal. They need you to be the leader of the pack, providing structure and guidance. The key to success is consistency and practice; you will get the behavior you reward. Be aware that a German Shepherd’s temperament can vary depending on their background. German Shepherds from working lines have an extremely strong drive to work and may be more dog than most people can or want to handle. If you want a family companion, a dog from a “conformation breeder,” someone seeking to breed dogs that conform most closely to the German Shepherd ideal, may be a better choice. German Shepherd Training The German Shepherd needs a job. German Shepherds are very smart companions and exceptional workers. When they are puppies, it’s crucial to start to socialize them with other dogs and have them in obedience training classes. This helps you build the right foundation for your puppy to evolve into a well-adapted and well-mannered adult dog. A good trick to remember is “Reward Positive Behaviors” and “Extinguish Negative Behaviors.” Make sure to add a treat, use your sweet voice, and follow up with praise when they do something you desire. Conversely, when your dog barks at you to pet them, do not start petting them until they sit down and quietly wait for you to do so. Soon they will learn that they get what they desire without the excessive, unnecessary behavior.  German Shepherds thrive on consistency, positive reinforcement, and a reward system, such as a treats or toys to help strengthen the human-animal bond. They become very bonded to all members of the family and will be willing to participate in many family activities. Fun Activities for German Shepherd  Herding Agility Tracking Nose work Dock diving  German Shepherd Grooming and Care Guide German Shepherds have a medium-length double coat. Their undercoat is soft, yet the outer coat is tight, rough, and heavy. This is a dog breed that sheds a lot. Coat Care While they are a very heavy-shedding dog, they can be easily maintained by brushing every few days to remove loose hairs. Using dog brushes that pull at the undercoat are very helpful for managing shedding. Germans Shepherds will go through one or two periods per year in which they will “blow” their coat—owners need to be prepared for excessive shedding during these times.   Making sure that a German Shepherd has regular claw trims is also very important unless their daily routine wears the claws down naturally. When claws become overgrown, they are prone to breaking. Skin Care German Shepherds only need to be bathed a few times a year. During their high-shedding periods, baths can help decrease the hair around the home. Excessive bathing should be avoided because it often strips the coat of its natural oils, which protect the skin and the undercoat. Eye Care Since German Shepherds can be predisposed to eye issues, it’s important to monitor your dog’s eyes for changes. This is especially important if you live at a high altitude or where there’s a very high UV ray index. Don’t let your dog spend large amounts of time outside during the peak sun hours of the day. Ear Care While it’s important to keep your dog’s ears clean, ear cleanings should only be done if there is an issue or visible debris in the ear. Adding excessive moisture to a dog’s ear by bathing frequently, swimming, or using ear cleansing liquid too often can lead to bacterial growth and an ear infection. For a normal, healthy dog, you can use a dog-safe wipe or paper towel to clean up light debris."}]