[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Nova Scotia Duck Tolling Retriever a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Nova Scotia Duck Tolling Retrievers make excellent family dogs, especially in active families who spend lots of time outside. Once their physical and mental needs are met, Tollers are content with quiet time and are gentle with children."}}, {"@type": "Question", "name": "How big does a Nova Scotia Duck Tolling Retriever get?", "acceptedAnswer": {"@type": "Answer", "text": "Adult Nova Scotia Duck Tolling Retrievers stand 17–21 inches tall at the shoulder and weigh 35–50 pounds. "}}, {"@type": "Question", "name": "Do Nova Scotia Duck Tolling Retrievers bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Nova Scotia Duck Tolling Retrievers are not typically excessive barkers. But when they are stimulated or excited, they can make a screaming sound. Featured Image: Adobe/RvDam"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Nova Scotia Duck Tolling Retriever", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/nova-scotia-duck-tolling-retriever.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/nova-scotia-duck-tolling-retriever.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Nova Scotia Duck Tolling Retriever", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/nova-scotia-duck-tolling-retriever"}, "datePublished": "July 10, 2023", "dateModified": "October 13, 2023", "description": "Nova Scotia Duck Tolling Retrievers are known for their beautiful copper coat. But that red fur needs lots of upkeep, and this hunting breed is not suitable for couch potatoes. Learn about caring for Toller dogs and puppies here.", "articleBody": "Despite the big name, the Nova Scotia Duck Tolling Retriever is the smallest of the American Kennel Club-recognized retrievers and is a relatively new breed. According to the Nova Scotia Duck Tolling Retriever Club USA, the breed’s name originates from the word “toll”—which means “to entice.” These Tollers were first bred to distract ducks with their white-tipped tail, then retrieve them for their human hunting companions. Tollers are well known for their long copper coat with white markings, notably at the tip of the tail. Their smaller stature as a retriever, standing 18–20 inches tall and weighing 35–50 pounds, makes them compact companions at home. Loyal and affectionate family dogs, Tollers thrive in a home with frequent and varying outdoor activities. Because of their intelligence and history as working dogs, Tollers require lots of stimulating activity and are not a great fit for all families. Caring for a Nova Scotia Duck Tolling Retriever The Duck Toller is a perfect hunting partner. They have a high energy level, high endurance, and webbed feet, which make them excellent swimmers. Because of this, Tollers require homes where they can get ample activity to keep them both physically and mentally stimulated. Their silky waterproof coat covers a dense undercoat, which requires weekly brushing. Toller Retrievers are typically healthy dogs and live an average of 12–14 years. They’re loyal, loving, and do well with children as well as other pets. Nova Scotia Duck Tolling Retriever Health Issues While Duck Tollers are generally healthy, they can be prone to certain inherited conditions. Hip and Elbow Dysplasia Hip dysplasia and elbow dysplasia are conditions in which the bones of the hip or elbow joints do not align appropriately. This misalignment causes the joint to deteriorate, causing rubbing and grinding over time. This is painful for the dog and can cause arthritis if not treated. While both conditions can be inherited in Nova Scotia Duck Tolling Retriever puppies, they can also be exacerbated by other factors such as exercise habits, weight, and nutrition. Progressive Retinal Atrophy Progressive retinal atrophy (PRA) is a group of degenerative diseases that affects the retina, eventually causing blindness. PRA is an inherited disease that affects Duck Tolling Retrievers as a result of both parents carrying the gene, though the parents may not show signs of it themselves. While this disease cannot be treated, a DNA test can screen for the defective gene in potential carriers. Responsible breeders will screen their dogs so their Toller puppies won’t develop this condition. Degenerative Myelopathy Degenerative myelopathy (DM) is a progressive condition affecting the spinal cord in dogs, leading to paralysis in the hind legs. The exact causes of DM are unknown, but a genetic predisposition is suspected. DM is commonly seen in middle-aged, large-breed dogs and can initially appear as hind-limb lameness. As the disease progresses, dogs will lose their ability to use their hind legs and often become incontinent. DM is a diagnosis of exclusion, meaning all other causes of hind-limb weakness or lameness must first be ruled out. A blood test to check for a specific gene mutation can be helpful in diagnosing but is not definitive. Once DM is diagnosed, the prognosis is poor. Many families elect for humane euthanasia within six to 12 months due to the debilitating loss of mobility. Addison’s Disease Addison’s disease in dogs is an inherited disease in which the body’s immune system destroys the adrenal glands, which are responsible for producing the life-sustaining hormones cortisol and aldosterone. In Tollers, Addison’s disease is often diagnosed when they are middle-aged and can cause non-specific symptoms such as lethargy, decreased appetite, vomiting, or diarrhea. It can also present as an acute crisis (Addisonian crisis) in which the dog becomes suddenly very lethargic and ill—and may even collapse. Diagnosis of Addison’s disease is based on a blood test. Once the dog is stabilized, Addison’s can be treated and managed with lifelong medication. While there is no cure for the disease, many dogs can live long, fulfilling lives once they are appropriately managed medically. What To Feed a Nova Scotia Duck Tolling Retriever Selecting the best diet for a Tolling Retriever varies from dog to dog. It’s important to choose a dog food that contains high-quality ingredients and is approved by the Association of American Feed Control Officials (AAFCO). Always talk with your vet about what food to feed your Toller. How To Feed a Nova Scotia Duck Tolling Retriever Toller puppies need to eat three to four meals every day, while adults only need twice-daily feedings. Other than that, the breed doesn’t require special feeding instructions. How Much Should You Feed a Nova Scotia Duck Tolling Retriever? The amount of food you feed your dog depends on their weight, lifestyle, and health history. Your dog food packaging will have portion suggestions, but always talk with your vet about how much to feed your dog. Overfeeding can cause obesity and exacerbate many health conditions. Nutritional Tips for Nova Scotia Duck Tolling Retrievers For Toller dogs diagnosed with hip or elbow dysplasia, your vet may recommend joint supplements with glucosamine and chondroitin to keep them healthy. Omega-3 supplements can also aid in protecting joint health, as well as keep their skin and coat healthy. Behavior and Training Tips for Nova Scotia Duck Tolling Retrievers Nova Scotia Duck Tolling Retriever Personality and Temperament  Because the Nova Scotia Toller is an active sporting breed, daily exercise is important to maintain their physical and mental health. The more varied the activity, the better for this clever breed: They’ll happily join their humans on hunts, hikes, and morning runs. Originally bred in Canada, Tollers aren’t bothered by cold or wet weather conditions and are eager for outdoor adventures—rain or shine. Because of their intelligence and history as working dogs, Tollers require lots of stimulating activity and are not a great fit for all families.At home, Duck Tollers do well with children who understand how to interact with dogs. And while they often do well in families with other pets, smaller animals such as cats can sometimes trigger their prey drive. Make sure introductions are made slowly and carefully, and that your Toller knows cats aren’t something to chase. Nova Scotia Duck Tolling Retriever Behavior Toller dogs are curious and have high energy requirements. While their smaller size makes them suitable for smaller homes or apartments, it’s important to have a fenced yard to prevent wandering during playtime and a variety of walking routes for enrichment. Tollers do not tend to bark. But when they are excited or stimulated, they can emit a high-pitched scream. Nova Scotia Duck Tolling Retriever Training Because Duck Tollers are so intelligent, training them can be tricky. They will know what you’re asking of them, but they might not agree to do it—that is, unless you have a tasty treat as a reward on hand. Toller dogs do best with short, reward-based training sessions. Fun Activities for Nova Scotia Duck Tolling Retrievers Hunting Hiking Fetch Swimming Dock diving Agility Flyball Nova Scotia Duck Tolling Retriever Grooming Guide Tollers have a silky, waterproof red coat with a dense undercoat. But that beautiful fur requires a bit of upkeep. Skin Care Skin care for a Duck Toller varies depending on their individual needs; however, this breed does not typically have sensitive skin. Coat Care Brushing your Toller once or twice a week will prevent their silky coat from matting, especially behind their ears, where hair tends to be finer and more prone to mats. Special attention to the feet can also be helpful, as excess hair between their paw pads can make smooth surfaces (such as wood or tile flooring) slippery. Eye Care Pet parents should assess their Toller’s eyes for signs of PRA and other changes, such as discharge. Routinely wiping your dog’s eyes with a pet-safe eye wipe will also help clear any normal tear staining or debris. Ear Care Water-loving Toller dogs can easily develop ear infections if moisture becomes trapped in their canals. Every time your pup splashes around in water or takes a bath, be sure to clean their ears. Considerations for Pet Parents As with any breed, it’s important for pet parents to understand the physical and mental needs of the dog they are considering before bringing one home. For Nova Scotia Duck Tolling Retrievers, their high energy requirements must be met to avoid unwanted behaviors, and they are therefore best suited for active homes. Their smaller size makes Tollers well-suited for apartment life, but their energy demands might make them a poor match for first-time dog parents. However, with the appropriate physical and mental stimulation, Toller dogs will love nothing more than to lie around with their humans. Their energy, size, and playful demeanor also make them suitable for families with children."}]