[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cesky Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cesky-terrier-rolf.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cesky-terrier-rolf.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Cesky Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_cesky_terrier"}, "datePublished": "September 5, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Cesky Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Developed as a breed for hunting, the Cesky Terrier was created in the Czech Republic in 1949. Although this dog breed’s unique coat requires some care, the Cesky Terrier makes a great pet for family or show. Physical Characteristics Also known as the Bohemian Terrier, the Cesky Terrier is a fairly long-bodied dog with short legs. This terrier ranges in size from 10 to 13 inches tall usually weighing anywhere from 16 to 22 pounds. The Cesky coat is mostly long and slightly wavy hair that falls long around the legs and under the stomach, as well as over the eyes and along the bottom of the head. This breed is found in two colors, blue-gray and light coffee brown, both of which look darker at birth. Personality and Temperament Known for being a loyal and loving family dog, the Cesky Terrier is friendly with other dogs and people, especially children. However, it is important to socialize this dog breed at an early age so it does not become wary of strangers. Bred originally for hunting purposes, the Cesky Terrier is an obedient, calm and smart breed. Care The Cesky Terrier requires an average amount of exercise such as a long walk per day. Although this breed, like other terriers, enjoys digging and open space outside, the Cesky Terrier can make a good apartment dog as well. Due to the longer coat, the Cesky Terrier requires grooming and hair clippings monthly. Health This dog breed has a life span of 12 to 15 years with general good health. The only known common health condition in Cesky Terriers is Scottie Cramp, which causes the dog to have locomotive problems due to a lack of serotonin in the body. This disease is not life threatening. History and Background The Cesky Terrier is a manmade breed created by a geneticist, Frantisek Horak, in the Czech Republic. Horak began breeding dogs for hunting starting with Scottish Terriers and Sealyham Terriers. In 1949 Horak successfully created a new breed from these two terriers believing it would make a stronger hunting dog. Unfortunately, only one pup survived from this litter and the first Cesky Terrier was shot in a hunting accident causing Horak a setback with his breeding efforts. Horak began breeding Scottish and Sealyham Terriers, and the next year had a litter of six Cesky Terriers. It is because of his careful notes and bloodline records that the history of the Cesky Terrier is so accurate. For a number of years after Horak began breeding Cesky Terriers, there was a ban placed on exporting the breed. However, this dog sill became popular in other countries fairly quickly. The Cesky Terrier was recognized by the Federation Cynologique Internationale in 1963 and by the United Kennel Club in 1993."}]