[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Swedish Vallhund", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Swedish Vallhund", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_swedish_valhund"}, "datePublished": "September 18, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Swedish Vallhund Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Originally bred as a herding dog, the Swedish Vallhund is a very alert and active small breed. With a friendly and obedient personality, this dog breed is an ideal addition as a family pet. Physical Characteristics Sometimes referred to as a big dog in a little body, the Swedish Vallhund weighs anywhere from 23 to 35 pounds at the height of 12 to 14 inches. This small dog is known for its double coat and “harness” markings with a wedge-shaped head and pricked ears. The coat color of the Swedish Vallhund ranges from shades of grey to red with combinations of the colors. Personality and Temperament The Swedish Vallhund is a very energetic and active dog breed that is never vicious or shy. This breed is known to be very friendly and eager to please, making a good companion and family dog. Care Because of its very active personality, the Swedish Vallhund requires daily exercise and entertainment. The medium-length coat requires little grooming, just regular dog bathing. Health The Swedish Vallhund lives an average lifespan of 12 to 15 years. The health issue most associated with this dog breed is progressive retinal atrophy, a genetic disease that causes blindness in both eyes. History and Background According to Swedish records, the Vallhund was brought over to the country at the time of the Vikings over 1,000 years ago, when they were known as the “Vikinarnas hund” or “Viking Dog.” The similarity between this dog breed and the Corgi are most likely because either the Swedish Vallhund was taken to Wales, or the Corgi was brought to Sweden. Historians believe that the Vallhund is the older of the two breeds. When it was introduced in Sweden, the Swedish Vallhund was bred as a cattle-herding dog on farms and ranches. However, in 1942, this dog breed was near extinction until a man by the name of Bjorn von Rosen stepped in. As a man with experience saving other Swedish breeds, Rosen remembered this dog from his childhood and made it his mission to revive the Vallhund breed. Just a year later, the breed was recognized by the Swedish Kennel Club. Over the years to follow, the Swedish Vallhund was introduced in other countries, and made its way to the United States in 1983."}]