[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Border Terriers good pets?", "acceptedAnswer": {"@type": "Answer", "text": "Border Terriers make excellent pets, especially for active families ready to give plenty of attention to their dog. There are grooming responsibilities for Borders, but they are not stringent or too time-consuming. Borders are relatively low-maintenance dogs. "}}, {"@type": "Question", "name": "Do Border Terriers bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Border Terriers have a loud bark and may use it to alert their family, but they aren’t known to be overly talkative or yappy."}}, {"@type": "Question", "name": "Do Border Terriers like to cuddle?", "acceptedAnswer": {"@type": "Answer", "text": "As long as they get enough exercise and mental stimulation, Border Terriers love cuddling with their family members at the end of the day."}}, {"@type": "Question", "name": "What happens if you don’t handstrip a Border Terrier?", "acceptedAnswer": {"@type": "Answer", "text": "If you don’t handstrip a Border Terrier, they will lose their characteristic hard, wiry coat texture and color. The fur that grows in will look—and feel—quite different. Featured Image: iStock/jarafoti"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Border Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/border-terrier.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/border-terrier.jpg"}, "author": {"@type": "Person", "name": "Zack Newman", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Border Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/border-terrier"}, "datePublished": "June 2, 2009", "dateModified": "October 13, 2023", "description": "Border Terriers are hardy, scrappy dogs with lots of energy. They do best in a patient and active family. Learn how to care for Border Terrier puppies and dogs here.", "articleBody": "Border Terriers were developed to be working dogs, utilized by English and Scottish farmers and shepherds, that would also fit in well at home after the hunt. Tipping the scales at just 15 pounds, these small fellows might not be what you picture when you think of a hunting dog, but their drive and penchant for digging in pursuit of prey make them notable allies in the field.  Caring for a Border Terrier While the Border Terrier’s size makes them more manageable, pet parents need to dedicate time to meet their dog’s physical and mental needs. The terriers require robust exercise and mental stimulation as outlets for their boundless energy, and their wiry fur needs a professional groomer to keep it in top shape. Border Terrier Health Issues Border Terriers are typically healthy dogs with long lifespans of 12–15 years. That said, they are prone to a few genetic conditions that can be painful and costly to address. Investing in pet insurance might be a good choice when you bring home your Border Terrier puppy. Gallbladder Mucocele (GBM) Gallbladder mucocele is when the gallbladder becomes distended due to excessive mucus accumulation. This can be caused by several conditions, including Cushing’s disease, hypothyroidism, inflammatory bowel disease, or from a diseased gall bladder causing a decrease in the flow of bile. GBM can sometimes be caught early with an ultrasound and remedied with a diet change. But the 2022 health report conducted by Border Terrier Health revealed that most signs of the illness are not shown until surgery is necessary.   Cushing’s Disease Cushing’s disease is an endocrine disorder that occurs when the adrenal gland secretes too much cortisol, a stress hormone. This condition typically affects older Border Terriers. Warning signs include increased thirst and appetite; hair loss; and skin infections. Without management, Cushing’s disease can cause other issues for dogs, including: Diabetes High blood pressure Bladder stones Blood clots Treatment can involve surgery, radiation, or medication, depending on the underlying cause. Most cases of Cushing&#039;s disease in dogs require daily lifelong medication. Canine Epileptoid Cramping Syndrome Canine Epileptoid Cramping Syndrome, or CECS, is a genetic disease that can cause cramps in a range of durations and frequencies, from seconds to up to 30 minutes. This is usually first seen in Border Terriers that are between 2–6 years old. Sometimes the condition can be treated with a grain-free diet, low-protein diet, or hypoallergenic diet. Always talk to your veterinarian before making changes to your dog’s diet. Cataracts Border Terriers can develop cataracts, a condition that clouds the eye lenses. Regular eye testing can help pet parents identify this problem early, and cataracts can be treated with surgery. What To Feed a Border Terrier Border Terriers benefit from a high-quality dog food that meets the standards set by the Association of American Feed Control Officials (AAFCO). Popular brands include Purina, Royal Canin, and Hill’s. Your vet can help you choose the right dog food for your pup. How To Feed a Border Terrier Feed your Border Terrier two meals a day—one in the morning and one in the evening. Border Terrier puppies should eat more frequently as they grow, about three or four times every day. Treats should not make up more than 10% of their daily calories. How Much Should You Feed a Border Terrier? The exact amount of food you should give your Border Terrier depends on your specific dog’s health, weight, and lifestyle. The dog food packaging will provide recommended portions, but always talk to your veterinarian for personalized advice. Nutritional Tips for Border Terriers Feeding your Border Terrier a well-balanced diet will supply them with all the nutrients they need, but supplements to support their eyes and joints might be good additions. Talk to your vet about supplements for your dog, and never give your dog a supplement without speaking to their vet first. Behavior and Training Tips for Border Terriers Border Terrier Personality and Temperament According to the Border Terrier Club of America (BTCA), bringing home a Border Terrier is like bringing home “a 2-year-old in a dog suit.” Pet parents need to focus plenty of attention on them to shape their pups into well-behaved dogs. This breed can be single-minded when they spot a neighborhood rabbit, and their willful personality requires patient guidance. Well-socialized Border Terriers do well in a family with children and with other dogs. Living with cats might be tricky, they they may see them as something to chase. But Border Terriers can get along with feline family members when introductions are made properly. A bored Border means trouble, as they will find a way to keep themselves engaged—usually by destroying your couch or digging up your yard. These dogs need a job to focus on, plus regular exercise and play to set them up for success. After they’ve worked out their energy, Border Terriers are cuddle bugs that love affection and curling up with you on the couch.  Border Terrier Behavior Border Terriers have a reverberating bark and are known to be independent—with a penchant for getting in trouble if they are bored, especially through chewing and digging. They will often dig to free themselves from their fenced yards, so it’s important to supervise your Border whenever they’re outside. Border Terrier Training Like all dogs, Border Terriers learn best when trained with positive reinforcement. Keep training sessions short and lessons fun to hold their interest, as these dogs can quickly grow bored and decide they’re done for the day. Fun Activities for Border Terriers Playing fetch Digging Running agility courses Hiking Neighborhood walks Border Terrier Grooming Guide The Border Terrier breed has a hard, wiry coat that requires special care from a professional dog groomer. Other than that, the dogs are typically low-maintenance when it comes to grooming. Skin Care There are no specific skin care requirements for Border Terriers, but monitor your dog for any changes. Because skin infections can be an indicator of Cushing’s disease, talk to your vet if you notice redness; scaliness or flakiness; hair loss; or discharge. Coat Care  Border Terriers need to be handstripped twice a year, according to the BTCA. Handstripping is a process where a groomer removes the dog’s hair from the roots by hand, instead of clipping it. This allows a new coat of wiry hair to grow in. If the fur is clipped, the Border Terrier will lose that characteristic hard coat, as the new hair that grows in will be a softer texture. For routine upkeep, pet parents just need to brush their dog’s fur with a slicker brush as needed. However, it can be difficult to find a groomer who handstrips dogs, so many pet parents may choose to learn the grooming method and do it themselves. Eye Care Stay alert for signs of cloudiness in your dog’s eyes or changes in your dog’s eyesight, which can indicate cataracts. Ear Care The Border Terrier’s floppy ears mean they can develop ear infections more easily than dogs with pricked (upright) ears. Talk with your veterinarian about how often you should clean your dog’s ears with a veterinary-approved cleaner. This will help prevent infections. Considerations for Pet Parents  The perfect home for a Border Terrier is one equipped to have a high-energy and intelligent pup in the house. An active family, especially one that has a job in mind for their Border, would be a good fit. Regular training and exercise will keep your dog happy and stimulated. "}]