[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Briard", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Briard", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_briard"}, "datePublished": "June 2, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Briard Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Handsome, vigorous and alert, the Briard is strong, without being coarse. Bred as a herding dog, it is inquisitive and adventurous, but not overly popular in the United States. Physical Characteristics The Briard looks very sophisticated, with a body that is either square-proportioned or a bit longer than taller. It is physically strong with movements that are easy and light as well as smooth. In fact, the movement of a Briard is often described as &quot;quicksilver.&quot; The dog&#039;s long head and eyebrows, meanwhile, gives an impression of confidence. The breed&#039;s outer coat is rough and dry-textured, and the undercoat is tight and fine. Its coat also has wavy locks at the shoulder area, which are six or more inches in length. Personality and Temperament The Briard loves to spend time inside the house and has proved itself a loving breed with a pleasant personality. Playful in nature, Briard puppies especially require socialization. This intelligent, independent, and confident dog is also very devoted to its master, making for an excellent companions or guard dog. Although some Briard dogs are reserved with strangers as well as other dogs, most love playing with children. They will even nip at a child&#039;s heel playfully during games. Care The Briard&#039;s coat must be brushed regularly to prevent the hair from tangling. Herding is its favorite activity, but it can also be taken for long walks or jogs in order to meet its exercise requirements. And though it is adaptable to outdoor living, it is most often considered an indoor dog. Just make sure you take it to large fields and let it play frequently. Health The Briard, which has an average lifespan of 10 to 12 years, is prone to diseases such as canine hip dysplasia (CHD) and gastric torsion. It also succumb to heart problems, progressive retinal atrophy and minor health problems such as night blindness. To identify some of these early, a veterinarian may conduct regular eye and hip exams on this breed of dog. History and Background The Briard is native to France. A superb herder, it was the official dog of the French army during World War II. And among the four sheepdog breeds of France (Pyrenean, Beauceron, and Picardy), Briards are the oldest. There is evidence of dogs resembling the Briard in 8th-century art work. There are also records of Briards during the 1300s. Some believe the breed originated from dogs of the Brie province; therefore, they were referred to as Chien Berger de Brie or Shepherd Dog of Brie early on. According to the 14th-Century legend, it may have even originated from the Chien d&#039;Aubry, or Aubry de Montdidier’s dog, which took revenge for his master’s murder. It was not until 1809 that the breed became to known as the Briard. The Briard was used for various purposes, including guarding estates and flocks from intruders and wolves on occasion. But as the French Revolution came to an end, there was more of a need to keep cattle closer to the home. The Briards, therefore, shifted their duties from guarding homesteads to herding cattle. The standard of the breed, written in 1897, was updated in 1909. Around the same time, the Briard began to be used as a show dog. It was only after World War I that American soldiers began to bring Briards to the U.S. However, the breed has yet to garner much popularity among families."}]