[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Canaan Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Canaan Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_canaan_dog"}, "datePublished": "July 29, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Canaan Dog Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Canaan Dog developed in the Middle East centuries ago as a herder and flock guardian. Although it is aloof with strangers, this medium-sized dog is loyal and loving with its human family. Physical Characteristics The Canaan’s double coat comprises a short, soft undercoat that changes its density in different climates, and a flat-lying, straight, harsh outer coat, with a ruff. This coat allows the breed to adapt to extremes of weather that range from cold nights to hot days. Its two most common patterns are as follows: (1) Predominantly white with or without additional patches of black and brown, and (2) Solid-colored with or without white trim. The Canaan Dog does not resemble other herding breeds, as it comes from a different background. It does, however, have traits that enable it to herd for hours. Its square-proportioned and medium-sized body has moderate substance and combines endurance, strength, and agility. Its brisk trot is ground-covering, and its gait is graceful and athletic. The Canaan can also change directions very quickly. Personality and Temperament The Canaan Dog behaves well with other household pets (including dogs), but tends to be scrappy towards strange dogs and people. A natural guardian, it may bark a lot and is protective of its human family. Additionally, the intelligent Canaan is an excellent herder, performing tasks obediently and always willing to please. Care This breed can live outside in warm or cool climates, but is also suitable as a house pet. To maintain coat clean and remove any dead hair, brush the dog once a week. The Canaan Dog is one of the few breed to claim to be a pure worker. It simply abhors sitting around and is in constant need of physical and mental exercise. This can be accomplished through various activities, including a challenging training session, herding exercises, strenuous playing, or long jogs. Health The Canaan Dog, which has an average lifespan of 12 to 13 years, does not normally suffer from any major or minor health problems. However, a veterinarian may recommend hip exams for the dog. History and Background There is evidence to suggest the breed developed centuries ago in Canaan, the land of the Israelites. At the time, there were referred to as the Dog of Canaan or Kelev Kanani. However, many of these Israeli dogs would become isolated in the Negec Desert and Sebulon Coastal Plain when the Romans drove the Israelites from their land about 2,000 years ago. On the brink of extinction, some wild Canaan Dogs were caputred by local Bedoins to assist them in guarding and herding. Dr. Rudolphina Menzel, who was asked by the Haganah (a Jewish self-defense organization) to develop a dog capable of guarding the isolated Jewish settlements and withstanding the harsh climate, was instrumental in developing the modern Canaan Dog breed. Her breeding and training program consisted of only the best native, untamed dogs, which were then developed to serve as as messengers, sentry dogs, Red Cross helpers, mine detectors, helpers in locating wounded soldiers during World War II, and as guide dogs for visually handicapped people after the War. This is perhaps the only breed to rise from its feral roots and become such a dedicated and useful companion in such a short time span. The first Canaan Dog entered the United States in 1965. But given that its appearance was understated, the breed did not quickly garner admiration. The American Kennel Club registered the breed under the Herding Group in 1997, and today it is considered a popular show dog and an excellent, well-behaved house pet."}]