[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "English Toy Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, English Toy Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_english_toy_spaniel"}, "datePublished": "July 29, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about English Toy Spaniel Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The English Toy Spaniel is a compact toy dog with of a short-nosed, domed head, a merry, affectionate demeanor and a silky coat. Also called the King Charles Spaniel, they differ from the Cavalier King Charles Spaniel in their expression: the King Charles’s mouth turns down, while the Cavalier appears -- like its namesake painting -- to be laughing. Physical Characteristics The expression and head of the breed are the English Toy’s hallmark. It has shiny dark eyes, a well-padded face and a domed head, all of which create an appealing and soft expression. The English Toy Spaniel, with a square-proportioned and compact body, is abundantly covered with a flowing, silky coat. This coat is either slightly wavy or straight. It has long tufts of hair on its feet and heavy fringing on its body. Personality and Temperament The English Toy Spaniel is a calm, quiet, gentle, and friendly but attentive lapdog. It shows utmost dedication to its family and is reserved towards strangers. Additionally, some English Toy Spaniels have been known to display a stubborn side. Care Even though the English Toy Spaniel is not very active, it enjoys a fun indoor or outdoor game or a good on-leash walk. Hot weather does not suit it and, by nature, it cannot live outdoors, away from the comfort of its family. It has a long coat that requires combing twice a week. Health The English Toy Spaniel, which has an average lifespan of 10 to 12 years, is susceptible to major health conditions like patellar luxation, and minor issues like early tooth loss, and &quot;lazy tongue,&quot; a condition which causes the tongue to protrude from the mouth. A veterinarian may recommend regular knee tests for the dog. Patent ductus arteriosus (PDA), hydrocephalus, and fused toes are also seen in some English Toy Spaniels, as well as a soft spot in the dog&#039;s skull due to an incomplete fontanel closure. Some English Toy Spaniels react adversely to anesthesia. History and Background The early histories of the English Toy Spaniel and the Cavalier King Charles Spaniel are said to be identical. In fact, both breeds initially began as one single breed, a result of interbreeding between Oriental toy dogs and small spaniels. There is also evidence that indicates Mary I, Queen of Scotland in the mid-16th century, carried the first toy spaniels with her from France to Scotland. Sometimes referred to as the comforter spaniel, this breed gained a great deal of popularity among the wealthy, where they functioned as lap- and foot-warmers and pleasant companions. During the rule of King Charles II, in the 17th Century, the dogs reached the zenith of their popularity. As the king adored the dogs, the breed became known as the King Charles Spaniel. All these early dogs featured black and tan coats, but other colors were introduced later when the first Duke of Marlborough developed the red and white Blenheims. Crosses made with Chinese Cocker Spaniels also resulted in the red and white coats. These spaniels were favorites among woodcock hunters. However, most breeders preferred a showy lapdog to a hunting dog. In the following centuries, a concerted effort was made to develop a smaller King Charles Spaniel with a flatter nose and rounder head. This breed In the United States, the English Toy Spaniel is displayed as two strains: the Prince Charles variety and the King Charles variety. These fun-loving and aristocratic lapdogs are sometimes known as &quot;Charlies&quot; and &quot;E.T.s.&quot;"}]