[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ibizan Hound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Ibizan Hound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_ibizan_hound"}, "datePublished": "June 15, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Ibizan Hound Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "A rabbit hunter by profession, this breed is lithe and quick. The Ibizan Hound, which may share ancestral roots with the Pharaoh Hound, also has deer-like elegance and excellent jumping skills. Physical Characteristics As it has a slender build, the Ibizan Hound can easily execute the double-suspension gallop quickly and with agility, and trots lightly. The hound is a wonderful jumper that can reach great heights. The characteristic features of the dog are large ears and a long body. It is almost like a deer in its graceful movement and expressions. The dog’s coat, meanwhile, which is generally white or red in color, can be short, wiry, or hard. Personality and Temperament While retaining its hunting instinct, the elegant Ibizan Hound uses its sharp senses of smell and hearing to search for small animals. It also loves to bark while chasing any creature (or anything that moves), thus setting it apart from most sighthounds. Most Ibizan Hounds are shy with strangers, while some are timid. By nature, this breed is faithful, even-tempered, gentle, and mild and is perfect as a calm house pet. Care Given soft bedding and warm shelter, the Ibizan can stay outdoors in cold climates, but it is not usually kept as an outdoor dog. As the hound is a skillful jumper, care should be taken when constructing an enclosure. The dog’s smooth coat needs just occasional brushing but the wire coat has to be brushed every week. The athletic and independent Ibizan Hound should be given regular exercise in a safe and enclosed area. Good exercise enables the hound to stretch its body, but its requirements are also satiated through jogs on a leash, long walks and full running. Health There is no major health problem that affects the Ibizan Hound. Some of the minor ailments are seizures and allergies. The dog is sometimes prone to problems like retinal dysplasia, deafness, cataract, and axonal dystrophy and cannot tolerate barbiturate anesthesia. Eye tests are also suggested for the Ibizan Hound, which has an average lifespan of 12 to 14 years. History and Background The Ibizan Hound and the Pharaoh Hound supposedly share the same ancestral roots; the former bears an incredible resemblance to the dogs dedicated to the jackal god Anubis, portrayed in Egyptian tombs. Ancient Phoenician sea traders might have brought the dogs to the Balearic Islands, where they in seclusion. Numerous nations, such as the Egyptians, Carthaginians, Chaldeans, Arabs, Romans, Vandals, and Spanish, held the royal scepter in Ibiza throughout the years. But when Spanish farmers in Ibiza used the dogs for hunting, the breed was kept in its purest form and crossbreeding was frowned upon. The tough island conditions also compelled the islanders to select only the best rabbit hunters or hounds for survival and breeding. This led to the production of a true-bred dog that has hardly been altered from its original stock. The Ibizan Hound was introduced to the United States for the first time in the 1950s. The impressive physical appearance of the Ibizan Hound attracted people at first, but the breed would never become a very popular pet. The American Kennel Club, however, would eventually officially recognize the Ibizan Hound in 1979; today it continues to be a rare breed."}]