[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Puli", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Puli", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_puli"}, "datePublished": "October 6, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Puli Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Originally from the Hungarian plains, the Puli is a rather unique sheepdog. It has a striking, shaggy coat that is mixture of black, gray and white cords. Of sound mind and body, the Puli is considered both agile and alert. Physical Characteristics The square proportioned, medium-boned, and compact Puli has a quick-stepping but not far reaching trot. It can alter directions instantly, and is acrobatic, quick, and agile. Its weatherproof coat comprises a dense, soft, wooly undercoat and a curly or wavy outer coat, which forms flattened or round cords that can be brushed out if desired. Personality and Temperament The Puli brims with energy and is always ready for action. It is a curious and busy dog that requires daily exercise. Even though it is a smart dog, it is tough and headstrong as well. In fact, some Pulis may become aggressive towards other dogs. The Puli is also protective of its human family, often barking at anything it deems a threat. Care The Puli can live outside in cool or temperate climates, but is also excellent as a house dog. As it is an energetic breed, it is always on the lookout for a task, like herding livestock. A good jog or walk, or a training and lively game session, can satisfy its exercise needs. Its non-shedding coat holds debris and should be brushed on alternate days. If it is corded, the cords should be separated regularly because the coat tends to accumulate dirt. Bathing takes a lot of time and it takes an entire day for drying. Pulis kept as pets may be clipped, but the breed&#039;s distinctive appeal is lost. Health The Puli, which has an average lifespan of 10 to 15 years, is susceptible to major health issues such as canine hip dysplasia (CHD). Progressive retinal atrophy (PRA) and deafness are also occasionally seen in Pulis. To identify some of these issues, a veterinarian may recommend hip, eye, and hearing exams for this breed of dog. History and Background The Magyar tribes of the eastern Urals arrived in the 9th century to occupy the central area of the Danube and mixed with the Turkish people on the way. They carried various sheepdogs along with them, as well as the ancestor of the modern Puli. As the Tibetan Spaniel and the Puli have similar body structures, it is said that the former may have been instrumental in the latter’s development. In the 16th century, after Hungary was decimated by invaders, the country was repopulated by people, sheep, and dogs from Western Europe. These new dogs were interbred with the native Pulik dogs to form the Pumi. Then the Pumi and Puli were crossed in such a manner that the original Puli breed was almost lost. Regardless of the breed&#039;s origin, these small dogs were praised for their nimbleness -- able to herd and divert a sheep&#039;s path by hopping on its back. Their black coat was also essential so that the shepherds could easily spot them among the sheep. The larger, lighter-colored Hungarian sheepdogs, meanwhile, were used as nighttime sentries. There was an effort in the early 20th century to revive the Puli, and in 1924 the first standard was penned. At about the same time, the Pulik in Hungary differed very much in height, ranging from the small dwarf to the large police, and the medium working sizes. The desired size was that of the medium-sized dog as it represented the conventional herding Puli. The United States Department of Agriculture brought in several Pulik in 1935 to improve the quality of herding dogs in the U.S. The war spoiled this effort but as people learned about the breed&#039;s working ability in America, the American Kennel Club registered the Puli by 1936. The fame and name of this breed spread throughout Europe, and the Hungarians who fled the war brought their dogs with them. The modern Puli is modestly popular as a show dog or pet, but continues to be a skillful herder."}]