[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pharaoh Hound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Pharaoh Hound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_pharaoh_hound"}, "datePublished": "September 24, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Pharaoh Hound Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Pharaoh Hound is one of the oldest known breeds of domestic dog and is the National Dog of Malta. A medium-sized dog with hard, clean-cut lines, and noble bearing, it is considered a fast hunting dog. Physical Characteristics The Pharaoh Hound has an almost unbelievable greyhound-like build, always holding its head high. Its body is long and not very tall. The dog&#039;s coat, meanwhile, is short, shiny and tan or chestnut in color (although it usually has white markings on its chest, toes, and parts of its face). It may be considered a sighthound in the U.S., but the Pharaoh Hound uses sight, scent, and hearing to hunt. In fact, it is able to track animals underground with the aid of its big mobile ears. The Pharaoh Hound also combines incredible power, speed, and grace to dart nimbly across rocky ground and walls. Personality and Temperament A placid creature, the Pharaoh Hound is the envy of other hunting dogs -- always willing to please while still retaining its independence. Its most unique feature is that the dog blushes when excited, with the ears and nose turning a shade of rosy pink. The Pharaoh Hound is fond of running and chasing strange animals, but is gentle and loving with other dogs and children. Its gentleness, however, does not impede its keen chasing and hunting skills. Care The dog’s coat does not demand much grooming; the occasional brushing is sufficient for removing dead hair. The Pharaoh Hound is capable of sleeping outdoors if given warm shelter and soft bedding, but it prefers to remain indoors with its master and family. Moreover, a daily leash-led walk or occasional run is recommended, but it will be content as long as it has sufficient room around the home to stretch out in. Health The Pharaoh Hound, which has an average lifespan of 11 to 14 years, is fortunate enough not to be prone to any particular acute or minor health problems. However, the breed does not tolerate barbiturate anesthesia. History and Background The Pharaoh Hound legitimately claims to be among the most ancient breeds that has hardly altered in the last 5,000 years. The breed bears an uncanny resemblance to the jackal god Anubis and its images are prominently features on the tombs of prominent Egyptian pharaohs. (Similar dogs were seen in ancient Greek art as well.) A hunting chronicle of the XIX Egyptian dynasty provides a perfect description of the present day Pharaoh Hound: &quot;The red, long-tailed dog goes at night into the stalls of the hills. He makes no delay in hunting, his face glows like a God and he delights to do his work.&quot; Even in the modern age, this breed &quot;blushes&quot; and &quot;glows&quot; when excited. It is believed Phoenician traders were the first to bring the dogs to the islands of Gozo and Malta, to North Africa and to Greece, where the dogs were kept in seclusion from other parts of the world. These island dogs were known as Kelb-tal Fenek (or rabbit dog) because once they picked up the scent of a rabbit, the dogs would bark and scare it into the open. Then, a belled ferret would chase the rabbit until the hound could catch the rabbit. The Pharaoh Hound was rediscovered and brought to England and the U.S. in the 1960s. In 1983, the American Kennel Club officially recognized the breed. It is also the National Dog of Malta, a small European island nation, south of Sicily."}]