[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much does a German Shorthaired Pointer cost?", "acceptedAnswer": {"@type": "Answer", "text": "A German Shorthaired Pointer can cost between $600-$1,500, depending on the breeder’s pedigree."}}, {"@type": "Question", "name": "How long do German Shorthaired Pointers live?", "acceptedAnswer": {"@type": "Answer", "text": "The average German Shorthaired Pointer lifespan is 12-14 years."}}, {"@type": "Question", "name": "What do German Shorthaired Pointers hunt?", "acceptedAnswer": {"@type": "Answer", "text": "German Shorthaired Pointers have been bred to hunt a variety of game, including (but not limited to) rabbits, raccoons, birds, and even deer."}}, {"@type": "Question", "name": "How big do German Shorthaired Pointers get?", "acceptedAnswer": {"@type": "Answer", "text": "Adult German Shorthaired Pointer males average 55-70 pounds and 23-25 inches tall. Female GSP dogs average 45-60 pounds and stand 21-23 inches tall. Featured Image: iStock/s5iztok"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "German Shorthaired Pointer", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/german-shorthaired-pointer.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/german-shorthaired-pointer.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, German Shorthaired Pointer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/german-shorthaired-pointer"}, "datePublished": "December 7, 2022", "dateModified": "October 13, 2023", "description": "German Shorthaired Pointers are high-energy hunting dogs who do best in active homes. Learn more about caring for GSP dogs.", "articleBody": "German Shorthaired Pointers are often described as “noble” or “aristocratic” in their appearance and are known for their speed, agility, and endurance. GSPs are “gun dogs,” hunting dogs trained to find or retrieve game. Because they are often used to retrieve birds, GSPs are also known as “bird dogs.” GSP dogs, unlike other gun dogs, point and signal when they are trailing a game scent by stopping and standing with their nose pointing in the direction of the scent. In this stance, they await a signal from their hunter to flush out the animal. As a medium-sized breed, adult male German Shorthaired Pointers average 55-75 pounds and 25-27 inches tall, while female GSPs are typically 45-65 pounds and 24-26 inches tall. GSP colors are either solid liver or a combination of liver with white, which can be liver and white ticked, liver patched and white ticked, or liver roan. Along with being well-loved gun dogs, German Shorthaired Pointers make great family dogs that are always ready for any outdoor activity. Caring for a German Shorthaired Pointer  German Shorthaired Pointers make excellent working dogs and hunting partners because of their high energy levels and endurance. For this reason, GSP dogs require homes with ample activity to keep them both physically and mentally stimulated. Other than their need for adventure, German Shorthaired Pointers are fairly low-maintenance dogs with short coats that require minimal grooming and shed moderately. They are typically healthy dogs and live an average of 10-12 years. With family, they are loyal and loving and do well with children as well as other pets. German Shorthaired Pointer Health Issues German Shorthaired Pointers are generally healthy dogs, but they can be prone to certain inherited conditions. As GSP dogs are considered a deep-chested breed, they can also be predisposed to bloat or gastric dilatation and volvulus (GDV), a life-threatening disorder. Hip and Elbow Dysplasia Hip dysplasia and elbow dysplasia are conditions where the bones of the hip or elbow joints don’t align properly. This misalignment causes rubbing and grinding of the bones. Over time, this leads to deterioration and arthritis of the joint, causing pain and loss of function. Hip and elbow dysplasia can be hereditary conditions that affect GSP dogs. However, they can also be exacerbated by other factors such as exercise habits, weight, and nutrition. Progressive Retinal Atrophy Progressive retinal atrophy (PRA) is a group of degenerative diseases that affect the eye’s retina, eventually causing blindness. PRA is an inherited disease that affects German Shorthaired Pointers as a result of both parents carrying the gene, even though they may not show signs of PRA themselves. While this disease cannot be prevented or treated, there is a DNA test that can screen for the defective gene in potential carriers. Reputable German Shorthaired Pointer breeders will screen their dogs for PRA. Subaortic Stenosis Subaortic stenosis is an inherited disease seen in GSP dogs. It causes a narrowing of the aortic valve, which is responsible for regulating blood flow from the heart to the rest of the body. When the valve narrows, it causes the heart to work harder. If left untreated, it will eventually lead to heart failure. Some common signs of subaortic stenosis include lethargy, decreased exercise tolerance, and fainting. Subaortic stenosis is typically detected by a veterinarian during physical examination as a heart murmur in young dogs, often before they are 1 year old. Treatment will depend on the severity; mild cases may not require treatment, while more severe cases may warrant lifelong medications.  Gastric Dilatation and Volvulvus Gastric dilatation and volvulus (GDV), a severe case of bloat, is a condition that can affect deep-chested breeds such as German Shorthaired Pointers. GDV commonly occurs following a large meal that causes the stomach to dilate or swell. The mixture of gas and food in the stomach prevents anything from exiting, increasing the stomach’s pressure and size. In turn, this can block blood returning to the heart from the abdomen, cause loss of blood flow to the stomach and possible rupture, and increase pressure on the diaphragm, preventing normal breathing. To help prevent GDV, prophylactic stomach tacking (gastropexy) surgery can be performed on GSP dogs as an at-risk breed. Feeding should also be split into two or three smaller meals a day instead of one large meal. It’s important to know if your German Shorthaired Pointer is showing signs of GDV and to seek immediate veterinary care. These signs may include: Distended abdomen Retching without producing any vomit General signs of abdominal pain, such as standing and stretching or excessive drooling What To Feed a German Shorthaired Pointer  Selecting the best diet for a German Shorthaired Pointer is based on the individual needs of the dog. While it’s always important to choose dog food that contains high-quality ingredients, ask your veterinarian what to feed your GSP based on their specific medical history. If your GSP dog does not engage in extensive physical activity, they can become obese. So, it’s vital to avoid overfeeding your German Shorthaired Pointer in order to maintain proper body conditioning and weight. How To Feed a German Shorthaired Pointer Due to their active lifestyle, German Shorthaired Pointers should be fed a diet that contains a higher fat/protein ratio. If a GSP dog lives in a cold climate or is primarily outdoors, they may require more food in order to help maintain their body heat. For specific information on portion sizes, talk with your veterinarian. GSP dogs do well with eating two meals a day, one in the morning and a second in the evening. The evening meal should take place after the day’s activities to help prevent GDV. How Much Should You Feed a German Shorthaired Pointer? The average weight of an adult German Shorthaired Pointer can range from 45-75 pounds, so the amount of food they require can vary. It’s also dependent on their activity level and can therefore range from 2-5 cups of dry food a day, divided into two meals. Nutritional Tips for German Shorthaired Pointers For German Shorthaired Pointers that have hip or elbow dysplasia, nutritional supplements with glucosamine and chondroitin can help keep their joints healthy. Omega-3 supplements can also aid in protecting joint health along with keeping their skin and coat healthy. Behavior and Training Tips for German Shorthaired Pointers German Shorthaired Pointer Personality and Temperament German Shorthaired Pointers are revered hunting dogs due to their speed and endurance. In the home, this means that they need a lot of daily exercise to keep them physically and mentally stimulated. If they are not used as sporting dogs, then they require at least 1-2 hours of exercise every day, which should not be limited to walking. Running, fetching, or agility games are great ways to spend time with a GSP dog and to exercise their mind and body. As a rule of thumb, a tired GSP is a happy GSP. As long as their energy needs are met, they love to snuggle up with their family members in the evenings. However, a GSP dog that is not given the exercise they need will become troublesome—and often destructive. German Shorthaired Pointer Behavior A German Shorthaired Pointer’s job is to “follow their nose,” which can sometimes lead them into trouble if they are not working. They should be kept in a fenced yard so that when an interesting scent catches their attention, they don’t wander off and become lost. German Shorthaired Pointer Training German Shorthaired Pointers train well with their handlers due to years of breeding as hunting companions. Sometimes, however, their independent nature can make training a bit more challenging. This is best overcome with consistency and positive training methods. In non-hunting homes, GSP dogs enjoy playing outside with their humans and can be successful with obedience and agility training.  Fun Activities for German Shorthaired Pointers Hunting Obedience Agility Running, especially alongside a bicycle Playing fetch or Frisbee Hiking Swimming German Shorthaired Pointer Grooming Guide With their short, shiny coats, German Shorthaired Pointers typically don’t require much in the way of grooming. They are average shedders, but this can be minimized with weekly brushing. Skin Care Skin care for a German Shorthaired Pointer varies from dog to dog. That said, this breed does not typically have sensitive skin. Coat Care German Shorthaired Pointers have a short, smooth coat and are average shedders. Weekly brushing reduces shedding, and bathing is only necessary every few months (or if your GSP dog rolls in something smelly). Eye Care Routine cleaning with a soft, damp cloth will help prevent normal tearing and debris from building up around your GSP’s eyes. Ear Care Routine cleaning with a veterinary-approved ear cleanser is vital in maintaining your GSP dog’s healthy ear canals. This should also be done any time your GSP is in water, such as after swimming or bathing. Considerations for Pet Parents As with any breed, it’s important for pet parents to understand the physical and mental needs of the dog they are considering before bringing them into their home. For GSP dogs, their high energy requirements must be met to avoid unwanted and destructive behaviors. Therefore, they are best suited for active homes. Their energy demands can make GSP dogs a poor match for first-time dog parents. However, after expending their boundless energy on outdoor adventures, German Shorthaired Pointers love nothing more than to lie around with their humans. Their energy, size, and playful demeanor make them quite suitable for families with children."}]