[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Boston Terrier a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, with proper training Boston Terriers can be great, playful family dogs."}}, {"@type": "Question", "name": "Are Boston Terriers smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, Boston Terriers are often very smart dogs."}}, {"@type": "Question", "name": "How much does a Boston Terrier cost?", "acceptedAnswer": {"@type": "Answer", "text": "On average, you can expect to spend around $1,000 when purchasing a Boston Terrier puppy from a reputable breeder."}}, {"@type": "Question", "name": "Is a Boston Terrier a good house dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. While they love to run, Boston Terriers often do well in an urban setting, provided they get enough exercise each day."}}, {"@type": "Question", "name": "How long do Boston Terriers live?", "acceptedAnswer": {"@type": "Answer", "text": "The typical Boston Terrier lifespan is between 11-13 years."}}, {"@type": "Question", "name": "What are the differences between a Boston Terrier and a French Bulldog?", "acceptedAnswer": {"@type": "Answer", "text": "While these two breeds are quite similar, the Boston Terrier is a bit leaner, has pointier ears, and has a bit more energy than a French Bulldog. Featured Image: iStock/schuie"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Boston Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/boston-terrier.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/boston-terrier.jpg"}, "author": {"@type": "Person", "name": "Katherine Smith, DVM, CVA, CVSMT", "url": "https://www.petmd.com/author/dr-katherine-smith"}, "keywords": "Dog, Breed, Zoo Boston Terrier Pack, Boston Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/boston-terrier"}, "datePublished": "October 11, 2022", "dateModified": "October 13, 2023", "description": "Boston Terriers are small and spunky dogs who have lots of energy. They can be prone to health issues because of their flat face and big eyes. Learn more about caring for Boston Terrier puppies and dogs.", "articleBody": "Boston Terriers originated in Boston (hence their name) and are affectionately known as the “American gentleman” because of their good manners and tuxedo coat. They are small dogs that have a shoulder height of 15-17 inches and weigh 12-15 pounds. They can be quite rambunctious and like to participate in whatever their family is doing. Although they have a lot of energy, Boston Terriers are content with consistent exercise and thrive in many environments, including urban settings. They are good family dogs and do well with children who play gently with them. It’s important to always supervise children with dogs, especially Boston Terriers, because this active and ambitious breed can accidentally become injured during playtime. All Boston Terriers are brachycephalic—meaning they have a flat nose, long palate, and narrow airway—so they suffer from breathing problems if they overheat or exercise for too long. Caring for a Boston Terrier Boston Terriers are small and stocky. They have large and bulging round eyes that require care and a short, flat nose. As noted, they are considered brachycephalic and may have trouble breathing if they are exposed to high heat or exercised for too long. Because of this, it’s important to keep exercise and play sessions to the mornings and evenings during the summer. Boston Terrier Health Issues Boston Terriers can be prone to health issues specific to their stature. Knowing about the conditions that they are predisposed to can help you prepare how to handle any health concerns that may arise. It is also important to understand how you may need to adapt to an appropriate activity level and environment that will best suit a Boston Terrier. Brachycephalic Syndrome Like many small and flat-faced breeds, the Boston Terrier is considered brachycephalic and prone to upper-airway obstruction. Boston Terriers have flat noses, short muzzles, and small nostrils, and tissues at the top of their throat can get enlarged. Combined, these anatomical issues result in difficulty breathing, overheating, and a reduced tolerance for exercise (especially in a warm, humid climate). Surgery can help alleviate this condition and make it easier for Boston Terriers to breathe. It’s important for pet parents to monitor their dog’s exercise in hot and humid weather.  Brachycephalic dogs make a snoring sound when they breathe. Being overweight exacerbates their breathing problems, so it&#039;s important to keep them trim and in shape. Patellar Luxation Boston Terriers are prone to a condition called patellar luxation. It is often caused by an abnormally located ligament within the knee joint. Over time, the edge of the bony surface that holds the patella (kneecap) in place wears down, which forces the kneecap to slide out of place.  Depending on the severity, surgical correction of patellar luxation is possible. Keeping your Boston Terrier at an ideal weight helps lessen symptoms of this condition. Also, providing your pet with joint support through nutrition and possibly supplementation is important to delay the onset of arthritis. Eye Disease Boston Terriers are predisposed to eye diseases such as glaucoma, cataracts, and corneal ulcers, and their eyes should be routinely checked by your veterinarian or whenever you notice any eye discomfort or changes. Due to the prominence of a Boston Terrier’s eyes, this breed may be more likely to incur eye injuries. It is important to make sure your Boston Terrier is playing safely and away from objects that could potentially hurt their eyes.  What to Feed a Boston Terrier  Boston Terriers need a high-quality and well-balanced diet. Feeding them dry food intended for small breeds makes it easier for these small dogs to chew. Always consult your veterinarian on the appropriate amount of food needed to keep your dog at an ideal weight. How to Feed a Boston Terrier Boston Terriers have a high metabolism and should be fed two or three meals a day. A diet that is formulated for small breeds would be beneficial to meet their nutrient needs. How Much You Should Feed a Boston Terrier The amount you feed your Boston Terrier depends on the type and brand of food and the weight, age, and lifestyle of your dog. It&#039;s recommended that you ask your veterinarian about the appropriate amount. The dog food label also has recommendations based on these factors. Nutritional Tips for a Boston Terrier There are no supplements that are specific to Boston Terriers; however, like most breeds, they could benefit from joint and skin health supplements and nutrition. Behavior and Training Tips for Boston Terriers Boston Terrier Personality and Temperament Boston Terriers are full of energy and can be quite rambunctious. They love playing with their family and entertaining anyone. Some of their favorite activities include fetch and frisbee.  Boston Terriers require moderate exercise and usually do well in a multi-pet household, although this may depend on the dog. They are typically good around children, as long as the dogs have been appropriately trained and the children are gentle enough to not accidentally injure the dog.  Boston Terriers can be a bit vocal in order to get attention and like to chew, but both behaviors may be reduced with the appropriate training. Boston Terrier Behavior Boston Terriers are curious and like to be a part of their family’s activities. They are little bundles of energy that do best with several short bursts of exercise throughout the day rather than one long walk. They are intelligent but can be stubborn, so they may know exactly what you are saying but choose to not listen. Boston Terrier Training Boston Terriers are very intelligent and respond quickly to training. However, they may require some patience due to their stubborn ways. They often enjoy high-energy activities like flyball and agility games.  Due to their potential breathing issues, a well-fitted harness is a better option than a collar to reduce pressure on their trachea (windpipe) when walking. Fun Activities for Boston Terriers Fun activities you may enjoy with your Boston Terrier include: AgilityFlyballFrisbeeFetchBoston Terrier Grooming Guide Coat Care Boston Terriers have short, smooth coats that shed moderately. Their short coat means they get cold easily, so they may need a sweater or jacket in cold temperatures. Skin Care Boston Terriers typically do not require any specific skin care. Brushing your Boston Terrier’s coat weekly with a grooming mitt or soft-bristled brush will keep their coat healthy and reduce shedding. Eye Care Boston Terriers are prone to eye disease and injury, so it is important to regularly check their eyes for diseases and irritation and to be careful when playing. Your veterinarian may want you to keep a dog eye rinse on hand to flush out debris when needed. Ear Care Regular ear cleaning is usually sufficient to care for a Boston Terrier’s ears. Considerations for Pet Parents If you&#039;re thinking about adding a Boston Terrier to your family, it&#039;s important to consider how you will manage their health, especially their breathing and joint problems. Also, it&#039;s important to think about the appropriate environment for the lively Boston Terrier. These are high-energy dogs who need some space to play and exercise."}]