[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "American Foxhound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, American Foxhound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_american_foxhound"}, "datePublished": "November 3, 2008", "dateModified": "October 13, 2023", "description": "Learn everything about American Foxhound Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The American Foxhound is a dog breed brought over from England in the mid-17th century originally for the purpose of fox hunting. It is an ideal choice for those who live in rural areas or on large farms. There are now four main types of the breed: field trail hounds, fox hunting hound, &quot;trail&quot; hounds, and pack hounds. Physical Characteristics Agile and swift, the American Foxhound is slightly bonier and taller than its cousin, the English Foxhound. Its hard coat, which can be found in any color, including black, brown, white, tan, red and cream, is medium in length. Its expression, meanwhile, is gentle and pleading. The dog also has a musical voice when it is trailing and hunts with ease on rough terrain because of its body type. Personality and Temperament The tolerant, gentle, and friendly American Foxhound can be reserved, especially around strangers. And though not considered a traditional house pet, the American Foxhound is well behaved indoors, getting along with other household dogs or pets. A natural born hunter, it will also dash on the trail of a scent, sometimes even without receiving a command. Care The American Foxhound’s coat is very easy to maintain, just the occasional brushing to clear the dead hair. It loves the outdoors and may prefer to live outside, provided there is warm bedding and shelter. Its daily exercise requirements can be met with a jog or long leash-led walk. The American Foxhound is a highly sociable dog and should, therefore, have regular human interaction. The breed is not well suited for the city life. Health The American Foxhound, with a lifespan of 11 to 13 years, is not especially prone to major or minor health problems. This particularly breed, however, may suffer from thrombopathy occasionally; to identify this condition early, a veterinarian may run blood tests on the dog. History and Background Some evidence indicates hounds were first brought to America in 1650, when the Englishman Robert Brooke sailed to the Crown Colony of America with his pack of hunting dogs. These hounds would later become the basis of several strains of American Hounds. In the mid-to-late 1700s, hounds from France and England were brought in to further develop the breed. By then, the breed had gained much recognition, especially amongst the upper class and politicians; even President George Washington was known to have an American Foxhound. The American Foxhound&#039;s popularity was mainly due to its ability to hunt and chase down foxes and deer. Hunters in the southern United States -- especially in parts of Tennessee, Maryland, Virginia, and the mountainous regions of Kentucky -- sought to develop specific strains of the breed according to their needs; these included the Walker, Trigg, Hudspeth, Goodman, July, and Calhoun hounds. The new varieties were used not only as show or running hounds, but also as pack or competitive field trial hounds. The American Foxhound is said to be among the earliest breeds that were registered under the American Kennel Club (AKC). Interestingly enough, many Foxhounds used by hunters today are not registered under the AKC, but rather with specialty Foxhound studbooks, the most important one being the International Foxhunter&#039;s Studbook."}]