[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Keeshond a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Their friendly and affectionate nature, along with the medium Keeshond size, makes this breed an excellent family companion."}}, {"@type": "Question", "name": "Is a Keeshond high-maintenance?", "acceptedAnswer": {"@type": "Answer", "text": "In terms of grooming, Keeshond dogs do require regular care, including brushing several times a week. They are also in need of attention and require lots of love from their family."}}, {"@type": "Question", "name": "Are Keeshonden a rare breed?", "acceptedAnswer": {"@type": "Answer", "text": "While not exceedingly rare, Keeshonden aren’t as commonly found as some other dogs. The American Kennel Club (AKC) ranked the Keeshond as the 90th most popular breed in their list of 199 dogs."}}, {"@type": "Question", "name": "How much does a Keeshond puppy cost?", "acceptedAnswer": {"@type": "Answer", "text": "The typical Keeshond price varies by a few different factors, including breeder, bloodline, and location. In general, expect to pay $1,000–$2,000 for a puppy from a reputable Keeshond breeder. Featured Image: Adobe/Evelina"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Keeshond", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/keeshond-dog-breed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/keeshond-dog-breed.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Keeshond", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/keeshond"}, "datePublished": "September 22, 2023", "dateModified": "October 13, 2023", "description": "Learn everything about Keeshond Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Keeshond, with their plush coat and expressive eyes, is a dog breed that has captured the hearts of many people throughout the centuries. Hailing from the Netherlands, the Keeshond served as a companion on the barges and boats that traveled the canals, according to the Keeshond Club of America (KCA). Because they were bred to be pets, Keeshonden (the plural of “Keeshond”) have gentle and loving temperaments that make them great family dogs. This medium-sized dog typically weighs 35–45 pounds and stands 17–18 inches tall. Their striking appearance, characterized by a mane-like ruff, pointed ears, and a curled tail, makes the beautiful Keeshond hard to miss. Caring for a Keeshond Keeshond dogs are known for their affable and outgoing nature. As spitz dogs, they’re related to Samoyeds, Huskies, Norwegian Elkhounds, and Pomeranians, and they share a lot of the same traits, from the fluffy coat to their impressive intelligence.  They possess a moderate energy level, making Keeshonden adaptable to many different living situations—as long as they receive daily attention from their pet parent. These social dogs want to be by their humans’ sides and involved in all family activities. The most important aspect of caring for a Keeshond is making sure they feel loved and that their thick, double coat is regularly groomed. Keeshond Health Issues Keeshonden are generally healthy dogs, but, like all dogs, they do have predispositions to certain conditions. Investing in pet insurance can provide peace of mind when you bring home your Keeshond puppy. Hip Dysplasia Hip dysplasia is a condition where the bones of the hip joint don’t align properly. This causes rubbing and grinding of the bones, resulting in joint deterioration and loss of function. Hip dysplasia can be screened for with X-rays, and treatment will vary depending on the severity. A common ailment in many breeds, it’s essential to monitor a Keeshond’s hip health, especially as they age. Patellar Luxation The Keeshond dog breed can develop luxating patellas, an inherited condition where one or both of the kneecaps pop in and out of place. Although patellar luxation is not generally considered a painful condition, it may cause the dog to favor one leg and can predispose them to other knee injuries (such as a cranial cruciate ligament tear) and arthritis. Depending on the severity of the luxating patella, surgery may be recommended to prevent further injury and improve quality of life.  Primary Hyperparathyroidism (PHPT) Primary hyperparathyroidism (PHPT) is an inherited condition that can affect Keeshonden. Most cases of PHPT are caused by a tumor in the parathyroid gland (a small gland at the top of the thyroid glands) that causes inappropriate secretion of parathyroid hormone. This can result in severely elevated levels of calcium in the blood, which can be life-threatening. The condition typically affects adult dogs, and initially they may not show any signs of the disease except for increased thirst and urination. As the disease progresses, dogs will become weak, lethargic, experience weight loss, and eventually have organ damage and kidney failure. PHPT is treated by surgically removing the affected parathyroid gland. A genetic test can be performed on Keeshond puppies to check for the PHPT gene. A positive result indicates that a dog will likely develop PHPT in their lifetime, and careful monitoring should be done by the owner to allow for early detection and intervention. What To Feed a Keeshond When selecting the best diet for a Keeshond, consider the needs of your individual dog. This includes lifestyle, current weight, age, and other factors. While it’s always important to choose a diet with high-quality ingredients that meets standards set by the Association of American Feed Control Officials (AAFCO), it’s best to discuss diet with your veterinarian, who can make a recommendation based on your dog’s specific medical history. How To Feed a Keeshond Most Keeshonden do not require any special feeding instructions. Typically, feeding your dog two meals (one in the morning and one in the evening) is well tolerated by this breed. Keeshond puppies will need to eat more frequently, up to four meals a day. How Much Should You Feed a Keeshond? It’s important to follow the feeding guide on the dog food bag to ensure your dog is receiving the appropriate essential daily nutrients. For an adult Keeshond, you can expect to feed 1.5–2.5 cups daily, divided into two meals. This amount will need to be adjusted based on life stage and activity. Always talk to your veterinarian about how much you should feed your dog. Nutritional Tips for Keeshonden Fish oil supplements can be beneficial for a Keeshond’s coat and overall health. Additionally, glucosamine can be considered for joint health, especially in those experiencing hip dysplasia or luxating patellas. Chat with your veterinarian before giving your dog any supplements. Behavior and Training Tips for Keeshonden Keeshond Personality and Temperament Keeshonden are friendly, eager to please, and get along well with other pets and children who know how to interact with animals. These are social dogs who don’t do well when left alone for long hours. Keeshond dogs love their people and should be treated like a family member. Sometimes known as the “smiling Dutchman” because of their happy temperament, Keeshonden are fun-loving dogs who are always ready to play. Keeshond Behavior They are typically well-mannered and not known for excessive barking. However, Keeshonden can become vocal when left alone without their humans or if they sense something amiss. Keeshond Training The Keeshond’s cleverness and eagerness to please makes them very responsive to positive reinforcement training. They excel in obedience training, which can be a fun activity for both the dog and pet parent. The KCA recommends enrolling Keeshond puppies in a puppy kindergarten class when they’re between 9 and 12 weeks old, where they can learn the basics like “sit,” “stay,” and “come.” Early socialization is essential for pups as well. Fun Activities for Keeshonden Agility training Puzzle toys Fetch games Scent tracking Socialization outings Following their family around Neighborhood walks Keeshond Grooming Guide The Keeshond dog breed has a fluffy, double coat that sheds moderately year-round, with an increase in furballs during seasonal changes. Regular grooming is essential for keeping the Keeshond’s skin and coat healthy. Keeshond colors include shades of silver, black, cream, and gray. Skin Care Skin care for the Keeshond varies depending on the individual’s needs. However, this breed does not typically have sensitive skin. The best way to keep their skin healthy is through regular bathing and brushing to maintain their coat. Contact your vet if you notice any changes in your Keeshond’s skin, including flakiness, redness, or if your dog appears itchy. Coat Care Thanks to their double coat, Keeshonden need to be brushed several times a week to remove dead hair and prevent mats and tangles from forming. Occasional professional grooming can also be beneficial.   Eye Care Keeshond dogs are known for their “spectacles,” which are dark, glasses-like markings around their eyes. This coloring usually doesn’t obstruct their vision, but you might need to periodically trim the fur around their eyes if it’s causing problems. Regular cleaning with a veterinary-approved wipe can help prevent any potential issues. Notify your vet if you notice any changes in your dog’s eyes, such as redness or discharge, as these can be signs of an infection. Ear Care Routine ear cleaning with a veterinary-approved ear cleanser is vital for maintaining healthy ear canals. This should also be done any time a Keeshond is exposed to water, such as after bathing or swimming. Considerations for Pet Parents While the Keeshond is an adaptable breed, that doesn’t mean they seamlessly fit into any home. Bred for companionship, they’re best suited for families or individuals who can spend quality time with them in an environment where they can be part of daily activities. The Keeshond’s moderate energy level and grooming needs should also be considered."}]