[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much is a Portuguese Water Dog?", "acceptedAnswer": {"@type": "Answer", "text": "The cost of a Portuguese Water Dog puppy can range from $1,500-$2,500, depending on the breeder, lineage, location, and other factors. Pet parents should consider connecting with a responsible PWDCA-approved breeder or Portuguese Water Dog rescue organization to find their new best friend."}}, {"@type": "Question", "name": "Are Portuguese Water Dogs hypoallergenic?", "acceptedAnswer": {"@type": "Answer", "text": "Portuguese Water Dogs are often referred to as “hypoallergenic” because they shed less than many other breeds. While no pet is 100% allergen-free, Portuguese Water Dogs are considered a preferred pet for people with allergies. But keep in mind: There’s no guarantee that having a Portuguese Water Dog will prevent symptoms such as sneezing, watery eyes, and respiratory issues, as sensitivity to a dog’s allergens varies from person to person. Before bringing home a Portuguese Water Dog puppy, spend time with the breed to see how your allergies react. "}}, {"@type": "Question", "name": "Is a Portuguese Water Dog a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "The Portuguese Water Dog is an excellent family dog. They are tender with loved ones and good with children and other pets—again, as long as they receive proper training and get their fill of daily mental and physical stimulation. That means pet parents should be prepared to give their enthusiastic, tail-wagging buddy plenty of exercise and attention. "}}, {"@type": "Question", "name": "How big do Portuguese Water Dogs get?", "acceptedAnswer": {"@type": "Answer", "text": "Portuguese Water Dogs are medium-sized dogs, standing 17-23 inches tall and weighing between 35-60 pounds. Like many other breeds, females tend to be smaller than males. Featured Image: iStock/inhauscreative"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Portuguese Water Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/portuguese-water-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/portuguese-water-dog.jpg"}, "author": {"@type": "Person", "name": "Patricia Kaowthumrong", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Zoo Portuguese Water Dog Pack, Portuguese Water Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/portuguese-water-dog"}, "datePublished": "February 3, 2023", "dateModified": "October 13, 2023", "description": "Portuguese Water Dogs are lovable, friendly dogs when well trained and socialized from an early age. Learn more about caring for Portuguese Water Dog puppies and what makes them a great family pet.", "articleBody": "Spirited, athletic, and intelligent, the Portuguese Water Dog is an excellent swimmer and seafarer bred to be a fisherman’s helper on Portugal’s coasts. They are beloved for their affectionate natures, minimal shedding, and adorable teddy bear-like faces—so much so that they even reached celebrity status: Sunny and the late Bo Obama, who both lived with the first family in the White House, may be the most famous Portuguese Water Dogs in U.S. history.  But Portuguese Water Dogs, which can grow to be up to 23 inches tall and weigh between 35-60 pounds, are popular additions to households all over the U.S. Due to their energetic demeanors, the fluffy and friendly water dog breed is best for active pet parents. Caring for a Portuguese Water Dog The jolly, affectionate Portuguese Water Dog can be a doting family pet if given the proper amount of exercise, training, and attention starting at an early age. They are also wired to work, according to the Portuguese Water Dog Club of America (PWDCA): The canines were bred from the 13th century to perform duties such as retrieving fishing gear and preventing fish from escaping nets along the coast of Portugal. That means pet parents should be prepared to provide their energetic Portuguese Water Dog with plenty of attention and exercise (at least 30-60 minutes per day). Those who do will be rewarded with loyalty, plenty of snuggles, and affection. Their robust, medium-size bodies are blessed with low-shedding coats, but their curly or wavy locks require regular grooming and care. “They are just happy-go-lucky, nice dogs,” says Pam Nichols, DVM, CCRP, CFI, immediate past president of the American Animal Hospital Association. Portuguese Water Dog Health Issues While they are predisposed to a few conditions, “health issues with Portuguese Water Dogs tend to be relatively low,” Nichols says.  Hypothyroidism Hypothyroidism is a condition in dogs characterized by the decreased production of hormones in the thyroid gland. Like in humans, this gland serves an important function in dogs’ metabolism. If the organs aren’t producing enough hormones, body functions slow, resulting in symptoms such as weight gain, lethargy, chronic skin and ear infections, heat-seeking behaviors, and an unhealthy coat.  If left untreated, hypothyroidism can shorten your Portuguese Water Dog’s lifespan. But thankfully, the condition can be treated with a lifelong oral medication and routine monitoring by your veterinarian. Hip Dysplasia  Hip dysplasia is a condition characterized by an unstable fit of the hip’s ball and socket. Pups with hip dysplasia commonly display reduced activity and limited mobility. There are many options for treating hip dysplasia, including nutrition supplements (such as Glucosamine with MSM), anti-inflammatory medications, and, in severe cases, surgery. If left untreated, arthritis can develop. Addison’s Disease According to the PWDCA, Portuguese Water Dogs are one of about a dozen breeds that are predisposed to Addison’s disease, a dysfunction of the adrenal glands. The glands, located near the kidneys, produce corticosteroid hormones that affect dogs’ ability to manage stress and metabolism. With Addison’s disease, there is a decrease or total lack of these hormones being produced. Pups with the disease may show symptoms such as: Lethargy Decreased appetite Vomiting Diarrhea The disease is treatable and, if caught early, affected patients can live normal, active lives. Congenital Eye Issues Portuguese Water Dogs can develop progressive retinal atrophy (PRA) or cataracts, according to the PWDCA. PRA is a disorder that causes deterioration of the retina, a light-sensitive layer of cells in the eye, and can gradually lead to blindness. While it isn’t painful, symptoms include night blindness, dilated pupils, and clumsiness. There is no treatment for PRA, but it can take months or even years for the disease to fully impair a dog’s eyesight. Cataracts involve cloudiness in the eyes, which can eventually lead to vision loss. If you notice your pup’s lenses have a cloudy or opaque appearance or that his vision has become limited, consult a veterinarian. The issue can be treated with surgery, but it will lead to blindness if untreated. What To Feed a Portuguese Water Dog To help your Portuguese Water Dog maintain a healthy weight, avoid health problems, and be his happiest and most energetic, he must consume the proper type and amount of dog food approved by the Association of American Feed Control Officials (AAFCO). How To Feed a Portuguese Water Dog  Nichols recommends choosing a high-quality dog food brand (such as Hill’s Science Diet, Iams, Eukanuba, Royal Canin, or Purina Pro Plan) that is appropriate for your dog’s life stage. Portuguese Water Dog puppies should be fed on a regular schedule three times per day, while adults can be fed once in the morning and once at night. How Much Should You Feed a Portuguese Water Dog? To determine the quantity of food to give your Portuguese Water Dog, talk to your veterinarian. They will assess your pup’s age, activity level, and other factors to determine how many calories your dog needs to consume daily. The correct meal size will depend on factors including the type of food, number of meals, and life stage. Nutritional Tips for Portuguese Water Dogs Portuguese Water Dogs fed a complete and balanced diet shouldn’t need nutritional supplements unless a veterinarian recommends them. Essential nutrients in dog food include protein, carbohydrates, vitamins, minerals, and fat, the right combination of which will help your four-legged friend look and feel his best. Behavior and Training Tips for Portuguese Water Dogs Portuguese Water Dog Personality and Temperament  Portuguese Water Dogs are intelligent and loyal companions that make wonderful additions to families of all sizes—though they require proper training, socialization, and exercise to manage their high energy levels and curious natures. “A Portuguese Water Dog can make a great family pet that can be around children and other animals,” says Christos Philippou, owner and trainer at Delaware K9 Academy. “However, proper introductions are a must to keep everybody in the household safe.” Since these water-loving dogs were bred to be the right-hand pups of Portuguese fishermen, they love to work and learn new things. They need jobs—whether that’s learning new tricks, agility training, or fetching balls and Frisbees—to keep them happy. Athletic and clever, Portuguese Water Dogs are ideal for households that enjoy exercise and outdoor activities like hiking, walking, jogging, and swimming.  Portuguese Water Dog Behavior  While the pups aren’t known to be huge barkers, Portuguese Water Dogs will speak up when prompted—for example, by squirrels in the yard or visitors at your doorstep. However, the activity-relishing Portuguese Water Dog can turn to undesirable behaviors like excessive barking and chewing if he doesn’t receive the right amount of mental stimulation and exercise. “These dogs love to run and do not tire easily,” Philippou says. “They will certainly need a daily walk paired with mental stimulation and obedience training to reduce nuisance behaviors and to ensure their needs are being met.” Pet parents can keep their four-legged friends busy by setting up agility or obstacle courses in their backyard, taking their pups for a swim, and investing in a variety of puzzle toys. Portuguese Water Dog Training  The Portuguese Water Dogs are known for their high intelligence and easy-to-train nature—which is why they’ve been helpful companions for centuries. Positive reinforcement, a training method that involves using praise and treats to reward good behaviors, should be started as early in your dog’s life as possible. “Positive reinforcement training is a great option for the Portuguese Water Dog, as they can often be highly food motivated,” Philippou says. “Rewarding the good behaviors is an excellent way to communicate with your dog and mark good behaviors that you want to continue.” In addition to excelling at obedience and agility training, the breed has a gentle temperament that is ideal for therapy and service dog training. Fun Activities for Portuguese Water Dogs  Walking or running Hiking Fetch Swimming Dock diving Dog park Tug-of-war Chase Agility training Obedience training Puzzle games Portuguese Water Dog Grooming Guide The Portuguese Water Dog’s eye-catching coats can be either wavy or curly, both of which are low-shedding and require regular grooming and brushing. To keep their beautiful hair from becoming unruly, Nichols recommends a visit to the groomer every 4-6 weeks. “They don’t shed much and have a constantly growing hair coat,” she says. “That also means their coat will mat if left alone, so get a good groomer and get a good schedule going.”  Nichols also urges pet parents to brush their Portuguese Water Dog’s teeth daily, which can help prevent expensive anesthesia-induced cleanings later in life. Skin Care If your adventure-loving friend gets wet or dirty from being outside, give him a bath with a dog-specific shampoo. But otherwise, Portuguese Water Dogs don’t require a regular bathing routine.  Coat Care  Because the Portuguese Water Dog has such voluminous curls and waves, they are prone to matting and require regular visits to the groomer. Pet parents will also need to brush their dog a few times a week.  Eye Care Because congenital eye conditions such as PRA and cataracts are common in Portuguese Water Dogs, pet parents should look for symptoms such as impaired night vision, clumsiness, and dilated pupils. Ear Care Portuguese Water Dogs are not prone to ear infections, but they can benefit from ear cleanings, especially if they love to swim. Considerations for Pet Parents Loving and loyal Portuguese Water Dogs make wonderful additions to active households of all sizes. But they must be supplied with the right amount of daily mental and physical stimulation, which can encompass everything from trail running to a romp in the yard. They can thrive in smaller quarters like apartments if their needs are met, but Portuguese Water Dogs will ultimately be happiest with plenty of room to roam in a fenced-in yard. Pet parents should also plan on using positive reinforcement training starting at a young age and budgeting for regular visits to the groomer."}]