[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Cavalier King Charles Spaniel a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "CKC Spaniels are very friendly dogs and are very loyal to their family. They are known to be tolerant and patient, making them great family dogs that get along well with children and other dogs. They are very adaptable and protective of their family and those they are loyal to."}}, {"@type": "Question", "name": "Are Cavalier King Charles Spaniels smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "CKC Spaniels are very eager to please their humans, making them easy to train. They are smart and excel at several canine sports including obedience, rally, and agility."}}, {"@type": "Question", "name": "How much does a Cavalier King Charles Spaniel cost?", "acceptedAnswer": {"@type": "Answer", "text": "A CKC Spaniel costs about the same as most other small-breed dogs. The average price is around $1,500 for a high-quality puppy from a reputable breeder. However, you can find Cavalier King Charles Spaniel puppies ranging in price from $1,000-$2,500."}}, {"@type": "Question", "name": "Is the Cavalier King Charles Spaniel a good choice for an apartment?", "acceptedAnswer": {"@type": "Answer", "text": "CKC Spaniels would make great dogs for those living in an apartment, as they do not require a lot of exercise. They are also small, toy breed dogs and do not need a large room or crate, making them a great choice for an apartment."}}, {"@type": "Question", "name": "What is the difference between a Cavalier King Charles Spaniel and a King Charles Spaniel?", "acceptedAnswer": {"@type": "Answer", "text": "The King Charles Spaniel has a wavier coat compared to the Cavalier King Charles Spaniel&#039;s straight fur. Also, the King Charles Spaniel has a snubbed nose that is turned up at the end, while the Cavalier King Charles Spaniel has a more elongated muzzle. Both breeds come in the same colors and look quite similar. The names can get confusing, so you&#039;ll most commonly find the King Charles Spaniel referred to as the English Toy Spaniel. Featured Image: iStock.com/Swanlake"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cavalier King Charles Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/Cavalier-King-Charles-Spaniel.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/Cavalier-King-Charles-Spaniel.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Breed, Cavalier King Charles Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/cavalier-king-charles-spaniel"}, "datePublished": "September 29, 2022", "dateModified": "October 13, 2023", "description": "Cavalier King Charles Spaniels are small and friendly dogs who fit in well with almost any family. Learn more about caring for Cavalier King Charles Spaniel puppies and dogs.", "articleBody": "The Cavalier King Charles (CKC) Spaniel is a loving and affectionate companion dog. They got their name from British royalty in the 17th century. King Charles I and his son Charles II were so fond of this breed that they took their dogs with them everywhere, including Parliament. The CKC Spaniel was bred to warm laps in drafty castles or on chilly carriage rides. Although they do share the same history, the CKC Spaniel and the King Charles Spaniel are different breeds. CKC Spaniels are a part of the toy group but are also sporting and hunting dogs and, with their gentle nature, make excellent therapy dogs. The CKC Spaniel gained popularity on the TV show “Sex and the City” as Charlotte York’s treasured pet. The CKC Spaniel is currently ranked as the 15th most popular dog in the U.S. by the American Kennel Club. Caring for Cavalier King Charles Spaniels CKC Spaniels are usually 12-13 inches tall and weigh 13-18 pounds. Male dogs of this breed are taller and weigh more than females. Their life expectancy is 12-15 years, as smaller dogs tend to live longer. CKC Spaniels have naturally floppy ears, a long back, compact body, and deep chest. They have a smooth, long coat and they come in four colors with distinct patterns: Blenheim: Reddish-brown and white; partial red mask and ears, and red patches on a white body Tricolor: Black and white with tan points Ruby: Solid red Black and tan: Black with tan markings CKC Spaniels require a moderate amount of care. Their long coat requires weekly brushing to help decrease shedding and to keep it well maintained. They also require frequent professional grooming. Cavalier King Charles Spaniel Health Issues CKC Spaniels are prone to several medical conditions that require routine physical exams and additional screening tests. Responsible breeders usually test dogs for any health issues before deciding whether to breed them. Eye Conditions CKC Spaniels are prone to eye conditions such as cherry eye, dry eye, retinal problems, and cataracts. An eye exam is noninvasive, painless, inexpensive, and easily performed on the dogs during a routine vet visit. Your veterinarian uses specialized tools to look for any abnormalities to the back of the eye or retina and the surface of the eye. They also check your dog’s ability to produce tears. Symptoms of eye disease in CKC Spaniels include: Swelling in the corner of the eye Eye discharge Squinting White opacity to the surface of the eye Bumping into things Depending on which eye condition is diagnosed, surgery or long-term eye medications might be necessary. Patellar Luxation Patellar luxation, or sliding kneecaps, often occur in the CKC Spaniel breed. This condition is usually noticed in the first 18 months of life, but may be diagnosed at any time even before your dog shows any symptoms. Patellar luxation causes limping, lameness, and “bunny hopping” and usually affects both hind legs. Hip Dysplasia Hip dysplasia is another health condition in CKC Spaniels where the thigh bone does not fit correctly into the hip bone. Dogs affected with hip dysplasia often show signs of pain including limping and lameness, and systemic signs like lethargy and anorexia are common. The Orthopedic Foundation for Animals (OFA) keeps records on the hip status of individual dogs, including CKC Spaniels, over many generations. Any dog that is going to be bred should have their hips evaluated by a veterinarian. This is done using x-rays on dogs as young as 4 months old, so that breeders have valuable information when deciding whether to breed them. Mitral Valve Heart Disease Mitral valve disease (MVD) is the leading cause of death in CKC Spaniels. It is a deterioration of the heart’s mitral valve, which normally keeps blood flowing in the correct direction. When the mitral valve is not functioning normally, it allows blood to flow backward, causing further deterioration of other parts of the heart muscle. Unlike other dog breeds with MVD, in CKC Spaniels, this condition almost always leads to congestive heart failure. Signs of MVD in CKC Spaniels are: Coughing Exercise intolerance Difficulty breathing Fainting episodes MVD is diagnosed using a stethoscope, x-ray, and echocardiogram (heart ultrasound) with color Doppler. Because this is a highly heritable disease, it is advised not to breed a CKC Spaniel with a heart murmur or with diagnosed MVD. Syringomyelia Syringomyelia (SM) or “neck scratcher’s disease” is a severe, inherited, progressive neurological disease that is usually diagnosed in CKC Spaniels between 6 months and 3 years of age, but it has been reported in dogs up to 10 years old. This condition causes fluid buildup around the spinal canal, often from abnormalities of the brain and skull. It is diagnosed using an MRI scan or by observing the classic clinical signs below. Symptoms of SM in CKC Spaniels include: Scratching on or in the air near the shoulder when excited or walking on a leash Yelping, whining, or whimpering in pain for no apparent reason Weakness in the legs Head shaking Lip licking Seizures Medical management of SM helps but will not resolve all the clinical signs. The only option for dogs with significant symptoms of disease is surgical correction to help alleviate pain. What to Feed a Cavalier King Charles Spaniel CKC Spaniels flourish on a complete and balanced diet approved by the Association of American Feed Control Officials (AAFCO) and specifically formulated for small or toy breed, as the kibble size is a bit smaller and aids in digestion. Hill’s Science Diet, Royal Canin, and Purina are among the most recommended brands of dog food. How to Feed a Cavalier King Charles Spaniel CKC Spaniels that are under 1 year old should eat a special diet formulated for puppies. Puppy formula has added nutrients to aid in mental and physical development during this crucial time of their lives. Any dog food that is labeled for “all life stages” should only be used for puppies, as they are not usually formulated for older dogs. Dogs that are older than 1 year should eat a diet labeled for adult dogs. When your dog reaches 7-8 years old, it is best to ask your vet if you could switch to a diet formulated for senior dogs. This type of dog food is often leaner and has added vitamins and supplements such as glucosamine for joint health. Consider feeding your adult and senior CKC Spaniel a low-fat or low-calorie diet, as maintaining lean body weight is best for dogs that are prone to orthopedic problems. How Much You Should Feed a Cavalier King Charles Spaniel Puppies should be fed three to four times a day, and adult dogs should be fed twice a day. The amount of food depends on the specific food your CKC Spaniel eats. You can ask your veterinarian, follow the package instructions, or contact the dog food manufacturer, as AAFCO-approved diets have veterinary nutritionists who help determine dietary requirements. Nutritional Tips for a Cavalier King Charles Spaniel In general, if a dog is on a well-balanced, AAFCO-approved diet, then they are getting all of the necessary vitamins and minerals to grow and develop. Depending on the breed and life stage of your CKC Spaniel, they might benefit from nutritional supplements. Joint supplements such as glucosamine, chondroitin, and methylsulfonylmethane (MSM) are great for joint health. MSM has all-natural, anti-inflammatory properties. Research shows that reducing inflammation helps control pain associated with osteoarthritis, a common problem in dogs with joint issues. Essential fatty acids such as omega-3 (high-quality fish oil) may have anti-inflammatory properties when given at appropriate doses. They are also known to help support eye and heart health. Probiotics are used to help improve digestive health, immunity, and ability to fight disease; manage urinary tract infections; and reduce allergic reactions by blocking allergens from getting absorbed into the intestines and blood stream. A generally healthy dog may not need probiotics, but during times of illness, stress, or malnutrition they are valuable to help restore balance to the body. Behavior and Training Tips for Cavalier King Charles Spaniels Cavalier King Charles Spaniel Personality and Temperament CKC Spaniels are very friendly and loyal. They are great family dogs, known to be tolerant, patient, and good with young children and other dogs. They are also very adaptable and protective of their family and those they are loyal to. Although CKC Spaniels were bred to be lap dogs, they are descendants of the sporting family and enjoy moderate exercise and outdoor activities. They do well with both active, athletic families and with less active, homebody types. It is not a good idea to allow your CKC Spaniel to go off leash. Their scenting and hunting instincts might be triggered by an unfamiliar, smell causing them to run off and possibly get lost or hurt. A fenced yard is recommended for your CKC Spaniel. Cavalier King Charles Spaniel Behavior The CKC Spaniel needs human interaction and companionship to thrive and should not be left alone for long periods of time. Because CKC Spaniels are very friendly and good with both families and strangers, they do not make good watch dogs. They are very adaptable and great company to those with different lifestyles. Cavalier King Charles Spaniel Training CKC Spaniels are very eager to please and easy to train. They are smart and excel at several canine sports including obedience, rally, and agility. They are known to have a sweet, gentle, and affectionate demeanor, and therefore they make great therapy dogs for disabled or elderly people. It is best for CKC Spaniels to be socialized and trained as puppies so that they learn good manners and are comfortable with other people in a variety of circumstances. CKC Spaniels do well with reward-based training involving food and treats. Fun Activities for Cavalier King Charles Spaniels The following are fun activities you can enjoy with your CKC Spaniel: Obedience classes to help with mental stimulation Agility Flyball Rally Hiking Running on the beach Cavalier King Charles Spaniel Grooming Guide CKC Spaniels are easy to maintain with regular brushings with a bristle or pin brush, to ensure the coat does not get tangled and to maintain shine. The frequency of grooming depends on how long you keep your dog’s coat. A general rule of thumb is the longer the dog’s hair coat, the more grooming is required. Skin Care CKC Spaniels should be bathed at least once or twice a month to help keep their coat healthy and skin free of irritants. A mild, soap-free, aloe- or oatmeal-based shampoo is best to keep their skin healthy and coat shiny. Coat Care The CKC Spaniel has a long, silky coat requiring regular brushing and grooming. Brushing not only helps prevent tangles and matting, but also serves as a massage and develops the human-animal bond. CKC Spaniels only shed a small amount, but regular brushing will help decrease the amount of shedding as well. Eye Care Since some CKC Spaniels have white or light-colored fur around the eyes, it is good practice to clean the eyes and surrounding areas daily with a wet, warm washcloth or a medicated wipe, such as Angels’ Eyes, to prevent tear staining. Brown or reddish-brown fur around the eyes is caused by a normal stain in their tears called porphyrin. CKC Spaniels are prone to many eye conditions, so routine monitoring of their eye color and appearance is very important. Seek a veterinarian’s attention as soon as possible if you notice any changes in or around your dog’s eyes. Ear Care Your CKC Spaniel’s ears should be checked weekly for signs of infection such as redness, debris, and odor. Mild ear cleaners are recommended to keep the ear canals clean and dry. CKC Spaniels have long earflaps that are prone to infections. When infected, excessive itch and head shaking may cause ear hematomas. This occurs when the tiny blood vessels in the earflap burst, and a pocket of blood develops. It can be resolved by treating the underlying ear infection or with a surgical corrective procedure.   Considerations for Pet Parents CKC Spaniels make great pets for just about any home or lifestyle. They can be very active and enjoy exercise often, or they can happily lie on the couch all day. They are very good with other dogs and cats and are happy in a large home or a small apartment. They only require a small amount of exercise daily; two 20-30 minute walks are sufficient. CKC Spaniels are very gentle and playful and would make a great addition to a home with children. They enjoy playing with tug-of-war toys or running an agility course at the dog park. They do shed some and have a very long coat, so they need regular brushing and to be groomed a few times a year."}]