[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Irish Water Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Irish Water Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_irish_water_spaniel"}, "datePublished": "March 16, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Irish Water Spaniel Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Though the Irish Water Spaniel is one of the oldest spaniels today, it is also very rare. Unique in appearance with its curly coat, this breed is a fun-loving and spritely dog that makes an excellent pet. Physical Characteristics Irish Water Spaniel dogs are very alert and intelligent. With the distinction of being the tallest spaniel, this breed flaunts is rectangular, medium-sized body. Its double coat, meanwhile, is covered with tight curls, which are solid liver in color. Much of these physical attributes are to enable the Irish Water Spaniel to resist harsh conditions while hunting. The Irish Water Spaniel also has a gait that covers the ground and is smooth. Personality and Temperament The Irish Water Spaniel has a distinctive personality and temperament -- a bit cautious around strangers but playful with children. And while some Irish Water Spaniels may be shy around new people, the breed is considered enthusiastic and positive by nature. The Irish Water Spaniel loves being independent and should be allowed to run, hunt, swim, and play to its heart content. However, when dealing with this breed, be prepared for fits of stubborness. To rectify this, train your dog proper discipline early on. Care To properly care for an Irish Water Spaniel provide it daily mental and physical exercises such as running, playing, and obedience lessons (the earlier, the better). Otherwise, brush comb, and trim your Spaniel&#039;s coat regularly to prevent its hair from becoming coarse and twisting on itself. Health The Irish Water Spaniel, which has an average lifespan of 10 to 12 years, is prone to otitis externa and canine hip dysplasia (CHD). It may also succumb to to minor health problems like distichiasis, and a major issues such as nail-bed disease, seizures, and megaesophagus. To identify some of these issues, a veterinarian may run hip ear exams on this breed of dog. Be aware that the dogs of this breed may react negatively to ivermectin or sulfa drugs. History and Background Though the Irish Water Spaniel is a great water retriever and sporting dog, today it is more popular as a pet and, to some extent, a show dog. It has a very unique appearance and is considered to be one of the oldest spaniels. This breed was became a popular show dog in the United States and Britain in the last half of the 17th century, and attained the recognition of the third most popular sport dog in the year of 1875."}]