[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Kerry Blue Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Kerry Blue Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_kerry_blue_terrier"}, "datePublished": "March 16, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Kerry Blue Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Originally bred as a farm dog in the mountainous regions of Ireland, the Kerry Blue Terrier is a stunning show dog and a giddy house pet. If you want an active dog that will be begging you to run, explore, and play with it, then this athletic fur ball with a blue-gray coat should be your pet of choice. Physical Characteristics The Kerry Blue Terrier is long-legged, strong-boned, muscular, and upstanding dog with a short back. Its build and athletic ability enable it to herd, trail, run, retrieve, swim, and dispatch vermin, making it a perfect farm companion. The Kerry Blue&#039;s coat is blue-gray in color, soft, wavy, and dense. However, this dog is born with a black coat, which changes to a blue-gray hue between its ninth month and second year. Personality and Temperament As this breed is fond of exploring, playing, hunting, digging, running, and chasing, it requires regular physical and mental activity, preferably in a safe place. Likewise, the Kerry Blue&#039;s personality is multi-faceted. The dog remains well-mannered indoors, happy to welcome known friends but reserved toward strangers. This clever and independent terrier is also aggressive towards small animals and other dogs, and is prone to stubbornness and fits of barking. Care The Kerry Blue should be able to spend time lots of time with its family, both outdoors and indoors. Exercise is required for the breed, but this can be accomplished with a vigorous game, a leash-led walk, or a nice romp in the backyard. Coat care consists of combing twice a week and shaping and clipping at least once a month. The Kerry Blue&#039;s ears will also need to be trained during its early stages of development so that its ears will be properly shaped as an adult. Health The Kerry Blue Terrier, which has a lifespan of 12 to 15 years, may suffer from clotting factor XI deficiency and retinal folds. It is also prone to minor health problems like cataract, entropion, Keratoconjunctivitis Sicca (KCS), canine hip dysplasia (CHD), spiculosis, otitis externa, and hair follicle tumors, and a major issues such as cerebellar abiotrophy. To identify some of these issues, a veterinarian may run hip and eye exams on the dog. History and Background Originating in the mountainous regions of western and southern Ireland, the Kerry Blue Terrier was known as the resourceful farm dog for over a hundred years. It could hunt vermin, birds, and small game, retrieve both in water and on land, and even herd cattle and sheep. Making it rather peculiar that this versatile and striking breed was kept an Irish secret until the early 20th century. The Kerry Blue terrier was introduced to American and English dog shows in the 1920s and was formally recognized in 1924. Once groomed, the Kerry Blue is renowned as one of the most attractive and stunning show dogs, though it is only moderately popular as a house pet. The Kerry Blue is also good at trailing, police work, and anything that uses its athletic and hunting abilities."}]