[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Glen of Imaal Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Glen of Imaal Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_glen_imaal_terrier"}, "datePublished": "March 17, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Glen of Imaal Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "  The Glen of Imaal is more of a working terrier than a fashionable show dog. It is equiped with a well-muscled haunch, bowed and short front legs, a strong rear, and a rising topline. One of its original jobs was to dig into burrows, using its weight, stregth, and powerful tail to root out nuisance badgers. Unlike other types of terriers, the Glen of Imaal is not an excessive barker.   Physical Characteristics   The Glen of Imaal is short in stature, but substantial in size. The Glen&#039;s body is longer than tall, with standard height being from 12 ½ to 14 inches at the withers, and weighing from 30 to 40 pounds. The coat is double layered and of medium-length, with a soft undercoat and a harsher outer coat that is generally wheaten, blue, or brindle colored.   Especially distinctive to this breed are the front feet, which are out-turned. Its tail, meanwhile, can be docked or undocked, but must remain long enough to provide a good hand-hold (for pulling the dog out of borrows).   Personality and Temperament   More docile than most terrier breeds, the Glen maintains a stoic stance; quiet, and deadly when given to chase. In fact, its success as a hunter is due in large part to its silent swiftness. However, this breed does have an adventurous side to it, and must be kept on a lead when outside of an enclosed area because of its predilection to chase prey instinctively. It is said that even an invisible electric fence cannot overcome the chase instincts of a Glen of Imaal.   The Glen is good-natured and behaves well with family members, other pets, and children; it is also suitable for large rural homes or small urban homes. Although it is not known for challenging bigger dogs, it does not back down from a fight either. Keep in mind that this breed was bred to fight badgers and foxes. It is a big dog on little legs, and it always has big plans to carry out.   Care   Caring for a Glen of Imaal Terrier is fairly straightforward. This breed is hearty, with very few health problems associated by breed, but the ears must be groomed regularly, with excess hairs removed to prevent buildup that can lead to infection. The softer undercoat does not mat or tangle quickly. However, an occasional brushing will keep the coat clean and healthy and prevent the coat from getting unruly. Shampooing the coat may soften it to the touch, but many enthusiasts of this breed prefer the natural coarseness of the Glen&#039;s coat.   Though the Glen can cope well enough with bad weather conditions, it should be kept indoors in hot climates. Additionally, summertime temperatures will require plenty of hydration to keep your Glen comfortable, along with a shortening of the coat. While swimming may be a good diversion and a way to cool off, the Glen must be protected from deep water, since its short legs and heavy body do not coordinate well enough for swimming for extended periods of time. A small kiddie pool should provide the pleasure of swimming for your Glen, without the associated risk.   Additionally, because Glen of Imaal Terriers are natural diggers and chasers, many will find their way out of a fenced yard. To prevent this, keep the dog in secure, enclosed spaces and take it out routinely on long walks.   Health   The Glen of Imaal Terrier, which has an average lifespan of 10 to 14 years, may suffer from a minor health problem like canine hip dysplasia (CHD) and a major one like progressive retinal atrophy (PRA). Tests for the eye and hip are useful for the dog.   History and Background   The Glen of Imaal Terrier originated on the then desolate, rocky landscape of the Wicklow mountains in Ireland. In this harsh environment, the Glen served mutliple purposes in its role as a working companion. During the day these spirited terriers tracked badgers and foxes, easily fighting them and saving their masters the trouble of dealing hands on with these vermin. At night, as the family slept, the Glen silently hunted rats and watched over the home.   The Glen of Imaal Terrier also had a gleaming persona, so it was a welcome addition to the family. In the home, Glens worked as turnspit dogs, using their powerful legs to move the wheel that turned the spit over the fire to cook the meals. These brave dogs could dig in the ground to confront a badger in its own home, and then run for miles on the hot kitchen’s turnspit.   The breed is first described in 1870, after its recognition at the Lisburn dog show in England. At the time, terriers from Ireland were simply referred to as Irish Terriers, no matter what type of terrier they happened to be. It would be some time before the Glen would have a name of its own.   In 1933, the Glen of Imaal Terrier Club of Ireland was begun, and in 1934, the Glen was accepted for registration by the Irish Kennel Club. As with many breeds, the Glen suffered as a result of the wars, and the numbers of the breed dwindled significantly. Few turnspit breeds managed to survive, as they were not thought to be interesting enough to be developed through the popular dog shows, but by the affection of a few ardent enthusiasts, the Glen of Imaal was brought into dog shows, where it garnered the attention of the attendants.   The breed was recognized by the Kennel Club of England in 1975, and in 1986, American enthusiasts began the Glen of Imaal Terrier Club of America. It would be several years before the Glen would be accepted for registration by the American Kennel Club, finally gaining that status in 2004.   Growth of the breed has been slow and careful, and the Glen is considered still to be a relatively rare breed, but it has had the benefit of retaining its original characteristics, often referred to as &quot;antique&quot; traits."}]