[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Australian Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Australian Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_australian_terrier"}, "datePublished": "May 15, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Australian Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Originally bred as a sentinel and for hunting small vermin and tending livestock, the Australian Terrier is small and tough dog. This versatile worker has a a keen, alert expression and is a suitable companion in most environments. Physical Characteristics The Australian Terrier has an attractive ruff circling the neck with a crest of longer hair that enhances its intelligent and keen expression. This working terrier has a medium-boned, small, and sturdy body that is longer than it is tall. It can withstand harsh conditions and shows a ground-covering gait. The Australian Terrier&#039;s coat, which is blue and tan or red in color, is weatherproof. It is comprised of a 2.5-inch long outer coat that is both straight and harsh, and a soft, short undercoat. Personality and Temperament This Aussie breed is always eager to please, quite clever, and among the most obedient of terriers. It mixes well with other household pets and dogs, but is shy around strangers. Being a true &quot;Earth&quot; dog, it enjoys digging. Even though it is among the quietest of terriers, it is also a tough and spirited dog, on its mark and chasing rodents whenever it can. Care A well-behaved housedog, the Australian Terrier should be allowed to spend lots of time with its family. However, in order to prevent frustration, this adventurous and playful breed requires daily exercise in the form of a playful game, a moderate walk, or an off-leash run. The wire coat requires combing every week and stripping of dead hairs twice a year. For a neat look, the hair around the feet should be trimmed. This terrier was bred to tolerate harsh Australian weather conditions, thus it can stay outside in warm and temperate climates. Health The Australian Terrier, which has an average lifespan of 12 to 14 years, may be prone to health problems like Legg-Perthes disease, cruciate ligament rupture, and seizures. In addition, patellar luxation and diabetes are just some of the minor problems seen in this breed. History and Background Among the smallest of the working terriers, the Australian is its country’s national terrier. The breed -- first exhibited as the &quot;broken-coated terrier of blackish blue sheen&quot; -- originated in the late 19th century. Later names included Blue and Tan Terrier, the Toy, and in 1900 it was named the &quot;Rough-Coated Terrier, Blue and Tan.&quot; Generally, the dog was known for its tan and blue colors, but early representatives also showed sandy or red coloration. Eventually the dog became popular in both British homes and show rings. A large number of breeds were crossed with the root stock of the Australian Terrier, including the Yorkshire, Dandie Dinmont, Scottish, Skye, and Manchester Terriers, resulting in a useful dog with a striking appearance. The American Kennel Club would officially recognize the Australian Terrier in 1965, nearly 40 years after the breed arrived to the United states."}]