[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Korean Jindo", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/beautiful-dog-in-park-at-sunset-picture-id186598448.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/beautiful-dog-in-park-at-sunset-picture-id186598448.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Korean Jindo", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_korean-jindo"}, "datePublished": "February 11, 2019", "dateModified": "October 13, 2023", "description": "Learn everything about Korean Jindo Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "By Paula Fitzsimmons With erect ears, a thick tail and an athletic build, the Korean Jindo is a wolflike dog breed originating in South Korea. Jindo dogs are excellent problem solvers, are fiercely loyal and have a strong drive to hunt, traits that have secured their position as hunters and guardians in their homeland. They continue to serve in these roles to a certain degree in the US, but Jindo dogs have primarily become cherished family members. The American Kennel Club (AKC) has not yet recognized the Korean Jindo as a new dog breed; it is in the organization’s Foundation Stock Service awaiting recognition. Many American Jindo breeders rely on the breed standards set by the Fédération Cynologique Internationale (FCI). Physical Characteristics Like the Akita, American Eskimo Dog, Chow Chow, Siberian Husky and other dog breeds with a wolflike appearance, the Korean Jindo is a Spitz breed. Jindo dogs are athletic, well-proportioned, medium-size pups who differ distinctly by their sex. Females tend to look slimmer with more angular features, while males tend to be stockier and more broadly built, says Nichole Royer, a founding member of the Korean Jindo Association of America.   The FCI standard height for males is 19 ½-21 ½ inches with a weight of 40-50 pounds. Females are a couple of inches shorter and weigh 33-41 pounds, says Royer. Like wolves, the Jindo’s ears are heavily furred and have rounded tips. “Very importantly, when alert, their ears are hooded, meaning they lean forward past the vertical when viewed from the side, and they never have ears that simply point straight up,” Royer says. They have strong, well-feathered tails. “Jindos may carry their tail loosely curled with the tip brushing the back, or may have a sickle tail with a gentle curve carried high and not touching their back, or they may have a saber tail, pointing straight up. Their tails never curl tightly and never lay on their back or side,” says Royer. Jindo dogs have a double coat consisting of a soft, fuzzy undercoat and stiff outercoat, which Royer says presents in six general colors: red, white, black and tan, brindle, gray, and solid black. “They have a quick and elastic trot, which makes it easy for the Jindo to travel quickly over any terrain,” says Gina DiNardo, executive secretary of the AKC in New York City. Being able to move rapidly on any type of landscape is essential to hunting success. Personality and Temperament Jindos are fiercely loyal and protective, traits they tend to reserve for one person or family. “While they should be calm, confident and never aggressive without reason, they are also a reserved and careful breed that often is not particularly interested in interacting with people or dogs outside their own family and pack,” explains Royer.  However, “a well-socialized Jindo will accept and even enjoy attention from someone who is accepted by their owner,” Royer says.  The Jindo dog breed is highly independent and has a strong aptitude for problem-solving. “Jindos are able to make decisions on their own and are not necessarily looking to their owners for direction. While very intelligent and easily trained, they are also easily bored,” says Royer. If you plan to get more than one Jindo, consider the dogs’ sex. “Same-sex dog aggression is the norm for the breed, and opposite-sex companions are the most successful,” says Royer.  As a breed with a high prey drive, Jindos need daily physical exercise and mental stimulation. “Outdoors, they are very active, continually looking for prey and patrolling the property,” Royer says. “Inside the home, they are alert and like to position themselves near their owners. However, they are restful and calm indoor companions.” They will often follow their human around the house, “not being clingy, but happy to curl up in a corner where they can simply be near and watch over their person or family,” says DiNardo. Care When provided an outlet for their energy, Jindos are calm and quiet while indoors, says Royer. “As a guard dog breed, Jindos are programmed to observe and react to anything unusual or out of place in their environment. For this reason, they require socialization as puppies so that they develop a broad concept of what is normal in the world.” Though intensely loyal to the family, Jindo dogs are also independent thinkers. “They will temper their obedience with their own judgment,” Royer says. “It is best for owners to take their dogs through one or more training classes to cement their bond and provide good basic Canine Good Citizen skills,” says Royer. The Korean Jindo is an athletic breed that needs a reasonable amount of physical and mental stimulation, says DiNardo. “They enjoy sports like lure coursing and agility and are happy to turn their athleticism to any active task, even if it’s a nice long walk.” Jindos typically have little body odor and will often clean themselves, similar to a cat, says Royer. “Most of the year they require weekly brushing to minimize shedding and an occasional bath. Twice a year Jindos will ‘blow’ their coat and most of their undercoat will come out in a fairly short period of time. During this time they will shed excessively and continuously, and daily brushing (and vacuuming) becomes necessary.” Health Jindos are generally robust dogs who have few health issues. With optimal care, they have an average lifespan of 11 to 13 years. Health conditions that have been identified in multiple dogs are hypothyroidism and discoid lupus erythematosus (cutaneous lupus erythematosus), a skin disease that may cause a variety of symptoms, including depigmentation of the lip and nose, lesions that can bleed, loss of tissue and scar formation, says Royer. There have also been isolated cases of cataracts, hip dysplasia, seizures, environmental allergies and cystinuria, an inherited disease that leads to kidney, ureter and bladder stones, Royer says. “However, none of these issues have been documented with frequency.” A responsible breeder will test for these diseases.   History and Background The Korean Jindo originated on Jindo Island, which is located off South Korea’s southwest coast.  “The dogs lived unrestrained on the island alongside their owners for thousands of years to develop into a natural breed with reputable hunting abilities,” DiNardo explains. “Jindos were originally used as hunting dogs in their native country due to their prey instinct and strict loyalty.” They were expected to hunt and kill small game, then bring the prey home, says Royer. “They also hunted deer and wild boar in small packs. This hunting instinct is still very strong in the breed, and many owners still hunt with their dogs.” Their strong hunting drive is also relied on here in the US. “There are many Jindos ridding their owners’ property of vermin such as rats, squirrels and rabbits. Jindos have also proven excellent at lure coursing and barn-hunt activities,” says Royer. In 1962, the Republic of Korea Preservation of Cultural Assets Act No. 53 was passed, which gave Jindos the title of “Natural Monument (No. 53).”  The Jindo is not yet on the AKC breeds list but has been in its Foundation Stock Service since 2008, says DiNardo. “It is where breeds that are in the process of becoming recognized are grouped.” Mixed-breed Jindo dogs and rescued imports from Korea are fairly common, and there are occasionally litters from parents that are supposedly purebred but unregistered, says Royer. “There are only around 20 AKC-registered Jindos in the US. We only have two breeders in the US who are actively involved with the breed, [who] health test their dogs and carefully screen new owners. So we are still a very small group, but always hoping to grow,” adds Royer."}]