[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Smooth Haired Fox Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Smooth Haired Fox Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_smooth_fox_terrier"}, "datePublished": "July 21, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Smooth Haired Fox Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Fox Terrier was bred to run with the hounds and horses, then to go to ground and pursue the quarry into its den. Although it resembles its cousin, the Wire Fox Terrier, the Smooth Haired Fox Terrier was bred independently in England during the 1800s. Physical Characteristics The body of the Smooth Fox Terrier has the right combination of power, speed, and endurance, allowing it to match the pace of hounds and horses during hunts and trail a fox to its narrow hideout. This square-proportioned terrier with a short back covers a lot of ground, propelled by its rear legs. The dog&#039;s hard and flat coat, which is predominately white in color with streaks of red, black, or blue, is paired fine, short undercoat. Its carriage, meanwhile, is expectant and alert, and its expression and attitude are keen. Personality and Temperament The Smooth Fox Terrier is rightly described as an inquisitive, energetic, daring, spirited, mischievous, playful, adventurous, and independent dog. It is fond chasing and exploring, but is reserved with strangers. In addition, some Smooth Fox Terriers are routine barkers and diggers. Care This breed can live outside in a warm climate, but is more suited for indoor living with access to the yard. The energetic Smooth Fox Terrier requires a lot of attention, including daily walks. When given room, however, it will exercise on its own. The dog&#039;s smooth coat should be brushed weekly to remove any dead hair. In fact, the Smooth Haired Terrier sheds more hair than its wire-haired cousin. Smooth Fox Terrier puppies may require ear shaping techniques to retain proper shape as adults. Health The Smooth Fox Terrier, which has an average lifespan of 10 to 13 years, may suffer from from deafness and patellar luxation. It is also prone to minor health concerns, such as lens luxation, Legg-Perthes, distichiasis, and cataract. To identify some of these issues, a veterinarian may regular eye tests for the dog. History and Background Though there are no documents that can establish the Smooth Fox Terrier&#039;s ancestry, the breed was already admired among dog show fanciers by the turn of the 19th century. Accompanying Foxhound packs, the Smooth Fox Terrier would dislodge foxes that tried to hide. Primarily hunters chose white dogs, as it was easy to distinguish them from the quarry, even when there was little light. Some experts believe the Wire and Smooth Haired Fox Terriers shared a common background, while others insist the Smooth Fox Terriers descended from the Bull Terrier, Black and Tan Terrier, Beagle and Greyhound. Regardless, the American Kennel Club approved separate standards for both the Wire and Smooth Fox Terriers in 1984. Early breeders attempted to cross the Smooth Fox Terrier with its wire-haired cousin, but the practice has since been discontinued. Being among the first dogs to be members of the show ring, Smooth Fox Terriers were initially classified with the Sporting breeds. Today, the Wire Fox Terrier has retained its keen expression and energetic demeanor. For this reason, it is loved among hunters and families alike."}]