[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Maltese a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Maltese are very affectionate and loving toward their families. They do well with children who know how to interact properly with small animals, but may be best suited for a family with older kids who are always gentle. "}}, {"@type": "Question", "name": "Are Maltese smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Maltese have been human companions for centuries—and are therefore adept in training their humans to get what they want. This intelligence can be perceived as stubbornness, but Maltese dogs respond very well to consistency and positive training methods. "}}, {"@type": "Question", "name": "Is a Maltese hypoallergenic?", "acceptedAnswer": {"@type": "Answer", "text": "“Hypoallergenic” dogs are actually a myth, as all dogs produce allergens from their coat, dander, urine, and saliva. But because of their low-shedding coat, a Maltese can be a good fit for some people who experience dog allergies. Before bringing home a Maltese puppy, spend time with the breed first to see how your allergies react."}}, {"@type": "Question", "name": "How long does a Maltese live?", "acceptedAnswer": {"@type": "Answer", "text": "The typical Maltese lifespan is 12-15 years."}}, {"@type": "Question", "name": "How much does a Maltese cost?", "acceptedAnswer": {"@type": "Answer", "text": "Depending on the breeder’s experience and the puppy’s pedigree, the cost of a Maltese puppy can range from $600-$2,000. "}}, {"@type": "Question", "name": "Are Maltese quiet dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Maltese are known to be moderate barkers, and they can be quite vocal in showing their displeasure about something.  Featured Image: iStock/enviromantic"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Maltese", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/maltese-dog-on-couch.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/maltese-dog-on-couch.jpg"}, "author": {"@type": "Person", "name": "Teresa Kho-Pelfrey, DVM", "url": "https://www.petmd.com/author/dr-teresa-kho-pelfrey"}, "keywords": "Dog, Breed, Zoo Maltese Pack, Zoo Small Dog Pack, Maltese", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/maltese"}, "datePublished": "October 17, 2022", "dateModified": "October 13, 2023", "description": "Maltese dogs are tiny, but they have big personalities. Learn about living with and caring for the Maltese dog breed from our vet expert.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. The Maltese is a toy dog breed that’s best known for their luxurious, floor-length white coats and playful personalities. These dogs originated on the Mediterranean island of Malta and have been loyal companions for centuries, with references to the breed found in Ancient Greek and Roman literature. Weighing an average of 7 hearty pounds, these tiny yet fearless dogs are highly adaptable and make charming and devoted companions. Caring for a Maltese Maltese have minimal health issues but require regular maintenance because of their long, silky, white coat. Their big, dark eyes and nose make these playful and moderate energy dogs irresistible. Despite their small size they have big, willful personalities and generally respond positively to reward-based training. Maltese Health Issues Most Maltese will live well into the double digits, with a typical lifespan of 12-15 years. They are a generally healthy breed with few health concerns. But there are a few inherited conditions that pet parents need to be aware of for health management. Luxating Patella Maltese can develop luxating patellas, an inherited condition where one or both of the kneecaps pop in and out of place. Although patellar luxation is not generally considered a painful condition, it may cause the dog to favor one leg and can predispose them to other knee injuries (such as a cranial cruciate ligament tear) and arthritis. Depending on the severity of the luxating patella, surgery may be recommended to prevent further injury and improve your Maltese’s quality of life.   Patent Ductus Arteriosus (PDA) Responsible Maltese breeders will screen their puppies for heart abnormalities such as patent ductus arteriosus. PDA is an inherited condition where the ductus arteriosus, the normal opening between the two major blood vessels in the heart that closes shortly after birth, does not close. This condition causes blood to flow improperly and forces the left side of the heart to work harder. This leads to eventual failure of that chamber. Depending on the size of the opening, dogs may show minimal symptoms to severe signs of heart failure such as: Difficulty breathing Exercise intolerance Stunted growth Surgery is typically the best option to close the defect and when done prior to heart failure, dogs generally have an excellent prognosis. Some dogs that have already developed heart failure at the time of surgery may require medications afterward.  Liver Shunts Maltese puppies should also be screened for congenital liver issues such as shunts. Liver shunts are abnormal veins that bypass the liver, preventing the normal filtration of toxins, wastes, and medications from the blood before returning it back to the body. Dogs with liver shunts may have stunted growth and neurologic signs such as disorientation or seizures. Liver shunts can be screened with a blood test and are often managed with a diet change and medication, though sometimes surgery is required. Dental Disease Like all other toy breeds, Maltese require regular at-home dental care as well as routine dental cleanings to prevent periodontal disease.  What To Feed a Maltese Selecting the best diet for a Maltese is often based on the needs of the individual dog. While it’s always important to choose a diet with high-quality ingredients, it’s best to discuss diet with your veterinarian, as they can make a recommendation based on your dog’s specific medical history. Maltese dogs can be prone to obesity, so avoid overfeeding your pup so they can maintain a healthy weight.  How To Feed a Maltese Due to their tiny size, young Maltese puppies can be susceptible to hypoglycemia (low blood sugar) if they don’t eat enough food throughout the day. This can be avoided by feeding small meals three to four times a day until they are around 4 months of age. At this age, their more developed bodies are better suited to regulate glucose levels and they can transition to two (or three, if desired) meals a day. Adult Maltese typically do well with two meals a day, in the morning and evening.  How Much Should You Feed a Maltese Always follow the feeding guide provided by the specific food to ensure that your dog is receiving the appropriate essential daily nutrients. For a Maltese, based on an average weight of approximately 6-8 pounds, this will range from about 1/4 to 1/2 cups of dry food daily, divided into two meals.  Nutritional Tips for a Maltese For Maltese dogs that have luxating patella, it can be beneficial to supplement them with glucosamine and chondroitin to help keep their joints healthy. Additionally, omega-3 supplements can aid in protecting joint health and keep their skin and coat lush and soft.  Behavior and Training Tips for the Maltese Maltese Personality and Temperament Maltese do well with some daily activity but don’t require vigorous exercise to maintain their physical or mental health. They can be somewhat stubborn, but with positive training methods Maltese dogs can do very well with activities such as agility. Maltese are very affectionate with their family, but their tiny size makes interactions with young or boisterous children something they might try to avoid. A family with older children who understand how to interact with a dog may be better suited for them, and interactions between children and dogs should always be supervised. Like many other toy breeds, Maltese tend to compensate their tiny stature with a big bark. They can be vocal, especially when they feel they are protecting their people or home.  Maltese Behavior Maltese are very attached to their families, and they show this with their tiny but mighty protective nature. This can also cause them to experience some anxiety when separated from their people, which can manifest in unwanted behaviors such as vocalization.  Maltese Training Maltese are an intelligent breed, and their stubborn side can make training difficult. Potty training Maltese puppies can be challenging, but consistency paired with positive reinforcement will yield the best results. Despite their lavish appearance, Maltese dogs are an athletic breed and can thrive in sports such as obedience or agility. While Maltese have an abundance of energy, daily walks or playtime with their family are usually enough to keep them happy and healthy.  Fun Activities for a Maltese Walking  Indoor/outdoor playing  Obedience   Agility  Maltese Grooming Guide Maltese are known for their long, silky white coat, which requires daily care to prevent mats and tangles. Their fur should be brushed or combed daily, and regular bathing will keep their skin and coat healthy and clean. Maltese tend to be low-shedding dogs and are often suitable for people with dog allergies.  Skin Care Skin care for the Maltese can vary depending on the individual’s needs. However, this breed does not typically have sensitive skin. Regular brushing and bathing to maintain their coat is the best way to keep their skin healthy as well.  Coat Care The Maltese’s long coat is prone to matting, which can cause skin infections if not cared for properly. Daily brushing is required to prevent their fur from matting or tangling. When bathing a Maltese, it’s important to thoroughly rinse and then dry the hair to prevent skin irritation or infection from the shampoo and moisture.   Eye Care Their white coat can predispose the Maltese to more prevalent tear staining, but routine cleaning with a soft, damp cloth will help keep this to a minimum. Excessive staining could be a sign of other underlying conditions (such as allergies or plugged tear ducts) and should be discussed with a veterinarian.  Ear Care Routine cleaning with a veterinary-approved ear cleaner is vital in maintaining healthy ear canals. This should also be done any time a Maltese is in water, such as after swimming or bathing. Considerations for Pet Parents The silky, white coat of Maltese dogs is often a major draw for new pet owners, but this breed will do best in a home that is able to provide daily maintenance of their coat. They need to be brushed every day—including after routine baths. While they are high-energy dogs, Maltese don’t require a lot of exercise to expend that energy, which can make them well-suited for busier families. Their tiny stature makes the rambunctious nature of young children somewhat intimidating for the Maltese, but they’ll fit right in with families that have older kids."}]