[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Miniature Bull Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Miniature Bull Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_miniature_bull_terrier"}, "datePublished": "September 14, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Miniature Bull Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Miniature Bull Terrier is a strong, sturdy, active dog, similar in every way to its larger cousin: the standard Bull Terrier. It has a determined expression and is full of spirit, though amenable to discipline. Physical Characteristics Moving with an easy and free gait, the Miniature Bull Terrier is a big-boned, square-proportioned, and strongly-built dog. It shares many physical characteristics with its standard cousin, such as its strong jaws, muscles, and bones. The Miniature Bull Terrier also has a harsh, short, and flat coat, with tightly-fitted skin. To go with its comical behavior, the &quot;Mini&quot; has a clownish face and a determined, keen expression. Personality and Temperament Just like the Bull Terrier, the Miniature is mischievous, playful, comical, and lively. However, its small size does not make it a lap dog -- it is curious, independent, stubborn and needing of a firm yet gentle master. The Miniature Bull Terrier is also sweetly devoted but not flattering. Care The Miniature Bull Terrier is not meant for outdoor living, but it does prefer access to the yard or garden. City-dwellers love this dog, as it can live in well-sized apartment or condominium. The Mini&#039;s exercise regimen, consisting of a playful romp or a moderate walk, should be fulfilled every day, but not overdone. Coat care for the dog, meanwhile, is minimal, requiring little more than the occasional brushing. Health The Miniature Bull Terrier, which has an average lifespan of 11 to 14 years, may occasionally suffer minor health concerns such as glaucoma and lens luxation, and major issues like deafness. The breed is also susceptible to kidney disease. To identify some of these issues, a veterinarian may recommend regular hearing and eye exams for the dog. History and Background Descending directly from the Bull Terrier, the Miniature Bull Terrier shares much of the former’s background. Initially, the earliest specimens of the Bull Terrier came in a wide range of sizes, a direct result of the variations of sizes of the Bull’s ancestors: the White English Terrier, Bulldog, and Black and Tan Terrier. The smallest of the white Bull Terriers were known as Coverwood Terriers, named after the kennel in which they were produced. There are also records that show small Bull Terriers of other colors existing, these weighing in at about four pounds. And though the tiny toy dogs were of a poorer variety -- quickly losing the interest of the population -- slightly larger dogs (or miniatures) were considered of better stock. The English Kennel Club recognized the Miniature Bull Terrier by 1939, but recognizing it as a distinct breed posed a problem. The Miniature could not be crossed with the standard Bull Terriers, as it was a separate breed. However, with just a few Miniatures present, there were several instances of interbreeding. The Miniature Bull Terrier breed became popular gradually, and the American Kennel Club eventually recognized it in 1991. Even though it remains an uncommon breed, this miniature form of the Bull Terrier is sure to see a rise of popularity."}]