[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Skye Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Skye Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_skye_terrier"}, "datePublished": "March 30, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Skye Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The elegant and stylish Skye is a working terrier. Often recognized for its courageousness, determination, and long straight coat, the Skye Terrier is a great choice for someone searching for a small indoor terrier that enjoys outdoor activities. Physical Characteristics The solidly built Skye Terrier is twice as long as it is tall. Its short legs enable it to pursue game such as badger and fox easily, and its long back gives it flexibility in small spaces. The Skye Terrier also has strong jaws and a close undercoat. Its straight, flat outer coat, meanwhile, grows to about five inches in length and is usually black, blue, gray, fawn, or cream in color. Personality and Temperament Don’t be fooled by the dog’s soft appearance; it is extremely courageous and makes for an effective watchdog. The stubborn yet sensitive Skye Terrier is also loving towards its family but very wary of strangers. And even though it mixes well with other household dogs, it does not get along with dogs it does not know. Care The Skye Terrier is most comfortable living indoors as a house dog. However, it should be allowed outside to play daily. Also, to maintain its peak physical form, a daily short or moderate walk is required. Coat care involves regular combing, and unlike other terriers, a regular bath is necessary and won’t soften the coat much. Health This breed survives for approximately 12-14 years and may suffer from minor ailments like premature closure of distal radius. History and Background The Skye Terrier is one of the oldest terriers in Scotland. The purest strain of such dogs was seen on the Isle of Skye, which explains how they got their name. The breed was described for the first time in the 16th century, when its long coat made it noteworthy. There is some confusion in delineating its history as there were many breeds that were known as Skye Terrier. In 1840, the actual Skye Terrier became well-known when Queen Victoria took a fancy to the breed. Thus, the dog gained more popularity among commoners and in the higher circles of society. Soon it arrived in the United States and with the American Kennel Club giving the breed recognition in 1887, it became popular in the show scene. In spite of the dog’s striking features and its illustrious start, its popularity started diminishing and today, it is one of the least known of the terriers. Greyfriars Bobby was the most renowned Skye Terrier -- he guarded his owner’s grave for 14 long years until he met his own death. Today he lies buried next to his master’s grave. A wonderful statue of this Skye serves as a perfect tribute to of one of the most faithful dogs."}]