[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Greater Swiss Mountain Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Greater Swiss Mountain Dog", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_greater_swiss_mountain_dog"}, "datePublished": "June 18, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Greater Swiss Mountain Dog Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Greater Swiss Mountain Dog is a large, powerful animal. Sharing a common ancestry with the Roman Molossian dogs, it was bred for draft and drover work, and has the familiar, striking tri-color markings of the Swiss Mountain breeds. Physical Characteristics The Greater Swiss Mountain Dog has a huge, powerful body, which is more on the long side than tall. The breed is characterized as a strong and powerful draft dog. The dog has smooth movement, which reflects good drive and reach. Its two-layered coat (black topcoat with red and white markings) comprises a dense outer coat and thick undercoat. This good-natured dog also has a gentle and lively expression. Personality and Temperament The Greater Swiss Mountain Dog is vigilant, territorial, alert, and bold. This sensitive, loyal, and easy-going breed is also an extremely dedicated family companion, especially gentle with other pets and children. Care As it is a traditional working dog, this breed is fond of spending time outdoors, particularly in cold weather. It can survive outdoors in cool climates, but prefers to spend more time with its human family. The dog is also fond of pulling. A vigorous romp or a good, long walk is sufficient to fulfill its daily exercise requirements. Indoors, the dog requires a lot of space to stretch itself. Coat care in the form of brushing once a week is enough, but the frequency should be increased at times of shedding. Health The Greater Swiss Mountain Dog, which has an average lifespan of 10 to 12 years, can suffer from minor problems such as distichiasis, panosteitis, shoulder Osteochondrosis Dissecans (OCD), gastric torsion, seizures, splenic torsion, and female urinary incontinence. It is also prone to canine hip dysplasia (CHD), a major health issue. Elbow, eye, and shoulder tests are suggested for this breed of dog. History and Background Described as the largest and oldest of the four strains of Swiss Mountain Dogs, or Sennenhunde, the Greater Swiss Mountain Dog shares common ancestry with the Roman Molossian dogs or the Mastiff. The other Swiss Mountain Dogs are the Bernese, Appenzeller, and Entlebucher. Their ancestors might have been introduced by the Romans when they invaded the area. Another theory has the dogs being brought by the Phoenicians to Spain around 1100 B.C. Whatever the case, the breed spread throughout Europe and cross-bred with native dogs, finally developing in isolated communities along individual lines. Sharing the same working principles and functioning as herders, draft dogs, and guardians of home and livestock, many of the dogs were known as butcher&#039;s dogs or Metzgerhunde. All these dogs that share the same coloring were thought to be of the same breed until the late 19th Century. Many believe that Professor A. Heim and his study of the native mountain breed in Switzerland in 1908 led to the &quot;birth&quot; of the Greater Swiss Mountain dog. Professor Heim would find a wonderful, short-haired dog in a Bernese Mountain Dog contest and, thinking it was a different breed, named it the Greater Swiss, as it closely resembled the strong Swiss butcher&#039;s dogs. The breed’s popularity grew very slowly and was also hampered by the World Wars. It was not until 1968 that the Greater Swiss Mountain Dog entered into the United States. The American Kennel Club later admitted the breed into the Miscellaneous class in 1985, and gave it complete recognition 10 years later."}]