[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Field Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Field Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_field_spaniel"}, "datePublished": "July 29, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Field Spaniel Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Field Spaniel is known for its level-headedness and perseverance. It is one of the rarest spaniel breeds, but one of the most recognized gundog breeds. Physical Characteristics The medium-sized Field Spaniel possesses a sturdy physique and a noble carriage. Additionally, Field Spaniels commonly have bodies that are longer in size than tall, all of which enables the breed to hunt through dense bushes. Its flat or slight wavy coat, which is usually black, liver, or golden liver in color, is of medium length. It is possible, however, to encounter a Field Spaniel with tan points or white markings. Its facial expression is heavy and gentle. Its pace, meanwhile, is long and low. Always alert, a Field Spaniel&#039;s tail rarely stops wagging, though it does not stand high. Personality and Temperament Generally cheerful, the Field Spaniel can prove to be a gentle and sensitive family pet. And though it loves its independence, it is fully devoted to its human master. Additionally, many Field Spaniels shy away from strangers. Care The Field Spaniel should be brushed and combed at least once or twice a week. Show dogs, meanwhile, must be trimmed and clipped on a regular basis to prevent outgrowth. A Field Spaniel&#039;s ear should be protected against the accumulation of dirt. Moreover, the inner ear hair and footpad hair should be clipped regularly. Regular exercise and training is recommended for the Field Spaniel. The breed should be allows to live inside the home, with access to the outdoors. But beware, some Field Spaniels are prone to snoring. Health The Field Spaniel, which has an average lifespan of 12 to 14 years, may be prone to minor health issues such as hypothyroidism and otitis externa, as well as seizures, heart murmurs, canine hip dysplasia, and patellar luxation. To identify some of these issues, a veterinarian may recommend heart, hip, thyroid, elbow, eye, and patella exams for this breed of dog. History and Background Although it is considered an excellent hunter of medium size today, the breed went through various changes, which culminated in the modern day Field Spaniel. According to the experts, the breed was originally larger, deriving its traits from the English Water, Sussex, and Cocker Spaniels, and weighing in at over 25 pounds. On the verge of extinction, breeders began to cross the Field Spaniel with the English Springer Spaniel, of which four Field Spaniels are commonly attributed to the progentiors of the modern breed: Elmbury Morwena of Rhiwlas, Ronayne Regal, Colombina of Teffont, and Gormac Teal. These Field Spaniels proved to be excellent hunters. The breed was originally introduced to America in the late 1800s. And though they have lost much of their popularity and are considered one of the rares breed in the United States today, the Field Spaniel&#039;s hunting abilities are irrefutable."}]