[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Tibetan Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Tibetan Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_tibetan_spaniel"}, "datePublished": "July 7, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Tibetan Spaniel Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Tibetan Spaniel, affectionately referred to as the &quot;Tibbie,&quot; is a small, proud breed that is active and alert. It is generally a happy, playful companion. Physical Characteristics The Tibetan Spaniel dog has a slightly long body, with a relatively small head and wide-set eyes. It has an apelike appearance. Its mouth is undershot, while its plumed tail has long feathering. This dog moves with a straight, free, and quick gait. The double coat comprises a medium-length, silky, and flat-lying outer coat and a long mane. Personality and Temperament This dog has a happy attitude and loves outings or playing games with its family. It even enjoys dozing off beside its favorite person. It is a remarkably enjoyable as well as fastidious pet dog. Although it is friendly with animals and other dogs, it tends to be reserved with strangers. The stubborn, independent, and bold Tibetan Spaniel, however, is well-behaved and sensitive. Care The Tibetan Spaniel breed is meant for apartment life and should not be allowed to live outdoors. The daily exercise needs of the Tibbie are minimal and can be met by indoor and outdoor games or a short on-leash walk. Its coat requires combing and brushing twice weekly. Health The Tibetan Spaniel, which has an average lifespan of 12 to 15 years, may suffer from patellar luxation and cataract. Occasionally progressive retinal atrophy (PRA) and portacaval shunt are seen in this breed. Knee and eye tests are suggested. History and Background The Buddhist principles of Tibet and the history of the Tibetan Spaniel dog are interlinked. The Lamaist variety of Buddhism considered the lion to be a significant symbol, as one supposedly followed Buddha just like a dog. These small lion-like dogs, which followed their Lamas, were said to be symbols of the holy lion and were therefore greatly valued. The Chinese cultivated the Pekingese, also a lion dog, and animals were often exchanged between China and Tibet, leading to inter-breeding between their dogs. Even though breeding took place in the villages, the best animals were produced in the monasteries that normally bred just the smallest specimens. These little dogs were not only used for decoration, but, while resting on monastery walls, would alarm monks of approaching wolves or strangers. Additionally, many were used as prayer dogs, and others rotated the prayer wheels using small treadmills. The first Tibetan Spaniel arrived in England in the late 19th century, but it was only in the 1920s that a proper breeding program was implemented. The Griegs, who promoted the Tibetan Spaniel, acquired many specimens, but only one Tibetan Spaniel, Skyid, survived World War II. Its descendents are now found in modern day pedigrees. The Western Tibbies, meanwhile, developed sometime in the 1940s, when some Tibbies were introduced to England through an English couple, who resided in Sikkim. The breed later came to the United States in the 1960s, and received American Kennel Club recognition in 1984. The Tibetan Spaniel breed only has a moderate fan following, but those who own a Tibbie find the dog simply wonderful."}]