[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How big do Sheepadoodles get?", "acceptedAnswer": {"@type": "Answer", "text": "It all depends on the dog’s parents! If an OES and Standard Poodle are the parents (an F1 Sheepadoodle), the resulting Sheepadoodle will likely weigh 65-85 pounds as an adult. If a Miniature Poodle is one of the parents, though, the resulting Miniature Sheepadoodle will be smaller. And with each subsequent generation that moves away from those parent breeds, the more differences you may see in size. An F1B Sheepadoodle, for example, has a Sheepadoodle and a Poodle parent; if the Poodle parent in this situation is a Miniature Poodle, the resulting Sheepadoodle puppy may be smaller than the Sheepadoodle parent."}}, {"@type": "Question", "name": "When do Sheepadoodles stop growing?", "acceptedAnswer": {"@type": "Answer", "text": "A Sheepadoodle typically reaches full-grown status within 1-2 years. This timing may vary a bit, so err on the side of caution when it comes to pursuing activities like running that are best reserved for adult dogs."}}, {"@type": "Question", "name": "Is a Sheepadoodle a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes! Sheepadoodles tend to be loving and affectionate family dogs that love adults and children alike. However, because they can be quite large and a bit boisterous while playing, care must be taken when allowing them to play with small children. Because kids can be knocked down by accident, supervision is always recommended when it comes to all dogs and children. Pet parents must also take special care to teach their Sheepadoodle that herding children is not appropriate."}}, {"@type": "Question", "name": "Is a Sheepadoodle hypoallergenic?", "acceptedAnswer": {"@type": "Answer", "text": "Because Sheepadoodles are a Poodle mix, the intention is for them to shed very little, if at all. But remember, there’s no guarantee that they won’t shed! Some people with allergies seek out low-shedding breeds and refer to them as “hypoallergenic” dogs—though it’s important to note that no dog breed is 100% allergen-free, and if you have severe allergies, even a doodle mix like the Sheepadoodle may not work for you. Before bringing home a Sheepadoodle puppy, spend time with the breed to see how your allergies react. Featured Image: Adobe/Logan"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sheepadoodle", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/sheepadoodle.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/sheepadoodle.jpeg"}, "author": {"@type": "Person", "name": "Kristen Seymour", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Sheepadoodle", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/sheepadoodle"}, "datePublished": "January 18, 2023", "dateModified": "October 13, 2023", "description": "Sheepadoodles are an intelligent, friendly, and energetic cross between Old English Sheepdogs and Poodles. Learn more about caring for Sheepadoodle puppies and dogs.", "articleBody": "Fluffy, clever, and just as sweet-natured as they look, Sheepadoodles are a crossbreed of Old English Sheepdogs (OES) and Poodles. Although they’re not as prevalent as their crossbreed cousin, the Goldendoodle, this designer mix is becoming more popular as a family pet thanks to their affectionate personalities and the likelihood of low-shedding coats. In fact, these same traits have made them increasingly widespread picks as therapy dogs and emotional support animals. As with any hybrid dog breed, the Sheepadoodle size and appearance doesn’t have specific requirements to meet like a purebred dog would. However, their coats most commonly come in a black-and-white pattern and, with that OES parentage, full-grown Sheepadoodles are usually on the larger side (16-22 inches and 65-85 pounds, although they can be larger or smaller). If you’re looking for a mini model, a Miniature Sheepadoodle is an OES crossed with a Miniature Poodle. Though, they’re rarer than standard Sheepadoodles. Caring for a Sheepadoodle As an Old English Sheepdog-Poodle mix, the Sheepadoodle is bred to create a dog with everything people love about both parent breeds. This leads to a clever, playful, loving dog that thrives as a cherished member of the family—but it does need to be the right family. “These are two intelligent breeds that need mental stimulation to avoid developing behavioral issues,” says Dr. Maggie Brown-Bury, DVM, a small-animal relief veterinarian who sits on the Canadian Veterinary Medical Association Council. Therefore, she says, they’re best suited to families who want an active dog that requires lots of time and attention. Some of that attention will need to go toward grooming, since both parent breeds have significant grooming requirements, Brown-Bury adds. “Another thing to be aware of is that Poodles are considered not to shed, but OES do shed,” she says. “So it cannot be assumed that you’re getting a non-shedder.” Sheepadoodle Health Issues Sheepadoodles tend to be a healthy breed with a lifespan of 12-15 years. But there are some health conditions that show up in both parent breeds, even if Sheepadoodle breeders take every possible precaution. “Unfortunately, with many breeds, the health problems they’re known for are very prevalent in the breed genetics,” Brown-Bury says, and that makes those genetic diseases difficult to remove from the breed because there are so few individual dogs free of the genes.  Hip Dysplasia Hip dysplasia occurs when the hip joint develops abnormally and leads to a loose joint. This condition is not unusual for large-breed dogs and is one of those issues that shows up in both Old English Sheepdogs and Poodles. A pooch with hip dysplasia will likely show signs of discomfort, which you’ll see as limited mobility, less activity, or looking stiff. Talk to your vet about the best treatment options, as there are many possibilities available like joint supplements, anti-inflammatory medications, and even surgery in severe cases. Eye Issues  “Congenital and inherited eye issues are often breed-related, and Poodles of all sizes and OES have significant lists of known potential eye issues,” Brown-Bury says. The two breeds’ lists of eye problems have a lot of overlap, including: Cataracts Corneal dystrophy Distichiasis (an eyelash that grows from an abnormal spot on the eyelid), Micropapilla (a smaller-than-normal optic disc) Progressive retinal atrophy Bloat Although bloat is generally seen in large dogs, including Standard Poodles, it has more to do with body shape than genetics, Brown-Bury says. Because both the OES and Standard Poodle are large, it’s certainly a concern. Severe cases of bloat can lead to gastric dilatation and volvulus (GDV), which is fatal if not treated. A procedure called gastropexy, which can be done on deep-chested dogs during their spay or neuter surgery, may be performed to prevent bloat from occurring later in life.  What To Feed a Sheepadoodle Consider your dog’s size and activity when choosing a dog food. Brown-Bury recommends feeding your Sheepadoodle puppy a large-breed puppy food. “Large-breed puppies have slower bone growth than small-breed puppies, and appropriate nutrition is how you ensure best bone health,” she says. As your dog grows, choose a food appropriate for their life stage.  How To Feed a Sheepadoodle  It’s recommended that pet parents feed their Sheepadoodle twice a day. When they’re puppies, create a feeding schedule with three or four mealtimes before switching to twice a day when they reach adulthood. For dogs at a high risk for GDV, pet parents should take some mealtime precautions: Feed your dog multiple small meals throughout the day, rather than one large meal. Restrict exercise before and after meals. Reduce stress at mealtime. Do not use elevated dog bowls. How Much Should You Feed a Sheepadoodle?  Take care not to overfeed your Sheepadoodle. Yes, they are a large breed, but they can still become overweight, which leads to other health problems. Following the measurement guidelines on the label of an AAFCO (Association of American Feed Control Officials)-approved food and paying close attention to your dog’s body size and composition throughout life is a good way to ensure your pup is getting the needed nutrition without too many added calories. Keep in mind, treats should be included in the daily calorie count for a pup. Nutritional Tips for Sheepadoodles  Your veterinarian is the best source of information on any nutritional supplements that might benefit your Sheepadoodle. Since both parent breeds are prone to hip dysplasia, you may want to ask your vet about a high-quality supplement containing ingredients like glucosamine hydrochloride, MSM, omega-3 fatty acids, and chondroitin to promote joint health. Behavior and Training Tips for Sheepadoodles   Sheepadoodle Personality and Temperament Ideally, your Sheepadoodle will be adaptable, intelligent, affectionate, and playful, exhibiting the easygoing, good-natured temperament of their OES roots, while still providing all the energetic fun and clownish antics of their poodle parentage. That said, they may more closely resemble one parent breed or the other. Fortunately, since both the Poodle and the OES tend to be great family dogs, a well-socialized Sheepadoodle will likely love children and get along well with other pets with proper introductions and supervision. This breed also has the potential for some rambunctiousness, says Erin Askeland, CPDT-KA, CBCC-KA, and Camp Bow Wow&#039;s animal health and behavior consultant. “It’s not so much that they’re super-high energy, but their endurance is pretty incredible,” she says. “If that’s [energy] pent up because they haven’t had enough mental and physical stimulation, that can come off as over the top.” Ample exercise, mental stimulation, and training throughout your Sheepadoodle’s life is important. Sheepadoodle Behavior  The Sheepadoodle’s affectionate nature means this dog can become quite attached to their family, in some cases so much so that they may not be able to handle being left home alone. That’s particularly true if they’re left alone with nothing to do, says Askeland. “They’re very people-oriented dogs,” she says. And although both breeds have a history of working independently, in those cases, they’re busy with a job to do. “If they’re left alone in a home situation, they might panic a bit and not know what to do.” That could manifest as separation anxiety, but with appropriate mental and physical stimulation, it’s less likely to be an issue, Askeland says. As long as they’re included in what the family is doing, Sheepadoodles tend to be happy-go-lucky pups. That said, they are generally rather alert, says Askeland. “They can be quite vocal and ‘barky’ as far as alerting you to people coming to the door or walking by the window,” she says. “That’s really instinctual to them, to tell the world what’s going on.” This means it’s important to give your Sheepadoodle an outlet for that energy, but pet parents should also work on training them to understand that, once you’ve investigated and said it’s okay, they can stop alerting. Sheepadoodle Training  Although the Old English Sheepdog and Poodle have differing backgrounds, both dogs were bred to do jobs: The OES is a herding breed, and the Poodle has historically been a hunter and performer. Therefore, it’s no surprise they are an intelligent, capable mix. “They’re highly motivated and very smart,” Askeland says. “They love to learn and work, so if you’re going to have one in your family, you must be able to do classes and dedicate yourself to training (using positive reinforcement training techniques) as a lifelong process.” Depending on which side of the family your Sheepadoodle most takes after, ease of training may vary. Poodles tend to be eager to please and easy to train, while the OES has a herding instinct to work more independently, meaning they sometimes require a little more motivation in terms of treats and praise. That means pet parents might need to exercise a little more patience.  Fun Activities for Sheepadoodles  Agility Swimming Obedience Tricks training Long walks, possibly runs (in cool weather) Playing in the snow Hiking Frisbee Fetch Going to the dog park Cuddling with their family Sheepadoodle Grooming Guide While many people opt for a “doodle” mix because they want a non-shedding dog, there’s no guarantee that a Sheepadoodle won’t shed.  The potential for shedding aside, both breeds have significant grooming requirements, so you must be prepared to commit to grooming whatever type of coat your Sheepadoodle pup ends up with. Regular brushing and appointments with a professional groomer will be required. It’s helpful to show Sheepadoodle puppies that grooming, brushing, nail clipping, and ear cleaning can be a fun bonding time full of treats and praise, so that when they’re older—and much larger—they’re comfortable with the process.  Coat Care  Brushing your Sheepadoodle a few times a week (if not daily), paired with a bath and trim scheduled every couple of months should keep her coat in good shape, no matter which parent breed your dog takes after. Depending on the type of coat your Sheepadoodle ends up with, there could be more potential for matting—which can be very painful for your dog. You could also deal with seasonal shedding. Talk to your veterinarian or groomer about the best ways to keep on top of any coat concerns you have. Eye Care  Regular grooming will help keep those cute coats from blocking your Sheepadoodle’s vision. However, since they’re prone to a variety of eye conditions, keep tabs on your pup’s eyes and talk to your vet right away about any changes you notice. Ear Care Because Sheepadoodles tend to enjoy playing outside, be sure to check your floppy ears regularly for debris. Keeping them clean and dry (especially if they’ve gone for a swim!) is the best way to keep ear infections at bay. Considerations for Pet Parents  The Sheepadoodle’s OES roots make them a fantastic fit for families in cooler climates, but they can also thrive in warmer areas if their coat is clipped appropriately and their family gives them plenty of time to cool off indoors during the summer. While the hope is that this crossbreed won’t shed, that’s not guaranteed—and either way, their grooming needs will be considerable. All this effort is well worth it, though, for a family that’s prepared to give their dog the time, attention, exercise, and training they need. A Sheepadoodle with good manners will love and amuse their family every day."}]