[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "American Water Spaniel", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, American Water Spaniel", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_american_water_spaniel"}, "datePublished": "May 26, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about American Water Spaniel Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Although it’s a very rare breed, the American Water Spaniel is the State Dog of Wisconsin. A dual-purpose animal, it was bred for companionship and retrieval ability. Physical Characteristics The American Water Spaniel is longer in size than many Spaniels. Its strong legs and muscular body allow it to move effortlessly through water, and its pace is balanced. This medium-sized dog’s unique coat, which can have closely-knitted curls, is wavy and generally solid liver or brown in color. The American Water Spaniel also has a long muzzle and hairy ears. Personality and Temperament The American Water Spaniel is versatile in its hunting capability and sensitive in nature. Apart from being a pleasant companion, it is cordial with other dogs and obedient if given proper training and exercise. Care Given its name, it is no coincidence the American Water Spaniel&#039;s favorite activity involves water games. However, it should be taken for indoor and outdoor activities, as well as place the dog on a routine-based exercise schedule. Additionally, a American Water Spaniel&#039;s ears should be checked regularly and its coat should be brushed and combed weekly; this will help remove any dead hair. Health The American Water Spaniel generally lives for 10 to 12 years. One of its major health problems is mitral valve disease. Other minor health issues include canine hip dysplasia (CHD), patent duct arteriosus (PDA), and pulmonic stenosis. It may also occasionally suffer from progressive retinal atrophy (PRA) and patellar luxation. To identify some of these issues, a veterinarian may conduct eye, cardiac, and hip exams on this breed of dog. History and Background Though nothing can be confirmed about the origins of the American Water Spaniel, it came to be recognized as a breed for the first time in the mid-western parts of the United States. It is assumed that the breed evolved from the Irish Water Spaniel and its other versions like Tweed Water Spaniels, Northern Water Spaniels, and Southern Water Spaniels. It is also believed that the English Water Spaniel and the Curly-Coated Retriever might have played a part in its development. Recognized as one of the least popular American Kennel Club breeds, the American Water Spaniel wasn&#039;t registered until 1940. The breed, however, remains popular in Wisconsin and is still the state dog today."}]