[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Azawakh", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Azawakh-Dog-Breed-533256317.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Azawakh-Dog-Breed-533256317.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Azawakh", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_azawakh"}, "datePublished": "September 30, 2016", "dateModified": "October 13, 2023", "description": "Learn everything about Azawakh Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "By Paula Fitzsimmons With its long legs, lean build and large, expressive eyes, the Azawakh was officially recognized as a new dog breed in the AKC’s hound group in January 2019. The Azawakh is originally from West Africa, where these pups have traditionally served as hunters, guardians and herders. The Azawakh dog breed made its way to the US in the 1980s. The Azawakh is a fast, energetic and independent dog breed cherished for deep devotion and affection for their human families. Those most familiar with the Azawakh say they’re a complex breed who requires early training and socialization in order to evolve into well-balanced dogs. Physical Characteristics The Azawakh is a tall, medium-size dog breed with a slender build and noticeably long legs. At first glance, they resemble Greyhounds; however, they are more closely related to Sloughi and Salukis, who are also members of the hound group. Azawakh males stand between 25 and 29 inches tall, with females typically a couple inches shorter. Males weigh from 44 to 55 pounds; females from 33 to 44 pounds. These dogs are built for speed, a skill useful for hunting fast-moving animals like rabbits and gazelle in their native West Africa. “The gait is light, and they appear to float over the ground,” says Deb Kidwell, secretary of the American Azawakh Association. “The gallop is leaping, similar to a deer. It’s not particularly fast as compared to a Greyhound, but they have incredible endurance.” Experts describe the Azawakh as elegant and exotic. “The tail is long, thin and tapered; it is set low but carried above the level of the back when the dog is excited. The head is long, narrow, lean and chiseled with a long, straight muzzle. The eyes are large and almond-shaped. The ears are high-set and triangular with slightly rounded tips,” says Gina DiNardo, executive secretary of the American Kennel Club (AKC) in New York City. The Azawakh also has a deep chest and prominent hip bones, as well as bones and muscles that are visible beneath their thin skin, she adds. Their coat is short and “may be down to nonexistent on the belly,” says Kidwell. The AKC standard allows all colors, color combinations and markings; limiting genetic diversity can actually be detrimental to this breed, Kidwell says. Common Azawakh colors include red, brown, black, gray and white. Personality and Temperament The Azawakh dog breed is known to be highly affectionate and loyal. “In terms of the bond with the owner, there is nothing like it. The Azawakh’s devotion to their owner or family is legendary,” says Kidwell. This affection is reserved for family members, however. “Generally, [Azawakh] tend to be aloof or avoidant with strangers. Early and consistent socialization is important to have a well-rounded pet. Some may never accept a stranger’s touch or close presence.” They also have a high level of energy and endurance. “A bored Azawakh is not a good thing! The owner of an Azawakh needs to be dedicated to providing adequate exercise and interaction for the breed. They are settled house dogs once their exercise needs have been met,” says Kidwell. They’re a complex, intelligent breed and are not suited for everyone. “They aren’t the easiest breed to live with when you don’t understand their basic emotional need to be close with their person and to be a beloved and cherished family member,” says Kidwell, who lives with five Azawakhs. Doing research and speaking at length to a vetted breeder is essential before committing oneself to the breed. “It’s so easy to become enamored with the exotic beauty of the Azawakh. However, you must examine yourself as to your suitability to be an Azawakh owner with all the pros and cons of living with the breed,” Kidwell says. Care Because they’re a highly intelligent and independent dog breed, Azawakh need to be trained as pups, says DiNardo. “Early socialization and puppy training classes with a trainer who has a positive approach are recommended. The Azawakh possesses an amazing amount of dignity,&quot; says DiNardo, and like any dog, &quot;does not respond well to harsh or punishment-based training, which can ultimately produce a hound who is either broken in spirit, aggressive or unmanageable.” “Positive, reward-based training with gentle but firm corrections can result in a hound who is obedient, affectionate and loyal,” says DiNardo. They are highly energetic and rugged dogs who require regular exercise, which includes “long walks, daily opportunities to run in securely fence[d] areas and daily activities with their owners. Without regular exercise, they can become lethargic or can exhibit destructive behavior,” says DiNardo. Exercise needs to be interactive, Kidwell says. “Leaving an Azawakh alone in a yard expecting them to exercise themselves without a playmate or interaction of owner is certainly not ideal.” Kidwell has a large yard for her Azawakh to play, run and exercise, but she says they also need to go places to maintain their socialization skills. “Group walks with other dog lovers at the local park are great.” Kidwell also recommends giving your dog a ride in the car, even if it is just going on errands. “These things help your Azawakh to become well-adjusted and keeps them happy,” she says. Some Azawakh prefer to stay home, however. “These dogs would like to live in a vacuum with their family. It’s the conundrum of living with this breed,” Kidwell says. These native West African pups also tolerate heat well, says DiNardo, “but are sensitive to damp and cold weather, which should be considered when planning an exercise schedule.” What they don’t tolerate well is long hours in dog crates. “If you are working an eight- to 10-hour day, a dog walker or doggy day care would be a good alternative. [An] Azawakh kept crated for long periods of time will become neurotic, and may become a crate soiler or hurt himself trying to escape the confinement.” The Azawakh has a fine coat, so upkeep is minimal, says DiNardo. “A weekly once-over with a soft bristle brush, a rubber grooming mitt or tool, or a hound glove is usually what is needed to keep the coat in good condition.” Health Overall, the Azawakh is considered a healthy dog breed that, with optimal care, can live between 10 and 13 years old. The most common health problems they experience are hypothyroidism, seizures, masticatory myositis (a condition that makes it extremely painful for a dog to open his mouth) and a spinal condition called spondylosis, says Kidwell. “Hip dysplasia and bloat are virtually unknown in the breed but could happen.” Experts strongly recommend working with a breeder who tests her Azawakh before breeding them. “Some tests that are recommended are CBC and Super Chem blood tests, full thyroid profile, X-ray for hip and elbow dysplasia, heart and eye testing,” says Kidwell. Kidwell recommends waiting until they’re fully mature before breeding them. “It would hopefully show that seizures are not present, though some get seizures later in life.” She says Azawakh should also receive DNA testing before breeding. “Keeping the coefficient of inbreeding—a method of determining how closely related two dogs are—of the breeding pair low also helps genetic diversity and prevents excessive inbreeding.” History and Background Azawakh are sighthounds who descended from the free-roaming dogs of the Saharan Sahel region of West Africa, says DiNardo. “The breed takes its name from the area’s Azawakh Valley.”   The Azawakh is the only sighthound dog breed that is indigenous to this area, says Kidwell. “In the Sahel, they are a multipurpose hound.” They are most commonly used as a village and flock guard, as well as a hunter of game—like rabbits, gazelle and jackal. Azawakh are also used for herding flocks of sheep, goats and zebu cattle, explains Kidwell. They’re still used in these capacities in countries within Africa today. They are considered more than workers; DiNardo explains that they are prized family members that live under the same roof as their owners."}]