[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Thai Ridgeback", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-thai-ridgeback-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-thai-ridgeback-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Thai Ridgeback", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_thai_ridgeback"}, "datePublished": "September 18, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Thai Ridgeback Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "This rare breed is thought to be one of the world’s first dog breeds, originating in an area of Thailand known for its isolation. Because of this, the Thai Ridgeback is believed to be one of the few true purebreds. Known for its hunting and protection abilities, the Thai Ridgeback is still a rare breed outside of Thailand, with only about 300 of these dogs known to exist in the United States. Physical Characteristics This medium-sized dog breed has a short, smooth coat with pricked ears. The Thai Ridgeback gains it’s name from the ridge of hair that runs down the dog’s back. This dog breed can weigh anywhere from 35 to 75 pounds at a height range of 20 to 24 inches, with the females being notably smaller than the males. Personality and Temperament Due to this breed’s innate ability to guard and hunt without proper training, the Thai Ridgeback may be aggressive in attempts to protect its master. However, this trait is easily outweighed, as the breed is generally known as a loving addition to a family. Daily exercise for the Thai Ridgeback is suggested, as well as a place to rest in a warm spot of the house. Care Because this dog breed originated in a tropical climate, the Thai Ridgeback generally does not do well in colder climates and should be kept as an indoor dog. The coat of a Thai Ridgeback requires little maintenance, however daily exercise is suggested to keep a healthy lifestyle for this breed. Health The Thai Ridgeback is a strong breed, known to live anywhere from 12 to 15 years. Although this dog breed is known to be generally healthy, one disease to be aware of in the Thai Ridgeback is the Dermoid Sinus Cyst, which causes the skin to be unable to close along the spine. History and Background Ancient artifacts show that the Thai Ridgeback originated in the isolated islands of Eastern Thailand an estimated 4,000 years ago. Because this area was secluded from others, with poor transportation methods, this dog breed has remained very pure with little to no crossbreeding. In Thailand, this dog breed was mainly used in hunting, with the ability to catch small animals, and as an efficient guardian of the home while its owners were away. Today the Thai Ridgeback is considered a very rare breed outside of Thailand, with only an estimated 300 in the United States. The United Kennel Club recognized this dog breed in 1996. Featured Image: iStock.com/DevidDO"}]