[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Scottish Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Scottish Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_scottish_terrier"}, "datePublished": "October 17, 2008", "dateModified": "October 13, 2023", "description": "Learn everything about Scottish Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Developed in Scotland in the 1800s, the Scottish Terrier is an interesting dog breed which is part of the Terrier Group. The compact, energetic and independent dog is especially known for its bearded muzzle and unique profile. Physical Characteristics The Scottish Terrier&#039;s beard and eyebrows enhance its keen and sharp expression. It has two coats -- a two inch long, wiry and very hardy outer coat and a dense undercoat. The outer coat, which comes in wheaten, black, or brindle of any color, frequently has sprinklings of white or silver hairs. The heavy boned, short-legged, and compact Scottish Terrier also packs a lot of power in its small body -- qualities needed in a dog that has to face formidable opponents in narrow places. Personality and Temperament Nicknamed “little diehard,” the Scottish Terrier is smart, feisty and fearless. And while it is aggressive toward other animals and dogs, it is usually friendly towards humans. The Scottish Terrier is also known for its stubbornness and independence, and yet, it is always devoted to its human family. When left alone, it may bark and/or dig. Care The consummate adventure seeker, it loves to play games outside and requires daily leash-led walks. Its wire coat, meanwhile, should be combed twice or thrice a week, and shaped once every three months. The Scottish Terrier is a good housedog, but can live outside in warm and temperate climates. Health The Scottish Terrier, with a lifespan of 11 to 13 years, may suffer from minor problems like Scotty Cramp, patellar luxation, and cerebellar abiotrophy, or major health issues like von Willebrand&#039;s Disease (vWD) and craniomandibular osteopathy (CMO). To identify some of these issues, a veterinarian may run hip, knee, and DNA tests. History and Background There is a lot of confusion regarding the Scottish Terrier’s background, as all terriers in Scotland are referred as Scotch or Scottish Terriers. Adding to the confusion is the fact that the modern Scottish Terrier was originally placed under the group of the Skye Terriers, denoting a family of terriers belonging to Scottish Isle of Skye. Irrespective of the origin, the earliest Scottish Terriers were first documented in the late 19th century, belonging to a group of hardy Highlanders whom they served as vermin hunters. The first breed standard was drafted by J.B. Morrison and later published in Vero Shaw&#039;s Illustrated Book of the Dog in 1880. John Naylor is credited with introducing the breed to the United States in 1883. The Scottish Terrier&#039;s popularity gradually grew until World War II, after which its popularity surged. The Scottish Terrier is also the only breed of dog that has lived in the White House three times, beginning with Fala, a male Scottish Terrier gifted to President Franklin D. Roosevelt. President Roosevelt rarely went anywhere without his steady companion, even being buried by next to Fala. Most recently, President George W. Bush has owned two Scottish Terriers, Barney and Miss Beazley. Today, the Scottish Terrier is a popular pet and show dog."}]