[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Curly-Coated Retriever", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Curly-Coated Retriever", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_curly_coated_retriever"}, "datePublished": "July 16, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Curly-Coated Retriever Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "As its name suggests, the breed is distinguished by its coat of small, tight, water-resistant, crisp curls. It’s a strong, agile breed, developed to be a multi-purpose hunting retriever. Physical Characteristics A strong swimmer, the Curly-Coated Retriever has long legs and dense curly coat. Its active and enthusiastic nature, together with a high level of alertness, makes it quick when retrieving. The breed also has a stylish and sophisticated appearance. Personality and Temperament The Curly-Coated Retriever is not only calm, gentle, and sensitive, but also very responsive. As such, the dog can be easily trained. It enjoys playing with children and can prove to be a great companion.  The Curly-Coated Retriever is most active and enthusiastic otudoors. Despite its confidence and bravery, however, it is wary of strangers and prefers to be at a distance. Care The Curly-Coated Retriever does not require too much maintenance. However, certain things have to be taken care of. The curls require a bit of trimming, and occasional brushing. However, this is not required at the time of shedding. A daily exercise regimen, including retrieving and swimming, is important for Curly-Coated Retrievers. And if you are in search of an outside pet, the Curly-Coated Retriever is adaptable to living outdoors in temperate climates. Health The Curly-Coated Retriever, which has an average lifespan of 8 to 12 years, may be prone to health concerns such as cataract and distichiasis. It is also susceptible canine hip dysplasia (CHD), a major health issue. To identify this problem, a veterinarian may recommend hip exams for the dog. History and Background The Curly-Coated Retriever&#039;s origin has not been properly documented. Some believe this particular breed was in England during the late 1700s, acquiring its name from its distinct curly coat. It is said that the Curly-Coated Retriever is descended from the Old English Water Dog, the smaller Newfoundland, and the Irish Water Spaniel. The breed&#039;s curls were later introduced after the mix was crossed with the Poodle, a water retriever. The Curly-Coated Retriever earned enormous recognition in England during the mid-1800s. It was first exported to the United States in 1907, and later exported to New Zealand and Australia. The breed was officially recognized by the American Kennel Club in 1924."}]