[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Norwegian Elkhound a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "When socialized properly as puppies and trained early, Norwegian Elkhounds make wonderful family dogs. They live well around adults as well as children."}}, {"@type": "Question", "name": "Are Norwegian Elkhounds rare?", "acceptedAnswer": {"@type": "Answer", "text": "The Norwegian Elkhound is a relatively rare breed, including in Scandinavia where they originated. "}}, {"@type": "Question", "name": "How big are Norwegian Elkhounds?", "acceptedAnswer": {"@type": "Answer", "text": "Male Norwegian Elkhounds are about 20 inches tall at the shoulder and weigh 50–60 pounds. Females are slightly smaller, about 19 inches tall and 40–55 pounds.  Featured Image: Adobe/Chris"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Norwegian Elkhound", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/norwegian-elkhound.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/norwegian-elkhound.jpg"}, "author": {"@type": "Person", "name": "Jamie Frevele", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Norwegian Elkhound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/norwegian-elkhound"}, "datePublished": "June 24, 2023", "dateModified": "October 13, 2023", "description": "Norwegian Elkhounds are fluffy and lively dogs that hunted alongside the Vikings. But today, they’re more likely to enjoy long hikes with their humans. Learn more about caring for Norwegian Elkhound puppies and dogs here.", "articleBody": "Many dogs are great companions by nature, but the Norwegian Elkhound has been walking side by side with humans since the age of the Vikings, according to the Norwegian Elkhound Association of America (NEAA). The fluffy, medium-size breed has perky ears and an attitude to match. Commonly called Elkies, today these ancient hunting dogs may not be seeking out moose and elk, but they still have the energy and loyalty that made them exceptional canine companions.  At about 19–20 inches tall and weighing between 45–57 pounds, the bulk of these pups is made of thick gray, black, and silver fur. This makes Elkies happiest in cold weather and cooler climates, where they can spend lots of time outside with their humans. Caring for a Norwegian Elkhound Elkies are known to be friendly, sweet dogs that love attention and cuddles from their human companions. This temperament makes them great around children of all ages, though all interactions between kids and dogs need to be supervised. The Norwegian Elkhound’s high energy and playful nature also make them ready for adventure. One hour of exercise a day is recommended for this breed, whether that’s running in a fenced yard; going on long walks; or hikes, swimming, or hunting alongside their humans. They need mental stimulation as much as they need physical exercise, as a bored Elkie can become destructive and noisy. But keep in mind: While Elkies are sweet and cuddly dogs at home, the NEAA says they have an undeniable independent streak. This part of their personality might make them a little difficult to train, though they’re smart dogs. Be consistent and use positive reinforcement methods when training your Norwegian Elkhound. Norwegian Elkhound Health Issues Norwegian Elkhound dogs have an average life span of 12­–15 years, typical for a medium-size dog. They are generally very healthy but, like all dogs, they have a few health conditions pet parents should be aware of and monitor for.  Progressive Retinal Atrophy (PRA) While it won&#039;t cause your pup any pain, Norwegian Elkhounds are known to develop progressive retinal atrophy (PRA), a genetic condition that eventually causes blindness. The first sign of this condition is night blindness, or noticing that your dog cannot see well or bumps into things more frequently at night. When you welcome your Elkhound puppy into your home, bring them to the vet to have their eyes checked for signs of the disease. If you work with a breeder, they should screen your Elkhound pup and the parent dogs for this inherited condition as well.  There is no cure or treatment for PRA, but blind dogs can live long and happy lives with proper care. Hip Dysplasia Hip dysplasia affects many dog breeds, including Norwegian Elkhounds. This happens when there is a malformation of the ball and socket joint of the hip causing the bones to grind against each other. This leads to pain, osteoarthritis, and decreased mobility. While the condition may present more in older dogs, this congenital condition may be seen even in Norwegian Elkhound puppies. If you notice your dog limping, having trouble standing, or bunny-hopping, talk to your vet. Sebaceous Cysts Underneath all their fur, Norwegian Elkhounds can be prone to sebaceous cysts. You may feel a pea to walnut-size lump under their skin, and sometimes they can burst. If you feel something suspicious, bring your Elkie to the vet to have them checked out. Often these cysts will go away on their own, but if the cyst is painful and causing an infection, it will be surgically removed Obesity Though it can be hard to detect under their two-ply coats, Norwegian Elkhounds gain weight easily. Obesity in dogs can cause a slew of other health problems and prevent your Elkie from living their fullest, healthiest life. Talk to your vet about your dog’s ideal weight and body condition score, and how you can help your Elkhound pup if they’re getting a little too chunky. Fanconi Syndrome Perhaps the most worrisome health problem to watch for in your Norwegian Elkhound is Fanconi syndrome, a congenital disease that affects the kidneys and, if untreated, is fatal. But Fanconi Syndrome, if caught early, can be treatable with medications, food management, and lots of water. Symptoms can appear in Elkies from 1–7 years old, and can initially include excessive urination and thirst, followed by weight loss; muscle loss and pain; lethargy; and loss of appetite.  What To Feed a Norwegian Elkhound Norwegian Elkhounds are food-driven, which means they are far from picky eaters. But this also means they tend to gain weight easily. The typical healthy Norwegian Elkhound size shouldn’t surpass 60 pounds. Talk to your vet about the best food to feed your dog. You should choose a food that’s approved by the Association of American Feed Control Officials (AAFCO) to make sure your Elkhound is getting a well-balanced and nutritious diet.  How To Feed a Norwegian Elkhound Adult Elkies should be fed twice a day, once in the morning and once at night. Norwegian Elkhound puppies need to eat more frequently—about three or four times throughout the day. If your hungry pup eats too quickly, introduce a slow feeder bowl to stop them from scarfing. It’s best to not free-feed your Norwegian Elkhound, as this can lead to overeating and unhealthy weight gain. How Much Should You Feed a Norwegian Elkhound? While your AAFCO-approved dog food bag will have guidelines on how much to feed your dog based on their weight, talking to your vet is the best way to determine proper portions. They can give you a better estimate based on your Elkie’s health and lifestyle. Nutritional Tips for Norwegian Elkhounds As long as you’re feeding your pup a nutritious, AAFCO-approved dog food, they shouldn’t need supplements unless your vet recommends them. Behavior and Training Tips for Norwegian Elkhounds Norwegian Elkhound Personality and Temperament Norwegian Elkhounds are natural working dogs, bred to hunt alongside human companions for thousands of years. This makes them great pets that are always down for spending time outside, but it also means they have an independent streak. Norwegian Elkhound Behavior While socializing your Norwegian Elkhound puppy is key, these dogs are friendly, happy, and love being by the side of their people and other dogs. They can also be great playmates for children who know how to interact with animals. That said, Elkies were bred for thousands of years to be hunters. This means they can dart off after smaller animals like rabbits, squirrels, and even cats. Always keep this dog inside a secure, fenced area or on a leash when they’re outside. Otherwise, they might follow their nose and get into trouble. While socializing your Norwegian Elkhound puppy is key, these dogs are friendly, happy, and love being by the side of their people and other dogs.Norwegian Elkhound Training The Elkie’s independence means training them can take a little longer than other, more eager-to-please breeds. But it’s far from impossible. Always use positive reinforcement when training your Norwegian Elkhound (or any dog, for that matter). Keep sessions short, consistent, and fun—and offer them lots of yummy treats when they follow your cues. Fun Activities for Norwegian Elkhounds Long walks Hiking Agility training Dock diving Swimming Herding trials Norwegian Elkhound Grooming Guide  Norwegian Elkhounds are known for their gorgeous double coat that helped keep them warm during Viking hunting expeditions. But that fluffy coat comes with a lot of grooming needs. Coat Care The Norwegian Elkhound&#039;s thick, coarse coat is double layered to handle cold climates. This means families with Elkies are in for a lot of shedding—as in silver tumbleweeds. If you can&#039;t brush his back for 2–5 minutes every day, this may not be the breed for you. Schedule a professional deshedding session with a local groomer during spring and fall, when the fur flies even more than normal. The good news about the Norwegian Elkhound&#039;s coat is that it&#039;s basically weatherproof, protecting your dog against harsh cold, wind, snow, and rain. This makes the Elkie well-equipped for the colder months but prone to overheating in the summer. Keep your dog cool with a swim, air conditioning, and plenty of shade and water to drink when temperatures climb. Skin Care While their coat is high-maintenance, Norwegian Elkhounds typically have healthy skin and only need to be bathed a handful of times a year. Make sure you can’t feel any cysts under their skin, though, and talk to your vet if you notice changes in your dog’s health. Eye Care Because Norwegian Elkhounds are predisposed to PRA, it&#039;s important to have their eyes checked at the vet regularly. Monitor their eyes at home for any changes, too, such as cloudiness or having trouble seeing at night. Ear Care Elkies have what are called “prick ears,” which stand up and expose the ear canal. This ear shape is less prone to infections than floppy ears, but pet parents should still monitor their Norwegian Elkhound’s ears for redness, debris, or odor. Considerations for Pet Parents  Bringing home a Norwegian Elkhound puppy means you’re in for a lively, loyal companion. But you also need to dedicate time to keeping your dog mentally stimulated, well-exercised, and well-groomed to help them thrive. Make sure your Elkhound pup gets at least 60 minutes of outdoor exercise every day. If you live in a hot climate, this might be difficult, as this thick-coated breed is prone to overheating."}]