[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Gordon Setter", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Gordon Setter", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_gordon_setter"}, "datePublished": "June 18, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Gordon Setter Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "Originally a bird dog, the Gordon Setter is equally at home as a companion dog, obedience competitor and show dog. This breed of Scottish origin has a distinctive black and tan coat that allows it to be found easily in light fields and early snow. Physical Characteristics The Gordon Setter is square-built, with a stylish appearance. It is the heaviest of the setter family, possessing long feathers on its back legs, ears, tail, and underside. The Gordon Setter&#039;s coat is thick, soft, shiny, and black with tan markings. Its hair, meanwhile, can be straight or a bit wave. The Gordon setter also has a smooth and steady gait, wagging its tail constantly. All of these attributes help it to be active in the field, especially when hunting. Personality and Temperament The Gordon Setter has a guarding instinct when confronted by strangers, and can even show signs of aggression towards other dogs. An excellent bird dog, it is highly energetic and can prove to be good family companion. Care Regular combing, which should be done every two to three days, is a must for the Gordon Setter, though an occasional trimming may also be required. A thorough daily exercise regimen is also essential for the breed. And although it is adaptable to temperate climates outdoors, it should be given plenty of human companionship. Health The Gordon Setter, which has an average lifespan of 10 to 12 years, is prone to major health issues such as gastric torsion and canine hip dysplasia, and minor problems like cerebellar abiotrophy, progressive retinal atrophy (PRA), hypothyroidism, and elbow dysplasia. To identify some of these issues, a veterinarian may recommend regular eye, hip, thyroid, and elbow exams for this breed of dog. History and Background The Gordon Setter is popular breed of hunting dog, which was recognized by the American Kennel Club in 1892. It happens to be the slowest and bulkiest of the setter family. There are two types of Gordon Setter: one is the show Gordon, and the other is the field-type Gordon. Robert Chapman organized a show of Gordons in 1875, showcasing them for the first time. Today, the Gordon is considered a more popular hunters than family pet. Scotland had Tan and Black Setters as early as the 15th century. As a result, this breed came to be known as the Gordon Castle Setter in the late 16th Century. A large number of Gordon Setters were maintained at the castle of the Fourth Duke of Gordon. After his death, it was the Duke of Richmond who continued breeding the best of these setters at Gordon Castle. The Gordon Setter came to the United States in the mid-17th century. It got its earlier name of Tan and Black in the late 18th century, and it was only when the English Kennel Club registered it that the Gordon Setter received its current name."}]