[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How long do Pekingese live?", "acceptedAnswer": {"@type": "Answer", "text": "The Pekingese lifespan is usually 12–14 years."}}, {"@type": "Question", "name": "Are Pekingese dogs good pets?", "acceptedAnswer": {"@type": "Answer", "text": "Pekingese have been bred to serve as companions since ancient China, so they make wonderful family pets and often attach themselves to a select group of people. They are affectionate, if strong-willed. "}}, {"@type": "Question", "name": "Do Pekingese bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Pekingese were also historically used as watchdogs, so many continue to be vigilant and will bark to warn their family of anything they deem suspicious. Early exposure to different experiences and individuals may reduce barking in unfamiliar situations."}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pekingese", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/pekingese.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/pekingese.jpg"}, "author": {"@type": "Person", "name": "Virginia LaMon, DVM", "url": "https://www.petmd.com/author/dr-virginia-lamon"}, "keywords": "Dog, Breed, Pekingese", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/pekingese"}, "datePublished": "March 17, 2023", "dateModified": "October 13, 2023", "description": "The Pekingese is a small dog with long, luscious hair that requires a lot of grooming. Along with this daily fur upkeep, early socialization and training is needed to help keep them from barking. Learn more about caring for Pekingese puppies and dogs.", "articleBody": "Bred to live in palaces with the royal classes of ancient China, the affectionate Pekingese has a long and noble history. The toy breed was created around the same time as other flat-faced breeds like the Pug and Shih Tzu, according to the Pekingese Club of America. The first Pekingese were brought to the West as loot in 1860. Pekingese have a distinctive coat that is longest around the neck, giving it the appearance of a lion’s mane. Today, they make affectionate and loyal companions who appear proud of their lineage. Pekingese are dense little dogs that stand 6–9 inches high and weigh up to 14 pounds. Caring for a Pekingese Most Pekingese dogs are affectionate, outgoing, and especially loyal to the ones they love most. While they require moderate exercise, Pekingese are short-faced dogs (a brachycephalic breed). This means they are more prone to overheating, so exercise in hot weather should be avoided.  Along with making sure their pup stays cool, Pekingese pet parents need to spend a lot of time brushing the breed’s thick double coat to prevent matting. Pekingese Health Issues The typical Pekingese lifespan is 12–14 years. While mostly healthy, Pekingese are predisposed to a few health conditions. Investing in pet health insurance prior to the diagnosis of any health concern could help make treatment more accessible. Brachycephalic Airway Syndrome While the Pekingese’s smooshed face is cute, its structural abnormalities cause these dogs to have brachycephalic airway syndrome. This affects the dog’s ability to breathe normally and cool down, and it may lead to lower-respiratory and gastrointestinal diseases. Many dogs with this condition will breathe loudly and snore, and they are also at higher risk of complications when under anesthesia. Mildly affected dogs can be managed by limiting exercise, avoiding stress, and staying away from hot and humid conditions. Obesity can make the condition worse, so maintaining a healthy body weight is important. In dogs that have more difficulty breathing, surgery is recommended to fix some of the upper airway abnormalities. Dry Eye Keratoconjunctivitis sicca (KCS), commonly called dry eye, occurs when a dog does not make enough tears. The lack of lubrication causes the surface of the eye and the inside of the eyelid to rub against each other, leading to inflammation. A thick mucus may also develop instead of normal tears. Most dogs with dry eye will have painful, red eyes, which leads to squinting or rubbing the eye. Ulcers on the cornea are common with dry eye and require immediate treatment. Dry eye is treated with topical eye medication. Progressive Retinal Atrophy Progressive retinal atrophy (PRA) is a group of diseases that causes breakdown of the photoreceptor cells (rods and cones) on the retina, the light-sensitive tissue at the back of the eye. Initially, the dog may have difficulty seeing in the dark, but over time complete blindness occurs. In most cases PRA is an inherited disease, and there are currently no effective treatments. Patellar Luxation In dogs with patellar luxation, the kneecap slips out of its proper groove. This causes discomfort and can lead to arthritis. Many dogs will skip or “bunny hop” on three legs when the kneecap is out of place. In some cases, the knee returns to proper alignment on its own. But sometimes joint supplements or anti-inflammatory medications are required. In severe cases, surgery may be needed. Dental Disease Dental disease is one of the most common conditions seen in dogs as they age, especially in small breeds such as the Pekingese. This occurs when bacterial tartar and plaque lead to inflammation of the tissues around the teeth—and, eventually, to tooth and bone decay. The best way to prevent dental disease is with daily tooth brushing with a dog-specific toothpaste. Routine dental cleanings are recommended to evaluate the mouth, remove plaque and tartar, polish teeth to prevent future buildup, and treat or extract teeth that are significantly unhealthy. As with humans, dental disease can be a painful condition and may even affect internal organ health. What To Feed a Pekingese  Feeding a commercial kibble or wet food approved by the Association of American Feed Control Officials (AAFCO) is a good way to make sure your Pekingese receives a complete and balanced diet.  Pekingese puppies should be fed a food formulated specifically for puppies or designated for all life stages. For adult dogs, your veterinarian may recommend a dental-focused diet to help prevent dental disease.  How To Feed a Pekingese Adult Pekingese should be fed a measured amount twice a day. Pekingese puppies should be fed at least three meals a day on a consistent schedule to prevent low blood sugar levels. How Much Should You Feed a Pekingese? Just like humans, the recommended caloric intake for a Pekingese varies among individuals; each dog’s size, metabolism, neuter status, and activity level all affect how much food they need. The best way to determine portions is to talk with your veterinarian, who can calculate caloric needs for your dog. Labels on dog food packaging also provide guidance. Nutritional Tips for Pekingese Pekingese may benefit from adding omega-3 fatty acids (DHA/EPA) into their diet. Omega-3 fatty acids can be found in skin and joint supplements, fish oil, and even in some specially formulated dog foods. These fatty acids act as natural anti-inflammatories that help support the skin, coat, kidneys, joints, and heart. Behavior and Training Tips for a Pekingese Pekingese Personality and Temperament The Pekingese is an affectionate companion that’s loyal to a select group of people. They are generally confident and opinionated, but a happy Pekingese is pretty laid-back at home. But because they’re so loving toward their family, some Pekingese can develop separation anxiety when their favorite humans aren’t around. Pekingese Behavior Pekingese are alert dogs and have a strong bark for such a small pup. They might use this insistent bark when they think something is a threat—even if it’s just a neighbor grabbing their mail. Exposing a Pekingese to lots of new people, animals, and experiences from an early age can help reduce their tendency to bark at novel exposures. Pekingese Training The Pekingese is a smart dog, which makes them very trainable. But how enthusiastic they are about following your signals can vary; they might just not see the point in sitting on cue. These strong-willed dogs will learn best with training games and positive reinforcement. Fun Activities for Pekingese Obedience training Fetch Nose work Scent walks Pekingese Grooming Guide The Pekingese dog has a beautiful, thick, and shiny double coat that’s found in an array of colors: There are cream, fawn, red, gray, white, and black Pekingese, to name a few. Because the coat naturally grows long, frequent brushing is required from all pet parents, though some elect to trim their pup’s coat short for easier care. Skin Care The Pekingese has facial folds around the eyes and mouth that require regular cleaning. Wiping with a moist washcloth or dog-specific wipe helps prevent skin-fold dermatitis (yeast and bacterial infections in the facial folds). Routine bathing is recommended as needed to maintain healthy skin. Bathing your Pekingese more than twice a month, however, may strip their skin of healthy oils that act as a barrier against allergens. When you do give your pup a bath, use a gentle, dog-specific shampoo. Coat Care Brushing your Pekingese at least one hour each week will help remove tangles and knots from the dog’s long coat. If you run into pesky tangles, use a detangling and de-matting spray-on conditioner. Most Pekingese with a long coat require professional grooming every six to eight weeks. Eye Care A Pekingese’s big eyes need a little extra attention. Wiping the eyes daily with a soft, moist cloth or face wipe will help remove any accumulated debris. Also, the hair around the dog’s eyes should be carefully trimmed to keep it from causing irritation. Because they don’t have a long nose to protect their eyes from injury, flat-faced dogs are at increased risk for ulcers and abrasions on the eyeball. If you notice your Pekingese squinting or emitting any eye discharge, a trip to the veterinarian is recommended. These can be signs of injury or more serious eye conditions. Ear Infections To prevent ear infections, pet parents should clean their Pekingese’s ears every week or two with a dog-specific ear cleaner. If redness, odor, or debris is noted, take your dog to the veterinarian. Considerations for Pet Parents The Pekingese is a wonderful and loyal companion. The same characteristics that make them great pets may lead to excessive barking, however, so early socialization and positive (and patient!) training are essential for Pekingese puppies. Pet parents need to know that grooming a Pekingese is no easy feat. To maintain their beautiful, shiny coat, frequent at-home brushing and trips to the groomer are necessary."}]