[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Spanish Mastiff", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-Spanish-mastiff-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-11/picture-of-Spanish-mastiff-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Spanish Mastiff", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_spanish_mastiff"}, "datePublished": "September 17, 2012", "dateModified": "October 13, 2023", "description": "Learn everything about Spanish Mastiff Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Spanish Mastiff is best known for its size, with some weighing well over 200 pounds. It is a calm dog breed, and very protective of its master and family. Physical Characteristics The Spanish Mastiff is a very large and strong breed, typically weighing around 140 pounds, although some can weigh over 200 pounds. Similar to other Mastiff breeds, such as the Neapolitan Mastiff or Tibetan Mastiff, this dog has a large head, rectangular build, and medium length coat with loose skin folds. The Spanish Mastiff comes in a range of coat colors, including black, fawn, red, gray, and yellow, and can be seen with brindle or white markings.  Personality and Temperament The Spanish Mastiff is an excellent family protector and may be guarded around strangers. Although very large, this dog breed is generally calm and is very intelligent. Care Due to its protective nature, the Spanish Mastiff does not usually fare well in a busy environment. It does best in an environment in which it does not feel that it has to be on constant guard, such as the case might be in a city or busy suburban area. It requires a moderate amount of exercise, such as a reasonably long walk every day and a yard to move freely about. This is generally not an apartment dog. If well socialized at a young age, the Spanish Mastiff can be trained to be more accepting of strangers and other animals, but this dog breed has an innate urge to protect its master and family. Health The Spanish Mastiff has an average lifespan of 10 years. Few major illnesses are associated with this breed. Some Spanish Mastiffs may develop hip dysplasia and certain heart conditions. History and Background The Spanish Mastiff is a very old breed, with records being traced to over 2,000 years ago. Mentions of the Mastiff in writing first appeared from the Iberian Peninsula, where the breed was most likely introduced by the Greeks and Phoenicians before the Roman invasion. This large breed was used in Europe as a herding dog for transporting and protecting the Merino livestock. The Spanish Mastiff’s mostly white color was helpful in differentiating the large dog from the wolves they guarded the sheep from. Records show that in 1526 about 3.5 million Merino sheep migrated with at least one Mastiff for every 100 sheep. It is also believed that the Spaniards used this breed in battles against the native peoples they conquered. Europeans admired the Spanish Mastiff as a breed that is resistant towards climate changes and harsh conditions, and as a very independent dog with strong defense instincts. Featured Image: iStock.com/marcelinopozo"}]