[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Are Whippets good pets?", "acceptedAnswer": {"@type": "Answer", "text": "Whippets can make marvelous family pets. Well-socialized Whippets can be good with kids and other dogs, and they will fit well into apartments and big houses alike. Their grooming needs are also pretty minimal thanks to their thin, low-shedding coat. "}}, {"@type": "Question", "name": "Do Whippets bark a lot?", "acceptedAnswer": {"@type": "Answer", "text": "Whippets are known to be a quiet breed. But, like all dogs, they may bark while they are playing or to get their family’s attention."}}, {"@type": "Question", "name": "What’s the difference between a Whippet vs. Italian Greyhound?", "acceptedAnswer": {"@type": "Answer", "text": "Whippets and Italian Greyhounds look very similar and share many of the same characteristics. They both have lithe bodies, short coats, similar faces, and an inclination toward running.  The big difference lies in their size. At 7-14 pounds, Italian Greyhounds are much smaller than Whippets, which can weigh as much as 40 pounds. And while both breeds are slender, Italian Greyhounds are even more dainty and thin than Whippets.  Featured Image: iStock/Zbynek Pospisil"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Whippet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/whippet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/whippet.jpg"}, "author": {"@type": "Person", "name": "Kaitlyn Arford", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Whippet", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/whippet"}, "datePublished": "February 16, 2023", "dateModified": "October 13, 2023", "description": "Though they&#039;re a medium-size breed, Whippets are the smallest sighthounds and love short bursts of sprinting. Learn more about caring for Whippet puppies and dogs.", "articleBody": "Standing between 18-22 inches tall at the shoulder, Whippets are sleek and slim with a deep chest, long neck, small waist, and graceful legs. Whippets resemble small-scale Greyhounds, as they originated from crossing these large sprinters with smaller terriers.  Athletic, enthusiastic, and capable of reaching speeds of 35 miles per hour, Whippets are happy to stretch their legs through sprinting. They can change direction easily in pursuit of prey and are incredibly alert. But they’re not always on the go; Whippets balance energetic bursts with evenings spent snuggling on the couch with their humans. Whippets originally came from Northern England, where they are pictured in artwork dating back to the Middle Ages, according to the American Whippet Club (AWC). By the 2000s, Whippets were one of the most popular dog breeds in the U.K. Caring for a Whippet As long as a Whippet’s physical and mental needs are met, he will generally be quiet, calm, and happy. The breed is a sighthound, a group of dogs bred to hunt with their speed and eyesight, such as Greyhounds, Borzois, and Salukis. “Whippets generally have a goofy, playful personality,” says Renee Rhoades, a dog behavior consultant. “However, as they can be sensitive, it’s important to nurture and support them in order to build their confidence with things they find unsettling or scary.” Because of their thin skin and coat, Whippets can get cold easily, and generally don’t do well in cold or wet weather. Pet parents can dress them in comfortable sweaters, doggy coats, or pajamas to keep them warm. Whippet Health Issues The Whippet dog breed has a long lifespan of 12-15 years. And while they’re generally healthy, they are prone to a few health conditions. Mitral Valve Disease The mitral valve is a one-way valve on the left side of the heart that ensures blood flows in the correct direction. Over time, this valve may wear out, leading to mitral valve disease.   This condition is more common in smaller breeds, and Whippets may develop it as they age. The earliest sign of mitral valve disease is a heart murmur. Your veterinarian can diagnose this heart disease and come up with a treatment plan that your pup will need to follow for life. This treatment plan will likely be a combination of oral medications, exercise, and a healthy diet.  Gastric Dilatation and Volvulus Gastric dilatation and volvulus (GDV) is a life-threatening form of bloat where a dog’s stomach fills with gas and twists on itself. Large dog breeds with deep chests are most prone to GDV, including Poodles, Saint Bernards, and Greyhounds. While a Whippet isn’t a large dog, they do have a deep chest and can develop this condition.  GDV is a medical emergency and requires surgery to correct it. You should contact your vet immediately if you notice signs of GDV, including:   Distended stomach  Drooling  Decreased appetite  Retching, vomiting  Restlessness or inability to settle  Lacerations Whippet dogs have a short and thin coat that doesn’t offer a lot of protection from skin injuries. So as Whippets sprint and play, they may accidentally tear their skin or come home with cuts. Lacerations often occur on the legs, as they are very slender and don’t have much muscle coverage.   Most small lacerations are nothing to worry about, but if you find a bleeding wound on your Whippet, apply pressure with a clean cloth and take him to the vet. Your veterinarian can give your Whippet a physical examination, clean the injuries, and, if needed, stitch any wounds. Von Willebrand Disease Whippets can be affected by von Willebrand disease. This disease causes unusual clotting, and dogs with von Willebrand disease may experience bleeding gums, nose bleeds, and prolonged bleeding after surgeries. Veterinarians typically diagnose this disorder when a dog is between 3-5 years old. Deafness  Whippets are predisposed to an inherited form of deafness, meaning it comes from a genetic defect. Whippet puppies can be born deaf, but the dogs can also develop hearing loss over time. If you notice your puppy does not respond to your efforts in training them or if your older dog slowly stops listening to cues, your Whippet might be deaf. Although hearing is a difficult sense for a veterinarian to evaluate in dogs, there are some nonconventional tests they can perform to assess your dog’s hearing. Most dogs with deafness will live a full and happy life. What To Feed a Whippet Whippets are a medium-size dog breed, typically weighing between 25-40 pounds. They need to eat a dog food approved by the Association of American Feed Control Officials (AAFCO) to get all of their nutrients and stay at a healthy body weight. How To Feed a Whippet Because they’re at risk for bloat or GDV, your Whippet should never be fed one big meal or be free-fed. Whippet puppies should be fed at least three times a day on a regular schedule. As they grow, their feeding schedule can be reduced to twice a day. Give your Whippet a slow feeder bowl if he scarfs down his food too fast.  How Much Should You Feed a Whippet? The exact amount your Whippet needs to eat depends on his weight, health, and other factors. Follow the instructions on your dog food bag to find the correct serving sizes for your dog, and chat with your veterinarian about feeding your dog, too. Nutritional Tips for Whippets Whippets should get all their nutritional needs from their AAFCO-approved dog food. Speak with your veterinarian before giving your dog any supplements.  Due to the Whippet’s petite stature, keeping them lean and avoiding excess weight gain is important. Oftentimes, a Whippet in perfect lean body condition might appear to be “too skinny” to the untrained eye.  Behavior and Training Tips for Whippets Whippet Personality and Temperament Whippets are the perfect mix of happy and friendly with calm and quiet. They typically get along well with new people and other animals when properly socialized at a young age. But a home with loud, rambunctious little kids might be too much for these sensitive pups. “Sighthound breeds, in general, can be sensitive,” says Rhoades, “so a calm, quieter home is more likely to be suitable for them, but that doesn’t mean they are not a kid-friendly breed. Whippets can be playful and cheery, so as long as the child and dog are introduced slowly, they have a strong likelihood of being good friends.” Whippet Behavior Whippets have been bred for centuries to chase after prey, so they might see a neighborhood squirrel or your neighbor’s cat as something to run after. Whippets should always be kept on a leash or inside a fenced yard to keep them—and smaller animals—safe.  All Whippets need to be kept active, both physically and mentally. They don’t need to run around for hours, but they do need to stretch their long legs and explore.  “Outings with Whippets should consist of plenty of time to let them engage with the environment through their nose,” Rhoades says. “As they do like to have short spurts of running, letting your Whippet engage in this [in a safe, fenced space] can be fulfilling for them.” Whippet Training Training and socialization must start young for Whippet puppies. Like all dogs, they benefit from positive reinforcement training and rewards of treats, praise, and toys. Because they can be nervous, expose your Whippet puppy to other animals, people, and new situations as much as possible so they grow into a confident dog.   Fun Activities for Whippets Agility Nose work Dock diving Walks Running Barn hunting Hiking Frisbee Fetch Flyball Lure coursing Whippet Grooming Guide Grooming your Whippet on a weekly basis is the perfect opportunity to check their overall health and identify any issues with their skin, eyes, or teeth. Whippets are considered a low-maintenance dog breed, but like every dog, they need regular care and physical examinations from your veterinarian. Skin Care Whippets have sensitive skin. As their skin and coat is thin and fine, any products used on them (like shampoos) should be specifically made for dogs and gentle on their body. Their thin skin and love of sprinting means your Whippet can get hurt by the environment. Check your dog for cuts or abrasions after a day at the park, and contact your veterinarian if you see anything alarming.   Coat Care The Whippet’s short and thin coat makes grooming easy. This dog doesn’t shed very much and won’t need to be brushed often. But when you do brush him (such as during the spring, when their shedding is a little more frequent), use a soft brush so you don’t irritate his skin. Eye Care While genetic eye defects have been found in Whippets, the AWC reports that they are very rare. Your Whippet probably won’t need any special eye care. That said, Whippets may lose eyesight or develop vision issues as they age. Ear Care Check your pup’s ears regularly for signs of infection. If you notice redness, odor, or discharge, contact your veterinarian. Cleaning your dog’s ears with a dog-specific ear cleanser can help deter infections.  Considerations for Pet Parents If you let your Whippet outside off-leash, he must be kept within a high-quality, tall fence. These dogs can reach speeds much greater than humans can, and they tend to dart after anything that catches their eye—like a squirrel in a tree or rabbit in a bush.  However, Whippets don’t need their own backyard to be happy. As long as you give them space to run and activities such as daily walks or dog sports, they’ll be happy."}]