[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Black Russian Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Black Russian Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_black_russian_terrier"}, "datePublished": "June 4, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Black Russian Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Black Russian Terrier is a solid, large, powerful dog. It was developed in Russia as a guard dog. Today, the Black Russian Terrier is well known for its courage and strength, as well as its endurance. Physical Characteristics This well-muscled and large-boned dog can pull heavy loads and is agile enough to move over rocky land and overtake an opponent. It has a strong body, a powerful neck and head and can carry out its duties as a reliable guard dog. As the Black Russian Terrier is a strong and protective breed, reliability, intelligence, and courage are essential traits. The dog&#039;s undercoat keeps it warm, and its outer coat, which varies in length from 1.5 to 4 inches, is weatherproof and does not hold water. Personality and Temperament The Russian Terrier is reserved with strangers and extremely attached to and protective of its family. Rightly described as daring, confident, and calm, the Black Russian Terrier is playful and gentle with kids; it is also sociable and affectionate. The breed has a tendency to stick close to familiar people indoors and may not behave well with dominant or strange dogs, but is normal with smaller dogs and other pets. Although an independent thinker and fast learner, the Black Russian can get stubborn when forced to do something it does not want to. Care The Russian Terrier’s coat requires proper combing every week, even though it does not shed much. It should be trimmed once every six to eight weeks. Traditionally, a Russian Terrier&#039;s coat is given a tousled look. When giving it a show trim, however, the dog&#039;s form must be visible. Mental and physical workout and social interaction are essential for the breed. Agility and obedience training are also useful to mold the dog&#039;s character and physique. Russian Terriers do not function well as kennel dogs, as it they are always in need of human contact. Health The Black Russian Terrier, which has an average lifespan of 10 to 11 years, is prone to minor health issues such as elbow dysplasia and major problems like canine hip dysplasia (CHD). The breed may also suffer from progressive retinal atrophy (PRA) and dwarfism. To identify some of these issues, a veterinarian may recommend hip, elbow, and eye exams for the dog. History and Background In the mid-20th Century, the Soviets had to find the right working dog for their military. As there weren’t good qualified dogs to suit their purpose, they imported mostly German breeds to their state Red Star kennels. Roy, a Giant Schnauzer born in 1947, was the most impressive import. This dog was mated with other breeds like the Moscow Water Dog, Airedale Terrier and Rottweiler. All the successful resultant crosses were black and could be differentiated from other breeds as the Black Terrier group. However, the best dogs were then inter-bred and by the late 1950s, the public could obtain the second- and third-generation dogs. The principal criteria for breeding were versatility and working ability and steps were taken to improve the form. The functions of the Black Russian Terrier were performing military tasks like detecting explosives and mines, pulling sledges, transporting supplies, finding wounded soldiers, and border guard duty. The dogs were also used for military operations in Bosnia and Afghanistan. A standard was registered in 1968 and, in 1984, the Fédération Cynologique Internationale (FCI) recognized the breed. The popularity of the dog increased as Black Russian Terrier breeders were taken to other countries. The AKC accepted the breed as part of the Miscellaneous class in 2001 and it became a part of the Working Group in 2004."}]