[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is a Brussels Griffon a good family dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Brussels Griffons typically do well in families with children, other dogs, or cats. However, they are a sensitive breed, so supervision with very young children is recommended.  "}}, {"@type": "Question", "name": "Are Brussels Griffons smart dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Brussels Griffons are known for their high degree of intelligence and strong bond with their owners."}}, {"@type": "Question", "name": "What are the drawbacks of Brussels Griffons?", "acceptedAnswer": {"@type": "Answer", "text": "The rough-coated Brussels Griffon has moderate grooming requirements that typically require the services of a professional groomer. Also, as with most other toy breeds, Brussels Griffons can take a little longer with potty training and require a little extra patience."}}, {"@type": "Question", "name": "How much do Brussels Griffons cost?", "acceptedAnswer": {"@type": "Answer", "text": "While prices may vary depending on specific breeders and geographic location, one can expect to pay between $1,500 and $2,000 for a Brussels Griffon puppy."}}, {"@type": "Question", "name": "Are Brussels Griffons rare?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. While they are slightly more common in Europe because they originated in Belgium, they are considered an uncommon breed in the United States. However, Brussels Griffons did experience a burst of popularity after one of these playful pups co-starred with Jack Nicholson in the movie “As Good as It Gets.”  "}}, {"@type": "Question", "name": "Are Brussel Griffons affectionate dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. They are nicknamed “Velcro” dogs due to their strong desire to be with their owners. Brussels griffons thrive on companionship and do not do well when left alone for extended periods of time.  "}}, {"@type": "Question", "name": "Do Brussels Griffons like to be cuddled?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Brussels Griffons will often even pick a favorite person to snuggle with.     Featured Image: iStock/CaptureLight"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Brussels Griffon", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/BF.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/BF.jpeg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Breed, Brussels Griffon", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/brussels-griffon"}, "datePublished": "August 11, 2022", "dateModified": "October 13, 2023", "description": "Dr. Veronica Higgs provides an in-depth look at the Brussels Griffon to provide you with a complete dog breed guide.", "articleBody": "With a near-human expression, Brussels Griffons are adorable, intelligent, and social dogs that quickly win over fans with their larger-than-life personalities. They are small dogs, weighing in at 6–14 pounds and 7–10 inches tall. They are known for their expressive, almost childlike faces and large, wide-set prominent eyes. Their stocky bodies and characteristic, purposeful trot are reflections of their heritage as vermin hunters in Belgium. Caring for a Brussels Griffon Brussels Griffons belong to a class of dogs called brachycephalic dogs, characterized by a short snout and flat-faced appearance. This makes them more prone to snore and more sensitive to hot, humid weather. They should not be left outside for extended periods of time. Conversely, given their small size, they do not tolerate extreme cold either.   They also love companionship and are known as “Velcro” dogs to their adoring humans. So if you are planning on adding a Brussels Griffon to your family, be prepared for a dog that wants to spend all their time with you. Brussels Griffon Health Issues  Fortunately, Brussels Griffons are a generally healthy breed with few health concerns. Areas to ask the breeder or your veterinarian about include screening for any heart conditions, eye defects such as cataracts, or orthopedic issues including patella luxation and hip dysplasia.  Hip Dysplasia  Hip Dysplasia is an instability or loose fit of the hip joint, which occurs in growing dogs because the hip socket does not fully cover the ball portion of the femur (thigh bone). This can result in hip arthritis and pain. Clinical signs of hip dysplasia are more prominent in large breed dogs, but luckily, with their small stature, Brussels Griffons typically have minimal signs of pain or discomfort, which can usually be managed with a joint supplement or medication. Rarely do they need surgical intervention.   If you are concerned about your Brussels Griffon suffering from hip dysplasia, talk with your veterinarian about PennHIP screening. These specialized x-rays of a dog’s pelvis can detect if a dog will develop hip dysplasia in their lifetime.  Medial Patella Luxation  Medial patella luxation is a condition where the kneecap slips in and out of place. This can result in knee arthritis and pain. Clinical signs will be more pronounced in larger breed dogs, so it may be hard to spot the signs in a Brussels Griffon. Often a joint supplement or anti-inflammatory medication will be sufficient for small breed dogs. However, if the luxation is severe, surgery may be recommended to correct the issue and keep the kneecap in place.   Eye Issues  Brussels Griffons can be predisposed to cataracts, progressive retinal atrophy (PRA), and eye injuries.  Cataracts, or cloudiness of the lens of the eye, can be corrected surgically by a veterinary ophthalmologist if it occurs. PRA is an inherited form of degenerative ocular disease with no treatment or cure. It  progresses to blindness but is not painful for the pet. Finally, due to their prominent eyes, Brussels Griffons are prone to eye injuries such as scratches or irritation. If your dog’s eyes are red or they are rubbing at them, it is recommended that you check with your veterinarian.   Dental Disease  Adult dogs generally have 42 teeth. But Brussels Griffons, with their “smoosh-faced” anatomy, have less space to fit these 42 teeth, causing crowding and sometimes odd angles of the teeth. This can increase tartar and trap food or debris at an earlier age than non-brachycephalic dogs. Therefore, dental care is very important and Brussels Griffons will likely benefit from at-home tooth brushing as well as routine dental cleanings done by your veterinarian. What to Feed a Brussels Griffon  There are lots of diets on the market, and finding the right food for your Brussels Griffon can be overwhelming. Association of American Feed Control Officials (AAFCO)-approved food is a good place to start to ensure that the food you select meets standard nutritional requirements and regulations for pet foods. Other considerations for the Brussels Griffon include small-bite or small-breed diets, due to their size, and possibly a vet-approved dental diet given their propensity for dental issues. However, be sure to consult with your veterinarian regarding your pet’s specific needs when selecting a diet.   How to Feed a Brussels Griffon  As small breed dogs, Brussels Griffons will appreciate a few feedings throughout the day— typically two or three. They can be slightly picky or finicky eaters so choosing a highly palatable diet or even utilizing food toppers may be useful. Be sure to select a diet that is appropriate for your pet’s life stage (puppy, adult, or senior).   How Much Should You Feed a Brussels Griffon  When determining how much to feed your dog, it’s important to read the instructions on the bag or can. The caloric content of each food can vary significantly, and therefore the food bag or can is the best place to make that determination. Typically, you will need to know your pet’s age and weight to compare to the chart on the bag. Maintaining a healthy weight and monitoring your pet’s caloric intake are keys to a healthy lifestyle. So be sure to discuss your Brussels griffon’s ideal weight with your veterinarian and adjust the amount you are feeding based on ideal weight, not current weight. Also, don’t forget that treats count as calories too. While they are great for training, giving too many can lead to overweight pups. Nutritional Tips for Brussels Griffon  Always discuss any supplements or diet aids with your veterinarian prior to starting them, to ensure they are right for your pet. Brussels Griffons may benefit from omega-3 fatty acid supplements to keep their gorgeous coats healthy and shiny. They may also benefit from joint supplements with glucosamine and chondroitin to maintain healthy cartilage.   Behavior and Training Tips for Brussels Griffon  Brussels Griffon Personality and Temperament  Brussels Griffons are big personalities in small packages. Known for their childlike expressions and intelligence, this breed will keep you entertained. These dogs are best suited to those owners who prioritize companionship and are prepared to spend a lot of time with their dog. They are considered “Velcro dogs” and do not like to be left alone for extended periods of time. They will flourish in settings where they can be a central part of the family. Brussels Griffons have a medium energy level and will do fine with up to 30 minutes of moderate activity or walks per day. They are happy to get up and go, or to take more of a lounging role as long as they are with their loving owner.   Brussels Griffon Behavior Brussels Griffons typically do well in families with children, other dogs, or cats, but they can be sensitive, so supervision is recommended. Similarly, they can be nervous around strangers or in new situations. However, Brussels Griffons are usually not aggressive or overly vocal. In general, they are fun-loving, happy dogs, but expect them to bark when someone knocks at the door. Brussels Griffon Training  Brussels Griffons are smart and have a strong bond with their owners, making them easy to train. They will benefit from socialization and puppy training classes to help ensure a well-rounded, confident dog with good manners. Most Brussels Griffons also enjoy tricks training, and some will do very well in agility classes.   As with many toy breeds, Brussels Griffons can take some extra time with potty training and patience is the key. Due to their sensitive nature, Brussels Griffons do not respond well to harsh correction and require more of a gentle approach. They will also often develop undesirable behaviors if left alone for long periods of time, as they strongly prefer to be with their owners. Fun Activities for Brussels Griffon Tricks class   Agility Up to 30-minute daily walks Cuddling Brussels Griffon Grooming Guide Brussels Griffons come in four colors: red, beige (black and reddish brown with black face), black and tan, and black. There are also two types of Brussels Griffon coats—smooth and rough. The length of their coat will affect the level of grooming needs you can expect. Skin Care  As brachycephalic dogs, Brussels Griffons have a nose fold that needs to be kept clean and dry.  Their face folds should be cleaned around once a week. You can use a warm, wet wash cloth to wipe the area, but be sure to dry it off afterward to prevent accumulation of bacteria or yeast. Coat Care  The smooth-coated Brussels Griffons have a straight, short, glossy coat that requires occasional baths and daily to weekly brushing. You can expect this coat type to shed a moderate amount.   iStock.com/CaptureLightThe rough-coated Brussels Griffons have a wiry, dense coat and characteristic beards. Rough-coated Brussels Griffons will have moderate grooming demands, requiring professional grooming every 4–8 weeks in addition to occasional baths and weekly brushing. The rough-coated Brussels Griffons do not shed, unlike their smooth-coated counterparts.   iStock.com/CaptureLightAs with all breeds, nail trims should be performed to keep the nails neat and short.   Eye Care  Brussels Griffons have large, prominent eyes that are prone to injury. If your dog’s eyes are red or they are rubbing at them, it is recommended that you check with your veterinarian.  Ear Care  Regular ear cleanings should be performed, especially at bath time. If you notice debris in the ear or odor, please contact your veterinarian.   Considerations for Pet Parents  The Brussels Griffon can be classified as a clingy dog, so it is best for a pet owner who wants to spend a lot of time with them. They are also a bit tricky to potty train, so experience and a lot of patience is recommended. The most prominent health concern for pet parents to be aware of when considering a Brussels Griffon is their brachycephalic classification. Brachycephalic dogs have short snouts and a “flat-faced” appearance, which impedes their ability to pant effectively, making them prone to overheating. Care should be taken to limit exercise and extended periods of time outside during the summer months and during poor air quality days.   "}]