[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Belgian Tervuren", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Belgian Tervuren", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_belgian_tervuren"}, "datePublished": "June 4, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Belgian Tervuren Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "A well-balanced, medium-size dog, the Tervuren is elegant, with proud carriage. It is a strong, agile, well-muscled breed. Courageous, alert, intelligent and a natural herder, the Belgian Tervuren is also a breed that is usually on the move. Physical Characteristics Belgian Tervuren dogs are square-proportioned, displaying great body strength. The breed moves majestically and has a highly sophisticated and intelligent expression, which sometimes reveals its questioning nature. The Belgian Tervuren also possesses a dense undercoat and a straight, long outer coat, which is fawn in color with black overlays. Its gait, meanwhile, is effortless and majestic, due to its lightweight medium-sized bones. Personality and Temperament The Belgian Tervuren is smart and highly obedient. It displays an independent nature and likes to keep away from strangers. It is also very protective of its human family. Always alert and aware of its surrounding, the Tervuren remains gentle and calm indoors. Some Tervurens, however, will occasionally nip at the heels of kids when playing. Curiously, dogs of this breed tend to move in a circle instead of a straight line. Care The Belgian Tervuren loves human companionship and should therefore be kept indoors. Its favorite activities include playing, running, and herding outdoors. The occasional brushing is required to keep its coat bright and sheen, more so during the shedding season. Health Belgian Tervuren, which has an average lifespan of 10 to 12 years, is prone to minor health issues like hypothyroidism, canine hip dysplasia (CHD), progressive retinal atrophy (PRA), allergies, and elbow dysplasia, and major problems such as seizures. Belgian Tervurens can also be occasionally affected by hemangiosarcoma, persistent pupillary membranes (PPM), cataract, and pannus. To identify some of these issues, a veterinarian may recommend frequent elbow, eye, and hip exams for the dog. History and Background Belgian Tervuren dogs are known for their versatility and are great herding dogs. Though it is only considered moderately popular, the Tervuren is the most elegant of the three Belgian sheepdog breeds: the short-haired Malinois, the wire-haired Laekenois, and the long-haired Groenendael. The origins of the Belgian Tervuren are a little vague, but many believe the breed belongs to the family of Belgian or Continental Shepherd dogs; the Tervuren, however, does have a different coat type and color to its suspected relations. The breed received its name from the village of Tervuren, which was the home of one of the earliest proponents of the breed. First recognized as a breed in 1891, the Tervuren registered in the United States in 1918. After the end of World War II, the breed&#039;s lineage was reinforced by crossbreeding efforts with the long-haired Belgian Malinois. Though currently not as popular as other shepherd breeds, the Belgian Tervuren has become a favorite among search and rescue teams and families seeking highly energetic, intelligent dogs."}]