[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Breeds", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Wire Fox Terrier", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Dog Breeds", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Wire Fox Terrier", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/breeds/c_dg_wire_fox_terrier"}, "datePublished": "July 21, 2009", "dateModified": "October 13, 2023", "description": "Learn everything about Wire Fox Terrier Dog, including health and care information. All from the real vets at PetMD.", "articleBody": "The Fox Terrier was bred to run with the hounds and horses, then to go to ground and pursue the quarry into its den. Although it resembles its cousin, the Smooth Fox Terrier, the Wire Fox Terrier was bred independently in England during the 1800s. Physical Characteristics The square-proportioned and short-backed Wire Fox Terrier propels itself by using its rear, which enables it to cover ground quickly and glide effortlessly. Additionally, it combines this endurance, power, and speed, to gallop with the horses as well as the hounds during a hunt, and even follows the fox into its thin burrows. The Wire Fox Terrier&#039;s keen expression is a perfect fit for its attitude: playful, alert, and adventurous. The dog&#039;s dense and wiry coat, which is predominately white in color with streaks of brindle, red, or blue, is twisted, broken, and resembles coconut matting; its undercoat, meanwhile, is fine and short. Personality and Temperament This breed enjoys playing, running, hunting, chasing, and exploring. A real &quot;live-wire,&quot; the Wire Fox Terrier is independent, mischievous, and always looking for adventure. Unlike the Smooth Fox Terrier, this breed may display aggression towards other dogs, and is generally reserved with strangers. Care Daily exercise in the form of a vigorous game, a good on-leash walk, or an off-leash outing in a secure area is a must for the Fox Terrier. When given room, however, the Fox Terrier can exercise on its own. It does well indoors with access to a secure yard, but can live outside in temperate or warm climates. The dog’s coat requires combing every week, and shaping once every three months. Pets are shaped by clipping, but for show dogs stripping is effective. This is because clipping tends to make the color of the coat dull and also softens it. In addition, Wire Fox Terrier puppies may require ear shaping techniques to retain proper shape as adults. Health The Wire Fox Terrier, which has an average lifespan of 10 to 13 years, may suffer from patellar luxation and deafness. It is also prone to minor health concerns, such as lens luxation, cataract, distichiasis, and Legg-Perthes Disease. To identify some of these issues, a veterinarian may regular eye tests for the dog. History and Background The ancestry of the Wire Fox Terrier can be traced to English hunting dogs of the mid-19th century. These dogs were skilled at jumping and dislodging game, particularly a fox that tries to seek cover. Some experts believe the Wire and Smooth Fox Terriers shared a common background, with the Wire Fox developing from the Welsh Black and Tan Terriers, but in 1984 the American Kennel Club approved separate standards for the Wire and Smooth Fox Terriers. Smooth Fox Terriers preceded the Wire breed in dog shows by about 15 to 20 years, but each became popular in their own right. Breeders crossed Wire Fox Terriers with Smooths early on in order to improve the Wire strain by reducing its size, increasing the whiteness of the coat, and giving it a sleeker silhouette. However, interbreeding has been discontinued for many years. Today, the Wire Fox Terrier has retained its keen expression and energetic demeanor. For this reason, it is loved among hunters and families alike."}]