[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How often should dogs be checked for lumps and bumps?", "acceptedAnswer": {"@type": "Answer", "text": "Your dog should be provided an annual exam every year with your veterinarian, but senior dogs should have more frequent visits as needed (especially if they are managing an underlying condition). Mast cell tumors can develop quickly and can change size fast, so it’s critical to schedule an appointment as soon as you discover any new lumps or bumps.  "}}, {"@type": "Question", "name": "What is the difference between a mass and a tumor in a dog?", "acceptedAnswer": {"@type": "Answer", "text": "In general, a tumor and a mass are terms used interchangeably. It’s important to note that both terms don’t always indicate cancer, as some tumors can be benign and some masses can occur as the result of an injury or infection (abscess). "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cancer in Dogs: Symptoms, Types, and Treatment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cancer", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-1152325455.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-1152325455.jpg"}, "author": {"@type": "Person", "name": "Michael Kearley, DVM", "url": "https://www.petmd.com/author/dr-michael-kearley"}, "keywords": "Dog, Adult, Senior, Condition, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cancer/cancer-dogs-symptoms-types-and-treatment"}, "datePublished": "April 3, 2023", "dateModified": "April 3, 2023", "description": "A cancer diagnosis for your dog can be confusing and emotional. Dr. Michael Kearley breaks down the most common types of cancers in dogs, common treatment and management options, and guidance on what to know when your dog is diagnosed with cancer.", "articleBody": "What Are the Most Common Types of Cancer in Dogs? Masses and lumps in dogs are relatively common, but not all of them are cancerous. When a mass isn’t cancer, it is referred to as benign. In most cases, benign masses grow more slowly and don’t spread to other parts of the body, so they don’t pose a serious health threat. By contrast, cancerous masses are characterized by cells that can multiply. They are known as malignant tumors and may grow rapidly—spreading to other organs and parts of the body, causing potentially serious health problems. How fast cancer grows and where it spreads depends on the type of cancer. Dogs, just like humans, can get cancer. In fact, about 25% of dogs will develop some form of cancer in their life and about 50% of dogs over the age of 10 will develop cancer. While not an exhaustive list, below are some of the more common types of cancers seen in dogs: Anal Sac Adenocarcinoma: This cancer affects the anal glands, which are scent glands located in the rectum­. It can metastasize (spread) to other parts of the body. Hemangiosarcoma: This tumor often arises from blood vessels, so it theoretically can arise anywhere. However, it is most found in the heart, liver or spleen. It is an aggressive type of cancer and has usually already spread by the time a diagnosis is made. Lymphoma: There are several types of lymphoma that dogs can get, but the most common affects the lymph nodes. It is one of the most common forms of cancer in dogs, but fortunately it is the type most responsive to chemotherapy. Mammary Gland Carcinoma: Female dogs have about five pairs of mammary glands, and these types of tumors are more common in unspayed females. Hormones like estrogen and progesterone play a role in mammary development and cancer formation. Mast Cell Tumor: This is the most common cancer of the skin, which can be difficult to determine with sight alone since the appearance can vary. These tumors have a variable prognosis and can range from low to high grade—meaning they are less likely or more likely to spread to other areas in the body. Melanoma: This type of cancer can occur on the skin or in the oral cavity; these tumors are typically malignant when found in the mouth and require aggressive surgery and/or combination of radiation and chemotherapy. They usually show signs associated with dental disease like bad breath and decreased appetite.  Osteosarcoma: This is the most common cause of bone cancer in dogs, which is highly aggressive and painful. This cancer commonly affects the legs of larger breeds of dogs.  Treatment often includes surgery followed by chemotherapy or radiation. Transitional Cell Carcinoma: This is the most common type of urinary cancer, which usually affects the bladder the most and often causes symptoms similar to a urinary tract infection General Symptoms of Cancer in Dogs Dogs with cancer can show multiple symptoms. Some may have a lump or bump, new swelling, a wound that doesn’t heal, swollen lymph nodes, or abnormal bleeding. But many symptoms are nonspecific, including: Abdominal distension Behavioral changes or other neurological issues like seizures or head tilt Coughing or changes in respiration Decreased appetite and weight loss Exercise intolerance Pale gums Lethargy Vomiting and/or diarrhea If you are even slightly worried about your pup—especially if you notice a change in behavior or find a new lump—schedule an appointment with your veterinarian for an exam. General Causes of Cancer in Dogs Cancer often occurs for unknown reasons and can be influenced by many factors, including:  Age Viruses and infections Chemical and toxin exposure Genetics DNA mutations UV damage or other environmental triggers What Does a Cancerous Lump Look Like on a Dog? Cancerous lumps cannot be distinguished from benign, non-cancerous lumps based on visual appearance alone, so don’t try to self-diagnose at home. Lumps vary in size, shape, and appearance; some may feel firm and immovable, whereas others may feel soft and pliable. Some may appear hairless or pigmented, and others ulcerated; some may be painful when touched, and others not; some may be felt underneath the skin, and others may be felt above the skin. It’s important to differentiate lumps from lymph nodes, as dogs have multiple pairs of lymph nodes (underneath the jaw, in front of the shoulders, under the armpits, and behind the knees) that can typically be felt as small, oval-shaped, non-painful swellings underneath the skin. Lymph nodes can become enlarged and may be a symptom of cancer. If you find a new lump or bump on your dog, schedule an appointment with your veterinarian for an accurate diagnosis.    How Veterinarians Diagnose Cancer in Dogs A physical exam is used to look for any abnormal or unexplained lumps, bruises, or masses large enough to be felt during palpation (pressing on the surface of the body to feel the organs or tissues underneath). Your veterinarian may want to perform an FNA (fine-needle aspirate) of the mass, where a sample of the tumor is collected and submitted for analysis. Alternatively, a biopsy (larger sample of tumor collected, usually under heavy sedation or anesthesia) may be performed and studied for type, malignancy, and grade. All of this provides insight into how the cancer may progress—either aggressively or not. Bloodwork and urine testing usually follows to look for signs that may narrow the problem to a specific organ or body system. Imaging with radiographs or ultrasound may also be recommended to screen for masses in the chest or abdomen.  Once diagnosed, your veterinarian may recommend additional tests or refer you to an oncologist for further testing and treatment, including staging (staging determines the extent the cancer has spread). This may include CT scans, bone marrow aspirates, or additional biopsies. The prognosis will vary depending on the type of cancer and it is influenced by grade and stage. Usually, the higher the grade and greater the stage the worse the prognosis.  General Treatments of Cancer in Dogs Generally, there are three options for cancer treatment in dogs—surgery, radiation, and chemotherapy. Some cancers may respond to one type of treatment, while others may require a combination of some or all to arrive at a favorable prognosis. Unfortunately, a full cure is difficult to find. Some chemotherapy medications often used include: Carboplatin Chlorambucil Cyclophosphamide Doxorubicin L-asparaginase Lomustine Mitoxantrone Palladia Prednisone Vinblastine Vincristine Treatment and Management of Cancer in Dogs Treating and managing cancer in dogs is different than treating cancer in humans, as there are different goals and expectations. The goal is to maintain a good quality of life, and drug dosages and frequency of administration are often less than what a human would be prescribed, which minimizes side effects. The most common in dogs are decreased appetite, lethargy, vomiting, or diarrhea, although serious side effects such as bone marrow suppression and infections can occur. With few breed exceptions, dogs do not lose their hair. While they are on chemotherapy, it is important to keep your dog comfortable and manage their pain appropriately. This means an effective partnership with your veterinarian, adhering to proper appointment recommendations, and following through with bloodwork monitoring and other testing.  Caring for a dog with cancer is a challenge and can be burdensome and emotional, but remember to take advantage of each day’s opportunities for play, bonding, and love.  Knowing when it is time to stop treatment or consider euthanasia is both variable and individual for all pets and pet parents. Many factors such as prognosis, metastasis, risks of treatment, cost, and quality of life are often considered. But when it comes to quality of life, which can be subjective, keep in mind the 5 Freedoms: Freedom from hunger and thirst Freedom from discomfort Freedom from pain, injury, and disease Freedom to express normal behavior Freedom from fear and distress Your veterinarian is the best resource when it comes to knowing when it “is time.” Your vet is trained in end-of-life care and disease outcomes, and there are many resources and tools that can help when it comes to making this difficult decision.  Reducing Cancer Risks in Dogs Unfortunately, there is very little a pet parent can do to prevent most cancers from occurring. Routine checkups and evaluation of any new lumps or unexplained illness(es) should immediately prompt a veterinary visit. Limit sun and UV exposure, have your dog spayed/neutered, and if your dog is a breed predisposed to certain tumors, more frequent screenings are recommended."}]