[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/qfoekthohr", "@type": "VideoObject", "duration": "PT5M10S", "name": "pet-euthanasia-dr-villalobos", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/a59ac8c3649835c7bcde25bc3db7def766b398cc.jpg?image_crop_resized=640x335", "embedUrl": "https://fast.wistia.net/embed/iframe/qfoekthohr", "uploadDate": "2019-12-12", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/2d9fa0f6676c99f57679e41b9030666ab7bc6ce7.m3u8", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/euthanizing-pets-home-cost-what-expect?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Euthanizing Pets at Home: Cost and What to Expect", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/golden-retriever-and-british-shorthair-accompany-their-owners-picture-id1415206960.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/golden-retriever-and-british-shorthair-accompany-their-owners-picture-id1415206960.jpg"}, "author": {"@type": "Person", "name": "Liz Bales, VMD", "url": "https://www.petmd.com/author/dr-liz-bales"}, "keywords": "Dog, Senior, General Care, End of life, Cat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/euthanizing-pets-home-cost-what-expect"}, "datePublished": "August 6, 2019", "dateModified": "October 27, 2022", "description": "A vet answers all your questions about at-home pet hospice and euthanasia, from procedure and costs to aftercare.", "articleBody": "Now more than ever, pet parents think of their dogs and cats as members of the family. So it comes as no surprise that they are giving a lot of thought and attention to the handling of their pet’s end-of-life care. In the past, the options to say goodbye to your family pet would have been to take them to your veterinarian’s office or to a shelter for euthanasia. A new branch of veterinary medicine, pet hospice, provides concierge end-of-life services to meet this need, including palliative care and in-home euthanasia. Here’s what you need to know about these services and what they offer. What Is Pet Hospice? Dog and cat hospice services are modeled after hospice services for people. Animal hospice provides compassionate care and support for a pet with a chronic, life-threatening, or incurable illness.   Hospice care veterinarians will often come to your home to examine your pet and walk you through pain management, nutrition, and hygiene protocols, among other issues, so you can help make your pet’s final time—be that days, weeks, or months—as comfortable and dignified as possible. This concierge veterinary relationship can help provide peace of mind during the difficult end-of-life decision-making process. Your hospice care team can then help you make decisions regarding euthanasia and body care. Hospice consultations range from $150-$250 per hour. Euthanizing Pets at Home In-home euthanasia has now become an option in most cities. This provides a way to say goodbye to your pet in a comfortable and private setting. Letting your pet go at home can allow your family and other pets to say their goodbyes in their own time and space. In-home euthanasia services are usually also able to provide aftercare for your pet’s remains by transporting the body to be cremated and returning ashes to you if you choose private cremation.   How Much Does In-Home Pet Euthanasia Typically Cost? In-home euthanasia costs can vary, depending on the services provided. Services that your veterinarian is likely to provide include: Traveling to your location to provide services; an additional cost for emergency services is likely A physical examination and discussion about your pet’s condition as well as your concerns or questions about the process Sedation for your pet to ensure the process is peaceful and comfortable The euthanasia procedure Transportation of the remains for cremation Cremation services and remembrances of your choice (such as paw prints or ashes) Combined, you can expect to spend $400-$1,500 for their services, but the cost will vary depending on your location and the aftercare services you choose. How Does the Veterinarian Prepare for Home Euthanasia? The veterinarian will arrive at your home at the agreed upon time and examine your pet. Based on your pet’s condition, they will choose the best medications and process to perform the euthanasia. Once the veterinarian determines the best plan, they will talk you through it and give you the time that you need to ask any questions. Together, you will choose the best location to perform the procedure. What Drugs Are Used for In-Home Pet Euthanasia? How Do They Work? Euthanasia is typically a two-step process that involves two injections to make it painless and stress-free for your pet. The first injection is a sedative that can be administered into a muscle or intravenously, depending on the medicine. Once injected, your pet will become relaxed and will gradually fall asleep. Be aware that they may not close their eyes. Once your pet is resting comfortably, a second injection is given into a vein to stop their heart. The second injection typically takes anywhere from a few seconds to a few minutes to work. What Happens to Your Pet’s Body After an In-Home Euthanasia? The vet will usually call you ahead of time to discuss the details of how your pet’s body will be handled post-euthanasia. It is best to think about this in advance. Options in your area may vary but can include: Home burial Aquamation (an eco-friendly alternative to traditional cremation that uses alkaline hydrolysis) Burial at a pet cemetery Communal cremation (ashes are not returned to you) Private cremation (ashes are returned to you) You may elect to arrange these services on your own, but your veterinarian can arrange these for you as well. Your veterinarian will provide peaceful and respectful transportation of your pet’s remains. It you would like to wrap your pet in a special blanket or include one of their favorite toys in their cremation, let your veterinarian know. End-of-life decision-making can be extremely difficult. Veterinary hospice and in-home euthanasia services are good options for pet parents who want to experience these moments in the privacy of their own home. Featured Image: iStock.com/chendongshan   Related Video: When Is the Right Time to Euthanize a Pet?"}]