[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Common Ailments in Senior Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1282881740.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-10/iStock-1282881740.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Senior, Condition, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/care/common-ailments-for-senior-dogs"}, "datePublished": "May 29, 2013", "dateModified": "October 20, 2022", "description": "As your dog ages many changes occur. Be prepared with the following list of common ailments for geriatric dogs.", "articleBody": "By Dorri Olds As your dog ages be aware of any changes in behavior and mood. These can be indications that something is physically wrong. Just like people, as dogs grow older their ability to fend off illnesses declines. Even the most loving and attentive owner can miss signs by assuming that deviations in the dog’s sleep or eating habits are normal, merely due to age. It is far better to err on the side of caution and contact your veterinarian when you have any doubts. To help, here is a list of common health problems commonly seen in aging dogs. Cartilage between joints acts as a buffer to protect the bones from damage. When that cartilage is damaged it can inflame the joint. Arthritis is the inflammation of one or more joints. It can cause swelling, stiffness and pain. Symptoms may include limping or a change in gait, reluctance to move, aversion to stairs, difficulty standing or walking, and exhibiting pain when picked up. A dog may lick or chew at the aching joint and can show irritability or aggression. There are treatments including drugs and changes in diet and exercise. Gingivitis (gum inflammation) usually precedes periodontitis (gum disease). Gums can become inflamed when mouth bacteria turns into plaque on the teeth. Saliva hardens plaque and creates tartar. Bacteria-laden plaque and tartar on the teeth can spread under the gum line and cause swelling. If not treated, gingivitis can advance to periodontitis, which is when the gums pull away from the teeth. That creates pockets which can become infected and cause bone loss. Symptoms are gums that bleed or are tender, red and swollen. Gum disease can spread infection to the bloodstream and cause serious damage to organs. Diabetes is caused from poor production and functioning of insulin, a hormone made by the pancreas. Insulin’s job is to help move glucose from the blood into the body’s cells where it is then used for energy. Diabetes most commonly occurs in dogs at the age of 8 or 9 years old. Diabetes can be hereditary and is more common in females. Dog breeds especially prone to diabetes include Samoyeds, Cairn Terriers, Pugs, Toy Poodles and Miniature Schnauzers. Symptoms of diabetes include frequent thirst and increased urination, weight loss, fatigue, irritability, recurring infections, blurred vision, and slow-healing cuts or bruises. Although distressing, blindness does not have to drastically change the day-to-day living for your senior dog. Blindness can occur over time in some dogs and is best when caught at the onset when the eyes are just beginning to fail so you can start teaching your dog to rely more heavily on his hearing and other senses of smell and touch. Deteriorating eyesight is part of the normal aging process for dogs. One of the early signs can be cataracts. Cataracts make the eye appear to be covered by a white coating. Other signs of vision loss include bumping into things, falling, dilated pupils and red or irritated eyes. Kidneys remove waste and maintain balance in the body. When kidneys lose their ability to perform, waste and toxins can build up in the body and wreak havoc. This poisoning of the system is referred to as kidney failure. Many things can cause the kidneys to cease doing their job. It can be a kidney stone that blocked off the urinary tract, or rupture of the bladder, or normal aging of the kidneys. Symptoms of kidney stones in dogs can include drinking more water, urinating more, and having accidents in the house. You may see apathy, loss of appetite, weight loss, vomiting, and brown discoloring on the tongue and the dog may develop an ammonia smell to their breath. Cancer becomes more prevalent in dogs as they age and is the leading cause of death in senior dogs. Blood tests rarely detect cancer at the beginning stages so it is important to notice if your dog has any lumps or bumps on his body, changes in weight, sores that heal slowly, bleeding from the mouth, nose or ears. You may also see drooling, coughing, excessive panting, difficulty eating, and extreme tiredness. Other things to watch for are diarrhea, constipation, or blood and mucous in the stool. Successful cancer treatment is more likely if it is caught early. Dementia or canine Cognitive Dysfunction Syndrome (CDS) is a medical condition that causes memory loss, personality changes, confusion and disorientation. Alzheimer’s disease in humans is almost the same as CDS. One of the similarities is that there is no known cause; another is the existence of nerve-damaging protein build-ups in the brain that become waxy and create plaque. Symptoms can include the dog forgetting familiar toys, housebreaking techniques and their owners. Senior dogs with CDS may even forget tricks, their name, and spend long periods of time staring blankly into space. Pacing is also common, as well as other repetitive, compulsive behaviors like walking in circles."}]