[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Can dogs get salmonella?", "acceptedAnswer": {"@type": "Answer", "text": "Disease from salmonella in dogs is uncommon (though serious if it occurs). More commonly, dogs serve as a host for salmonella bacteria that will cause severe illness in people if transmitted. "}}, {"@type": "Question", "name": "Can dogs get salmonella from raw chicken?", "acceptedAnswer": {"@type": "Answer", "text": "Raw chicken and dried pig ears are two of the most common sources for salmonella bacteria found in the intestines of dogs, especially due to the popular (but inadvisable) trend of feeding raw meat to dogs and cats."}}, {"@type": "Question", "name": "Is salmonella fatal to dogs if left untreated?", "acceptedAnswer": {"@type": "Answer", "text": "Dogs affected by salmonellosis can become extremely ill. Untreated dogs will often die of dehydration and bacteria entering the bloodstream (sepsis). Featured Image: iStock.com/fpphotobank"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Salmonella in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Digestive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/calm.dog_.at_.vet_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/calm.dog_.at_.vet_.jpg"}, "author": {"@type": "Person", "name": "Jamie Lovejoy, DVM", "url": "https://www.petmd.com/author/dr-jamie-lovejoy"}, "keywords": "Dog, Adult, Puppy, Senior, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/digestive/salmonella-dogs"}, "datePublished": "June 9, 2023", "dateModified": "October 8, 2023", "description": "Dr. Jamie Lovejoy explains how salmonella infections affects dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Is Salmonella in Dogs? Salmonella is a type of bacteria that infects the gastrointestinal tract and can cause severe diarrhea in humans. In a dog, salmonella infection (called salmonellosis) is not common and often does not result in symptoms unless the dog has an already weakened immune system or is a puppy. Most salmonella bacteria are host-specific, meaning that individual strains will cause disease only in certain species of otherwise healthy animals. A cow with illness from salmonella is unlikely to make a healthy dog sick, and vice versa. However, even if a dog does not show signs of salmonellosis, he can still spread the disease through feces or saliva, which can infect humans. The type of salmonella that affects dogs is more likely to affect humans as well, making it a zoonotic disease. Although illness from salmonella is normally rare in dogs, the risk grows when pet parents choose raw and unprocessed meats as part of their dog’s diets. In all species, diarrhea and illness from salmonella is often severe and can lead to dehydration, sepsis, and even death if left untreated. Parents should promptly take their dogs to a veterinarian when diarrhea occurs with decreased appetite, lethargy, fever, and blood in the stool. Symptoms of Salmonella in Dogs Although salmonella can cause disease in multiple systems of the body, symptoms are most often seen when it disrupts the gastrointestinal tract. Symptoms of salmonellosis include the following: Severe, sudden onset, watery diarrhea Bloody diarrhea (hematochezia) Vomiting Lethargy Fever Decreased appetite, with or without weight loss Dehydration Though clinical signs overlap with other causes of severe diarrhea, salmonellosis may be suspected based on diet history, travel history, recent illness, or stress on the immune system. Though it is rare, salmonella can travel to the lungs, causing pneumonia, or to the reproductive tract of breeding female dogs, leading to loss of pregnancy. Causes of Salmonella in Dogs Usually, salmonella is transmitted when a dog swallows fecal matter from infected animals or products contaminated by bacteria. Dogs in agricultural settings are at higher risk, as are dogs whose diets include raw chicken or beef. Dried pig ears are another common source for canine infection. Salmonellosis is unlikely to occur if a dog accidentally swallows a small amount of raw meat. though other mild types of gastrointestinal upset (such as enteritis) may occur. Mild upset usually does not require medical attention, though the pet parent should watch their dog closely for symptoms. Good hygiene should always be followed when handling or disposing of pet waste. Raw diets should be avoided, as repeated exposure to salmonella sources increases likelihood of illness for the entire family. How Veterinarians Diagnose Salmonella in Dogs  Diagnosing salmonellosis can be difficult because the symptoms overlap with many other types of illness. In addition, dogs often do not show symptoms. Typically, a veterinarian will suspect salmonellosis by the symptoms and a history of exposure through raw meat consumption, or if any humans in the family are experiencing symptoms. Other causes of severe gastrointestinal inflammation can cause similar symptoms to salmonellosis. These include foreign material ingestion, parasites, Addison’s disease, and viral diseases. These should be ruled out through bloodwork, radiographs, and fecal tests prior to diagnosing salmonella.Treatment rarely requires a veterinarian to test for the specific type of salmonella unless recurring exposure is suspected and the source of infection has yet to be determined.   Treatment of Salmonella in Dogs As with many other causes of gastrointestinal inflammation, treating salmonellosis is mostly supportive care. This includes: Hydration with fluid therapy Controlling nausea and vomiting Preventing blood infection/poisoning with antibiotics Some patients may need greater care, such as feeding tubes, fever suppression medication, probiotics, or fecal transplants to reinstate normal gut flora. Recovery and Management of Salmonella in Dogs Recovery depends mostly on the severity of the infection. Mild cases may respond to supportive care within a few days, while dogs with advanced infections and blood poisoning may require multiple weeks of intensive therapy including intravenous fluids, antibiotics, and feeding tubes. Prevention of Salmonella in Dogs Feeding your dog well-balanced commercial diets and processed treats is the best way to avoid salmonellosis. The documented safety risks of raw food diets include E. coli, salmonella, and even tuberculosis. There have been no studies indicating that these diets are healthier than commercially prepared and cooked diets. At minimum, meat and eggs should be fully cooked before being offered to pets. Monitor the FDA pet food recall lists for any potentially contaminated products."}]