[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Senior Pet Questions Answered by a Vet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/senior%20dog%20resting%20head%20on%20pillow.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/senior%20dog%20resting%20head%20on%20pillow.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Senior, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/5-senior-pet-questions-answered-vet"}, "datePublished": "March 26, 2019", "dateModified": "September 7, 2022", "description": "petMD asked our Facebook audience their most pressing questions about senior pets. Here is one veterinarian’s answer to all those questions.", "articleBody": "You asked, and we answered. Here are some questions our PetMD Facebook audience had about keeping their senior pets happy and healthy. If you have a senior pet of your own, take a look at what veterinarian Dr. Jennifer Coates has to say about helping your senior pet thrive in their golden years.   Answers by Jennifer Coates, DVM 1. Vet prices are exorbitant, especially when senior dogs may need more frequent visits. Are there any payment plans available where prices are reduced—as in the human world—for senior dogs? - Vivienne Spiteri While veterinary care—particularly senior dog care—can get expensive, there is help available. Many pet health insurance and veterinary discount plans are available, but before you sign up, you need to be sure you know exactly what you are getting for your money. Traditional pet insurance will probably not cover any preexisting conditions that a senior dog or senior cat might have, but it could still be helpful if something new arises. Some policies include wellness care at an additional charge. Veterinary discount plans, like Pet Assure, work a little differently. For a monthly or yearly charge, you can receive discounted veterinary services, but only from “network” veterinarians. Check to make sure that a veterinarian you are comfortable working with is available in your area. The Humane Society of the United States also maintains a comprehensive list of organizations that provide financial assistance to pet owners in need. 2. What are the effects of CBD oil for age-related arthritis? - Erin Baker Chester  A lot of research is being done into the safety and efficacy of using CBD oil for the treatment of arthritis, but few results are currently available. One paper, published in 2018, reported on just 10 senior dogs who completed the study but did find CBD oil to be effective in relieving pain and promoting activity in cases of naturally occurring osteoarthritis. The authors did not report any significant side effects associated with CBD administration. More scientific study is needed before we can definitively say whether or not CBD oil is a good option for treating arthritis in senior pets, but preliminary work is promising. Remember that many other complementary therapies for osteoarthritis do have evidence supporting their use. Some examples are weight loss, nutritional supplements like omega-3 fatty acids and glucosamine hydrochloride, acupuncture, therapeutic lasers, and physical therapy. 3. My 13- and 14-year-old healthy dogs walk me daily—weather permitting. How much/often is too much? One of them loves it more than the other. My 14-year-old is a wee bit cranky—is this common or normal for his age? My vet said they are both in great shape. - Deb McGuire Walking is one of the best forms of exercise for senior dogs. It not only helps keep the body strong but is also a great way to provide mental stimulation. That said, if your 14-year-old hasn’t always been “cranky,” it is worth pursuing further with your veterinarian. Changes in temperament can be a sign of undiagnosed pain or other health problems. Senior pets tend to be quite stoic, particularly at the veterinarian’s office, so you may be seeing a symptom that your dog is hiding from his doctor. If your dog has recently received a clean bill of health, it would be interesting to see if a trial course of an appropriate pain reliever improves his attitude, particularly on walks. 4. I have a 9-year-old female Rottweiler. Any supplements you recommend? - Daemon Ember  Nutritional supplementation should be tailored to a pet’s individual needs, but some generalities do apply to many senior dogs. First, make sure that your dog is eating a high-quality diet. This will ensure that she is getting all of the nutrients she requires and eliminates the need for vitamin or mineral supplements. Many senior dogs have or are at significant risk for osteoarthritis, so giving a joint supplement does often make sense. Look for dog supplement options that contain several of the following ingredients: low molecular weight chondroitin sulfate, glucosamine hydrochloride, manganese ascorbate, avocado/soybean unsaponifiables (ASU), omega 3 fatty acids, P54FP (an extract of turmeric), hyaluronic acid and/or green-lipped mussels. If your dog has specific health problems, your veterinarian will be able to provide more detailed recommendations. 5. What health screenings are recommended for our older dogs? - Renate Glad Rollins Health screenings are an important part of preventative healthcare for senior pets. This is because they can pick up problems in their earliest stages when treatment is most likely to be effective. Screening for parasites (heartworms and intestinal worms, for example) generally remains unchanged as pets age, but many veterinarians start recommending additional lab work once pets reach middle age. In dogs, these additional lab tests usually include a complete blood count, a panel of blood chemistry tests and a urinalysis. Additional diagnostics may be warranted based on a dog’s breed, lifestyle, reproductive status, geographic location and medical history. Featured Image: iStock.com/LightFieldStudios"}]