[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Feed a Dog With Bladder Stones", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1324226513.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-1324226513.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Adult, Senior, Puppy, Condition, Nutrition, Urinary health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/what-to-feed-dog-with-bladder-stones"}, "datePublished": "March 17, 2023", "dateModified": "March 21, 2023", "description": "It&#039;s important to know what to feed your dog if they have bladder stones. Learn which vet prescription diets and ingredients are important to manage bladder stones in dogs.", "articleBody": "Bladder stones develop when substances that are normally dissolved in urine form crystals that link, and over time combine to form one or more stones. They can become so big that they can’t pass through the dog’s urethra, which traps them in the bladder. Different types of bladder stones require different treatments, and unfortunately, once a dog has had bladder stones, there’s a good chance they could come back, especially if no preventive measures are in place. Diet can play a big role in the treatment and prevention of bladder stones. Here’s what you need to know about feeding a dog with bladder stones. Can You Use Food to Treat Dogs With Bladder Stones? Some bladder stones can be dissolved using a special prescription food or medicine. When you create the right conditions in the urine, the stones gradually dissolve. Other bladder stones have to be physically removed, either through surgery or techniques like lithotripsy (using sound waves or a laser to break stones into small pieces) or urohydropropulsion (placing a special catheter into the bladder to flush out small stones). Your veterinarian can recommend the best treatment for your dog’s bladder stones based on: The type (or types) of stones Their quantity and size Your dog’s overall condition Treatment Plans Based on Type of Bladder Stone Let’s take a look at the options for getting rid of different bladder stones. Struvite Struvite stones (also called magnesium ammonium phosphate) are quite common in dogs and can usually be dissolved with food or medicine. Antibiotics are also necessary, because struvite stones in dogs are almost always associated with bacterial infections in the bladder. Dissolving stones takes anywhere from a few weeks to several months, depending on their size and other factors. Surgery and other methods of physical removal can be considered if necessary. Diets used to dissolve struvite stones have the following characteristics: Reduced levels of protein, magnesium, and phosphorus Increased levels of salt Creates acidic urine (urine with a lower pH than normal) Good options include: Royal Canin Veterinary Diet Adult Urinary SO Hill&#039;s Prescription Diet s/d or c/d Multicare Purina Pro Plan Veterinary Diets UR Urinary Ox/St Calcium oxalate Calcium oxalate is another common type of bladder stone in dogs. Unfortunately, there is no way to dissolve calcium oxalate stones, so they have to be removed via surgery, lithotripsy, or urohydropropulsion. Cystine Cystine stones are not as common in dogs as struvite and calcium oxalate stones. They can usually be dissolved with the right kind of food. Appropriate diets have the following characteristics: Reduced levels of protein Low sodium Low levels of the amino acids cystine and methionine, which the body converts to cystine Create alkaline urine (urine with a higher pH than normal) Veterinarians usually prescribe these diets to dissolve cystine stones: Hill’s Prescription Diet u/d Royal Canin Veterinary Diet Urinary UC Purine Purine stones can be made of urate or xanthine. Urate stones can be dissolved with food. This is also true for some, but not all, xanthine stones. If food and medicine fail to dissolve the stone, it will need to be removed. Diets used to dissolve purine stones have the following characteristics: Reduced levels of protein—specifically proteins that contain a lot of purine, like fish and organ meats Low sodium Creates alkaline urine (urine with a higher pH than normal) Good dog foods to dissolve purine stones include: Hill’s Prescription Diet u/d Royal Canin Veterinary Diet Canine Vegetarian Royal Canin Veterinary Diet Urinary UC Calcium phosphate Bladder stones made of calcium phosphate are not very common in dogs. Surgical removal of the stones is usually necessary. Silica Silica bladder stones are rare in dogs and cannot be dissolved. They must be removed by surgery, lithotripsy, or urohydropropulsion. How Special Diets Can Prevent Bladder Stones in Dogs Dogs that develop bladder stones once are at risk for getting them again, but preventive measures are available. Changing dog food is one of the most effective ways of preventing bladder stones. This is because to a large degree, a dog’s diet determines what ends up in their urine. By feeding a special food, pet parents can reduce the building blocks needed to create bladder stones. Struvite Struvite stones are a partial exception to the rule because they are almost always caused by bacterial infections. Therefore, the best way to prevent the return of struvite stones is to focus on preventing bladder infections. A long-term diet change is not always necessary, but ensuring that the urine remains dilute and slightly acidic can help. A veterinarian may recommend these foods to help prevent the return of struvite stones: Hill&#039;s Prescription Diet c/d Multicare Royal Canin Veterinary Diet Adult Urinary SO Purina Pro Plan Veterinary Diets UR Urinary Ox/St Calcium oxalate While changing a dog’s diet won’t get rid of calcium oxalate stones, therapeutic foods can help prevent their return. An appropriate nutrient profile for calcium oxalate stone prevention: Reduces calcium levels Avoids ingredients that contain a lot of oxalates Creates dilute urine Maintains urine that is slightly more alkaline than normal to discourage calcium oxalate stone formation Diets that meet these criteria include: Hill&#039;s Prescription Diet c/d Multicare Royal Canin Veterinary Diet Adult Urinary SO Purina Pro Plan Veterinary Diets UR Urinary Ox/St Hill&#039;s Prescription Diet w/d Multi-Benefit Cystine The dietary parameters used to dissolve cystine stones—low protein (especially those that contain a lot of cystine and methionine), low sodium, and promoting alkaline urine—can also be used for prevention. These are both good options: Hill’s Prescription Diet u/d Royal Canin Veterinary Diet Urinary UC Purine Diets used to dissolve purine stones can also help prevent their return. They should be low in protein; be made without ingredients high in purines (like fish and organ meats); be low in sodium; and produce alkaline urine. These are common diets for purine stones: Hill’s Prescription Diet u/d Royal Canin Veterinary Diet Canine Vegetarian Royal Canin Veterinary Diet Urinary UC Calcium phosphate No ideal diet for the prevention of calcium phosphate bladder stones has been identified, but keeping urine dilute and slightly more alkaline than normal can help. For this reason, veterinarians may recommend diets that are typically used to prevent calcium oxalate stones, such as: Hill&#039;s Prescription Diet c/d Multicare Royal Canin Veterinary Diet Adult Urinary SO Purina Pro Plan Veterinary Diets UR Urinary Ox/St Hill&#039;s Prescription Diet w/d Multi-Benefit Silica A diet that is high in animal protein and avoids plant-based ingredients that could be high in silica, like corn gluten, is commonly recommended to prevent silica stones. It’s also important to increase water consumption to dilute urine and to keep your dog’s urine pH slightly alkaline. The best diet will depend on the specific dog’s case, but Hill&#039;s Prescription Diet Derm Complete or high-quality, grain-free canned dog foods (with a little extra water added) are often good options. It’s also important to prevent dogs from eating soil or drinking water that may be high in silica, which may be associated with volcanic areas. Homemade Dog Food for Bladder Stones No discussion about what to feed dogs is complete without talking about home-cooked foods. It is difficult enough to put together a nutritionally complete and balanced, homemade dog food that is safe to feed long-term to a healthy dog. Adding bladder stones to the mix makes it even harder, since you need to achieve specific parameters in the urine. If you’re interested in feeding home-cooked food for bladder stones, work with a veterinary nutritionist who is familiar with your dog’s case. Feeding the wrong homemade dog food could make your dog’s condition worse. How Much Water Should Dogs Prone to Bladder Stones Drink? When it comes to bladder stones, keeping dogs well-hydrated (or even slightly overhydrated) is important. Dehydration makes a dog’s urine very concentrated, increasing the risk that crystals and stones will form. Conversely, bladder stones are less likely to form in very dilute urine (urine with a lot of water in it) because the substances that form them will stay dissolved. The best way to keep your dog’s urine dilute is to feed wet dog food, add a little extra water to it, and make sure your dog always has access to bowls of fresh, clean water. It is possible to add water to dry food, but you would have to add a lot, often several cups, to reach the levels found in canned food. This can make it hard for some dogs to eat enough to meet their other nutritional needs. Measuring a dog’s water intake is difficult, and their needs will vary depending on their activity level, the outside temperature, and other factors. An easier way to check if your dog is taking in enough water is to regularly monitor their urine specific gravity (USG). A dog’s USG goes up when they are dehydrated. Trying to keep your dog’s USG under 1.020 is a good goal for preventing bladder stones. Your veterinarian can recommend a refractometer to measure your dog’s USG at home, or they can run a quick and inexpensive USG check if you drop off a urine sample. Featured Image: iStock.com/ti-ja"}]