[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What To Feed a Dog With Kidney Disease", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/woman-at-home-with-her-pet-dog.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DpbcqmKU2RNsGIM_Nhmj74onI_SCrMzGiTK1zbROnfvE%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/woman-at-home-with-her-pet-dog.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DpbcqmKU2RNsGIM_Nhmj74onI_SCrMzGiTK1zbROnfvE%3D.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Adult, Senior, Nutrition, Kidney health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/what-feed-dog-kidney-disease"}, "datePublished": "March 29, 2023", "dateModified": "September 20, 2023", "description": "If you’re having trouble getting your dog with kidney disease to eat, you’re not alone. Dr. Jennifer Coates gives options for feeding your dog, what to look for in a kidney diet, whether it’s okay to feed homecooked meals, and how to transition them to the new food.", "articleBody": "Nutrition plays a big role in the management of dogs with kidney disease. Because dogs with kidney disease usually aren’t feeling well, the first step is often to merely get your dog to eat anything. Kidney disease can make dogs nauseated, and they can also develop ulcers in their mouth or stomach, which makes eating painful. A feeding tube may be necessary to get dogs with severe kidney disease the nutrition they need. Once your dog’s condition is more stable, you can turn your attention to providing more optimized nutrition. Kidney diets for dogs have to tick a lot of boxes. Here’s a guide that explains nutritional needs and what to feed a dog with kidney disease. What To Look For in a Kidney Diet for Dogs Kidney diets for dogs are significantly different from regular dog foods. However, no single kidney diet is going to be best for every dog throughout the rest of their life.  For example, a dog in the early stages of kidney disease could thrive on a kidney diet with more protein, but as their disease progresses, a diet lower in protein and phosphorus might better control their symptoms.  As a rule of thumb, good kidney diets for dogs tend to have a nutrient profile that looks like this:  Nutrient  Grams/1000 kcal  Protein  31-41  Phosphorus  0.5-0.8  Sodium  0.4-1.2  EPA and DHA  0.4-1.2    Unfortunately, it can be hard to find this information on dog food labels or on pet food manufacturers’ websites. If you are having trouble getting the numbers, your veterinarian can help you pick a good kidney diet based on your dog’s needs.  Here are several important elements to look for in kidney diets for dogs:  Taste  The most important characteristic of a kidney diet for dogs can be the hardest to achieve: It has to be delicious! That’s because the metabolic and physical changes associated with kidney disease can lessen a dog’s appetite.  To counteract this effect, kidney diets need to smell and taste great. After all, a kidney diet that isn’t eaten isn’t going to do a dog any good. Kidney diets should also be calorie- and nutrient-dense, so dogs can eat less and still get a lot of nutrition.  Hydration and Water Content  Kidney diets should also contain a lot of water. Dogs with kidney disease struggle to maintain their hydration. All dogs always need to have access to bowls of fresh clean water, but a diet that has high water content is a great way to boost a pet’s water intake when they have kidney disease.  Wet foods are almost always a better option for dogs with kidney disease than dry foods. If you are feeding your dog kibble, ask your veterinarian about adding water to the dry food or other ways you can supplement their water intake.  It&#039;s also important to keep an eye on the sodium levels in kidney diets for dogs. Too much sodium increases the chances that your dog will become dehydrated.  The Right Amount of the Right Protein  Next comes the balancing act that is protein. Dogs with kidney disease need protein, but not too much. The breakdown products of protein digestion are responsible, in large part, for making dogs with kidney disease feel “yucky.”  The goal is to feed just enough protein to meet a dog’s needs for muscle maintenance, immune function, and the other vital jobs proteins have in the body—but not to feed too much more. Extra protein will only be turned into calories that can be more safely provided by carbohydrates and fats.  Protein quality is also important. Proteins should be highly digestible and supply all the essential amino acids dogs need.  Low Phosphorus Levels  There’s a close relationship between protein intake and blood phosphorus levels. Dogs with kidney disease gradually lose the ability to excrete phosphorus in their urine, so it backs up in the bloodstream. Reducing phosphorus intake has been shown to slow the progression of kidney disease in dogs and increase their lifespan.  An important way to reduce phosphorus levels in the diets of dogs with kidney disease is to not overfeed protein and to ensure that proteins relatively low in phosphorus are included in the diet. Plant-based sources of protein tend to be lower in phosphorus than animal-based sources of protein.  Supplements  Nutritional supplements can also help dogs with kidney disease. Supplements often included in kidney diets for dogs include:  Omega-3 fatty acids: eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), which can reduce inflammation in the body—including in the kidneys—and possibly improve kidney function  Antioxidants, which neutralize free radicals that can further damage the kidneys  Fermentable fiber, which helps get rid of protein digestion waste products in poop. This allows dogs to eat more protein than they might be able to otherwise.  Prescription Kidney Diets vs. Homemade Kidney Diets for Dogs  What about homemade kidney diets for dogs? A study published in 2012 showed how hard it is to find nutritionally complete and balanced kidney diet recipes in books and online. Of the 39 recipes evaluated, none met all the National Research Council’s recommended nutrient allowances for adult dogs.  In contrast, prescription kidney diets produced by reputable dog food manufacturers undergo testing to ensure they are safe for long-term feeding and have a positive effect on a dog’s health.  How To Cook for Dogs With Kidney Disease  One big benefit of homemade kidney diets, however, is taste. If your dog simply won’t eat anything else, a homemade kidney diet is worth considering. To avoid nutrient deficiencies or excesses, make sure a veterinary nutritionist or a service like BalanceIT, which requires veterinarian approval, is involved in formulating recipes for your dog.  Common Prescription Kidney Diets for Dogs  After a dog has been diagnosed with kidney disease and their condition is stabilized, veterinarians typically recommend switching over to a prescription kidney diet. Your veterinarian may have recommended a particular food based on the details of your dog’s case. Here are three popular options:  Hill&#039;s Prescription Diet k/d Kidney Care is available in wet and dry formulations and different flavors: Purina Pro Plan Veterinary Diets NF Kidney Function is available in wet and dry formulations: Royal Canin Veterinary Diet Adult Renal Support is available in wet and dry formulations, different flavors, and for both early and more advanced kidney disease: How To Transition Your Dog to a Kidney Diet  special attention to how you make the transition. Do not change your dog’s food while they are still nauseated or feeling bad. They may associate their symptoms with their new food and refuse to eat it.  Once your dog has a good appetite, start making the switch very slowly. Give them lots of time to get used to the new flavors, textures, and ingredients. This reduces the chance of food refusal and lets your dog’s digestive system adapt.  Here is a timetable for taking two weeks to switch your dog to a new diet:  Days 1 and 2: Mix 5% of the new food in with 95% of the old food  Days 3 and 4: Mix 10% of the new food in with 90% of the old food  Days 5 and 6: Mix 20% of the new food in with 80% of the old food  Days 7 and 8: Mix 40% of the new food in with 60% of the old food  Days 9 and 10: Mix 60% of the new food in with 40% of the old food  Days 11 and 12: Mix 80% of the new food in with 20% of the old food  Days 13 and 14: Mix 90% of the new food in with 10% of the old food  Day 15: Try 100% of the new food  If at any point your dog turns their nose up at their food or develops signs of digestive upset, move back a step in the timetable and proceed more slowly.  Signs to Watch for After Starting Your Dog on a Kidney Diet  Don’t give up if you initially have trouble switching your dog to a kidney diet. Call your veterinarian if your dog won’t eat the recommended food. They can help by:  Recommending an appropriate food topper to make the food more appealing. Avoid products that are high in phosphorus and salt.  Prescribing medications to reduce nausea, stomach inflammation, ulcers, or other symptoms that may be reducing your dog’s appetite  Recommending a different prescription kidney diet or, if necessary, a suitable over-the-counter food  Referring you to a veterinary nutritionist to get recipes for homemade kidney diets  Talking to you about the benefits of a feeding tube  Many dogs with kidney disease live happily for quite a long time, particularly if they get the right kind of nutrition. One study showed that on average, dogs who were fed a kidney diet lived 13 months longer than those who ate regular dog food. That’s certainly a goal worth striving for!  Featured image: iStock.com/RichLegg "}]