[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Nausea in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/woman-hugging-dachshund-dog.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3D8jGGPI7LKypQNRMkZwc4GUG3ZKuegD86YKnc5khfPhU%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/woman-hugging-dachshund-dog.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3D8jGGPI7LKypQNRMkZwc4GUG3ZKuegD86YKnc5khfPhU%3D.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Puppy, Adult, Senior, Symptom, Digestive health, Symptom Checker, Nausea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/nausea-dogs"}, "datePublished": "March 31, 2023", "dateModified": "September 12, 2023", "description": "What can you do for a dog with nausea? Dr. Sandra Mitchell explains what causes it, when to go to the vet, and which medications are commonly prescribed for nausea in dogs.", "articleBody": "You know the look—and before you can react, you see your dog do a mad dash to the only piece of carpet in the house. Or it could be that your dog always seems to get motion sickness and nausea every time they take a car trip. If you think your dog is feeling queasy, learn why and what you can do about it. Symptoms of Nausea in Dogs Each dog may react a little differently to an upset stomach, and with time, you will learn which signs are common for your dog. Since dogs tend to get into things they shouldn’t, nausea is a pretty common thing. Here are some symptoms to watch for: Restlessness Panting Drooling Shaking/trembling Repeated swallowing or gulping air Lip licking Retching Vomiting Signs of stress or nervousness Vocalization Nausea is the sensation of an upset stomach that occurs before anything is actually vomited up. Sometimes a dog has nausea and will then vomit, but other times, the nausea may resolve without vomiting. What To Do if Your Dog Has Signs of Nausea If your dog seems to be nauseated, pick up their food and treats right away. Most dogs will not try to eat when their stomach is upset, but others continue to gobble their food and treats, which can further upset their belly. Drinking too much water can also make your dog feel worse, so although you want them to stay hydrated, consuming small amounts of water frequently is best. Only put a small amount of water in the bowl at a time, and keep refilling it. If your dog doesn’t chew on ice cubes, you can give them a few to help with hydration without overloading their stomach with water. When it comes to vomiting, less going in is better—that gives them a chance to recover and not just bring everything back up. If your pet seems nauseated and uncomfortable but has no other symptoms, it’s usually safe to monitor the situation and see if it resolves. If your dog seems to be more comfortable within a few hours and they have not vomited, the problem has probably resolved itself. However, if the signs are getting worse or your dog starts throwing up, call the veterinary hospital and ask for its next available appointment. If your dog ends up vomiting, take a look at the vomit. This can give you some clues as to why your dog had nausea in the first place. It can also help you decide what the next steps should be. For example, if you find a few milk chocolate candy wrappers in the vomit, you know exactly what they got into. If you find green material, it could be rat poison, which is potentially fatal. If your dog is very distressed, has repeated and/or severe vomiting, retches repeatedly without bringing anything up, or has vomit with any amount of blood, take your pet to the emergency clinic for evaluation. Not only could there be something serious wrong, but repeated vomiting can quickly lead to dehydration. What Causes Nausea in Dogs? Nausea is common in dogs. There are many, many reasons why dogs may be nauseated—some are minor and likely to resolve on their own, and others that can be severe and even life-threatening. Because of this, a sage rule to follow is this: If you are concerned and it seems like something is not right, it probably isn’t; see a vet right away. Acute Nausea in Dogs Acute nausea is where it starts suddenly, for a clearly defined reason, and generally also stops quickly when the cause is identified and removed. Perhaps the most common reason is dogs eating something they shouldn’t—whether from raiding the trash, litter box, or dining room table. Holidays in particular are a busy time for veterinary hospitals, as floods of nauseated, vomiting dogs pour in after well-meaning people “share” table food or give their pets extra treats. Another very common reason for nausea in dogs is if their dog food is changed suddenly—sometimes even just to a different flavor of the same brand. And probably the third most common reason dogs become nauseated is car/motion sickness. Some other reasons for nausea in dogs include intestinal parasites, viral infections (including parvovirus), bloat, foreign bodies, medication reactions, constipation, pancreatitis, organ failure (especially kidney or liver), heatstroke, inflammatory bowel disease, toxins, uterine infections, ulcers, food sensitivities, bacterial infections, and stress. Chronic Nausea in Dogs Another type of nausea is chronic nausea, where dogs frequently seem to have an upset stomach and the cause is often not clearly defined. A problem is considered to be chronic if it lasts for several weeks or longer and an identifiable reason has not been found. Interestingly, some dogs seem to become nauseated once per day, at the same time of day. Often this is late in the night or very early in the morning. Although we can’t usually find a diagnosis for these dogs, it is thought that they have developed acid reflux from going a very long time without eating. Anti-Nausea Treatment for Dogs If your dog appears nauseated and has not started vomiting, the best home therapy is to simply pick up their food and water bowls and frequently provide small amounts of water. Don’t allow your dog to graze on grass in the yard or chew on rawhides or other similar chew toys. Instead, provide a quiet, calm place for your dog to lie down and de-stress. In many instances that require a vet visit, anti-nausea medications will be prescribed. These often include maropitant citrate (Cerenia), which helps to quiet the nausea itself; metoclopramide (Reglan), which helps normalize the movement of the intestinal tract; or other drugs to help relieve inflammation in the intestinal tract. Metronidazole can be a particularly helpful medication because it is antibacterial, antiparasitic, and anti-inflammatory. Other medications may also be prescribed, depending on your dog’s situation. Nausea With Vomiting For most cases of severe or chronic vomiting, veterinarians will generally recommend testing that often includes blood work, X-rays, and urine and fecal samples. Because so many different problems can cause vomiting, this is usually just a starting point, and additional testing may be necessary. Chronic Nausea Providing a small meal right at bedtime will solve the problem for many of these pups. Other times, an antacid prescribed by your veterinarian may do the trick. But either way, take note of when your dog seems ill and what their triggers are, because this can help your veterinarian  get to the bottom of the problem. Motion Sickness Car sickness can be relieved by having your dog fast for 12–18 hours before a car trip. For dogs that become very nauseated in the car, some nausea medications—especially Cerenia—can be prescribed and given at home before the trip. This can be extremely effective in minimizing or eliminating symptoms. How To Prevent Nausea in Dogs The most effective way to prevent nausea in dogs is to know your dog and anticipate things that might cause nausea. If your dog has a weak spot for cheese and you are about to have a barbecue with cheeseburgers, it might be best for your dog to stay in the house until all of the food has been consumed. On the other hand, if car rides are a problem, not feeding your dog the night before the trip can solve the problem. Some dogs are picky eaters and want the same brand and type of food all the time, while others can handle switching foods. Knowing your dog is the key to solving these problems. And of course, there are some dogs that pick up everything and anything when they are outside. If this has become a real problem for your dog, using a basket muzzle (which still lets your dog pant, drink, and eat kibble) may be the ideal solution, as they will be unable to pick up rocks or other items that might cause an obstruction or upset stomach. There are, of course, times when things slip through the cracks and your dog ingests something they shouldn’t, or their prescribed medication causes an upset stomach. Fortunately, when identified early, these problems can usually easily be addressed with the help of your veterinarian. Featured image: iStock.com/GeorgePeters"}]