[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Your Dog&#039;s Behavior Can Change with Age", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/dogs-shutterstock_75802924.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/dogs-shutterstock_75802924.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Senior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/training/how-dog-behavior-changes-with-age"}, "datePublished": "May 30, 2013", "dateModified": "September 7, 2022", "description": "Few people want to admit that their once-beloved puppy is approaching his twilight years. Here are some changes to expect.", "articleBody": "Few people want to admit that their beloved puppy is approaching his twilight years. While it is possible for dogs to live into their 30s, like the Australian cattle dog Chilla who died at age 32, a more likely estimate of your canine’s life span ranges from almost 7 years to 13 ½. Here are some changes to expect as your dog enters his golden years. Excessive vocalizing as he ages doesn’t mean he’s becoming more conversational, but it could indicate that he’s disoriented due to cognitive dysfunction, he’s becoming deaf, or he’s in pain, perhaps from arthritis. Have him thoroughly examined to rule out any medical condition. If there’s no physical cause, try training him to be quiet upon your command and reward him generously for falling silent. A bark-control collar of the non-shock variety, like a citronella collar, may help. Drugs to calm anxiety may be in order as well. Your aging dog could be experiencing hearing or vision loss, which can impact how deeply he sleeps. Or he may need to go potty more frequently but has trouble catching it in time. Older dogs can also be triggered to overreact to noises that previously didn’t elicit a response. Try wearing him out with play during the day and especially in the evening, waking him up to take walks or chase a ball. Drugs to induce sleep or to keep your dog more alert during the day should be used only as a last resort. Dogs show they’re anxious by becoming irritable and sensitive, getting spooked by unfamiliar people and pets (sometimes with aggression), becoming less tolerant of being touched or restrained, following you around more, and wanting increased physical contact. Destruction at the points of entry and exit (windows and doors) or refusal to eat while the family is away are also common. Behavioral modification with a professional is probably your best bet to resolve this problem. If he has taken his elimination habits indoors, he is not being willfully disobedient. Inappropriate elimination has many causes, such as a decrease in mobility, a more frequent urge to eliminate, less control over his bowels or bladder, and serious organ issues or even brain tumors. Take him to the veterinarian to rule out any medical issue and, if that’s not the cause, repeat housetraining just as if he is a puppy. Rewarding good behavior along with increased potty trips outside should remind him where to “go.” Destructiveness is particularly distressing, sometimes destroying cherished household objects and other times hurting the dog himself. Some forms of destruction include pica (eating objects that are inedible, such as pencils); chewing, sucking, or licking body parts, family members, or household objects; and digging and scratching. While it is possible that your dog is being destructive due to cognitive or physical ailments, you can do your part by dog-proofing your home and substituting appropriate chewables, like rawhide. Few things are as heart wrenching as seeing a dog shuddering in terror. As your dog ages, the world can become a scary place that he has trouble navigating, due to deteriorating vision. Keep his environment consistent so he’s not tripping over moved objects, and play background music to mask noises. Rule out any medical causes with a veterinarian before considering professional help from a behaviorist or pheromone therapy expert to help calm him. These signs are repetitive, ritualized behaviors that have no apparent function or goal. Some examples are self-injuring by overlicking or overgrooming, causing “hot spots”; tail chasing or spinning; jumping and pacing; fly snapping or air biting; or staring into space and appearing to zone out. The cause can be cognitive or medical, but very often is a way he deals with anxiety or conflict. If it’s the latter, his compulsions can become deeply ingrained if he perceives that they provide comfort. Either way you should an expert (veterinarian or behaviorist) to see if therapy or medication is beneficial. With his reduced senses of hearing, vision, and smell, your dog is less able to sense people or things coming into his personal space and can become startled more easily than in his younger days. Effective treatment usually isn’t possible until the specific cause for his behavior is identified. If it’s based on fear, for instance, a head collar could potentially exacerbate the problem. Behaviorists are invaluable in solving problems with dog aggression, and their retraining is quite effective for aggressive dogs. You can also make efforts to reduce his triggers, once they’re determined. Aging dogs may wake up in the middle of the night because they need to eliminate, feel anxious about being apart from you or due to physical pain. If you find evidence of house soiling upon awakening, try taking his food and water away a couple of hours before bedtime. Consider letting him sleep with you in your bed if you suspect his trouble sleeping is due to missing you. And definitely have your veterinarian rule out any physical issues causing pain; sometimes eliminating that will return his sleep schedule to normal. Although not much research has been done on the grieving process of pets, parents with more than one dog know they can become quite attached to each other. When the dogs are adopted around the same time, many life experiences are shared well into old age. Signs of dog mourning include decreased activity and appetite, restlessness or anxiety, sleep disturbances, depression, and “searching” for his missing friend. You can help your pet through this difficult time by giving him more attention and, if you’re able, by replacing his departed companion with another pet."}]