[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/8elbhk1607", "@type": "VideoObject", "duration": "PT2M37S", "name": "5440991251001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/0df8f21427cf0eb9a5410fa2e67e4013699bdc44.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/8elbhk1607", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/9f512afe7ed8930d505e6698a37bcc67989ab52c.m3u8", "transcript": "It walks with your dog or a battle between being pulled wildly or stopping suddenly every time you smell something new. It's time to start working out how to walk politely on leash. Now, while it might seem impossible goodly skills can be learned. Teaching your dog not to pull ensures your safety while at the same time making daily walks more comfortable and enjoyable for both of you.\n\nThese three easy steps will help improve your dog's leash walking skills first reward your dog frequently politely walking is less about teaching your dog not to pull and more about teaching your dog to walk nicely beside you. The number one thing that will encourage that behavior. Plenty of treats you want to dole them out for good manners the treats you bring should be extra special Jack pup treats delicious enough to keep your dog's attention as you walk with him. Now be prepared to give a lot of treats.\n\nThis helps your dog quickly figure out what works and encourages him to keep doing it. You want to give him a treat as he walks nicely beside you. If he looks up at you or if he does anything that you like and you want him to continue. Praise him for keeping it up over time.\n\nThe space out this reinforcement. So your dog never knows when he's going to get paid. You can also turn leash walking into a game a playful puppy might need a game of follow me in order to fully focus on leash walking. So holding the leash takes several steps backwards away from your dog.\n\nThis movement is inviting and it's likely to get your dog to follow along as he gets closer say yes. And then immediately give him a treat then back away in a different direction. Once again say yes and give the reward. Repeat this pattern about eight to 12 times until your dog is actively pursuing you.\n\nWhen you move away from him then you can turn this progress into forward movement. Walk normally and then continue giving treats. And what about a practice polar harness with a front clip will give you extra control during walks. But if your dog is already in a no pull harness and he's still pulling it might be time to bring in a professional positive rewards based trainer.\n\nFinally, it's important that you never stop practicing leash manners. Every single walk, you take with your dog is an opportunity to work on your skills and you have to remember it can take time to develop the habits you want when you're out there with your dog. Focus on the training. No cell phones or distracted walking.\n\nAnd remember to reward your dog every time he looks up at you or walks politely beside you or does anything that you like. Lastly and most importantly, don't forget to celebrate any and all improvements you make with your dog with lots of praise.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/how-stop-your-dog-pulling-leash?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Stop Your Dog From Pulling on the Leash", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dogpullingleash_97127684_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dogpullingleash_97127684_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-stop-your-dog-pulling-leash"}, "datePublished": "April 6, 2015", "dateModified": "August 16, 2022", "description": "Whether your dog is big or small, here are six ways to improve your dog’s behavior on a leash. Read more.", "articleBody": "By Caitlin Ultimo We all have that friend, relative, or rival who walks their dog with expert leash-wielding skills. They aren’t being pulled down the block, tied &#039;round trees, or tangled up with the friendly neighbor dog who’s also out for an afternoon stroll. I don’t know about you, but I silently envy the person and pet that can walk side-by-side without breaking a sweat.  And I have to admit, good leash walking skills are important for more than just showing off your pet-parent talents. “From a relationship perspective,” explains Sarah Fraser, a certified professional dog trainer and co-founder of Instinct Behavior &amp; Training in New York City, “if your dog is walking nicely on a leash, it likely means that your dog is paying more attention to you, making it easier for you to provide direction and guidance as needed along your walk.”  A leash-puller can also run the risk of accidentally breaking away from your grip, which can pose multiple dangers to your pet if he or she continues to run, not to mention the danger for yourself if you end up face-first on the sidewalk. Having proper leash manners minimizes the risk that you will be pulled over in a moment of overzealous leash yanking and will make the time more about walking and less about tug-of-war.  “Teaching your dog to walk nicely on a leash allows you to take her more places and for longer walks, because it’s more comfortable and enjoyable for the both of you,” Fraser says.  Tips for Better Walking Behavior Whether your dog is big or small, here are six ways to improve your dog’s behavior on a leash:    Adjust your attitude.  First, ask yourself: “What would I like him or her to do instead?” Instead of teaching a dog to stop pulling, think of it as teaching your dog how to walk nicely beside you. Remember it’s all about the rewards.  One of the easiest and most effective ways to start teaching a dog to walk properly on a dog leash is to reward the dog for paying attention to you and for being in the desired position (next to you or close to you) when out for a walk. “As the dog learns that walking next to you is a pleasant, rewarding experience, she’ll spend less time pulling and more time walking nicely beside you,” says Fraser. Try using very special treats in the beginning, like small pieces of boiled chicken or roast beef, to really get your dog’s attention, she advises.  If you are worried about spoiling your pup&#039;s meals you can use pieces of dehydrated dog food or freeze-dried dog food from your pup&#039;s daily meals. That will help you to make sure you are not overfeeding your dog while also supplying them with tasty incentives for good behavior. Play the “follow me” game.  Hold on to your leash and take several backward steps away from your dog. The backward movement is inviting, so your dog is likely to turn and follow you. Say “yes!” as your dog approaches you, then immediately reward him or her with a treat. “The game helps your dog focus and move with you,” says Fraser. Then back away several steps in another direction. Once again, says “yes!” as your dog approaches and reward him or her with a treat. Repeat this pattern eight to 12 times, until your dog is actively pursuing you when you move away. Practice on your regular walks. Once you’ve started your stride, each time your dog looks up at you or walks next to you, says “yes!” and immediately reward him or her with a treat. Reward often.  &quot;Frequent rewards will help your dog figure out more quickly what behavior you’re looking for and make the learning process easier for her,” Fraser explains. “The trick to making this work is using very special treats at first, and keeping your rate of reinforcement high, which just means that you are marking and rewarding often—maybe every 4-5 steps at first—for any and all ‘good’ leash behavior.” Over time, you can thin out your rate of reinforcement, rewarding your dog less frequently throughout the course of the walk, Fraser adds. Consider additional assistance.  “If your dog is already a practiced puller, consider purchasing a quality front clip harness to provide extra control on walks,” Fraser recommends. But if your dog already pulls hard with a no pull dog harness, consider working with a certified, positive reinforcement-based trainer. Finally, remember that walking on a leash is a skill that takes time and practice for both the pet parent and dog, so celebrate incremental improvements and successes! Did you know walks help your pet digest food? Find out more: Top 10 Health Benefits Walking Provides Your Pet Learn more from PawCulture: Csehak Szabolcs/via Shutterstock"}]