[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Shaking?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/small-chihuahua-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/small-chihuahua-dog.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior, Symptom Checker, Tremors/Shaking", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-shake-their-fur"}, "datePublished": "July 31, 2020", "dateModified": "September 12, 2023", "description": "Why is my dog shaking? Veterinary behaviorist Wailani Sung, MS, PhD, DVM, DACVB, explains the many reasons why dogs shake and when to call your veterinarian.", "articleBody": "If you’ve seen your dog experience tremors throughout their body, you might be wondering, why is my dog shaking? When we talk about shaking in dogs, we don’t mean the whole-body shake that you see when a dog shakes their body to dry off after they’ve had a bath or been in water. We’re also not talking about dogs that shake their head and scratch their ears when they have an itch or an ear infection. In this article, shaking refers to tremors through the entire body. There are several different causes of this type of shaking in dogs, ranging from medical issues to behavioral responses. Here’s some important information about why dogs shake, which dog­ breeds might be predisposed­­­ to shaking, and when it’s considered to be an emergency. Why Do Dogs Shake? We separate the shaking in dogs into two broad categories: Medical or Physical: Shaking as a clinical sign that’s associated with a medical or physical condition Behavioral: Shaking as a physiological response that dogs may exhibit when they are emotional Physical Conditions That Cause Shaking in Dogs Various physical conditions can cause a dog to shake or tremble. Dogs shiver sometimes when they are cold. The body tremors help with thermoregulation. Dogs can also shake when they are experiencing pain. The pain dogs feel can be caused by trauma, inflammation, or infection. Dogs do not always vocalize when they are experiencing pain; they may simply endure it, and the only visible sign might be the body tremors. Neurological Diseases That Cause Dogs to Shake There are several neurological conditions that cause shaking in dogs. Dogs with a seizure-related disorder can experience mild body tremors to whole-body convulsions. Seizures can occur in any breed of dogs. Certain neurological disorders are congenital (present at birth), such as cerebellar hypoplasia, shaker syndrome, and shaking puppy syndrome. Cerebellar Hypoplasia Cerebellar hypoplasia is caused by the incomplete development of the cerebellum (the part of the brain that is responsible for the coordination and regulation of voluntary muscular movement). This condition is usually seen in puppies when they first start to stand and walk. The clinical signs include head bobbing, falling over, and tremors in their limbs. There is a hereditary component noted in certain breeds such as Chow Chows, Airedale Terriers, Boston Terriers, and Bull Terriers. Shaker Syndrome Shaker syndrome, also known as generalized tremor syndrome (GTS), often occurs in dogs with white fur, such as Maltese and West Highland White Terriers. This condition has also been diagnosed in other dogs with different coat colors. Shaker syndrome causes the whole body to shake, and it is associated with inflammation of the central nervous system. It is typically noted in young to middle aged dogs. Shaking Puppy Syndrome Shaking puppy syndrome, also known as hypomyelination, typically occurs in puppies, even as early as 2 weeks of age. The signs include body tremors, issues with balance and coordination, and having trouble walking. In this condition, not enough myelin is produced, which is the protective sheath that covers the nerves. Breeds affected by this disease include male Welsh Springer Spaniels, male Samoyeds, Chow Chows, Weimaraners, Bernese Mountain Dogs, Dalmatians, Golden Retrievers, and lurchers. Only the male Samoyed and Springer spaniel puppies are affected by this condition. The female puppies of these two breeds do not experience the physical signs of this condition. Medication/Toxin-Induced Shaking The ingestion of certain substances, such as marijuana or chocolate, can lead to dogs shaking, in addition to a variety of other clinical signs. Some dogs are sensitive to certain flea and tick medications, and they may experience body tremors and seizures when these medications are used. Some dogs may shake when they are recovering from anesthesia after a dental or surgical procedure. Other dogs may experience shaking when placed on psychotropic medications. Diseases That Cause Shaking in Dogs The following medical conditions can also produce shaking/tremors: Hypoadrenocorticism (Addison’s disease) is an endocrine disorder that can cause lethargy, vomiting, and shaking in dogs. Dogs with hypocalcemia, which is low calcium concentration, can experience muscle trembling and seizures. Dogs with hypoglycemia, which is low blood sugar, can experience muscle twitching and seizures. Dogs with distemper, an infectious viral disease, may exhibit muscle tremors as one of the clinical signs of the disease. Behavioral Causes for Shaking in Dogs Dogs that are fearful, anxious, or stressed can all exhibit shaking. This is a physiological response to a real or perceived threat. Fear is a crucial response that aids in survival. It is part of the fight or flight response. Anxiety occurs when the dog anticipates that a threat or danger may occur. Stress is a demand or challenge to a dog’s body that creates an imbalance. Dogs experiencing high levels of stress can also exhibit shaking. When a threatening trigger occurs, information is sent to the amygdala, which is the part of the brain that processes emotions. The fear response sends a cascade of reactions through the brain and body. Cortisol and adrenaline are released, which aid a dog’s body in fight or flight. They cause increased respiratory and heart rate, dilation of the pupils, relaxation of the bladder, constriction of many blood vessels, slowed digestion, and shaking. Dogs can also shake due to excitement, an indication of mental arousal. The mental arousal can be either a positive or negative emotional response. Should You Call Your Veterinarian Immediately if Your Dog Is Shaking? Try to identify the possible cause for the shaking. Did your puppy or dog recently eat something? Was the shaking triggered by a loud noise outside your house? Did you recently give your dog medication? If you have any doubts, contact your veterinarian. When your puppy or adult dog starts to shake, make sure that they are kept in a warm location and that they are not cold to the touch. A young puppy that does not feel cold and is persistently shaking should be examined by your veterinarian. Are there other symptoms, such as vomiting, diarrhea, etc.? If your adult dog exhibits shaking along with other physical signs, like lethargy, vomiting, discharge from the eyes or nose, or leaking urine, they should be examined by your veterinarian. If your dog only shakes when they hear a loud noise, such as thunder or fireworks, or when the bus goes by on his walk, you should seek a consultation with a veterinary behaviorist (a Diplomate of the American College of Veterinary Behaviorists or DACVB) or certified applied animal behaviorist (CAAB). Just to be safe, rule out any medical conditions by seeing your vet, and at the appointment, ask for a referral to a veterinary or animal behaviorist. Featured Image: iStock.com/Coica"}]