[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Heal an Emotionally Traumatized Pet", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-trauma.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-trauma.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Anxiety, Mental health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-heal-emotionally-traumatized-pet"}, "datePublished": "February 6, 2018", "dateModified": "August 16, 2022", "description": "Veterinarians and behavior experts are effectively treating animals who suffer from trauma-driven fear and anxiety. Learn the signs of emotional trauma in cats and dogs and how to help them.", "articleBody": "By Paula Fitzsimmons People who’ve lived through traumatic events may experience symptoms consistent with depression and anxiety years later. Thankfully, treatments are available to help them heal. But what exists for companion animals who’ve been traumatized? Cats and dogs are sentient beings, after all, and can be impacted by bad domestic situations, abusive environments, and neglect. Research on emotional trauma in companion animals is lacking, in large part because of the language barrier. “The animal can’t tell us what happened to him earlier in life, and whether his fears now come from a traumatic experience or something else,” says Dr. Frank McMillan, a research veterinarian and director of well-being studies at Best Friends Animal Society in Kanab, Utah. Help is available, however. Veterinarians and behavior experts are effectively treating animals who suffer from trauma-driven fear and anxiety. Signs of Emotional Trauma in Cats and Dogs Like humans, traumatized cats and dogs can develop fear and anxiety disorders, says Dr. Kelly Ballantyne, a board-certified veterinary behaviorist at the College of Veterinary Medicine at the University of Illinois, Chicago. “Dogs and cats may attempt to escape or flee situations where frightened, they may become aggressive when interacted with or if forced out of a hiding spot, may freeze or show avoidance behaviors such as hiding or becoming still, and fidget by pacing, jumping up, or repeatedly pawing at their owners.” Trauma can also manifest as “shaking, hiding, urination and/or defecation when the trigger attempts to interact, howling, pacing, excessive vocalization, and panting,” says Pia Silvani, director of behavioral rehabilitation at the ASPCA’s Behavioral Rehabilitation Center. If you are wondering if your pet need to go to counseling to explore past issues, the answer is no. Dr. Sarah Wooten, a veterinarian based in Colorado, says the type of trauma experienced isn’t as critical as what the pet learns from the experience. These behaviors don’t always result from emotional trauma, however, says Dr. Liz Stelow, chief of service of Clinical Animal Behavior Service at the Veterinary Medical Teaching Hospital at University of California, Davis. “While most owners of a fearful rescued animal assume it’s been abused, relatively few pets actually are,” Stelow says. “The reality is that many pets with perfectly adequate, loving backgrounds develop fears, anxieties, and phobias based on lack of socialization to a given stimulus as a juvenile.” Genetics can also contribute. New evidence suggests that behavior consistent with trauma may be inherited through DNA, says Dr. Terri Bright, director of behavior services at MSPCA-Angell in Boston. “Any animal is the sum total of its breeding and upbringing, so a dog or cat whose parents were fearful or who were mistreated or injured may pass along fearful tendencies to its offspring.” Treating Emotional Trauma in Pets Emotional trauma in companion animals hasn’t been widely studied, according to our experts. “For now, we use techniques designed to help the animals overcome their specific emotional problems—whether fear, anxiety, or depression—without knowledge as to whether that emotional condition is the result of trauma or from other causes,” says McMillan, whose research focus is the mental health and emotional well-being of animals who have endured psychological trauma. Treatment generally centers on desensitization and counter-conditioning. Desensitization is the process of exposing the animal in a safe, non-threatening environment to a low level of the feared stimulus. “Exposure increases very gradually over time,” McMillan explains. “Through this process, the animal learns that the presence of the stimulus is not followed by any unpleasant consequences, thus ‘desensitizing’ the animal to the stimulus.” Behaviorists often pair desensitization with counter-conditioning, a process that changes the meaning of something bad to something positive. “This is the same method as when dentists hand out stickers or small toys to the child after a visit,” he says. “The goal of counter-conditioning is that, over time, the feared stimulus will not just be accepted—that’s the goal of desensitization—but actually desired.” “Harry Potter can help us understand desensitization,” Wooten adds. “Remember the scene where the students banished the boggart with the ‘Ridiculous!’ spell? That is turning something bad into something funny.” In dogs, desensitization is usually accomplished with something that the dog likes, such as treats, praise, or play. Sometimes the fear can be so intense, pets need a little pharmaceutical help to get started with their retraining. Depending on the situation and intensity of symptoms, a vet may prescribe drugs to complement behavioral work, reduce fear, and improve quality of life, McMillan says. (Some of the same drugs, including anti-depressants prescribed for humans, are also given to cats and dogs for anxiety.) Effectiveness of Treatment “Treatments can be very effective, as we have seen at the ASPCA Behavioral Rehabilitation Center,” says Silvani, a certified professional dog trainer. Most dogs enter the program with extreme fear stemming from lack of proper socialization or having lived in deplorable environments, she says. “Time and patience is the key.” Desensitization and counter-conditioning is an effective treatment for fear and anxiety-related disorders, Ballantyne says. A strong caveat is attached, however. “When this technique is used incorrectly, it can cause worsening of the animal&#039;s fears. This exercise should only be done under the supervision of a veterinary behaviorist or certified applied animal behaviorist.” Also understand that first attempts at treatment are not always successful. “The important part of these treatments is to adjust as necessary until they are effective,” says Stelow, who is a board-certified veterinary behaviorist. “It’s not easy to get the right medication or combination of medications the first time. And sometimes desensitization and counter-conditioning can be rushed to the point that it is ineffective. But adjustment of the plan can lead to great success.” And because we’re working with biological beings, treatment doesn’t always deliver perfect results. “In most cases, emotional difficulties can be overcome, but in some cases, the psychological and physiological changes are so severe, that an animal may only respond partially to treatment,” says McMillan, who is board-certified in small animal internal medicine and animal welfare. Living with a Traumatized Cat or Dog A traumatized animal has a higher likelihood of becoming re-traumatized if she re-encounters major stressors, McMillan says. So understanding your companion’s triggers is beneficial in helping prevent episodes. “This does not mean the pet should be forced to live an ultra-protected life, but that major foreseeable stresses should be avoided as best as possible,” he says. “For example, a person with a dog that is anxious when left alone might avoid putting the dog in a kennel when she goes away on vacation, instead having a friend care for the dog.” The most important factor to understand, Stelow says, is that exposure to a trigger without careful planning will make things worse. “This is referred to as ‘sensitization’ rather than ‘desensitization.’ Although it’s the American Way, the pet is not going to ‘get over it’ with increased exposure.” Another common misperception is that showering an animal with love is sufficient, Silvani says. “‘She just needs to be loved’ is a common statement we hear. Many dogs who exhibit extreme fear of people are not interested in interacting with them, so it&#039;s not as simple as giving the pet love and attention.”   Never use techniques that frighten an animal, says Bright, who is a board-certified behavior analyst (and a certified applied animal behaviorist. “This includes shake cans, spray bottles, prong collars, or anything that shocks the animal. That can both damage a new bond with the owner and make the animal aggressive.” Set Up a Safe Space All animals can benefit from a safe space, Stelow says, adding that the animal should choose the location. “If he likes hiding in your closet, don’t create the safe space in the living room. Also, no one ‘messes with’ the pet when he’s in the safe space. If he needs medications, to go for a walk, or other intervention, he should be asked to come out voluntarily, perhaps for a treat.” Cats prefer spaces that are higher up, Ballantyne says. “It&#039;s helpful if this hiding spot is comfortable, easily accessible to the cat, and provides the cat with the ability to hide his or her head.” Dogs, on the other hand, may naturally seek enclosed areas like closets or a dog crate, Ballantyne says. “It&#039;s important that the safe place is a place the dog chooses to go to on its own and the dog should never be forced to be confined.” While we can’t get into an animal’s psyche to determine the root of the angst, treatment offers hope. There is still room for growth, however. “Our best treatments have yet to be developed,” McMillan says."}]