[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is My Dog Mad at Me?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-mad.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-dog-mad.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Mental health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/my-dog-mad-me"}, "datePublished": "February 6, 2018", "dateModified": "August 16, 2022", "description": "If you feel like your dog is mad at you, it’s not as easy as simply asking your pup if everything is OK. Here’s what the experts had to say about your dog’s feelings.", "articleBody": "By John Gilpatrick Imagine you’re at work and someone that you normally get along with is suddenly giving you the cold shoulder. In a matter of minutes, you start to hit the panic button. Did you do something to make your coworker upset? As difficult as it is to interpret your friend’s emotions and their underlying causes, it’s even more difficult to do the same with your dog. And if you feel like your dog is angry with you, it’s not as easy as simply asking your pup if everything is OK. So, is your dog mad at you? Here’s what the experts had to say about your dog’s feelings: Do Dogs Feel Emotions? “That’s not even on the table in terms of debate,” says Linda Case, owner of AutumnGold Consulting and Dog Training Center in Illinois and author of The Science Dog. “Basic emotions like joy, fear, and anxiety—dogs definitely experience them.” Nannette Morgan, a certified dog trainer and associate certified dog behavior consultant based near San Jose, says affection, suspicion, excitement, and shyness are also common emotions dogs feel. She explains that a dog’s emotional development caps around that of a two-and-a half-year-old human. Do Dogs Get Angry? They can, Morgan says, but dogs don’t have the capacity to assign a motive to an emotion, which means being angry at you (or anything) isn’t something for which there is evidence. This also means behavior that seems angry—growling, snapping, barking, etc.—is more in-the-moment than it is built-up and vengeful. It also means this behavior is just as likely to be indicative of frustration, fear, disappointment, or annoyance than it is anger as we tend to think about and experience it. But My Dog Seems Mad at Me. Am I Crazy? If you feel like your dog is mad at you, you may simply be reading into his behavior. It’s natural for humans to shift blame in certain difficult situations, says Case, especially onto themselves. “Maybe your dog isn’t getting as much exercise as he’s used to because your schedule has changed. Maybe, for a similar reason, he has some separation anxiety,” she says. “Generally speaking, it’s easier for us to say, ‘He’s mad at me for something I did,’ rather than consider that he has anxiety and doesn’t handle being alone well.” Another strong possibility is that the appearance of anger stems from a physical problem. “Dogs are less inclined to show that they’re in pain. It’s evolutionary,” Morgan says. “Your dog might not limp, but if he has a sore or strained muscle or tweaks his back, that could appear as if the dog is mad at you.” What Should I Do? Don’t waste time trying to self-diagnose a problem. If your dog appears to be exhibiting anger, depression, or any other behavior changes that are severe or last for more than a few days, it’s worth getting a professional medical opinion. “If your dog isn’t eating or is generally less physical or showing signs of malaise—that can be a sign of something as simple as an injury or arthritis, or it could be more serious,” Case says. “Anything that seems like he’s not his normal self is cause for concern and should be checked out by a veterinarian.” My Dog Is Healthy. Now What? “So much of what we see in terms of behavior changes are unfortunately couched in anxiety or fear,” Case says. That means there could very well be some trigger in your dog’s environment that’s bringing on the appearance of anger. It could be something as small as a new or loud object that spooks him, or he could be reacting to something different that you’re doing—such as playing less or traveling more. Perhaps he’s dealing with the loss of another pet or family member. Whatever the case, when you can isolate the trigger, you can start to help him acclimate to it or otherwise cope. If that’s not working, you may want to consider consulting with a professional behaviorist in your area."}]