[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/2rz12f34k8", "@type": "VideoObject", "duration": "PT1M28S", "name": "5361677878001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/25c5946a4011168bf9a46d52156c4e9b9e45f757.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/2rz12f34k8", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/4c6d40095c33c1f82586eadf92e473c89fbc0c2f.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/why-do-dogs-lick-everything?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Lick Everything?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-09/cheerful-little-girl-and-her-pet-licking-her-cheek-looking-very-happy-picture-id931297400.andresr.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-09/cheerful-little-girl-and-her-pet-licking-her-cheek-looking-very-happy-picture-id931297400.andresr.jpg"}, "author": {"@type": "Person", "name": "Stephanie Betbeze, DVM", "url": "https://www.petmd.com/author/dr-stephanie-betbeze"}, "keywords": "Dog, Behavior, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-lick-everything"}, "datePublished": "September 22, 2021", "dateModified": "August 30, 2023", "description": "Whether your dog licks everything in sight or focuses on certain things, Dr. Stephanie Betbeze explains why and what you can do.", "articleBody": "Has licking become your dog’s favorite activity? There are many reasons dogs enjoy licking you—or everything else around them. While some dogs lick things out of boredom, for other dogs, licking can be compulsive, providing a calming and soothing sensation. When licking is a self-stimulating activity, it could also be a sign of anxiousness or discomfort. Other dogs can lick to the point of causing secondary problems. Whether your dog is licking the floor after a messy meal or cleaning their best friend’s face, licking is very normal. However, you should monitor your dog’s licking behaviors because some instances can be a sign of a health or behavioral issue. Why Dogs Lick Everything Although licking can be harmless in some cases, it can also signal an issue, whether it’s heath or behavior related. Behavioral Issues If your pup doesn’t seem to favor licking just one thing, it’s likely a self-soothing behavior or a compulsive habit. This habit did not start overnight and will not go away quickly. It’s also important to realize that if your dog licks everything, they have also been using licking as a way to communicate to you. Some dogs lick habitually out of boredom. You can help prevent this type of habit from developing by providing your dog lots of stimulation and exercise throughout the day. Try playing fetch outside or going for a walk or run with your pup. Additionally, kennel-training your pup while you are away from home for brief periods can keep them from licking objects in your home that could lead to destructive behavior or ingestion of dangerous objects. If you are having other behavioral issues with your dog, seek assistance from your veterinarian to help rule out potential causes. If you feel your dog’s licking has become uncontrollable, it is important to recognize it early on to avoid other problems, as it can be a sign of separation anxiety. Because such behavior can lead to destructive or harmful outcomes, you and your veterinarian can discuss options such as reaching out to professional trainers or an animal behaviorist who can thoroughly evaluate your pet. Health Issues When a dog licks everything, it can also be a sign of infection or gastrointestinal upset. Having your dog checked out by your vet can help you determine if there is an underlying health issue. If you ignore your dog’s licking behavior, it can lead to self-trauma, secondary infections, or unwanted, destructive behaviors. Always speak with your veterinarian if you think your dog is showing signs of an infection, as they may need treatment. Why Dogs Lick Specific Things If your dog likes to lick certain things, or they like licking people or other animals, here are some potential reasons behind the behavior. People Dogs instinctively lick and groom themselves. Just as mother dogs will lick and clean their pups, some dogs feel the need to lick their favorite person in the world. Whether it’s a sign of respect or love for you or the left-behind crumbs from your lunch, your dog finds comfort in licking you. Your dog may also discover that your skin tastes salty from your sweat after a gym session, so they will want to lick it. They also know that licking you will get your attention, so many dogs will lick you to distract you from whatever else you are focused on so you can pet them. Sometimes it can be difficult to pinpoint the exact cause of licking, so it’s good to check with your veterinarian to rule out other issues. Air Your dog licking at the air does not always come after smelling freshly baked cookies. Dogs can start to lick their lips in anticipation of a meal or a treat. Excessive licking at the air, however, can be the result of a neurologic or compulsive disorder. If your pet has not been evaluated recently by your veterinarian, take them for a physical exam. Your veterinarian will be able to rule out any neurologic diseases as well as dental pain or dental disease, as licking the air can be a sign of discomfort. Couches/Furniture Although it may seem gross, sweat from you or food from a late-night snack can be left behind in the furniture, leaving a wonderful treat your dog can find and enjoy later. Dogs will also lick furniture to explore their surroundings and survey the area for any new activity. Keeping your furniture clear of crumbs and cleaning the surfaces can help prevent your furniture from being soaked in saliva. If your dog’s furniture licking appears to be a continuous, compulsive activity, try offering fun and tasty toys or interactive games to keep your dog busy and so they can’t destroy your couch or other furniture. Daily exercise can also burn excess energy that pets may have at the end of the day. Flooring or Carpet Dogs may lick the floor or carpet to clean up a mess, but it can lead to destructive behavior where your dog is eating or destroying things. Licking the floor can also become a compulsive habit. Keep your dog entertained and stimulated throughout the day to ensure they do not resort to licking and possibly chewing the floor. Offer lots of playtime and chew toys as alternatives if your dog is fascinated by carpet. Keep the floor clean and clear of foods or objects, which could be toxic to your dog or result in an obstruction. Have your veterinarian examine your dog regularly to rule out diseases as well. Their Toys Does your dog suddenly seem fascinated with licking their toys? Although some toys have a tasty covering, some dogs will lick their toys for a soothing sensation, especially after they are reunited with a favorite toy. Finding comfort in familiar toys and surroundings can bring dogs a sense of calmness. Therefore, licking their toys in moderation is typically not a sign of any deeper issue. Each Other (Other Dogs&#039; Ears, Eyes, Mouths, etc.) Some dogs will lick their furry best friend for various reasons, including: Comfort/communication with their companion Exploring Sign of infection (e.g., ear infection, conjunctivitis, gingivitis) Dogs licking other dogs can be sweet and cute. However, it should be avoided in excess, as it can also lead to other problems. By introducing bacteria from one dog to another, it can lead to new infections. It is best to not let the licking be in excess, as it can lead to further irritation of infections. Their Own Paws/Tails/Backs/Legs/Lips/Groin Area Does your furry friend spend the day licking their feet, or an immense amount of time taking care of self-hygiene? Dog will lick themselves for grooming needs, but it can also be a sign of allergies or other skin conditions, especially if the area is reddened, missing hair, or appears abnormal in any way. If you notice these signs, reach out to your veterinarian, as they could be signs of dermatitis or skin inflammation. The most common skin infections are caused by an allergen in the environment, which leads to further skin infections that require treatment. Your vet will prescribe oral medications if needed or may recommend placing an e-collar or “cone of shame” on your dog to avoid further irritation to infected or itchy areas. If your dog is consistently licking an area but you do not see any irritated skin, it is still best to check with your veterinarian, as it could be a sign of joint pain or arthritis. Featured Image: iStock.com/andresr"}]