[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Jumping, Chewing, Playbiting, and Other Destructive Behavior Problems in Puppies, Young Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Behavioral", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/pediatric-behavior-problems-puppies.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/pediatric-behavior-problems-puppies.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/behavioral/c_dg_pediatric_behavior_problems"}, "datePublished": "May 29, 2010", "dateModified": "August 16, 2022", "description": "Undesirable behavior exhibited by dogs between puppyhood and adolescence, such as destructive chewing, jumping on people, and play biting, is medically referred to as pediatric behavior problems.", "articleBody": "Pediatric Behavior Problems in Dogs Undesirable behavior exhibited by dogs between puppyhood and adolescence, such as destructive chewing, jumping on people, and play biting, is medically referred to as pediatric behavior problems. Though these behaviors may be perceived as a “normal” trait of a puppy, it is often not acceptable behavior for a pet. It is important to address this as early as possible with behavioral modification therapies while the puppy is still impressionable. Genetics do play an important role and behavior of young pups is likely to be similar to those of their parents. Certain breeds inherit certain problems like unruly, activity problems in working breeds of dog. However, such behavioral problems have been found to be more common in urban areas where opportunities for exercise and play are limited. Symptoms and Types Destructive Chewing Initially, the pup may chew and damage furniture and/or other household items in the presence of family member, but after being caught and punished, he may continue be destructive when no family member is around. Playbiting Play fighting may be started by a family member initially, but can further escalate or become spontaneous afterward. This is a problem because the deciduous teeth of puppies are still sharp and can cause injury if it bites the hands, legs, and/or clothing of family members. Growling and barking may also develop, but usually differ from the acts associated with fear or justified aggression. Jumping on People Jumping on people and placing paws on visitors and/or family members typically occurs during greetings and when she is excited, but may occur when the pup wants attention or something in the person&#039;s hand. Getting on Counters/Furniture The pup may get on the counters or furniture to grab an object to chew or eat. He or she may also jump on furniture during play, to get attention, or to rest. Causes While many behavior problems in puppies are species-typical, there are some causes that can worsen behavioral issues -- many of which are related to inadequate supervision, control, training, exercise, and/or the pup’s general environment. Specific factors that may lead to the categories listed above include: Destructive chewing Poor nutrition or inadequate food provisionsPresence of mice or other small mammals in the walls or flooringSpilled food on carpet or furnitureInsufficient or uninteresting toysEscape behaviorPlay biting Teasing and rough play (i.e., encouraging pup to bite)Long confinement periods, especially in small enclosuresExcited greetings by visitors or family membersGetting on Counters/Furniture Insufficient or uninteresting toysDesired foods or objects left on furnitureUncomfortable floor surfaces or inadequate sleeping areasDiagnosis   You will need to give the veterinarian a thorough history of your dog’s health, including the onset and nature of the symptoms. The questions will particularly focus on the pup&#039;s environment, new additions to the family (including other animals), and other related topics. Laboratory tests, meanwhile, are often not conducted unless a concurrent disease or condition is present.  Treatment   Your veterinarian will discuss the various behavior modifications techniques like rewards and punishment. It is, however, never advisable to strike the pet, shake it by the scruff, thump its nose, role it on its back or squeeze its lips against its teeth to stop mouthing or biting. Such approaches are detrimental to existing behavioral problems and may aggravate the condition due to fear and aggression. Vigorous exercise can also be extremely helpful for pups with these types of behavioral problems. Involving these puppies in healthy games like fetch/drop, for example, lets the pup know that the human is in control. Certain medications may also be used especially in cases not responding well to behavioral therapy. Other tips your veterinarian may recommend include: To Discourage Destructive Chewing Experiment with various toys and look for those that interests your pet, especially those than have compartments for foodKeep forbidden objects out of reachClose doors to deny access to forbidden areasInterrupt any unacceptable chewing with a sharp “no”Playbiting Provide plenty of exercise and activityUse toys to distract the pet during the act of playbitingLeash and halter can be used to provide minimal restraintAvoid games that encourage playbiting behaviorPut your puppy in puppy classes as early as possibleTake control of resources and train your pup to sit before receiving toys, food, attention, and foodIgnore any pushy social behavior like barking, whining, or pawing for attentionJumping on People Teach the pet to sit on commandAvoid games and play that may encourage it to jump on peopleGain your dog&#039;s attention with a loud, sharp noise when it does jumpHead halter can also be used to provide minimal restraintGetting on Counters/Furniture Keep your counters and furniture free of any food or other objects that might get attention of the pupMove dog to a confined area when it does misbehaveProvide interesting toys for mental stimulation, and a comfortable living spaceLiving and Management It is important you follow-up with your veterinarian to ascertain the effectiveness of the behavioral therapy program. Prognosis in most cases is good; in addition, the frequency and intensity of such behaviors typically decrease with age.  If the dog is still misbehaving after several weeks, your veterinarian may recommend a trained behavioral therapist for a more intense training program."}]