[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Reasons Your Dog Won’t Stop Barking", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-wont-stop-barking.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-wont-stop-barking.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Vocalizing, Symptom Checker, Excessive Vocalization", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/5-reasons-your-dog-wont-stop-barking"}, "datePublished": "September 29, 2017", "dateModified": "September 22, 2023", "description": "Learn about the five commons reasons why your dog won’t stop barking, the meaning behind different types of barks, and how best to react and train your dog not to bark.", "articleBody": "There are hundreds of thousands of words in the English language, but imagine for a second that the only thing you could say (or hear) is “banana.” Whether you’re happy or sad, need food or a hug, or want to express a desire to go for a walk or take a bath, the only thing that anyone hears is “banana.” (Imagine that this entire article about why your dog won’t stop barking reads “banana banana banana.”) That’s what it’s like for dogs trying to communicate with their owners, and that’s why it’s important for owners to always pay attention to context and tone when their dogs bark and bark and bark. “Barking is driven by a whole bunch of things,” says Dr. Kristina Spaulding, a certified applied animal behaviorist from upstate New York, “and while some dogs don’t bark much, they’ll sometimes find other ways to show their emotions or signal that they want something—like pawing at you, jumping, mouthing, stealing things, or finding other ways to get into trouble.” Continue reading for five commons reasons why your dog won’t stop barking, the meaning behind different types of barks, and how best to react. They Want Something Demand barking, Spaulding says, occurs when a dog wants attention of some kind. Maybe that’s a walk or just to be pet. It could also signify that your dog wants food. Unlike other types of barking, demand barking has a specific and identifiable cadence to it, Spaulding says. “Demand barking tends to be shorter—a single bark or a few in quick succession. There are more pauses in between, and the dog is usually looking at you or the thing they want. It’s much more controlled,” she says. The million dollar question with this type of barking is whether you should respond to it. “I tend to ignore it or actively get up and walk away if a dog demand barks at me,” Spaulding says. That’s because caving and giving dogs what they want can reinforce the behavior and encourage them to demand bark more in the future. If you decide you want to give in, however, Spaulding says it’s best to do that after the first or second bark, if you can, because waiting teaches dogs they have to bark a lot to get what they want, and they may become very pushy in the future. They’re Alarmed Most dog owners have likely experienced this when the doorbell rings and their dog just freaks out. “Alarm barking is associated with something catching the dog’s attention,” says Sandra Sawchuk, a primary care clinical instructor at the University of Wisconsin School of Veterinary Medicine. If you want this type of barking to stop, Sawchuk says the most important thing is to not yell at the dog. That just tends to rile him up even more. Instead, divert the dog’s attention as quickly as possible by taking him outside or giving him a favorite toy—something he can chew on will work especially well to get him to stop barking. Sawchuk also recommends considering training your dog to go to a spot away from the door whenever the bell rings. This might be something you can do yourself, or you may have to hire a certified professional in your area to assist you. They’re Anxious The emotion behind this is similar to alarm barking, but the context can be very different. Sawchuk says anxious barking may occur when you’re leaving the house for the day. You might also see it on walks when a stranger or another dog is approaching. To that end, Spaulding says this type of barking often gets confused for aggression. “Typically, if a dog is barking in an aggressive context, it’s actually fear based,” she says. “People are often confused by that because if dogs lunge and bark at the same time, that must mean they’re aggressive, but often, it seems to just be a display to keep them away from something they find scary.” They’re Excited During walks, a dog may let out an excited bark if they see another pup along the way, Spaulding says. “You’ll also see excitable barking when dogs are doing something they enjoy, like chasing a small animal or for agility dogs when they run a course.” The fine line between fearful and excited can be especially difficult when you’re dealing with on-leash reactivity, and Spaulding says leash-reactive dogs should probably be evaluated by a certified professional. In most other situations of excitable barking, however, the context is usually pretty clear. “If they’re backing away from something, they’re probably afraid,” Spaulding says. “If they’re jumping up on you when you come home from work, they’re probably excited.” They Simply Want Attention Context means so much when you’re trying to discern why your dog is barking, but Spaulding says it can sometimes be entirely unclear to you what your dog wants, assuming he wants anything at all. “Often, a dog’s bark means he’s bored or frustrated, and he wants us to fix it,” she says. “In situations where you’re not sure what the cause of the barking is, it’s fair to assume your dog would like to interact with you.” If your dog won&#039;t stop barking, you can try these training tips to help stop the behavior. "}]