[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Does My Dog Lick My Wounds?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-licking.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-licking.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-does-my-dog-lick-my-wounds"}, "datePublished": "October 27, 2021", "dateModified": "August 16, 2022", "description": "Dr. Sandra Mitchell talks about why dogs lick your wounds, whether dog saliva can heal wounds, and how to stop the behavior.", "articleBody": "It’s happened to most dog parents—you get a minor skin wound, and the next thing you know, your dog is licking the cut. Have you ever wondered why your dog licks your wounds? Is this an instinctive behavior to clean the wound or somehow soothe you after being hurt? Why Do Dogs Lick Your Wounds? Wanting to care for a wound is instinctive to most animals—and to most people, as well. It doesn’t take much training to teach a child that an open sore needs to be attended to, and in fact, many children will instinctively stick an injured hand or arm in their mouth immediately after the injury occurs. This is true for many mammals—dogs, cats, primates, and even rodents attend to their wounds by diligently licking them. So yes, most dogs do instinctively try to clean a fresh wound by licking it. Some lick more intensely than others, which can cause significant damage to the wound. Other dogs just clean the wound and move along. So although it is instinctive to most dogs to take care of a fresh cut, the degree to which they approach the task varies widely. Does Dog Saliva Heal Wounds? The belief that allowing dogs to lick wounds will help them heal is deeply rooted in human culture. It started in ancient Egypt, continued through Grecian times, and carried through to common folk culture. But is there science to support this? Yes and no! Dog saliva and human saliva contain some ingredients that can help heal wounds. Wounds in the mouth tend to heal faster than those elsewhere in the body. This was studied by Menno Oudhoff of the University of Amsterdam, who found that saliva contains proteins called histatins, which have the ability to ward off infection. Histatins can also prompt cells from the surface of the skin to help close over the wound quickly—all good things to promote healing. Another pharmacologist from the London School of Medicine and Dentistry found that the nitrite in saliva, when it comes in contact with skin, breaks down to nitric oxide, which can help protect cuts from infections. And researchers at the University of Florida discovered a protein called nerve growth factor in saliva, which also speeds healing of wounds. Perhaps even more importantly, gentle licking of wounds can help remove dirt and debris that may slow healing and cause infection. The mechanical action of the tongue loosens the foreign matter, which then sticks to the saliva and is removed from the wound. So there are plusses to licking wounds. But there are also some minuses, including infection. Does Dog Saliva Infect Wounds? Unfortunately, dog saliva can infect wounds. There are a number of bacteria present in animals’ mouths that can cause infections in people, some of which can be severe. One example is a bacteria called Pasteurella that grows well in areas without air, such as deep wounds. When this bacteria is introduced into a cut, the infection can be severe enough to require amputations, and in some cases, it has been life-threatening. Quite a few cases of severe complications have been reported, including a woman with a small burn that was licked by her dog. She ultimately lost all of her fingers and toes as well as a leg secondary to the infection that was induced. Another man developed acute kidney infection from an infection introduced into a hand wound by his dog. There is even a case of a man who developed meningitis after his dog licked his ear when he was recovering from a perforated eardrum. So while there are many good compounds that can be found in saliva that help heal wounds, there are significant potential complications to allowing your dog to clean your wounds. How to Keep Your Dog From Licking Your Wounds Typically, the best way to prevent your dog from licking your wounds is to simply care for them yourself. If you receive a minor wound, cleaning it out immediately and covering it will usually prevent your dog from being able to access it. If it is a more significant wound, medical attention should be sought. However, most dogs are less likely to attempt to lick a wound once it has been cleaned up, disinfected, and covered; the “fresh wound” smell and the blood seem to be the major attractants to many dogs. As sweet as it may seem that your four-legged family members want to help take care of you when you are hurt, it’s possible that their help can cause much more damage than good, so you shouldn’t allow them to lick your wounds. Dogs even have the potential to cause very serious damage to their own wounds—hence the “cone of shame” (e-collar) sent home with most patients after surgery. Every veterinarian has seen wounds severely traumatized and infected from a dog licking their own wounds. So the next time you get a minor wound, the best advice is to allow a qualified human to take care of it, and let your dog be moral support! Featured Image: iStock.com/retinal_experiences"}]