[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/tn4g5gxocl", "@type": "VideoObject", "duration": "PT2M44S", "name": "5595689620001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/9c3e941ada2e07863950b5e6e2ff6a08fa34df93.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/tn4g5gxocl", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/17a208a1c3fb340bde7a64cd017981cab3e75e35.m3u8", "transcript": "Dogs love to roll around in smelly things, especially poop. It's frustrating and wrote for pet parents. It's not easy to stop a dog from rolling in poop especially if you have a large yard or you allow your dog to hike off leash. But the good news is there's some steps you can take to prevent it.\n\nSo most dogs have obvious tells that signal they're getting ready to roll and poop recognizing them can help you short circuit the behavior before it happens. Most dogs will hone in on the odor before they dive in. So if you notice your dog focusing on a patch of ground with great intensity. It's possible that he's getting ready to roll.\n\nSome dogs rotate their face to the side and gradually descend into the pile in slow motion. Once you see these types of signs act quickly with a strong leave it cue which will prevent a very messy cleanup later. Now before you can use leave it to prevent a poop dive. You need to train it in a variety of controlled situations.\n\nSo to begin. Take a low value dry treat and present it to your dog at nose level in a closed fist. You need to ignore any nosing and nibbling until your dog backs away from your hand the minute he moves away. Say yes to mark the behavior and give an extra special treat from the other hand, such as a little bit of chicken or cheese.\n\nThe treat in your fist represents the item you want your dog to move away from. So never reward him with it. Once your dog reliably backs away every time you present your closed fist you can start naming the behavior by saying leave it right as he moves away. It's going to take about 20 repetitions before the phrase is anchored to the behavior and your dog understands what it actually means in this scenario.\n\nNow, to make things more challenging, you can put the dry treat on the floor and put it underneath your shoe and repeat the whole process. Once your dog is consistently backing away from the treat. Try a few repetitions where you move your foot away. Your dog can see the tree.\n\nYou're going to be rewarding that same movement away from the tree just like you did with your fist. Next, take your training outside. Set up low value toys. Use napkins socks and other interesting.\n\nBut non edible items. A few feet apart. You're going to walk with your dog towards the items and say, leave it right as your dog starts to zero in on one of them. After all of the training you've done together your dog should quickly move away from the item into you to get the reward to make training seem more real life cue and leave it.\n\nWhen your dog isn't right next to you because it's likely that your dog will be at a distance when he's getting ready to roll and poop you want to praise him when he looks up from the object of interest. Then kneel to encourage him to run to you to get that Goody dog's flying rolling in poop. Really rewarding. So preventing this behavior is a big deal.\n\nYou want to give your dog lots of love for a job well done in the future to avoid further temptation. Try to find a poop free zone for outdoor Hangouts.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/why-do-dogs-roll-poop?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Roll in Poop?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-08/dog-has-relaxation-time-lying-down-on-green-grass-at-shadow-picture-id641960574.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-08/dog-has-relaxation-time-lying-down-on-green-grass-at-shadow-picture-id641960574.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-roll-poop"}, "datePublished": "August 31, 2021", "dateModified": "August 16, 2022", "description": "Dr. Sandra Mitchell explains why dogs roll in poop and what you can do about it.", "articleBody": "It’s a common scenario—one that you’ve probably experienced before. You’re on a walk or hike with your dog. You look down, and before you know it, your dog is rolling around on something. And it happens to be poop. Your dog rolled in poop right before you were ready to pop in the car for a long ride home. (This is actually what happened to me and my dog Burgundy after an overnight backpacking hike.) This is probably not the first time your dog has rolled in something smelly, either. So why do dogs roll in poop, and how can we stop it? Is It Normal For Dogs to Roll in Feces? In many ways, rolling in poop is, indeed, just a dog thing. It is extremely common, and most dogs usually indulge in this behavior at the most inconvenient times—right after a bath, just before company is coming, or as you’re on your way out the door. It is not only common, but also normal. Even wild dogs such as wolves and foxes roll in fecal matter of other animals. Reasons Why Dogs Roll in Poop Here are three common reasons your dog rolls in poop. They like the smell. This one might be hard to accept, but it does seem that dogs might actually just like the smell of other animal’s fecal matter. Think of it like humans putting on perfume—for some folks, the stronger the scent, the better. Dogs seem to be no different in this regard. Many dogs will spend plenty of time when out for a walk just looking for the most disgusting thing possible to roll in. Other dogs, like my dog Toupe, may relish rolling in anything dead. Something as simple as a roadkill earthworm might induce your dog to roll. There is no accounting for taste when it comes to dogs rolling in things. They are covering up their own natural scent. Many people feel that, as predators, wild dogs have an advantage when hunting if they don’t smell like a coyote, for example. Hiding their identity in this respect might give them a tactical advantage. Although this may be the case, some studies have shown that wild animals, when given the choice, will roll in things that are innately foreign to them, such as perfume and motor oil. Covering yourself in these strong scents doesn’t seem like a really good strategy for hiding from your prey. They’re telling the story of where they’ve been. Think of this like bringing postcards home from your vacation. When a dog returns to their pack, they are bringing back the smells of the places where they’ve spent time. This allows the other members of the pack to follow the trail back to the source and to any food that was found nearby. So in a way, rolling in feces is a form of communication amongst a pack—sort of the dog version of a social media post. How Can You Stop a Dog From Rolling In Poop? For many pet parents, this may be the million dollar question. They aren’t as interested in why the dogs do it, but more so in how to stop it. Unfortunately, this can be an extremely difficult lesson to teach. If your dog is on-leash, it’s much easier. Simply lead your dog away from the offending area, and the opportunity never presents itself. If your dog is off-leash, however, the challenges mount. Many behaviorists recommend teaching your dog a command called “leave it” in which your dog learns to not touch the object. This training can begin in the house with an item such as a sock, which is interesting, but off-limits. You can gradually increase the value of the item up to treats, where your dog is not allowed to approach until you release the “leave it” condition by giving another cue, such as “OK,” which tells your dog they may now take the treat.   Once your dog reliably follows the “leave it” cue in the house, you can take the training (and interesting objects!) out into the yard with your dog on-leash, and with time, progress to training off-leash. I have found this cue to be useful with my own dogs in a lot of different circumstances. Once you have a way to tell your dog to not touch the offending poo, the trick becomes timing. Most dogs will tell you in one form or another that they are getting ready for the deep dive. If you watch closely, you will learn what your dog’s behaviors are, but for many animals, they start to roll with their head and progress to the whole-body roll. Often, they will have a particular posture or behavior; for example, sniffing intensely at an area, then lightly shaking their head before twisting their face to one side and rolling into the offensive pile. Right when you see your dog start the sniffing and headshaking behavior, this would be the key time to give the “leave it” cue. Some dogs are just intrepid poo rollers, and it may never be possible to have an entirely “clean record” for these dogs. But with patience, close observation, and some training, you might be able to minimize the number of unexpected baths. I can tell you that after my dog Burgundy rolled in poop on our hike, despite a dip in the stream, that was a long ride home that I will never forget!   Featured Image: iStock.com/alexei_tm"}]