[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Have Obsessive Compulsive Disorders?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/compulsive-behaviors-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/compulsive-behaviors-dogs.jpg"}, "author": {"@type": "Person", "name": "Lisa Radosta, DVM, DACVB", "url": "https://www.petmd.com/author/dr-lisa-radosta"}, "keywords": "Dog, Behavior, Mental health, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/evr_dog_behavior_compulsive_disorder"}, "datePublished": "September 5, 2012", "dateModified": "August 16, 2022", "description": "What do we know about compulsive disorders in dogs? Actually, quite a bit. Here are some important insights into this curious dog behavior.", "articleBody": "Treating Compulsive Dog Behaviors By Lisa Radosta, DVM, DACVB Can dogs have OCD? Not really, but they do get compulsive behaviors. What is the difference? Obsessive compulsive behaviors include obsessive thoughts, which don&#039;t apply to dogs since we can’t know what they are thinking. Instead, in dogs, these disorders are called compulsive disorders. Here are some other important insights into this curious dog behavior we call compulsive disorders… What are Compulsive Disorders? Compulsive disorders (obsessive compulsive disorder, OCD) occur in dogs, although not with great frequency. These behaviors are exaggerations of normal dog behaviors. They are exhibited for longer than expected periods of time, are repeated out of context, and in situations in which they would be considered abnormal. Common dog behaviors which can be classified as compulsive include spinning, tail chasing, fly biting, light chasing, barking, chewing, staring into space, sucking on a toy, or sucking on a part of the body. What Causes Compulsive Disorders in Dogs? Compulsive disorders are caused by conflict, stress and/or frustration. With each stressful event that your dog encounters, there is a release of neurotransmitters involved with the stress response. When a dog is frustrated or stressed, he may start to perform a normal behavior such as holding a toy in his mouth in order to relieve that stress. If holding the toy in his mouth actually reduces the neurotransmitters involved with the stressful event, the dog is likely to perform that behavior again when he is stressed. For some dogs, this behavior becomes ritualized and repetitive because of the intense reward that is associated —reduction of the physiologic feeling of stress or frustration. Over time, compulsive behaviors progress and get worse. Dogs often start to perform the compulsive behavior with any stressful event, not just the original inciting situation. The behavior can take over the dog’s life replacing normal sleep and feeding habits. It can cause injury to the dog as the impulse to perform the particular behavior becomes stronger and stronger. Dogs that chase their tails often end up mutilating the tail requiring amputation, while dogs that suck on themselves frequently cause skin infections.   Sometimes, what appears to be a compulsive behavior is actually an attention seeking behavior. Even behaviors which start as a frustration related behaviors can be rewarded inadvertently when owners pay attention to the dog when he performs the behavior. For example, if an owner yells No!, that is still regarded by the dog as attention and can perpetuate the behavior. If you think that your dog exhibits a behavior for your attention, try the following tests. First, videotape your dog when you are not home to see if and when the behavior occurs in your absence. Next, try walking out of the room the next time that your dog performs the behavior. If he does not perform the behavior in your absence, your attention or presence is most probably a part of the problem. Some dog breeds are predisposed hereditarily to certain compulsive behaviors. For example, Bull Terriers and German Shepherds are commonly seen for tail chasing. Labrador Retrievers exhibit oral compulsive behaviors such as pica, whereby the dog is driven to pick up any object and eat it. Doberman Pinschers are well known for flank sucking, whereby the dog holds and sucks on the skin of the flank for long periods. The best way to know if your dog is predisposed to a certain type of behavior is to speak to your veterinarian about your breed’s genetic predisposition. Then, if possible, speak to the owner of your dog’s parents to learn of their behavior. How Do You Treat Compulsive Disorders in Dogs? The first thing to do if you think that your dog has a compulsive disorder is to go to your veterinarian for help. Because medical conditions can cause signs similar to compulsive behaviors in dogs, it is extremely important to rule out medical diseases such as neurologic, endocrine, gastrointestinal, and orthopedic disorders. Your dog should receive a thorough physical examination as well as screening labwork before considering treatment for a compulsive disorder.  If your dog is completely healthy and is free of pain, he may have a compulsive disorder. Compulsive disorders are treated with medications to lower arousal and conflict as well as behavior modification to give the dog an alternate coping strategy outside of the compulsive behavior. Treatment is often prolonged and continues for the life of the dog. If your dog is diagnosed with compulsive disorder you can expect some ups and downs in treatment and in your dog’s behavior. Often chronic cases are referred to a board certified veterinary behaviorist for treatment. The best thing that you can do for your dog if you suspect a compulsive disorder or if your dog repeatedly displays any behavior, even if it seems harmless now, is to seek help from your veterinarian. When compulsive behaviors are treated early and quickly the prognosis is much better than if they have progressed to a chronic state."}]