[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Kick After Pooping?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-08/scottish-terrier-in-a-park-kick-leafs-picture-id497991614.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-08/scottish-terrier-in-a-park-kick-leafs-picture-id497991614.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/dog-behavior-why-do-dogs-kick-their-feet-after-pooping"}, "datePublished": "August 31, 2021", "dateModified": "March 1, 2023", "description": "Dr. Wailani Sung explains why dogs kick after pooping and what the research shows about why dogs engage in this weird behavior.", "articleBody": "Have you ever seen your dog kick their hind legs after they have done their business? It looks pretty funny when a dog does this, like they are wiping their hind paws. Not all dogs exhibit this behavior, and it can range in intensity. Some dogs may just kick each paw once and walk away, whereas other dogs kick and alternate legs multiple times. Some dog parents are embarrassed by the vigor of the kicking—their dogs might even kick up clods of dirt and clumps of grass. If your dog does this, you may have even been yelled at by homeowners for allowing your dog to tear up their manicured lawns. So, why do dogs kick grass and dirt after they poop? And are you supposed to do anything about it? Is It Normal For Dogs to Kick After They Poop? Kicking the hind legs after elimination is known as ground-scratching, and it is a normal dog behavior. This behavior has been seen in dogs and wild canids, such as wolves and coyotes. Many animal scientists think it’s a form of communication among dogs. Ground-scratching has been referred to as a composite signal that involves chemical and visual components of communication. The kicking motion is a visual display for other dogs and may help spread the scent of urine. Since urine odors are short-lasting, the slashes on the ground serve as longer-lasting marks to indicate the dog’s presence in the area. Scent Dispersal Some scientists believe this behavior helps with scent dispersal—not necessarily scratching just to spread the urine around, but to also leave odors from a dog’s paws. Scents can be released from a dog’s interdigital pads, or paw pads. Visual Display Other scientists think dogs are conveying visual messages to other dogs. As part of their ground-scratching, dogs typically score the ground with slashes. When no other dogs are present, the slashes tell their own story to any dog that sees them. When other dogs are around, the ground-scratching is a visual display for other dogs. One study by Bekoff (1979) of free-ranging dogs found that ground-scratching is more likely to occur when other dogs were physically present. The ground-scratching usually occurred after a dog had done a raised-leg display, with or without urination. Ground-scratching can also occur after defecation. Scientists have observed that male dogs that exhibited ground-scratching were frequently avoided by other dogs, both during the act and immediately afterward. But the presence of urine or slashes on the ground did not deter other dogs from approaching. Are Certain Dogs More Likely to Kick After Pooping or Peeing? Male or female dogs of all sizes and breeds can engage in ground-scratching. In Bekoff’s observations, about 9% of males and females exhibited this behavior. The free-ranging dogs had a higher rate of ground-scratching behavior when they had conflicts with other dogs that were not part of their pack. Another research study found that the senior dogs in a shelter were more likely to show ground-scratching behavior compared to adult and juvenile dogs (McGuire, 2016). They were also more likely to do it after defecation. Dogs that showed ground-scratching behavior after defecation also had a least one episode of ground-scratching behavior after urination. However, ground-scratching does not always occur after every instance of urinating or defecating. Sometimes it can occur after a dog has simply sniffed the ground. Reasons Dogs Kick Their Hind Feet After Pooping Now that we have some insights on dogs kicking up grass or scratching the dirt after they go the bathroom, here are the reasons why they do it. Marking Territory Researchers have found that ground-scratching occurred more often along territorial boundaries in free-ranging dogs. For dogs that belong to someone, their pet parents may notice ground-scratching is more likely to occur in their yard, in front of the house, or on grounds near their house. For urban dwellers, their dogs may be more likely to exhibit this behavior in front of the apartment building, on the block where the apartment building is located, or at a local park they frequent. Dogs may be signaling these are places they frequent to let the other dogs in the area aware of their presence. Remember that when they kick their hind paws, they are also leaving a scent from their paws in the dirt or grass. Social Display For free-ranging dogs, the ground-scratching behavior was more likely to occur during encounters with unfamiliar dogs. Within a free-ranging dog pack, higher-ranking dogs were more likely to ground-scratch. One study found that other dogs stayed away from dogs that showed ground-scratching behavior. This may be a strategy that dogs adopted to keep other dogs from approaching them. One researcher reported that this behavior was used as an “intimidation” display toward other dogs. Slashes are left in the ground as visual markers. Sometimes, these scratches may be difficult to see when urban dogs kick up their paws on the hard sidewalk. There is no need to stop your dog from kicking their feet after pooping or peeing unless they kick up a lot of dirt or grass or does it with such vigor that they are hurting their nails or paw pads.  "}]