[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Feel Embarrassed?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/embarassed%20dog%20shame%20362083202.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/embarassed%20dog%20shame%20362083202.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, Anxiety", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/can-dogs-feel-embarrassed"}, "datePublished": "February 19, 2018", "dateModified": "August 16, 2022", "description": "Is that look on your dog’s face embarrassment, shame, or something else altogether? We looked to the experts to explain the emotional undercurrents in our dogs’ brains. Read more here.", "articleBody": "By LisaBeth Weber The varied emotions of our four-legged friends are apparent, whether it’s their unconditional love, their curious nature, their sympathy when they recognize distress, or less pleasant examples, like anxiety and aggression. Dogs have even been known to behave altruistically — putting themselves in danger to help others. We’ve seen their wary reactions when they know they’ve misbehaved, and experienced their happiness each time we return home, whether it’s after 10 minutes or 10 hours. The answer to the question of whether dogs experience embarrassment may seem clear to some, but the truth of it is more elusive. The consensus among animal behaviorists is that embarrassment is most likely too complex an emotion for dogs to possess. However, in the long-term, the research into complex thought and emotions in companion animals is still in its infancy. Dogs and Emotions: Not That Simple Molly Sumridge, a certified dog behavior consultant and trainer, and founder of Kindred Companions in Frenchtown, NJ, believes more science and research is needed, but that the answer lies somewhere in the middle. “I don’t think we’re there yet, scientifically or behaviorally,” says Sumridge. “Too often, broad assumptions are made about complex emotions, when it’s really not that simple.” Sumridge feels that labeling an emotion without verification can complicate owner/dog relationships more than help them. “Trying to discern what is embarrassment versus fear, discomfort, or anxiety is extremely hard. These are complex emotions and all we can go on is a cause and effect relationship between the environment and the dog’s behavior,” Sumridge said. Dr. Terri Bright, director of behavior services in the Behavior Department at MSPCA/Angell in Boston, MA, agrees. “For a dog to feel embarrassment, they would need to possess an overall sense of social norms and morals, which they don’t have the same way humans do,” says Bright.  “Since dogs can’t tell us how they feel, we infer their emotions by watching their body language,” she continued. “Some dogs inherit and/or learn ‘appeasement’ signals, such as yawning and head-turning, which may be described by humans as being embarrassed.” The Dog Guilt Trip In assessing whether or not dogs can feel embarrassment, there seems to be a lot of crossover between shame and guilt among both experts and pet owners. With humans, shame and guilt are based on a moral compass, while embarrassment is based on a social compass. Through the lens of the animal behaviorist community, these three emotions fall into the pool of complex behaviors that are not easily defined in dogs. Ask a cross section of pet owners, however, and the response might be very different. In unofficial surveying, many owners believe their dogs definitely feel embarrassed, while others don’t believe that at all. Some see it more as a feeling of guilt in the dog, as they describe a multitude of guilt inducing scenarios, like one owner’s sad tale of their dog eating money to the tune of almost $500.00. Anthropomorphi… What? So, are dogs really showing embarrassment or is it our human interpretation that perceives it that way? A word not often heard outside of the science and behavioral fields is anthropomorphizing; that is, the act of applying human characteristics to non-humans, like putting a Halloween costume on your dog and then saying how much they love (or hate) it. The dog probably doesn’t have feelings about it one way or the other, but imagining they do is part of our human expectation. Sumridge says that “many times, when owners and experts are asked to describe embarrassment in dogs, they say, ‘you know it when you see it’. In reality that ‘knowledge’ is usually a gut feeling based on our reaction of humanistic behaviors being expressed by the dog.” You need only look to the advent of social media and “dog shaming,” where people post pictures on Tumblr, Instagram, Facebook, and other sites, of their dogs wearing signs around their necks describing their bad behavior. The dog has no idea of its shame; however, the display is simply for the benefit of the human response. “Dogs are just as complicated in their feelings and emotions as humans are,” said Sumridge. “However, we are not at the point to definitely say what our pets are feeling.” Bright reflects a similar attitude, saying that “people are invested with the idea that dogs are just like them, and they give human attributes to dogs all the time. It’s most likely that dogs described as being embarrassed by their owners are dogs that are actually a little nervous or afraid because the people around them are behaving in a way that makes them feel uncomfortable.”  “We complicate our relationships with our pets when trying to label behaviors,” Sumridge explained. “We can better understand our dogs by observing them without assumption and appreciate that they have their own way of communicating with us. If we think we are observing embarrassment, we should think about how we can better support our animals so they don’t have to experience the stress, discomfort, or anxiety that they may be feeling.”  The Science of Canine Cognition Certified dog behavior consultant Maria DeLeon from Mercer County, NJ, sees the big picture. “I don’t believe we can say either way, but I do not think dogs feel embarrassment,” she said. “We’re only now getting into canine cognition as a science and I think that is why people are hesitant to interpret an emotion such as embarrassment. There’s not a lot of research so far.” DeLeon believes that a science-based approach is the best way to understand dogs’ behavior. “Since no one can read a dog’s mind, it is essential for us to keep an open mind,” she said, adding that there is still much to be discovered in the field of canine cognition. “My hope is that as the science grows, so will our industry, because that’s the most efficient way to help dogs and their handlers,” said DeLeon. Read More Do Animals Have Emotions? Destructive Behavior in Dogs"}]