[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Adopting a Pet with a History of Abuse: What You Should Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/shepherd-mix-dog-sitting-in-front-of-shelter-volunteer.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/shepherd-mix-dog-sitting-in-front-of-shelter-volunteer.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior, Mental health, Adoption", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/adopting-pet-history-abuse-what-you-should-know"}, "datePublished": "January 26, 2018", "dateModified": "September 26, 2022", "description": "Oftentimes when we adopt pets from rescue organizations or local animal shelters, we are not able to obtain their complete history. Here are some common signs that your pet may have been abused in the past and advice on how to gain your new pet’s trust.", "articleBody": "Abused pets often end up in animal shelters after they have been surrendered by their former parent or  seized by authorities due to evidence of abuse or neglect. These pets may never have known love, security, or safety and are at the shelter through no fault of their own. It is important that people who  love animals and have the necessary resources adopt from their local shelter. When they do, they are rescuing and saving a life. What Does History of Abuse in a Pet Mean? The word “abuse” is associated with cruel, harsh, and harmful treatment. This may include physical abuse and/or mental and emotional abuse, such as frequent yelling and threatening actions. Some people may scare their pets to the point where the animal develops an exaggerated startle response such as jumping, running quickly on a slick floor without traction, or hiding under furniture. Another form of abuse is neglect, where a pet’s basic needs—such as food, water, comfortable bedding, a litterbox, or access to the outdoors for elimination—are not provided for. Neglect can also include pain or discomfort when the pet is not given needed medical care. In cases of abuse, suffering is present. But sometimes it’s difficult to know for certain that a pet has been abused if no history is known. Understanding Behavior in Pets That May Have Been Abused Pet parents may think their newly adopted pet has been abused if the pet is “head shy,” meaning they move their head away when people reach out to pet them there. However, this is often due to miscommunication between human and animal. Making direct eye contact, leaning over them, and reaching for the top of a dog or cat’s head or neck can all be perceived as challenging or threatening gestures. Most pets will instinctively avoid eye contact or lean or move away to indicate that they are deferential to the person making such a gesture.   Sometimes it’s difficult to determine if a pet has been abused or neglected, as opposed to simply being undersocialized or genetically predisposed to exhibit fearful behavior. Pets that have been abused may display a large emotional reaction to certain objects or situations. For example, a dog that has a history of being punished with a belt may cower, crawl away, hide, or urinate in place when a new pet parent picks up a belt to wear. Alternatively, the dog might react by lunging and trying to bite the belt. A cat may exhibit similar signs of avoidance and retreat or go on the offensive and attack the person holding the belt. Sometimes, abused animals dramatically overreact to the slightest change in their environment, such as the slightest hand movement or a raised tone of voice. Typical responses again include cowering, eliminating, hiding, or trying to escape the room and the pet parent’s presence. Keep in mind these are some signs to look for, but they do not prove that a pet has been abused. Other indications may include: Anxiety: This ay be demonstrated by pacing, panting, circling, spinning, shaking, excessive licking of themselves or objects, exhibiting other repetitive behaviors, or being unable to settle down. Extreme fear: This may include fear of people, other animals, leaving their home, or being touched or handled. In this case, a pet might exhibit body language such as cowering, a tucked tail, a lowered head, ears pulled back, or even vocalizing. The pet might be frozen in fear and unwilling to move. Hiding: Your pet could stay in their crate or hide under or behind furniture because they doesn’t want to do anything else. The pet may come out only to eat, drink, play, and eliminate when people have gone to bed and the household is quiet. Aggression: A pet may become aggressive whenever they are approached or reached for by people or other pets. The pet may vocalize, exhibit fearful body language, and escalate to biting with little provocation. How to Gain Your Pet&#039;s Trust There are many things adoptive pet parents can do to gain a new pet’s trust. Exactly what is needed will depend on the animal’s temperament, the degree of individual resiliency, and the amount of mental and physical trauma the pet has experienced. Several useful tips to help a new pet adapt to a new life include: Learn to read the pet’s body language and give them plenty of space and room to heal. Learn to recognize and honor when the pet does not want to be showered with attention and affectio Give the pet choices in life, as this gives them some autonomy and control. Examples include: Providing multiple toys and beds for them to choose from Teaching them that they can give consent to being petted or to interacting with people Giving them safe places to retreat to, such as a comfortable crate or a safe and quiet room. Pet gates or exercise pens can also be used to create a safe barrier for the pet between other pets or family members. These pets may also need to be fed separately, away from people or other pets. Provide a consistent routine, as predictability can greatly reduce a pet’s anxiety. This includes: Meals at set times Regular potty breaks and walks (for dogs) Daily litterbox cleaning Regular exercise and play sessions Pet parents can strengthen the bond with their new pets by providing positive experiences such as playing with toys, giving them tasty treats, or taking them outside for excursions—as long as the pet does not exhibit any fear, anxiety, or aggression in those situations.  Avoid specific movements or activities that scare the pet. For example, if a dog flinches or cowers every time someone reaches out to pet the top of her head, try reaching to pet under her chin and chest. If a cat hides every time a family member exercises inside the house, place the cat in another room with a puzzle toy to work on while the human works out. Engage in training, as this creates a common language between animals and humans. It also provides an opportunity to increase the pet’s confidence and promote positive interactions between the pet and his new family members. Treatment Options for Pets with a History of Abuse Training Training a pet creates a common language and, when done properly, provides opportunities for positive experiences and helps to cement the relationship between pet and pet parent. Pets need a basic understanding of the foundational behaviors that are important to their pet parents, such as “sit,” “down,” “stay,” and “go to bed” for a dog. Training helps the pet understand what the human is communicating to them. This understanding will help decrease the pet’s worry and anxiety and help create a more stable relationship. Keep in mind that some dogs may be difficult to house-train if they were forced to eliminate where they slept. Some dogs may develop a peculiar behavior of not eliminating while on leash or in the backyard. Behavior Modification Unfortunately, in some cases, love does not cure all. Pets with a history of severe mental and physical trauma may need a lot of emotional support and management, and their new pet parents must understand that there are likely no quick fixes. Abused pets with behavioral disorders may need a more comprehensive behavior-modification plan to address their reaction to triggers. These pets will need the assistance of a board-certified veterinary behaviorist or a certified applied animal behaviorist to develop a treatment plan to address the pet’s issues.  The treatment plan will discuss avoidance and management of the pet when triggers occur. The plan will also offer specific behavior-modification exercises to address the behavior issue. Sometimes behavioral therapy provides resolution of the behavioral disorders within a few months. Other times it is years of behavior-modification exercises, along with psychoactive medications and intense management. Behavioral therapy requires a pet parent with plenty of patience and commitment to care for the newly adopted pet. Medication Treatment In some cases, pharmaceutical treatments can be beneficial. Pets that exhibit extreme signs of fear, anxiety, stress, or aggression are candidates for receiving medication. However, medication should always be prescribed by a veterinarian or veterinary behaviorist and should be used in conjunction with a behavior modification plan. The goal of using behavioral medications is to reduce the pet’s overall level of anxiety. When the pet is calmer, they are easier to manage and may make more progress in training and with behavior-modification exercises. Medications are not intended to sedate the pet, but they should help decrease the frequency, intensity, and duration of the behavior problem. Not all pets with behavioral disorders need medication therapy. It is a choice that the pet’s veterinarian or veterinary behaviorist can discuss with you. Seek Professional Help At any point in your journey with your new pet, remember seek the help of trusted professionals when needed, whether it’s a veterinarian for your pet’s medical needs, a certified trainer for pet education, a board-certified veterinary behaviorist, or a certified applied animal behaviorist to address your pet’s mental and emotional health and well-being. This extra level of support and expertise can make all the difference in understanding your new pet and creating a meaningful relationship that serves the pet and your family for many years to come. Remember, Patience Is Key When you adopt a pet with a history of abuse, realize up front that you will need to go slow. Set up your house and lifestyle in a way you can make the pet feel safe. Seek professional help if you are seeing signs in your pet of anxiety, fear, or aggression. The challenges of adopting, living with, and working with an abused or neglected pet can bring great rewards. Many pet parents have gained a new appreciation of their relationship with their pets and have discovered how gratifying it is to save a life and earn a pet’s trust. Featured Image: iStock.com/StefaNikolic"}]