[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/hazg4mch1f", "@type": "VideoObject", "duration": "PT2M4S", "name": "5694815057001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/9b2017324b43edbae20d4cbec117ae52b9ecd565.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/hazg4mch1f", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/1971cf5b6bb1c023fab4f5f36d8c7f272a72ee63.m3u8", "transcript": "It's a fact. Most dogs bark. Now they do it for a ton of different reasons. And if you want to discourage barking you first need to figure out why it's happening.\n\nHere's some tips for putting a stop to three of the most common types of barking. Now first attention seeking barking is exactly what it sounds like your dog wants your attention and he's making noise to get it. Dogs do this when they want their meal or when they want you to throw the ball or when they want to go for a walk. The key to stopping this kind of barking is to ignore it.\n\nOr better yet try doing the opposite of what your dog wants. Walk away from the food prep area. Drop the ball drop the leash the moment your dog is quiet go back to what you were doing. Alarm barking is usually in response to an unexpected sight or sound.\n\nThese dogs are easily triggered and respond to noises like a car door slamming outside. Now when your dog starts to bark place a tasty treat inside your fist and put it right in front of his nose. He won't be able to sniff and bark at the same time. And you're going to name this silence by saying hush.\n\nThen open your fist to your dog and let him meet the treat. Repeat this process until your dog knows that hush means to orient to you quietly in order to get that Goody. You can also use a white noise machine to drown out any outdoor sounds that might trigger your dog to bark. Territorial barkers react to a perceived threat on their home turf.\n\nMany of these dogs spend time looking out the window, waiting for an interloper. An easy way to short circuit a territorial barker is to simply manage the behavior and cut off your dog's view. Close the blinds shut the door make the window inaccessible and prevent your dog from practicing is inappropriate reaction. If you want to address the problem directly work on hush.\n\nAnd teach your dog to orient to you rather than the distraction outside. Now remember every dog can benefit from more exercise, especially dogs that like to bark. And don't forget to reward your dog for the absence of barking. Now if your dog hears your neighbors slam a car door and doesn't bark tell him It's a very good boy.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/evr_dg_how-to-stop-a-dog-from-barking?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Stop a Dog From Barking", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/westie-terrier-laying-in-grass.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/westie-terrier-laying-in-grass.jpg"}, "author": {"@type": "Person", "name": "Teresa Manucy, DVM", "url": "https://www.petmd.com/author/dr-teresa-manucy"}, "keywords": "Dog, Training, Vocalizing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/evr_dg_how-to-stop-a-dog-from-barking"}, "datePublished": "June 30, 2020", "dateModified": "August 16, 2022", "description": "Veterinarian Teresa Manucy, DVM, provides her tips for how to stop a dog from barking.", "articleBody": "Barking is a common way for dogs to express their desires to their pet parents and to the world around them. But excessive dog barking can be frustrating and startling—and possibly a sign of an underlying behavioral issue. It’s important to determine the reason why your dog is barking so the behavior can be quickly corrected. So how do you stop a dog from barking? Here’s some insight on why dogs bark and tips for how to train a dog to stop barking. Why Do Dogs Bark? There are many reasons why dogs bark, including: To greet people or other pets (social barking) To protect their possessions or property (territorial barking) To show excitement To get your attention when they’re bored (aka attention seeking) To warn of danger, such as an intruder To tell you they’re hungry, thirsty, or in need of exercise To be released from confinement (example: being confined to a room when someone comes to repair something in your home) These are generally short-lived instances of barking that are specific to a certain occurrence or event. What Causes Excessive Barking? When a dog’s reasons for barking are not addressed, they often begin to bark excessively. For instance, dogs will often bark to signal when their basic needs, such as hunger, thirst, environmental temperature, and sufficient exercise are not met. If a dog that is hungry is deprived of food, for example, they may bark more frequently and excessively in response. Some dogs may be experiencing a psychological issue, such as separation anxiety, that causes them to bark excessively. These conditions require a visit to their veterinarian or a veterinary behaviorist to diagnose and treat. Medical conditions, such as hearing loss with advancing age, can also contribute to excessive dog barking. Once a medical condition is diagnosed, prescription medications and calming methods may be necessary for successful dog training. How to Stop a Dog From Barking Training is the ideal way to eliminate excessive dog barking. Here’s how to train a dog to stop barking. Use Positive Reinforcement The most successful method is positive reinforcement, which encourages the reinforced behavior. Whenever your dog is quiet and well-behaved, offer them a desired treat. Over time, your dog will learn that good things come to them when they’re not barking. Develop a Calm Verbal Cue Another dog training tip is to develop a calm verbal cue such as “Quiet, want a treat?” that will let your dog know that the barking is unacceptable. Start with training sessions where you reward your dog’s quiet behavior with this cue, followed by the treat or a favorite toy. Once your dog learns the calm verbal cue, you can use it during times of unwanted barking, such as the ring of a doorbell or the sound of other dogs barking, to prompt the quiet response (aka to stop the barking). If your dog stops barking when they hear the cue, reward them. Don’t Reward Attention-Seeking Barking If your dog keeps barking after you give the cue, another verbal cue such as “too bad” or “oh well” can be given before you remove your attention briefly by going to a separate room. The duration of time should only be a few minutes, or until they stop barking. This will gradually improve with practice. This technique is designed to remove the attention your dog may be seeking by barking. If your dog remains quiet when you return, reward your dog with a treat. If your dog does not respond to these training methods, consult with a veterinary behaviorist or specialized dog trainer. Never Punish Your Dog You should never use punishment for dog barking. Examples of punishment would be yelling, throwing objects, or trying to interrupt the barking by spraying water at your dog, making loud noises, or using citronella-spraying collars or shock collars. A dog’s responses to pain or fear caused by punishment will only give short-term results, may cause aggression and phobias, and will lead to high levels of stress that block your dog’s ability to learn. They may even associate the pain with you as the trainer. How to Prevent Excessive Dog Barking Take these steps to prevent unnecessary dog barking: Increase your dog’s exercise and playtimeKeep a consistent daily scheduleEnsure your dog’s food, water, and temperature needs are metProvide mental stimulation with puzzle toys or treat-dispensing toysTry leaving music or a TV show on to create white noise when your dog is home aloneThese steps will go a long way toward preventing the habit of excessive barking from developing in the first place. Featured Image: iStock.com/bruev"}]