[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Crate Train a Puppy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/crate-training-puppy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/crate-training-puppy.jpg"}, "author": {"@type": "Person", "name": "Brittany Grenus, DVM", "url": "https://www.petmd.com/author/dr-brittany-grenus"}, "keywords": "Dog, Puppy, Training, Zoo Puppy Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/crate-training-puppies"}, "datePublished": "February 2, 2023", "dateModified": "September 21, 2023", "description": "Crate training a puppy is vital for giving your new dog a place to feel safe and secure. Learn how to crate train a puppy or dog and how to make the process go smoothly.", "articleBody": "While dog crates can sometimes have negative connotations, a crate provides your puppy with so many benefits. The most significant? Providing her with a quiet, safe space she can go to whenever she feels overwhelmed or needs some alone time. Many dogs continue using their crate as a safe haven throughout their life—if pet parents get them used to it early. Here’s what to know about crate training a puppy. Why Is Crate Training a Puppy Important?  Many people think of crate training solely as a way to keep your dog confined when you’re away from home. But the reality is that a crate offers many positives for your pup.  Provides a safe, quiet space for dogs: Dogs are den animals, meaning they like to have their own space where they can go if they feel stressed or scared. When used appropriately, a crate can provide that den-like comfort.  Aids in housetraining: Dogs don’t like to soil the area they sleep in, so a crate helps puppies learn to hold their bladder for longer periods of time. This is very handy when potty training a puppy.  Emergency evacuation: If you need to evacuate due to a natural disaster, many shelters allow pets—as long as they are crate trained. Dogs that are crate trained are also less likely to be lost or run away in an emergency.  Traveling: A crate helps keep your pet safe during travel and is generally required when flying.  Prevents destructive behaviors: A crate helps prevent puppies from getting into things that could be dangerous when they can’t be supervised.  Overnight stays at the veterinarian: When dogs are really sick, they sometimes need to stay overnight at the vet hospital. Being crate trained helps to make them feel more relaxed.  Rest after an injury: Some dogs need strict rest after an injury or surgery, and the crate provides this space for them so they can’t hurt themselves further. Dogs that aren’t crate trained will sometimes feel stressed in the crate and will have a hard time relaxing after their procedure.  Prevents separation anxiety: To help prevent separation anxiety, pet parents can put dogs in their crate in another room of the house where they can’t see you. This slowly helps them adjust to not having you immediately present.  Choosing a Crate  There are several types of crates available, including hard plastic and wooden crates, metal crates, soft crates, foldable and collapsible crates, heavy-duty crates, highly mobile crates … the list goes on. With all these different options, it can be difficult to know which crate is right for your puppy.  When choosing a dog crate, ask yourself:  How big is the pup expected to get?  What will the crate be used for?  Am I planning to travel with it?  Is my pup a super chewer?  What is my pup’s temperament?  How much am I willing to spend?  Do I want the crate to match my home decor?  The most important of these considerations is the crate’s size. It should be large enough for your dog to stand up, turn around, and lie down comfortably. This means when choosing a crate for a puppy, you need to estimate how big she’s going to get (so you hopefully don’t need to upgrade as she grows). If you aren’t sure, your veterinarian can help provide a safe estimate of your pup’s adult size.  But having a crate that’s too big for your little puppy does have a drawback. When crates are too large, dogs will soil their crate because they can still lie far enough away from their mess. Ideally, get a divider for the crate—this lets you adjust the amount of space your pup has access to as she grows.  Here are a few other key features that make a good crate:  Sturdy: While most dogs are perfectly content in their crate, some are a little more stressed and may try to chew. A sturdy crate helps prevent chewing and the damage it can cause.  Multiple entries: This helps provide easier access to the crate for both pets and pet parents.  Easy cleaning: Crates can get dirty quickly, especially when house training a puppy. Metal and plastic crates tend to be easier to clean than fabric crates.  Rounded corners: Sharp corners can injure you or your pup, so it’s best to choose a dog crate with rounded corners.  Transportable: Ideally, a crate should be small enough to carry, have wheels to roll it, or be collapsible so it can be easily transported to alternative locations.  How to Crate Train a Puppy  Crate training can take days or weeks depending on your dog’s age, temperament, and any previous experiences they’ve had. The most important thing when crate training a puppy is to always use the crate as a positive place; never use it for punishment.  1. Make the Crate Safe and Comfortable  Make the crate feel like a welcoming and safe place by putting it where your family spends the most time, such as the family room. Placing soft blankets or a dog bed inside can help to make it feel more comfortable, too, though some dogs do prefer to lie on hard surfaces.  Keeping the door propped open and allowing your dog to explore the crate at her leisure can be helpful. Some dogs will even just naturally start sleeping in the crate right away.  2. Introduce Your Dog to the Crate  If your pup isn’t naturally inclined to go to the crate on her own, bring her over to the crate and talk to her in a positive and happy voice. Keep the crate door propped open so that it doesn’t accidentally hit your pup and frighten her. Putting small treats near or just inside the crate’s door can also entice your pup to explore the area. If your puppy refuses to go inside initially, don’t force her to go in! It’s critical that she never feels forced to use the crate.  As your pup gets more comfortable being near the crate, you can progressively put treats farther inside to get her to go all the way in. This positive reinforcement with treats should be repeated until she’s comfortable walking in and out of the crate. Alternatively, if your pup is not food motivated, you can use her favorite toys as positive reinforcement.   Introducing your pup to the crate can take as little as a few minutes to as long as several days. It’s important that you be patient with her and don’t rush her as she gets comfortable with the crate.  3. Feed Your Pup Meals in the Crate  Once your dog is introduced to her new space, start to feed her regular meals near or inside the crate. This will help her create a positive association with it.  If your puppy is comfortable in the crate, you can place the food dish on the far end of the crate (furthest from the door). But if your puppy is still reluctant to go inside, only place the food as far as she feels comfortable entering the crate. Then, each time you feed her, progressively push the food farther and farther back into the crate.  4. Close the Door  Once your puppy is comfortable standing fully inside the crate, try to close the door while she’s eating. The first time you do this, you should open the crate door as soon as she’s finished with her meal.  Progressively leave the crate door closed for longer and longer periods of time, starting with 1 minute and working up to about 10 minutes after eating. If your puppy starts to whine while closed inside the crate, it’s likely you increased the length of time too quickly and should go back to a shorter time period for the next few feedings.  5. Leave Your Pup Alone  Once your dog seems comfortable with the crate and is regularly eating her meals inside, start to confine her there for short periods of time while you’re home.  Start by using a treat to entice her to enter the crate and giving a command of your choosing, such as “Crate” or “House.” Once your puppy enters the crate, praise her and give her the treat, and then close the door.  You can then sit quietly near the crate for a few minutes before entering another room for a bit. When you return, sit quietly by the crate again for another minute or two, and then let your puppy out. Repeat this process while gradually increasing the amount of time your puppy is left alone.  6. Crate Your Dog When You Leave  Once your puppy can relax quietly in the crate for about 30 minutes, you can start to leave her alone in the crate while you’re gone for short periods of time.  To do this, put your dog in the crate (using the command that you have chosen and a treat). Try to vary when she goes in the crate during your “getting ready to leave” process so that it doesn’t start to promote separation anxiety. This can be anywhere from 5-20 minutes prior to leaving, but try to keep the timeframe short.  The goal is to make leaving seem as insignificant as possible to your puppy. Praising her briefly and giving her a treat for entering the crate is enough, and then you can leave quietly.  As hard as this may be, it’s important that you aren’t overly enthusiastic if your puppy is showing excited behavior when you come back. Keeping your return as calm as possible will help to make her feel less anxious about when you will get home and help prevent separation anxiety.  Once your puppy is fully crate trained, it’s important that you continue to crate her occasionally when you’re home so that she doesn’t always associate the crate with you leaving.    7. Crate Your Dog at Night  Once your puppy is comfortable with the crate, you can start crating her overnight. It’s important to remember that puppies often have to go to the bathroom in the middle of the night and will cry to tell you, so it can be helpful to put the crate in your bedroom at night so any bathroom cries can be heard. While puppies sometimes whine when they’re first put into the crate, these cries are typically associated with anxiety, whereas cries in the middle of the night typically indicate that they need to go to the bathroom.  Having the crate in your bedroom can also be helpful because your pup will be able to smell you and won’t feel so isolated. This can also be helpful for older dogs that are getting crate trained.  As your puppy gets more comfortable being in the crate overnight, you can gradually begin to move it to the preferred location in your home.  Tips for Making Crate Training a Puppy Successful  To help make crate training your puppy go smoothly, here are some things to keep in mind:  Ideally, keep the crate in your bedroom or a nearby hallway. This helps your puppy feel close to you, which can help her to feel more comfortable in the crate.  During the day, it can be helpful to keep the crate in the room where you and your family spend the most time. Again, this helps your puppy feel close to you, even if she’s in her crate.  The most important thing with crate training is to never use it for punishment.  It’s also critical that you train puppies in small steps and don’t go too fast. If you go too fast and they feel forced to use the crate, it may cause them to have negative associations with it.  Featured Image: iStock/SolStock   "}]