[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "News", "item": "https://www.petmd.com/news"}, {"@type": "ListItem", "position": 2, "name": "Views", "item": "https://www.petmd.com/news/views"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "You Get More Flies, and Dogs, with Honey", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_149148035.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_149148035.jpg"}, "author": {"@type": "Person", "name": "Lisa Radosta, DVM, DACVB", "url": "https://www.petmd.com/author/dr-lisa-radosta"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/blogs/purelypuppy/lradosta/2013/march/training-dogs-the-nice-way-29977"}, "datePublished": "March 27, 2013", "dateModified": "September 6, 2022", "description": "We all know that you get more flies with honey than with vinegar, but for some reason, dogs seem to be exempt from that rule. Bullying dogs is not only accepted in our society, it is held up as an ideal on some popular television shows.", "articleBody": "“You can’t run these trails!” yelled an older man as I ran by him on Sunday morning. I was running the same trail that I run every Sunday morning. On this particular Sunday morning, a small bike race was taking place on the trail. Surprised by the man’s outburst, I stopped running and went over to talk to him. With an angry, loud voice he stated that he had rented the trails. I explained that I was an experienced trail runner who was used to looking out for bikes; always yielding to them. I certainly didn’t want to interfere with his race, but these were the only safe (for a woman running alone) trails within an hour of my house. He upped the volume a couple of notches, yelling that I was one of those selfish people who didn’t care about charity and the fact that I was running alone was not his problem. At that point, the situation turned for me. You see, if you approach me with kindness, you can generally sway me, but if you push me … I push back. It is my nature. The conversation got heated. The Park Ranger was called and I continued my run on the trails. As I was running, I wondered how it could have gone differently. He could have motivated me by explaining what his charity was about. I certainly would have donated. Great! More money for his charity. He could have given me clear guidelines which would have allowed us to coexist. For example, he could have asked me to run opposite traffic and move off the trails when I saw a rider. He could have just asked nicely if I could go run somewhere else in the park, but he didn’t. He thought that he could bully me. NOT! We all know that you get more flies with honey than with vinegar, but for some reason, dogs seem to be exempt from that rule. Bullying dogs by hanging them on pinch or choke collars until they turn cyanotic (blue), holding them down until they urinate or defecate, shocking them and/or deliberately provoking them to bite in the name of training or “rehabilitating” them is not only accepted in our society, it is held up as an ideal as millions watch these brutal methods play out on popular television shows with no objections what-so-ever. If that was a child, the trainer would be in jail. The fact is that you don’t have to hurt someone to get them to respect you. I am all of 103 pounds and I controlled my Rotties without brutality. Why in the world does a grown man have to whip a 10 pound Shih-Tzu around by a pinch collar? But that is what is happening out there every single day in training facilities all over the country. Good owners drop their dogs off for training, or learn about these methods in their own homes from self-professed “experts.” Dr. Meghan Herron published a study in the Journal of Applied Animal Behavior Science which gave us scientific proof of what we knew was true — if you are a meanie you are more likely to be bitten than if you are a sweetie. She surveyed dog owners who came to the university and asked them about how they intervened in their dog’s behavior previously and what happened after those interactions. Physical methods such as hitting and kicking, growling, holding the dog down (e.g., dominance down, alpha roll), forcibly taking things from the dog’s mouth and grabbing him by his jowls, all were shown to elicit an aggressive response in about ¼ of the dogs. They must have personalities like mine. The fact is that most pet dogs who are aggressive toward their owners have fear or anxiety disorders. This is the case in my practice and survey studies of board certified veterinary behaviorists show that I am not alone. Let’s step into the dog’s paw prints so that you can understand what is happening here: You don’t speak English and you have the cognitive ability of a one year old human child. You have a caretaker who you love dearly and look up to, but you have this little anxiety. You just don’t want your bones taken away. Honestly, it makes your blood pressure rise. You don’t have any problem with the other dogs in the household because they see the worried look on your face as you lower your head, slightly avert your gaze and look up showing the whites of your eyes (you can find out more about canine body language here: Canine Body Language). They get it and they walk away. But your human mom, she acts differently. She walks right up and takes your bone. How rude is that?! OK, she doesn’t understand dog. It is not her fault that she never took any dog body language classes in school. So, you make your signal to her bigger — you growl. Then, she starts to yell at you and get close to your face and your bone. You have no idea what she is saying, but you are more than anxious now. You are downright scared. You tuck your tail and put your head closer to the bone. Why is someone that you love screaming at you? Finally, she takes your bone and walks away. Mom is definitely acting irrationally. Maybe this will be a one and done interaction. But it is not one and done. Mom shows up with a shock collar the next day. The “training session” consists of putting a bone down and then shocking you when you go near it. At this point, you can’t figure out why you are being hurt by someone that you love. You are confused and afraid. When your owner reaches for you, you bite her, afraid of what she will do next. Does this scenario seem far-fetched? It really isn’t. I see it every day. So, what to do? Work with a qualified positive reinforcement trainer from the time that you adopt your dog. If they ask you to do something that doesn’t sit well with you, don’t do it.When your dog has a serious behavior problem such as aggression, see an expert. You can find a board-certified veterinary behaviorist at the American College of Veterinary Behaviorists.Don’t do something to your dog that you wouldn’t want done to you. No physical stuff or in-your-face yelling. That provokes aggression and creates fear.Give your dog clear boundaries and structure from the beginning of your relationship. Help him to know what you expect from him.When in doubt, step back and take a deep breath. You are smarter than your dog and you can help him to understand what you want by using your brain, not your brawn. You may need to get some help from a professional in order to do this, but you can do it. Dr. Lisa Radosta Image: mezzotint / Shutterstock"}]