[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The Do’s and Don’ts of Dogs in the Workplace", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Dodger%20at%20work.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Dodger%20at%20work.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/dos-and-donts-dogs-workplace"}, "datePublished": "May 14, 2018", "dateModified": "September 6, 2022", "description": "Ready to introduce a new, four-legged coworker to the office crew? Be sure to follow these do’s and don’ts of having dogs in the workplace.", "articleBody": "By Nicole Pajer Studies show that having dogs in the workplace may help to lower stress and can even cause employees to work harder and be more productive at their jobs. Employers are catching on to this trend and are happily starting to oblige. But there are certain things to keep in mind before bringing your pup to accompany you on your 9 to 5. Here are some dos and don’ts of having dogs in the workplace. Do’s of Having Dogs in the Workplace Get it approved: Don’t just assume that your office is pet-friendly. Make sure that you check with the higher-ups and get their approval. Contact your human resources team to ask if there is a policy or certain rules for dogs at work. Check with your co-workers to make sure they are okay with it: You love your pup, but that doesn’t mean that Fred from the next cubicle over will. Before bringing pets to work, it’s customary to ask those that sit around you if they would be bothered by your animal’s presence. “Many people have allergies, and some folks are afraid. A little communication can go a long way to keep pets and people happy,” says Jennie Lane, an associate certified applied animal behaviorist Synergy Animal Behavior in Portland, Oregon. Melanie Wells, founder and director of the Lifeologie Institute School for Psychotherapeutic Yoga in Dallas, Texas, adds that in her office, it’s also important to check in with clients. “Rarely a client who is afraid of dogs will walk in your office. Respect their wishes and remove the dog to a secure area while that client is in your space,” she says. Check that your pet is up to date on vaccines: This ensures that your pet stays safe and doesn’t pick up something from other dogs in the workplace. In order to protect other pets and your fellow coworkers, you should also make sure your pet has had his latest dose of dog flea and tick prevention. Keep your pet from becoming a distraction: Animals are cute, but they can also cause occasional commotion. Don’t allow your pup to run freely through the office or to make excessive noise. The Lifeologie Institute has a strict “no barking” rule instilled at their office. “Office dogs can be an asset or a distraction. A barking dog is no bueno,” says Wells. Make sure that your dog is well trained: Before you bring your dog to work, it’s essential that he is properly trained. At the very least, your pet should understand basic commands like sit, stay, down, and come. “Office dogs have to be friendly and generally non-reactive in a number of situations,” says Wells. “If you have a skittish dog, a territorial dog or a neurotic dog, [he’s] probably not a great fit for the office.” Properly exercise and socialize your pet before bringing them to work: To make dogs at work more relaxed, Lane suggests keeping them properly stimulated. “Well-exercised and well-trained dogs are more likely to exhibit polite and calm behavior during the work day,” she says. Kate Wilson, Vice President of Making It Happen at LeadDog Marketing Group, recommends having dogs get to know each other outside the office prior to coming in. “To ensure all of our pups get along, we ask that the owners meet and introduce the dogs outside of the office space. Give them a chance to meet/greet/smell so they’re buds before coming into the office,” she says. Make sure you have all the dog supplies you need for the day: In order to make dogs in the workplace comfortable, make sure that you pack all of their essentials. A dog should be given access to fresh water, and you should also bring snacks and a bed for him to rest on. You will also need to bring a dog harness and leash to take your dog for a potty break, as well as some of his favorite toys.  In order to avoid having your dog become a distraction to others, it’s also a good idea to bring a KONG toy or treat-dispensing ball that can keep him busy. Set him up in his own space, like a corner or under the desk, where he can go to relax. Look for safety hazards in your workspace:  Pick up any items on the ground, such as paperclips, that could be a choking hazard to dogs at work. Let your coworkers know that certain foods are toxic to dogs, and if fed to them or dropped on the floor, they could be fatal. This includes grapes, raisins, chocolate and anything with artificial sweeteners (xylitol), which includes certain gums and some types of peanut butter. Keep your dog safely closed in your office or restrained inside of your cubicle so that he can’t wander around the office and get into trouble. Use a dog gate to keep him out of areas of the office that you don’t want him to explore. Don’ts of Having Dogs in the Workplace Let your pup wander around unattended while you are in a meeting: “Keep a close watch on your pup when he is at the office to read signs of when he needs to go outside. If you are headed into a meeting, ask someone else to take over the responsibility,” says Melissa DiGianfilippo, co-owner and president of public relations at Serendipit Consulting, a dog-friendly, full-service marketing, PR and creative agency that services clients all over the nation.  Leave spills or stains for someone else to clean up: “Accidents happen,” says DiGianfilippo. But if you bring your dog to work and he should happen to make a mess indoors, clean it up immediately. Bring in pets that growl/bark/bite: Dogs in the workplace should be friendly and must get along well with other pups and coworkers. Don’t bring a skittish, fearful or aggressive dog in to work with you. Force your pet to interact with another pet/person: Some pets get along and others don’t. If you bring your dog to work, refrain from forcing him to befriend another office pup. And if a coworker doesn’t like him, don’t insist that they become friends. Let your pet stick their head in garbage cans/purses and bags: Scavenging in garbage cans could lead to all sorts of issues, such as a pet becoming injured or swallowing something that he shouldn’t. He could also chew on a coworker’s purse or bag, or find something hazardous inside. Ignore signs of stress from your pet: Keep an eye on your pet to make sure that he is doing well in the office. “Most importantly, the dog should be comfortable in the work environment; this includes the travel to get there,” says Lane. She suggests checking in with your dog and making sure that you do everything that you can to keep him relaxed. And if your dog begins whining or appears to be stressed, it might be time to bring him home. You may love having your pet at the office, but he may be less overwhelmed at home.  Having dogs in the workplace can be a rewarding experience for both humans and canines. Follow the tips above and you’ll ensure that the experience is positive for all. Image via Pet Central"}]