[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "5 Dog Training Rewards That Aren&#039;t Food", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/selfie-happy-dog-picture-id485998078.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/selfie-happy-dog-picture-id485998078.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/5-dog-training-rewards-arent-food"}, "datePublished": "May 7, 2019", "dateModified": "September 6, 2022", "description": "When you’re training your dog, what you offer as a reward can make or break the learning process. Here are five alternatives to regular dog treats for your dog training sessions.", "articleBody": "There’s nothing quite like using dog treats for positive reinforcement, which is why you probably have a cupboard full of dog training treats for your pup. There seems to be real power behind a tasty goody—but what if your dog is not food-motivated or you don’t have any treats handy? Dog treats are not the only types of rewards that our furry best friends appreciate. In fact, the best dog handlers use a variety of “creative rewards” that tap into their dogs’ drives to help keep them motivated, responsive and ready to work. Why Use Nonfood Dog Rewards? Dog training treats are an important tool, but the fact is that you can’t always have a pocket full of them (although your dog would be very happy if you did!).  While it’s critical to use food rewards during the foundation stages of dog training, pet parents should gradually wean their treat usage as their dog starts to understand the basic lessons. That means that you should end up only occasionally using treats to mark good behavior.   That said, it’s always important to recognize your dog when he makes good choices, and creative, nonfood rewards are an easy way to do it. This is especially true in the case of dogs who are not food-motivated. Rewarding your dog with a creative alternative can help to keep your dog motivated during training sessions. What Types of Rewards Work for Your Dog? Before you try incorporating creative rewards into your dog’s life, you need to think about what your dog actually considers to be rewarding. The best creative rewards are specific to your pup. While there are universal favorites in the dog world, every dog has preferences that you can use in your training and daily life together. For example, a round of fetch with a ball-driven dog probably ranks almost as high as getting a treat, but a fetch-indifferent dog won’t consider a tossed tennis ball rewarding at all. The things that make your dog dance with glee are the best dog rewards. How to Introduce Nonfood Rewards in Dog Training Creative rewards can be incorporated into your dog’s formal dog training plan or your day-to-day life together. Keep in mind that not every creative reward fits with every scenario, so plan accordingly. Much like dog treats, you should dole out creative rewards after your dog has completed a task, like at the end of a recall or after a stretch of polite leash-walking. Be careful about not using rewards as bribes—this will backfire in the long run because your dog might not respond unless he sees that you have something for him. Getting Started With Creative Rewards Here are five creative reward ideas; think about what makes your dog happy to personalize the list for him! Praise This creative reward should come naturally! It’s easy to shower your dog with words of encouragement when he does something good, even if it’s as basic as pottying outside. In fact, commenting on all of the wonderful choices our dogs make is a great way to strengthen our bonds and keep our best friends on the right path. Toys Dog toys rank high on the reward scale with most dogs, but make sure that you pick the type your dog loves the most. Some prefer to play tug with a rope toy; some enjoy chasing after fetch toys; and others like plush dog toys that they can cuddle with (or destroy!). Dog toys are easy to use in a variety of circumstances, which makes them strong runners-up to dog treats as far as rewards go. Petting Most dogs love a good dog massage session, but it’s important to check in with your dog to make sure that he’s enjoying your touch in the moment. If you’re using petting as a reward during a high-drive activity, like at the end of a challenging recall, you might discover that your dog doesn’t appreciate it as much as he normally does. Always check in with your dog for feedback when you use touch as a creative reward. Games Your dog just ran across the dog park when you called him, and you want to show him how awesome he is. Why not rev him up with a game that he loves? The moment your dog gets to you, try to get him to chase after you or play a round of hide-and-seek so that he figures out that recalls always ends with fun. Permission to Sniff Dogs take in the world through scent, and even though it’s one of their primary ways of learning about the world, we often forget that it can also be a powerful way to reward them. For example, if your dog does a stretch of pull-free leash-walking, you can reward him by dashing over to a hydrant or garbage can that’s sure to be coated in pee-mail. Using scent as a reward requires that you think like a dog, and your pup is sure to appreciate your efforts! By: Victoria Schade Featured Image: iStock.com/patostudio"}]