[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Start Training Your Puppy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/yellow-lab-puppy-biting-and-tugging-on-leash_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/yellow-lab-puppy-biting-and-tugging-on-leash_0.jpg"}, "author": {"@type": "Person", "name": "Shelby Loos, DVM", "url": "https://www.petmd.com/author/dr-shelby-loos"}, "keywords": "Dog, Puppy, Training, Behavior, Zoo Puppy Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/when-start-training-puppy"}, "datePublished": "July 30, 2020", "dateModified": "August 30, 2023", "description": "Dr. Shelby Loos, DVM, explains the step-by-step process of training your puppy.", "articleBody": "Puppies are constantly learning, whether it’s from their environment, from socializing with people or other animals, or from direct training. This creates a critical foundation that will set the stage for their adulthood. Providing puppies with the appropriate socialization and basic puppy training allows them to grow into confident adult dogs. Follow this step-by-step puppy training guide to set you and your puppy up for success! When Can You Start Training Your Puppy? Training a puppy starts as soon as you bring them home, which is typically about 8 weeks of age. At this young age, they can learn basic puppy training cues such as sit, stay, and come. Tips for Training Your Puppy Here are some basic puppy training tips to get you started. Use Positive Reinforcement There are many different methods of training your puppy that you might have heard about or even seen in person with a dog trainer. However, there is only one acceptable and scientifically backed method of training, and that’s the use of positive reinforcement. Positive reinforcement is the process of giving a reward to encourage a behavior you want. The use of punishment—including harsh corrections; correcting devices such as shock, choke, and prong collars; and dominance-based handling techniques—should be avoided, because these can produce long-term consequences that result in various forms of fear and anxiety for your dog as an adult dog. To apply this, first find out which rewards work best for your puppy. Some puppies might find something as simple as a piece of their normal kibble exciting enough to train with, while others might need something tastier, like a special training treat. Then there are the puppies that are not motivated by food at all! For those puppies, try to find a toy they enjoy that they can get when they do a good job. Praise is also a way to positively reinforce a puppy. Petting or showing excitement and saying, “good job!” may be all you need for basic puppy training. Keep Training Sessions Short When training a basic cue, keep the sessions short, about 5 minutes each, and try to average a total of 15 minutes per day. Puppies have short attention spans, so end your session on a positive note so that they are excited for the next session! Use Consistency When Training Your Puppy It is important to be consistent in your approach to cues and training. Use the same word and/or hand signal when you teach your puppy basic cues such as sit, stay, and come. It is also important to reinforce desired behaviors consistently, even when it’s not convenient. So if your puppy is at the door needing to go outside to go to the bathroom, stop what you are doing, let them out, and reward them for going to the bathroom outside. Practice in Different Environments  Taking a puppy to a new environment like a park or the beach and asking for a cue is vastly different than training at your house. This is due to the variety of new sights and smells they will encounter outside the home. Make attempts to practice in different settings to set your dog up to be confident no matter what their situation. Please keep in mind that puppies should not go to areas where there are a lot of dogs until they have finished their puppy vaccination series! Be Patient Puppies are growing and learning, just like young children. They will make mistakes and may not always understand what you are asking. All puppies learn at different speeds, so stick with it and don’t get frustrated. Maintaining a consistent routine with feeding, potty breaks, naps, and playtime will make your puppy feel secure—and a secure puppy is ready and able to learn! Basic Puppy Training Timeline So when do you teach your dog the different cues? When does house-training start? Here’s a puppy training timeline that you can use. 7-8 Weeks Old Basic Cues (Sit, Stay, Come) You can start with basic cues as early as 7 weeks old: Say a cue such as “sit” once. Use a treat to position your dog into a sitting position. Once sitting, give your puppy the treat and some praise. Leash Training You can start leash training indoors at this age. Because puppies don’t have their full vaccinations at this point, it is unsafe for them to be walking around where other dogs walk. Start by letting them wear the collar/harness for short amounts of time while providing treats. Increase this duration slowly. Once your puppy knows how to come to you, you can walk around inside on the leash with no distractions. You can move the training outside once your puppy has all their vaccinations. General Handling Get your puppy used to being touched. Gently rub their ears and paws while rewarding them. This will get them used to having those areas touched and will make veterinary visits and nail trims less stressful when they are older! 8-10 Weeks Old Crate Training Your puppy should see their crate as a safe and calm place. Start by bringing them to their crate for 10- minute intervals while they are nice and calm. Reward them for going in their crate. You can even feed them in their crate to create a positive environment. 10-12 Weeks Old Learning Not to Bite Puppies become mouthy at this age. Putting things in their mouths is how they explore their world, but it is important to teach them not to bite your hands or ankles. When they start biting at you, redirect them to a more appropriate object to bite, such as a toy. 12-16 Weeks Old Potty Training Maintaining a schedule is important for potty training. Make sure to take your puppy out first thing in the morning, after eating, and after playtime and naps throughout the day. At this point they should start having enough bladder control to learn to hold it. Reward your puppy with a treat every time they go to the bathroom outside. 6 Months Old Puppies are entering the adolescence stage by this point, and it is the most difficult stage to start training at. That is why it is important to start training them as young as possible! At this stage you will continue training to solidify and strengthen their skills in more public and distracting settings such as dog parks. Featured Image: iStock.com/SanyaSM"}]