[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "You’re Not a Bad Pet Parent If Your Dog Jumps on People", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-jumps-on-people.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-jumps-on-people.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/youre-not-bad-pet-parent-if-your-dog-jumps-people"}, "datePublished": "January 8, 2019", "dateModified": "September 6, 2022", "description": "Image via iStock.com/stevecoleimages By Victoria Schade Admit it—you’re reluctant to have friends over because your dog’s greeting behavior is a bit embarrassing. She jumps so high that she’s nearly eye-to-eye with your guests, which might be okay with your kid’s friends, but it’s a hazard when your great aunt visits. This can leave pet parents in a tight spot when company comes over; it’s difficult to balance being a good host and a dog trainer at the same time.", "articleBody": "Image via iStock.com/stevecoleimages By Victoria Schade Admit it—you’re reluctant to have friends over because your dog’s greeting behavior is a bit embarrassing. She jumps so high that she’s nearly eye-to-eye with your guests, which might be okay with your kid’s friends, but it’s a hazard when your great aunt visits. This can leave pet parents in a tight spot when company comes over; it’s difficult to balance being a good host and a dog trainer at the same time. So, what causes jumpy greetings, and what can be done to stop them—aside from banishing your dog to the yard or their dog crate when people come over? While training a dog not to jump starts in puppyhood, it’s never too late to teach your dog how to be a good host! Why Do Dogs Jump? Leaping greeting habits typically start when the behavior is cute. Your excited puppy leaps at you any time you walk in the room, and you naturally reach down to pet her when she does it. After all, she’s adorable—how could you not? It’s a totally unconscious behavior on your part. The same jumping response happens when your pup meets new friends, and in some greeting scenarios, people even invite your pup to jump up to say hello. It doesn’t take long for your puppy to figure out that jumping up gets them attention. It’s fine when your puppy is small, but the behavior becomes less adorable as she starts to grow. But, by that point, your puppy has probably already had months of positive reinforcement for jumping up, and trying to put a stop to it isn’t easy. Couple that strong reward history with your pup’s sheer joy of greeting  friends and family, and you’ve got an entrenched jumping habit.   What Not to Do Pet parents used to be told to use pain to stop a jumping dog, like kneeing them in the chest or stomping on their back paws when they leap. Obviously, the primary issue with this type of advice is that’s it’s cruel to hurt your dog in the name of dog training. Thankfully there are more humane ways of addressing your dog’s overexuberant greeting behaviors that don’t resort to wrestling moves.  How to Stop Dog Jumping: Management A management solution controls your dog’s environment so she’s unable to perform the unwanted behavior. For example, if your dog grabs the mail after it comes through the delivery slot, you can manage that behavior by putting a dog gate near the door so she can’t get to it. While management doesn’t train your dog to do the right thing, it prevents her from repeating behaviors you don’t appreciate. A great management technique for food-motivated jumpy greeters is providing them with a treat-stuffed dog interactive toy, like a KONG dog toy, when you’re expecting guests. You can try stuffing a KONG Classic dog toy with peanut butter and a few dry dog treats—that act as “speed bumps”—and give it to your dog right as your guests arrive. By the time she finishes unstuffing the goodies inside the toy, your guests will be yesterday’s news. You can use a dog leash to manage jumpiness in a number of scenarios. To control a dog that likes to jump when meeting new friends during walks, simply step on the midpoint of the leash before the person gets close. Leave enough room for your dog to stand comfortably but not so much slack that he can successfully jump up on the person. This simple management technique allows your dog to interact with new friends while keeping four paws on the floor. How to Train a Dog Not to Jump It’s much easier to put a stop to jumpy greetings with puppies that haven’t been doing it for long. The process is easy; simply avoid interacting with your puppy until she has all four paws on the floor. Turn away from her the moment her front feet lift, and step out of striking range so that she can’t put her paws on you. Then, when she’s standing politely, quickly turn and acknowledge her. In time she’ll realize that jumping up has the exact opposite reaction that she wants—it makes you ignore her. If your dog has been jumping on people for a while, it’s going to take more work to change her responses. Teaching your dog to respond to a nonverbal “sit” cue is a straightforward way to cut through the excitement of saying hello to a new friend. This method also helps your dog understand that “rump on the floor” is the proper way to greet people. Dogs often ignore verbal cues in the excitement of the greeting process, but a clear nonverbal cue, like crossed arms, will quickly help her understand what she should do instead of jumping. You can also try a hybrid management/training approach by using a leash tether while you work on your pup’s sit for greetings. Tether your dog to a heavy piece of furniture near the door so that she can’t make contact with people, especially if they aren’t comfortable with up-close-and-personal hellos. It Takes Time Polite greetings are one of the more challenging behaviors to teach, so don’t expect a miracle behavioral change overnight. Practice with your dog every chance you can get in a variety of scenarios, and in time, you’ll have a welcoming ambassa-dog."}]