[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/7mwn3cdc4e", "@type": "VideoObject", "duration": "PT2M5S", "name": "5694866826001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/0bd14ed79452bb8bc11d6e8ea086d4c8b75553fd.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/7mwn3cdc4e", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/db5312c06c5c5d58ff113f0ab27db5d7300601f4.m3u8", "transcript": "Teaching your dog to come when called can be a lifesaver but a strong recall also helps to keep your relationship with your dog frustration free. Now coming when called is super easy to teach, but it takes dedication to get your dog to respond to it. No matter what. It helps if you make the foundation steps of this cute, easy, and fun.\n\nSo your dog learns that coming to you is a very good thing. First pick a word that doesn't have any baggage for your dog. If he's learned to ignore the word come you something like here instead. And don't use your dog's name as your recall word because you probably say it all the time.\n\nAnd the word you used for this q needs to be special. Now to teach it. Grab a partner and some super tasty treats and go to a quiet room in your house kneel down, say, the word here once with a happy tone of voice. And then whistle.\n\nClap your hands. Make kissy noises. Anything you can do to encourage your dog to run to you. Now he's not going to know what he or means at first.\n\nSo the noises will help him figure it out. When your dog gets to you give him the treat and have a praise party. You want him to think that he's a genius for what he just did. Then have your partner call your dog back and give a treat and lots of praise.\n\nRepeat this process until your dog is racing from person to person each time you call. Then make it tougher on your dog hide in another room. You'll probably have to whistle a little bit more as he hones in on you and that'll help give him clues at this point. Training is going to seem like a game of hide and seek.\n\nWhich is exactly the idea. Have fun with it. Once your dog is a pro at the game inside move it out to your yard or a safe enclosed area. Now working outside means you're going to be competing with distractions.\n\nSo use a super special treat like cheese or hot dogs. Your dog is going to be a recall pro in and around your house and controlled situations, but that doesn't mean that he'll be able to do the same thing at a crowded dog park or when he wants to chase a squirrel. So make sure to work together as a team frequently to master your dog's recall ability and eventually your dog will come to you whenever he's called.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/training/how-teach-your-dog-come-when-called?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Teach Your Dog to Come When Called", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/teach-dog-to-come.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/teach-dog-to-come.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-teach-your-dog-come-when-called"}, "datePublished": "December 28, 2017", "dateModified": "September 6, 2022", "description": "Teaching your dog to come when called is an important command that can save your dog&#039;s life. But this recall technique requires lots of work and training. Learn how to teach your dog to come with these easy tips.", "articleBody": "By Victoria Schade Teaching your dog to come when called can be a lifesaver. But a strong recall also helps keep your relationship with your dog frustration-free. Coming when called is super easy to teach, but takes dedication to get your dog to respond to it no matter what. It helps if you make the foundation steps of this command easy and fun, so your dog learns that coming to you is a very good thing! First, pick a word that doesn’t have baggage for your dog. If he’s learned to ignore the word “come” use something like “here” instead. And don’t use your dog’s name as your recall word – you probably say it all the time and the word you use for this cue needs to be special. To teach it, grab a partner and some super tasty treats and go to a quiet room in your house. Kneel down, say the word “here” once with a happy tone of voice, and then whistle, clap your hands or make kissy noises to encourage your dog to run to you. He won’t know what “here” means at first, so the noises will help him figure it out. When your dog gets to you, give him the treat and have a praise party. You want him to think he’s a genius for what he just did! Then, have your partner call your dog back and give a treat and lots of praise. Repeat this process until your dog is racing from person to person each time you call. Then make it tougher on your dog; hide in another room! You’ll probably have to whistle a bit more as he hones in on you, to help give him clues. At this point training will seem like a game of hide and seek, which is exactly the idea. Have fun with it! Once your dog is a pro at the game inside, move out to your yard or a safe enclosed area. Working outside means you’ll be competing with distractions, so use a super special treat like cheese or hot dogs. Your dog is going to be a recall pro in and around your house in controlled situations. But that doesn’t mean that he’ll be able to do the same thing at a crowded dog park or when he wants to chase a squirrel. So, make sure to work together as a team frequently to master your dog’s recall ability, and eventually your dog will come to you whenever he’s called.  Read Also: Critical Commands That Can Save Your Dog&#039;s Life"}]