[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Apply the Premack Principle to Dog Training", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/CANS-Premack-Principle-Dog-Training-496150861.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/CANS-Premack-Principle-Dog-Training-496150861.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-apply-premack-principle-dog-training"}, "datePublished": "June 29, 2018", "dateModified": "September 6, 2022", "description": "Looking for a different approach to dog training? Find out what the Premack principle is and how it can be used in training dogs.", "articleBody": "Many methods for dog training exist, including using a dog clicker, classical conditioning, positive reinforcement and the Premack principle. Although you may not have heard of the Premack principle, you might already be using it with your dog and even your children. Developed in 1965 by David Premack, who was an Emeritus Professor of psychology at the University of Pennsylvania, the Premack principle works on both humans and dogs. The simplest and most noted example of the Premack principle at work is when you tell your kids, “If you eat your vegetables, then you can have dessert.” This means that the more probable or rewarding behavior (getting dessert) reinforces the less probable or rewarding behavior (eating vegetables), says Megan Stanley, certified professional dog trainer and owner of Dogma Training in Calgary, Alberta, Canada. “This can be a powerful technique in dog training, as you’re rewarding your dog with highly motivating behaviors that you know he enjoys,” says Stanley. “It enables you to use life rewards, which are what your dog wants, and allows you to vary those rewards.” Offering life rewards as reinforcers can create a more responsive and cooperative dog because your dog will think you control the universe, says Bhambree. Applying the Premack Principle to Dog Training To begin, observe what your dog values, says Bobbie Bhambree, certified dog behavior consultant, certified dog trainer and owner of DogCentric Training &amp; Behavior in New Rochelle, New York. Is it playtime with a canine companion, going to the dog park, swimming or playing with a dog toy? Make a list of those fun activities, she says, and you’ll see where you can implement the Premack principle in your dog’s training. Then, decide which behavior you want to instill and which reward you’ll choose. Scenario 1: To illustrate this, Bhambree gives an example of how she trained her dog, Topper, not to bark when she opened his crate door in the morning. “Topper gets excited and expresses that excitement by barking,” says Bhambree. “I taught him that if he remained quiet (a low probability behavior), he could exit the crate and join the other dogs in the bedroom.” Scenario 2: In another scenario, Bhambree uses the Premack principle when training dogs to drop dog ball toys at their owner’s feet. For most dogs, ball chasing is much more reinforcing than returning the ball to you, says Bhambree. However, your dog learns, over time, that there’s a relationship between the two: he must bring the ball to you before you can throw the ball for him. Your dog quickly learns that dropping the ball (a low reward behavior) results in getting to chase the ball (a high reward behavior). Sitting and staying can also be taught by incorporating the Premack principle. Scenario 3: Teaching your dog to sit and wait comes in handy on many occasions. The dog may be anxious to greet a guest who is at the door, excited to say “Hi” to another dog on the street, wiggly when you want to put on a harness, or nervous when a groomer or veterinarian wants to examine him. This can be seen in terms of the Premack principle: calming your dog and putting his harness on (a low probability/reward behavior), so he can ride in the car (a high reward behavior). Stanley demonstrates her own step-by-step method for how to train your dog to relax so you can put the harness on: Stroke your dog’s side with the back of your hand, and if he remains calm, give him a few dog treats.If he seems nervous, hold the treat in front of his nose as a distraction.Pet his back, down his tail, under the belly, and touch his legs and paws. Take plenty of breaks and continue to reward him for staying calm, giving plenty of verbal praise along the way.Increase the pressure and prolong your touch, while continuing to reward him.Stanley explains that dog training is more effective if done in shorter sessions, and it’s ideally taking place throughout the day, whenever the opportunity arises. Watch for Adverse Signs When your dog doesn’t respond or is very distracted, you might be expecting too much from him, says Stanley. It’s not the dog’s fault. Give him more distance or break the training down into smaller steps so your dog can be successful. “If your dog is fearful or reactive, I recommend working with a certified reward-based trainer to ensure you’re using the proper training technique to help alleviate your dog’s behavior concerns,” says Stanley. “Also, make sure that the behavior you’re using as the higher reward is appropriate.” For example, if the dog sits and waits for you to open the door so he can chase the squirrel in the backyard, but he has a history of killing them, that’s not a behavior you want to reinforce, Stanley says. When the Premack principle is used appropriately in dog training, it can work wonders. Image via bbernard/Shutterstock"}]