[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/pdtt615ngt", "@type": "VideoObject", "duration": "PT2M14S", "name": "5694877827001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/1dac7c7a257cdd3e1f1c302ca67e453556846845.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/pdtt615ngt", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/238f349d497914ad0e97d363d114386ab4e27900.m3u8", "transcript": "We have all been there. You welcome a guest into your home and your dog goes nuts. Now it's not easy to curb a jumping habit because jumping up is deeply rewarding for dogs. And believe it or not, many of us accidentally keep the behavior alive by giving her dog's attention when they jump.\n\nWell, I'm here to teach you a simple tip that's really effective. The arm cross it. Now sometimes are verbal cues can get lost in the shuffle especially in times of great excitement like when greeting someone new at the door. But our dogs are always paying attention to our body language.\n\nSo using a very clear non-verbal signal makes it easy for your dog to understand what works. So this nonverbal cue is also helpful in directing your guests behavior. Crossed arms signal a calm environment, which means that people won't accidentally encourage jumping. First teach your dog that this position means sit take your dog to a quiet space in your home and stroll for a few steps then stop and cross your arms like this.\n\nAfter a second or two your dog will probably offer a sit-in when he does. Mark that behavior with a click or a marker word like Yelp and give your dog a treat. Now practice this all around your house, especially near your front door where you greet guests after lots of practice, you're ready to try it with a helper. Remember, everything changes when you take classroom training to a real life scenario.\n\nSo don't expect perfection right off the bat. Now it helps to use a tether to keep your dog from crowding the door when you welcome someone in. So take a leash and secure it to a heavy piece of furniture near the door. So your dog is present, but not in the middle of the action.\n\nHave your friend knock on the door, let them in and greet them as you normally would then walk over to your dog and crush your arms like this. And it helps if your friend does it too. Now it might take a few seconds for your dog to figure out what he's supposed to do. But the moment he sits mark the behavior and tossed the treat a few steps away.\n\nThis allows your dog to focus on finding the treat rather than ambushing your guest. Keep practicing the arm cross it with friendly helpers at your front door until your dog suit is automatic. The moment he sees this position with enough practice your dog might become the head of your household greeting committee.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/training/how-stop-your-dog-jumping?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Stop Your Dog From Jumping Up", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/stop-dog-from-jumping.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/stop-dog-from-jumping.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-stop-your-dog-jumping"}, "datePublished": "December 28, 2017", "dateModified": "September 6, 2022", "description": "If you want to stop your dog from jumping up on guests, there are a few easy training tricks to try. We asked our expert trainer to walk us through the steps of how to stop dogs from jumping. Learn effective dog training techniques to try.", "articleBody": "By Victoria Schade We’ve all been there; you welcome a guest into your home and your dog goes nuts. It’s not easy to curb a jumping habit because jumping up is deeply rewarding for dogs. And many of us accidentally keep the behavior alive by giving our dogs attention when they jump! I’m here to teach you a simple tip that’s really effective—the arm-cross sit. How to Stop Your Dog From Jumping: The Arm-Cross Sit Sometimes our verbal cues can get lost in the shuffle, especially in times of great excitement, like when greeting someone at the door. But our dogs are always paying attention to our body language, so using a very clear nonverbal cue makes it easy for your dog to understand what works. This nonverbal cue is also helpful in directing your guests’ behavior—crossed arms signal a calm environment, which means people won’t accidentally encourage jumping. First, teach your dog that this position means “sit.” Take your dog to a quiet space, stroll for a few steps then stop and cross your arms like this. After a second or two your dog will probably offer a sit, and when he does, mark the behavior with a click, or marker word like “Yup!” and give your dog a treat. Practice this all around your house, particularly near your front door where you greet guests. After lots of practice you’re ready to try it with a helper. Remember, everything changes when you take classroom training to a real life scenario, so don’t expect perfection right off the bat! It helps to use a tether to keep your dog from crowding the door when you welcome someone in. Take a leash and secure it to a heavy piece of furniture near the door so your dog is present but not in the middle of the action. Have a friend knock on your door, let them in and greet as you normally would. Then walk over to your dog and cross your arms (if helps if your friend does this too). It might take your dog a few seconds to figure out what he’s supposed to do. The minute he sits, mark the behavior and toss the treat a few steps away. This allows your dog to focus on finding the treat rather than ambushing your guest. Keep practicing the arm cross and sit with friendly helpers at your front door until your dog’s sit is automatic the moment he sees the position. With enough practice your dog might become the head of your greeting committee! "}]