[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Teach a Dog to Stay Anywhere", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/teach%20a%20dog%20to%20stay.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/teach%20a%20dog%20to%20stay.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-teach-dog-stay-anywhere"}, "datePublished": "August 31, 2018", "dateModified": "September 6, 2022", "description": "Learn how to teach a “down-stay” and how to teach a dog to stay in any environment.", "articleBody": "Image via Emily on Time/Shutterstock By Russell Harstein, CDBC, CPDT and owner of Fun Paw Care in Los Angeles Teaching a dog to stay is a fun exercise to practice. And dogs love it because they learn to simply relax and receive dog treats for not moving a muscle! Some dogs excel at staying better than others simply because they might be older, have less energy or are less motivated (lazier). But any dog can be taught to stay anywhere and anyplace, and you can teach and condition them to eagerly look forward to any obedience or dog training behavior.   After you’ve mastered the basics of getting your dog to stay still and not move in familiar environments, like in your bedroom, living room or backyard, you can progress slowly into other, much more distracting environments. Then you can have your dog perform a “down-stay” reliably and without moving in dog parks, in restaurants or when walking on a leash. What Is a Down-Stay? To avoid confusion, let&#039;s be clear about what type of stay behavior we want before we begin. A stay has three different positions—a stand-stay, a sit-stay or a down-stay. And there are four different types of down-stay positions: Prone (head touching the floor)Sphinx (prone position with upright head)Lateral (lying down on the side)Supine (dog entirely on their back with their face pointed toward the sky)In this article, we will focus on perhaps the most comfortable type of down-stay for the dog, which is also the behavior that most pet parents want—a lateral lying down-stay. This also happens to be the position that elicits a relaxation response in most dogs. Some dogs prefer a prone position, so that is fine to use as well. I don’t recommend practicing a sphinx position or a supine because they are too difficult to work with and reward the dog appropriately, and are unrealistic for practical, “real-world” purposes. Set the Stage for Dog Training As with any dog training, we want to set ourselves and the dog up for success. In doing so, make sure you are not rushed and can dedicate your time and energy to working exclusively with your dog. It may help to make sure that your dog is on the tired side of the spectrum, or at least relaxed. That means choosing an optimal time of day when your dog has a reduced energy level—perhaps after exercising. Make it as easy as possible for your dog to succeed and perform the intended behavior. If you try to practice a down-stay after your just dog wakes up from a nap or in the morning, it is not going to be as easy for either of you. Practicing Lateral Down-Stays The trick to taking any dog behavior on the road is to progress gradually. Begin at home, where your dog is most comfortable and will most likely offer you a down-stay reliably and naturally. There are several different ways to teach a dog down: Simply capture their behavior and mark each time your dog lies down on their bed or the floor with a verbal “Yes” or a clickerOR Ask them to lie down on cue with either your body language or a verbal cue, and mark that moment with a verbal or audible sound (like a clicker)Then immediately reward them with a high-value food reward. Once your pup has perfected this, you can add the “stay” portion. Encourage your dog not to move a muscle and to relax. Reward your dog when you are next to your pup instead of ending the exercise from a distance with a “Yes” and having the dog run excitedly to you. You want your dog to understand that they don’t have to move a muscle or get excited to get rewarded, even after your session has ended. Otherwise, the dog gets conditioned to come to you and run over to get their treat. This practice builds excitement and disinhibition in your dog when we want to develop and cultivate the opposite behavior. Once your pup is eager to lie down around the house on cue and stay, you can practice this behavior in slightly more distracting and different environments. Down-stays are a fun and easy behavior because a dog relaxes and gets rewarded for performing a natural behavior without having to do anything difficult. But keep in mind that not moving is very difficult for many puppies, working dogs and high-energy dogs! Practicing a Down-Stay With Distractions As you progress to more and more difficult and distracting environments, practice the down-stay at longer durations and distances. Slowly integrate any of these distractions at a slow, progressive pace: Walk away from your dog quickly and at different speeds.Try going out-of-sight for brief periods building up time.Move around your dog in a circle.Jump up and down or jog in place.Do jumping jacks or squat thrusts.When you really think your dog&#039;s got it, start crinkling around some treat bags. Pretend you are opening his dog food or open the refrigerator door. If he still doesn’t budge, it’s time to progress to the next distracting stage, perhaps outdoors. Be mindful of your dog’s precision, accuracy, latency and speed, and continue to reward only the best iterations of the behavior. This fine-tuning of a behavior is how a dog progresses quickly. When that eureka moment occurs, you and your dog will be off to communicating effectively, efficiently and clearly, and the training process will be a joyous and fun learning experience for everyone."}]