[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/o0o41yo3eb", "@type": "VideoObject", "duration": "PT1M16S", "name": "5351997579001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/7981e20bd09bae1675c84d9b3fb03e5161060492.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/o0o41yo3eb", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/7e4c86b6979b6d34626caa2ffd40cae11484409c.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/training/why-your-dog-sometimes-forgets-his-training-and-what-you-can-do-about-it?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Your Dog Sometimes Forgets His Training, and What You Can Do About It", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-forgot-training-289491512.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-forgot-training-289491512.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/why-your-dog-sometimes-forgets-his-training-and-what-you-can-do-about-it"}, "datePublished": "February 12, 2016", "dateModified": "October 20, 2022", "description": "Have you ever asked your dog to do something simple—sit, for example—only to have him look at you as if you’re speaking another language? Why do dogs forget their training? Learn more.", "articleBody": "by Victoria Schade Have you ever asked your dog to do something simple—sit, for example—only to have him look at you as if you’re speaking another language? You know your dog knows how to do it; it was the very first thing you taught him! You ask him to do it several times a day, in fact, and he always complies. So, what gives when he doesn’t? How come it seems like your dog sometimes “forgets” his training? The first question you should ask yourself in situations where it seems like your dog is blowing you off is, “Did I teach my dog the full behavior, or just a very specific version of the behavior?” For example, let’s say that you taught your dog to stay before you put his dinner bowl down and he knows how to hold while you fill his bowl and walk it over to his dinner spot. Awesome! But do you ever ask your dog to stay in other situations? Meaning, can he hold a stay when you open the door to get a package? Or when your kids are chasing each other around the dinner table? Asking your dog to stay in those types of situations is vastly different than doing his rote “I do this then this happens” daily pre-dinner stay. It’s up to you to help him increase his stay “fluency.” To do so, imagine all of the different scenarios where you think it would be helpful for your dog to stay—beyond that dinnertime stay—and work towards achieving them as a team. Speaking of fluency, have you ever taken a language class? Initially your teacher walks you through the basics of grammar, then you move on to speaking simple sentences, and then eventually you and your classmates can have very basic conversations. You start to feel confident in your abilities. Now imagine that you and your class take a field trip to a market in the country you’re studying. Suddenly, everything you learned in the classroom no longer applies. Everyone is talking too fast, the accent sounds strange, and everyone is crowding you. It sounds like a frustrating and scary scenario, right? The exact same thing happens to our dogs when we take them out of the “classroom” and into the real world. Asking your dog to do a “sit” around your house is very easy for him because he’s comfortable and familiar with the environment. Asking your dog to sit at the vet office, however, is an entirely different experience. Just like the sights and sounds might overwhelm you in a foreign country and make you “forget” your burgeoning language skills, the same goes for your dog. The vet office is fraught for a dog. The smells, sounds and not-so-happy memories there are enough to override the basic training you’ve done together. It’s not a case of your dog being willfully disobedient when he “ignores” you in this type of scenario, it’s more likely that your dog is overcome by the surroundings. The same holds true in the dog park. There’s a lot to sniff and explore! Sometimes the environment trumps the trainer and your dog might “forget” to respond when you call him. An easy way to help your dog remember his manners is to make sure that his responses are close to perfect when in a familiar environment, like your yard. This is your important foundation training—don’t skip this step! Then you can practice at the park when it’s not prime-time and filled with other dogs. Visit the park in the early morning or in the evening when the environment is less distracting and practice the recalls using a very special, high value treat. Try to set your dog up for success by initially only calling him when he’s not fully engaged with another dog. Finally, look deeper when it seems like your dog is “forgetting” his training. I’ve worked with many dogs that are uncomfortable when they try to do a sit-stay on hardwood floors. It might seem like these dogs are blowing me off when I ask them to do it and they hesitate, but they’re actually trying to avoid slipping and sliding all over the place! (We opt for a down-stay instead.) Some dogs are superstitious about household equipment, so they don’t want to respond to a recall if you’re standing right next to the noisy fan. And sometimes pain might be a mitigating factor. An older dog might not want to do a down because it hurts him when he has to get back up. Simply observe your dog and consider all of the possible influences before you blame him for insubordination. Believe it or not, your dog is not trying to be willfully disrespectful when you ask him to do something and he “forgets” how. If you’ve done a good job with your dog’s basic training and he doesn’t respond to a cue when you ask, there are usually other factors at play that make it challenging for him. Figuring out the how and why behind the refusal will make life easier for both you and your dog. Victoria Schade is a professional dog trainer. Learn More: Image:  Javier Brosch / Shutterstock Related Well Timed Rewards Matter for Puppies in Training Top 5 Puppy Training Tips Why Do We Need to Give Treats to Our Pets"}]