[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "3 Dog Behaviors You Can Accidentally “Untrain”", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/hungry-boston-terrier-picture-id877709304.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/hungry-boston-terrier-picture-id877709304.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/3-dog-behaviors-you-can-accidentally-untrain"}, "datePublished": "December 14, 2018", "dateModified": "September 6, 2022", "description": "Are you unintentionally encouraging your dog’s behavior problems? Find out how you might be untraining your pup without knowing it.", "articleBody": "Image via iStock.com/MonikaBatich By Victoria Schade You’ve put in the time at dog training class and diligently practiced your homework, and now you’re convinced that you’re on your way to having a well-behaved best friend. But did you know that some of your daily interactions might be accidentally untraining your dog? It doesn’t take much for the hard work that you’ve put in for it to start to unravel, and it’s usually because we don’t realize how quickly an undesirable dog behavior can take root. For example, petting your dog when he jumps up on you, zoning out during leash walks, or slipping him something from your plate when he demands it are easily overlooked responses that might lead to dog behavior problems down the road. The key to avoiding untraining is to always remain mindful when interacting with your dog. Think about whether you like the behavior that your dog is offering. If you don’t, consider how you might be accidentally reinforcing it and keeping the behavior alive. And remember, some things your dog considers reinforcing might not make sense to you. You might think that pushing your dog off when he jumps is a viable training strategy, whereas he might think you’re giving him a welcoming pat! The following are some common ways we untrain our dogs, which might lead to dog behavior problems, and advice on how to avoid them. Training Dogs Not to Jump Reacting to a leaping dog is almost reflexive, and that’s exactly how jumping up becomes a habit. Whether it’s scolding a dog to get him to stop, or reaching down to give a few pats before pushing him off, this is one example of untraining that’s almost universal. Leaping on people is rewarding for dogs because it works; your excited dog makes contact with you, and more often than not, he gets acknowledged when he does it. Even angry acknowledgement is enough to keep the behavior alive. The secret to curbing a jumping habit is to teach your dog that he’s invisible unless he has four paws on the floor. Instead of telling your dog to get off or pushing him, turn your body away the second his front feet start to come off the ground. Don’t acknowledge your dog while he’s leaping, and the moment he manages to keep four on the floor, turn back to him and say hello. If he jumps again, repeat the process. Training dogs not to jump, especially if they’ve been doing it for a while, will take time. You can also teach the arm cross sit to help speed the process. Dog Behaviors That Happen Gradually: Leash Pulling This is an untraining process that literally happens a few steps at a time. In training class, you probably learned that your dog’s leash should always be slack, but the reality is that you probably let your dog pull you occasionally, like when you’re in a hurry or when the weather is bad. The problem is that a pulling habit is a mix of muscle memory and your dog realizing that pulling works for him; over time, that’s a potent untraining combination. Dogs can quickly learn that a tight dog leash means forward motion (that’s the muscle memory aspect), so that combined with allowing him to get where he wants to go will change the way your dog walks on a leash over time. To keep your dog from developing a lifelong pulling habit, make sure to remain fully present during leash walks, meaning don’t zone out on your phone. Be aware of the moment when your dog’s leash starts to get tight, and stop walking so that he realizes that a tight leash no longer means forward motion. If your dog’s pulling habit is becoming entrenched, bring dog treats with you and revisit the basic lessons you learned in dog training class. Remember, polite leash walking is a “marathon” behavior that requires ongoing effort until it becomes a habit. Dealing With Begging Dogs It’s natural to want to share goodies with your dog, but doing so can morph from something you do occasionally to something your dog demands every time you have a plate. Dogs quickly learn that your food can also be theirs with the right combination of puppy dog eyes and demand barking, and in no time, this dog problem can turn mealtime into a test of wills. Begging is rewarding for dogs because they get paid with a potent double-reinforcer when they do it—food and your attention. Whether you’re prepping a meal at the counter or sitting at the kitchen table enjoying dinner, if you give your dog an occasional goody, he’s quickly going to associate both of those scenarios with shared food. If your dog is begging for food at every meal, redirect his attention by giving him something to do at mealtimes. Dog treat toys, like the West Paw Zogoflex Tux toy, make your dog work to earn a tasty payoff, which will keep him focused on getting the treat rather than your food. If your dog begs anytime you have food, even if you’re just grabbing a quick snack, avoid giving in, no matter how hard he tries. You’ll likely see the begging behavior get worse before it gets better, but if you don’t give in, your dog will learn that his puppy dog eyes no longer work."}]