[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/7sj1xc4n9a", "@type": "VideoObject", "duration": "PT1M40S", "name": "5324794618001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/e01d66f176d07fcc14642b9f9b8f9dfd584aad6e.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/7sj1xc4n9a", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/f2553b866f5bd57d230ea3f70a1aa5dcb28c62cb.m3u8", "transcript": "Dogs can sleep up to 14 hours a day so making sure that at least eight of those hours correspond to when you asleep is important for household harmony. If you have a dog that keeps you up at night try the following tips. Bump up your dogs daily exercise every dog can benefit from more playtime and the result is a tired dog that will sleep through the night. Silence your dogs tags with a piece of electrical tape.\n\nThe information is still accessible but now the jingling won't keep you awake at night. Consider creating your dog in your room at night. If he's restless that way he's close to you but he can't engage in his evening gymnastics. If your dog's not comfortable in a crate move him from your room at night.\n\nYou can give him a cozy bed right outside your door. Get a white noise machine. If your dog barks at things that go bump in the night it's an easy fix. And it works if your dog wakes you up too early in the morning.\n\nTry these tips once again tire out your dog each day so he's less likely to wake you up too early in the morning, take one last potty break before you go to bed and eat. That way you can be sure that his bladder is empty. Make your room as dark as possible to discourage your dog from working with the sun. This is a tough one but don't respond to your dog's barking and whining when it's finally time to get out of bed.\n\nWait for a moment of silence before you get up so your dog doesn't think that his barking is what made you start your day. Push back your dog's breakfast time so he doesn't associate getting up with eating right away. Sleep training takes time and patience. But before long you and your dog will be enjoying peaceful nights and long restful mornings.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/training/evr_dg_sleepless_nights?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is Your Dog Keeping You Awake at Night?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/4250877391_ab139f5749.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/4250877391_ab139f5749.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Behavior, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_dg_sleepless_nights"}, "datePublished": "May 7, 2009", "dateModified": "October 20, 2022", "description": "If you’re a dog owner, chances are you’ve been there or are going through it: seemingly endless and sleepless nights because your pup refuses to settle at night. So what can you do? And why do dogs behave this way anyway?", "articleBody": "  Move Over Rover   If you’re a dog owner, chances are you’ve been there or are going through it: Seemingly endless, sleepless nights because your pup refuses to settle at night. It not only barks you right into insomnia, but some very grouchy mornings, too. So what can you do? And why do dogs behave this way anyway? Michael&#039;s dog, Willy, was a barker. In fact, he would bark and whine all night long. &quot;It got to the point that everyone in the house was sleep deprived -- the kids, the wife,&quot; Michael said. &quot;We’d only had him for two years, when we moved to an actual house. Once we moved in, we decided to put him in the laundry room at night. It wasn&#039;t an awful place; it was comfy and even had a bed. But he kept barking from bedtime until morning.&quot; Michael was astonished to hear from one of his friends that his dog might be suffering from separation anxiety. Willy couldn’t understand why he was so far away from everyone. &quot;In our last place, he slept in the kitchen, which was close to our bedrooms,&quot; Michael said. &quot;So we decided to move his bed in the bedroom at night with us.&quot; Alison had a different problem. &quot;I’ve had Rex since he was a puppy and he has always slept with me. But now that he&#039;s grown up, he&#039;s become too big. He sprawls out and takes up a lot of the bed, causing me to sleep at weird angles -- it just doesn’t work. I push him down, but he gets back up again. I’ve tried putting him outside of the room, but he barks and whines and I still can’t sleep. And I feel bad.&quot; So Alison spoke to her local vet for a solution and she suggested crate training the dog to sleep on the floor. It worked! &quot;I felt awful doing that, but he had a comfy bed in there. And he didn’t bark because he was in the room with me. Now he has his own bed on the floor,&quot; said Alison. &quot;He jumps on the bed to cuddle in the mornings, but I can live with that.&quot; Laura’s allergies, meanwhile, meant their dog, Maya, had to sleep outside of the bedroom -- something her dog wasn’t happy about. &quot;My boyfriend and I both work, so she wants a lot of attention and cuddles. Even if my boyfriend spends time out in the living room with her, the moment he goes to bed, Maya whines and knocks things down. It’s annoying.&quot; Their solution? Adopt another dog. &quot;Now Maya has a buddy to play with during the day, and companionship at night.&quot; As she pointed out, they were helping out another animal by rescuing him from the pound. Jeff and his wife, Maria, are in a different stage of their lives. They work long hours and their only child has already left home. &quot;Our dog is only a few years old and has a lot of energy, so he runs around the house all night long, barks at shadows, you name it,&quot; Jeff said. &quot;We were exhausted.&quot; They tried taking him for an extra walk in the morning, but it wasn’t working. &quot;Finally we realized we needed to incorporate our exercise regime with him,&quot; Maria said. &quot;Now when we get home, instead of going to the gym, we take him for walks or runs. Sometimes we play in the park, and later on, a few hours before bed, we&#039;ll walk. Basically, we wear him out.&quot; They have also employed a dog walker, one who will exercise their pet on a daily basis. The outcome? All three of them get a good night&#039;s sleep! So now you have a few helpful tips to try on your dog if he won’t let you sleep. Good night, don&#039;t let the bed &quot;bugs&quot; bark ... I mean, bite. Image: Ginny / via Flickr"}]