[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Teach a Dog to Come to You in Any Environment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/teach-a-dog-to-come.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/teach-a-dog-to-come.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-teach-dog-come-you-any-environment"}, "datePublished": "September 5, 2018", "dateModified": "September 6, 2022", "description": "Learn how to teach a dog to come in any environment.", "articleBody": "Image via Lapina/Shutterstock By Russell Harstein, CDBC, CPDT and owner of Fun Paw Care in Los Angeles No matter where we are, we want our dogs to listen to us. In this article, we will focus on having your dog come on cue in any environment. But in order to do so, there are a few basic dog training principles that we need to understand. Although the laws of learning are universal to all animals, many still struggle with having their dog come to them in any environment. Let’s delve into the “come” or “recall” cue. Why It’s Hard to Teach a Dog to Come Why is dog recall training so elusive to many pet parents? My supposition is that one primary factor is that pet parents (and trainers) poison the cue by accidentally associating it (or any cue) with something the dog perceives as a punishment. For example, assume your pup does not like the bath. Your dog may not like a bath for many reasons. She may be scared of the water, sounds, smells, water temperature or the bathroom. In any case, she eagerly and excitedly comes over to you when called, and you immediately pick her up and plop her in the tub. If you recall your dog from a reward to a “punishment,” you will poison whatever cue you have used. In this case, your dog will no longer come to you when you call them inside from the backyard or dog park. How many times have you done something similar to this? How to Address a Poisoned Cue There are a few ways I like to fix a poisoned cue, but the easiest is to simply change the cue to a new one. That means changing both the word and body language we have associated with the “punishment.” This is also excellent opportunity to practice mindfulness. The reason cues get poisoned so often is because parents and trainers are not mindful or conscious of the words they are using and their consequences, as viewed from the dog&#039;s perspective. Any single-syllable word that you will remember will suffice. I have had clients use &quot;Here,&quot; Now&quot; or &quot;Touch,&quot; for instance. I like using the cue “Touch.” Touch has many advantages and is used as the basis for many behaviors to lure dogs into place. Touch is also a simple, one-syllable cue. More importantly, I do not use it nearly as often and mindlessly as come. This small but significant difference is very important. How To Use Touch as a Recall Cue to Get Your Dog to Come    In order to use the new touch cue instead of come, we don&#039;t want our dog to simply come close to us, orbit around us or be in close proximity to us. Instead we want the dog to physically touch your hand or finger, etc. Begin asking your dog to touch after they start playing with and are engaging in a mildly exciting activity—perhaps playing with a toy that is not their favorite. Once she begins coming to you and touching your hand, you immediately offer her an appropriate, delicious dog treat as a reward. Next, try again when you are at a distance or out of sight, and repeat this pattern. Then practice when there are distracting sounds, or practice with some doors open. Then move to the backyard or balcony, perhaps transitioning to a hallway or elevator. I would integrate the touch cue for recalls when on leash walks as well. Spontaneously and unpredictably offering the cue and being prepared to immediately reward your dog “proofs” the behavior and makes your dog fluent with practice. The list of exercises is endless. You can create any scenario you like as long as you go slowly and gradually. How to Practice Come or Touch in Different Environments You will first teach your dog to come in a familiar, safe, comfortable and non-distracting environment. Never use force, punishment, intimidation or coercion to manipulate a dog. Then you can introduce duration, distance and distraction in each environment before using them all at once. Then gradually proceed to more difficult training scenarios and environments as the dog becomes proficient in all three. It&#039;s critical to manage your dog&#039;s rewards effectively. Imagine being your dog&#039;s employer. You wouldn’t give an employee $1,000 just for typing a memo, but perhaps for completing more difficult tasks. In this scenario, we need to alter how much we pay our dog (with high-value food rewards) for each performance of a behavior. It is crucial to know your dog&#039;s hierarchy of rewards before you begin any obedience or dog training exercise. If you don&#039;t know what type of treats your dog is crazy about, now&#039;s a great time to find out. Otherwise, how can we possibly reward them appropriately with their currency of choice? If you bring boring old kibble to the dog park, and there are tons of distractions, your pup is less likely to come when called. However, if you condition them with their favorite treats that you only offer on very special occasions, they will drop whatever they&#039;re doing and sprint to you. If your dog is not paying attention to you or responding, you have gone too far too fast, and the environment is likely to be too distracting for her to concentrate. However, keep in mind that using a different cue such as touch will be no different than using come if you poison it as well. Our connection and communication are fundamental to a healthy and thriving relationship with our pets. Dogs are our family, just like any other member, and we love them deeply and without condition. Understanding them can strengthen our bond and connection, which makes for a beautiful experience."}]