[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Shaping: You Can Use This Dog Training Method in Almost Any Situation", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/hunting-dog-and-hand-with-clicker-picture-id697031440.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/hunting-dog-and-hand-with-clicker-picture-id697031440.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/dog-shaping-you-can-use-dog-training-method-almost-any-situation"}, "datePublished": "March 18, 2019", "dateModified": "September 6, 2022", "description": "If you’ve hit a wall when it comes to dog training, don’t give up yet. Dog shaping can be a useful dog training method to try when everything else has failed.", "articleBody": "Picture a behavior that you’d like to teach your dog, but have no idea how to go about it. Maybe it’s getting him to go to his bed or crate when you ask, or maybe it’s something cute, like ringing a dinner bell. If you are confused about where to begin, there’s a training technique called “shaping by successive approximations” that can help. There are many ways to teach your dog new tricks, and one of the most creative options is using dog shaping. It’s similar to the childhood game of “Hot and Cold”; you reward incremental parts of the behavior to tell your dog, “You’re getting warmer!” Much like the individual pages of a cartoon flip book come together to form a completed action, dog shaping helps both trainer and dog split complex actions into manageable pieces. Here’s an explanation of how it can help and how you can get started. How Does Shaping Help in Dog Training? Dog shaping is a great technique to teach a variety of behaviors, but it’s particularly helpful when you feel like you’re facing a training impasse with your dog. For example, many Dachshund pet parents have a tough time teaching “down” because their dogs are already so close to the ground. Both the dog and pet parent might become frustrated as the pet parent tries to use dog treats to lure the dog into position. The pet parent eventually gives up because the dog won’t assume the completed belly-on-the-ground position, and the dog gives up because he is not getting rewarded for his efforts. Shaping, on the other hand, keeps pups engaged because they’re getting feedback and reinforcements throughout the process until they’ve worked their way to the desired action. This dog training method is also helpful for dogs trying to overcome mild fears, like learning how to use a new dog door. Walking through a dog door flap is a strange sensation, and some dogs might resist going through, even when offered a treat on the other side of it. But shaping can help a dog to work up the courage to go through one baby step at a time. Instead of asking the dog to do the “impossible”—walking all the way through a scary plastic hole—shaping helps to build courage by acknowledging and rewarding incremental progress towards the dog door. How Does Dog Shaping Work? Most dog training methods ask the dog to complete the full behavior before getting rewarded, which means that if you’re working on “sit,” you’ll withhold the treat until your dog’s rump is on the ground. But in some cases, getting the full behavior isn’t an immediate option, like with a refusing-to-down Dachshund. The beauty of shaping a dog is that you’re rewarding incremental progress toward the completed behavior, which helps keep dogs engaged when working on challenging or multi-step procedures. Because you’ll be capturing small steps towards the finished behavior, which often happen quickly, it helps to use a dog clicker or marker word so that your dog understands exactly why he’s being rewarded. Make sure to use tiny but savory treats when shaping, like Cloud Star Tricky Trainers, since you’ll be rewarding frequently! The secret to dog shaping success is envisioning the completed behavior and then reducing it to easily achievable steps. For example, if you want to teach your dog to go to her dog crate, the completed behavior is obviously her walking to the crate and getting inside. But, the small achievable steps to get to that finished product might be: Your dog looks at the crate: This simple behavior signals that the game is on. Click and treat your dog when she acknowledges the crate, even if it’s just a glance. She takes a step towards it: Once you’ve click and treated your dog for looking at the crate a few times, pause and wait for her to do something more. It might be as simple as leaning towards the crate or as “big” as taking a single step closer to it. She continues taking steps towards the crate until she’s in front of it: Each step closer to the crate is treat-worthy click! Try to work quickly as your dog figures out the game. She puts her nose inside the crate: Some dogs have “crate baggage,” meaning they’re reluctant to get inside. That’s why you should click and treat your dog for the first hint that she might go in (and give her the reward while her nose is still inside the crate, if possible). She puts her nose and paw inside: It’s important to always wait for your dog to do a little more. So after a few click-and-treats for putting her nose inside, withhold the click until she tries something else, like putting her paw in. She walks in halfway: You’re nearly there! Click and treat your dog while she’s still inside the crate. She walks completely into the crate: This is a moment to celebrate! Make sure to have a party when your dog gets all the way inside the crate, and click and treat her while she’s still inside. Once your dog has successfully walked into the crate, start the process over again, and prepare to be amazed by how quickly she works through the steps! Shaping Troubleshooting: A Dog Training Tip One of the common challenges when shaping a dog is when they keep offering you the same behavior repeatedly, like looking at the crate, without doing anything else. If that happens, the key to getting to the next step is withholding the click-and-treat for a few repetitions. Your dog might look at the crate and wait for the reinforcement, then do it again and wait. When she doesn’t get a reward, she’ll probably do something bigger, like taking a step towards the crate, as if to say, “Can’t you see what I’m doing?” The beauty of shaping is that you can use it for life skills as well as for fun tricks. An easy way to get started with dog shaping is to work on a simple behavior, like “wave” or “high five” until you both feel comfortable with the process. Then, you and your dog will be on your way to shaping success! By: Victoria Schade Featured Image: iStock.com/PavelRodimov"}]