[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Train a Deaf Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/deaf-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/deaf-dog.jpg"}, "author": {"@type": "Person", "name": "Carol Thompson, VMD, LSHC-S", "url": "https://www.petmd.com/author/dr-carol-thompson"}, "keywords": "Dog, Puppy, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/how-train-deaf-dog"}, "datePublished": "July 6, 2020", "dateModified": "September 6, 2022", "description": "Check out this veterinarian’s tips for training a deaf dog.", "articleBody": "Deaf dogs are more common than you think—they make up approximately 5-10% of the pet population.   Hearing loss can be congenital (they are born with it) or acquired. Acquired hearing loss can come from injury, drug reactions, or age-related loss. Congenital hearing loss is seen at a young age and is often associated with coat color patterns. No matter the cause of deafness, just because a dog cannot hear, it doesn’t mean they are untrainable. You just need to think outside the box. Tips for Training Deaf Dogs Here are some ways you can modify training to fit the needs of deaf dogs. Teach That Touch Is Good Since the hearing-impaired dog cannot hear when you call them, you need to train that touch is good. Remember to train this as you would any other behavior. The touch is meant to be a way to get attention, just like calling your hearing dog’s name gets their attention. Decide where you will touch your dog to mean, “I want your attention” (for example: shoulder or rump). Pair the touch with positive reinforcement so that your dog understands that you want attention when you tap in that spot. Use a single or double tap, not repetitive tapping, as this is considered to be nagging and may be a bit annoying for the dog. If you desire, you can teach your dog to turn to the side on which you are tapping by only reinforcing when they turn their head to the side of the tap. Break Each Behavior Into Steps With “Shaping”    Shaping behavior is very important for teaching a dog to think on her own. With shaping training, the final behavior is broken down into smaller steps that are taught progressively. Each step gets closer to the final behavior, making it easier for a dog to learn. Modify Traditional Clicker Training With “Hand Flashes” Clicker training is a reliable style of training that allows for shaping, and it can be adapted for deaf dogs. Clicker training involves using a sound (click) to mark the correct behavior for the dog. Even though deaf dogs cannot hear, you can still apply the philosophy of clicker training. Many trainers who work with deaf dogs recommend using a deliberate opening and closing of the hand—a hand flash—as a “clicker” to mark the behavior. The hand movement is then followed by a reward. When using a hand flash, you must be sure of two things: The dog can see the hand flash. The hand flash is immediately followed by a reward. While your dog is learning this, the use of a harness and lunge line or long lead is recommended.  Try Physical (Touch) Clicker Training Depending on the type of activity that you want to do with your dog, some people teach a physical click. This involves a firm but gentle touch on the muzzle or ear that signals that the behavior is correct. The touch is then immediately followed by a reward. The physical click can be used when the dog is in a position that does not allow the handler to easily get a hand flash in the dog’s line of sight.    Teach a Check-In Behavior The check-in behavior helps your dog learn to turn to you and ask for your guidance. While the check-in is important for all dogs, it’s much more important for deaf dogs who cannot hear a car coming or recognize another dog’s growling. To teach a check-in, start by rewarding your dog every time they look at you. Initially, allow your dog freedom in a controlled environment to choose to look at you. When they do, you use your hand flash or physical click to mark the behavior, and give them a reward. As your dog gets better, you can take the training into more distracting environments, but remember to use a leash and harness initially until the behavior is well learned. Once they’re looking at you on a regular basis, you can add a signal to show them what to do— come closer, go investigate, or do a specific move. Train Your Dog to “Settle” It’s of benefit to train any dog to lie on a mat quietly while other things are going on. It is especially helpful for hearing-impaired dogs since they may not sense when another dog is getting irritated by their behavior. You, as the owner, must be aware of what is going on in your dog’s environment so that if needed, you can have them go to their mat to avoid unnecessary conflict or danger. You can use a bed, towel, or platform. Start by rewarding your dog for placing a single foot on the object, and then keep requiring your dog to move farther onto the object until she has her whole body on it. Use Hand Signals You will also have to pair hand signals with behaviors. You can use any signals that you desire. Remember to be consistent and decide on a hand signal before starting to train. Many people use signals from human sign language, but you can also use your own. It’s usually better to use one-handed signals, so that your other hand is free to give rewards. Start by using your hand flash, and reward your dog for offering the behavior (shaping). Then add your signal before the behavior, and reward with a “flash” and treat for the correct performance of the desired behavior. Be Patient and Seek Help From Pros When You Need It Always use whatever your dog finds to be the best reward, and always be patient. Your dog is unique and needs you to be patient with them. If you need help, seek a trainer who uses positive reinforcement and is knowledgeable about training deaf dogs.  Here are some helpful resources: The Deaf Dog Education Action Fund Deaf Dogs Rock, a rescue organization designed to educate and help owners Morag Heirs, a trainer in the UK with vast experience with deaf and blind dogs Featured Image: iStock.com/Tomas Maracek"}]