[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/vmq5z1dcaq", "@type": "VideoObject", "duration": "PT2M24S", "name": "5324820008001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/4ef44185d32620e1bb2b7ca2a2e8a321da36c479.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/vmq5z1dcaq", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/91924574e48fd40c3b88adc61320cf974b0df759.m3u8", "transcript": "It's exciting to add a new dog to your household in order to make the transition smooth for your resident dog, as well as your new dog. It's best to choreograph all of their interactions as they get used to each other. On the day you bring your new dog home. Start off by going to a neutral location and doing parallel walking.\n\nGet a friend or family member to help out. You're basically walking both dogs about 20 feet apart from each other double back on the areas that you've already crossed. So the dogs can actually catch each other's scent. Now pay close attention to their body language.\n\nYou're looking for loose happy curiosity about each other with no tension hard stares or high tails if they seem relaxed you can slowly close the distance between them, allowing them to meet. Keeping the leash is loose at the same time. Praise all appropriate interactions then go back to your yard and do an abbreviated version of parallel walking with both dogs when their body language tells you that they're getting along. You can drop the leashes and allow them to play.\n\nAllow your new dog some time to explore his home before you let your resident dog back inside. Make sure to pick up any resources that could cause a scuffle between them like bones toys or half filled food bowls. Then once your new dog has had a chance to survey his new home you can let your resident dog back in. It's helpful to give both dogs alone time during the transition.\n\nYou can set up a quiet room for your new dog where he can go to relax or if he's comfortable. Use a crate. This gives both dogs a chance to relax. You can also put up a baby gate so they can get used to each other slowly on their own time.\n\nEven if your new dog and your resident dogs seem like the best of friends from the very first day it's still a good idea to separate them when they eat. You can either use a baby gate or just close the door between them so they can eat in peace until they learn to understand each other. Try to acknowledge positive encounters between your dogs. If your new dog offers a play about to your resident dog as an invitation to play praise that behavior.\n\nIf your resident dog sits quietly beside your new dog praise that as well. This type of feedback helps your dogs understand the behaviors that you appreciate it. Finally to be 100% safe always separate your dogs when you leave the house and you can't supervise them. You can use a baby gate or crates if your dogs are comfortable in them Follow these tips and before you know it your new dog and your resident dog will be best.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/training/evr_introducing_a_new_dog_to_a_resident_dog?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Introduce Dogs the Right Way", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dogs-meeting-picture-id900016076.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dogs-meeting-picture-id900016076.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Training, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/training/evr_introducing_a_new_dog_to_a_resident_dog"}, "datePublished": "March 18, 2020", "dateModified": "September 6, 2022", "description": "How do you introduce a new dog to your longtime canine friend? Here are some steps you can follow and helpful tips for introducing dogs.", "articleBody": "Reviewed on March 18, 2020, by Dr. Alison Gerken, DVM, and Victoria Schade, dog trainer Introducing a new dog to your family dog is sure to spur a mix of nervousness and excitement. In order to make the transition smooth, you should plan each step of the process—from the dogs’ first meeting to the steps you’ll take to keep the peace for the first few months. The first step toward ensuring a lifelong doggy friendship is for you to have a plan and a calm approach.   Steps for Introducing a New Dog to Your Current Dog  If you know how to introduce dogs properly, you’ll set them both up to make a good first impression. Follow these steps for introducing dogs to each other. 1. Find a Neutral Spot to Make Introductions If possible, find a neutral, outdoor, fully fenced space—an area that neither dog has “claimed” through frequent visits or walks. The space should be quiet with no other dogs or people, like the backyard of a friend who doesn’t have pets or a park during off hours when no one is there. Unfortunately, this isn’t always possible, so the next best option is an outdoor space with enough room for the dogs to roam on-leash as they get to know one another. If outdoor space isn’t available, opt for a large garage or basement. Put away anything that might cause a scuffle—like dog toys, bones, beds, and even empty food bowls. Consider everything, including objects that don’t seem to interest your dog. An old bone might suddenly become valuable again if your new dog takes an interest in it. 2. Watch for Positive Dog Body Language Since the dog introduction process begins with both dogs on-leash, you’ll need a partner that understands canine body language to help out. Watch the dogs for happy, waggy body language and interest in one another without hard stares, tense postures, freezing in place, or a lowered or tucked tail.  Look for signs that one dog is trying to get away, which are often missed or misinterpreted. If your dog runs over to you, don’t send them back “into the fire” because this is usually an indication that your dog needs a break from the interaction.  If you’re not comfortable with how the dogs are interacting during this first step, or you’re unsure of what your dogs’ behaviors mean, enlist the help of a trainer during the introduction process. 3. Walk the Dogs Together After introducing a new dog, the next step is parallel walking with both dogs. They should be far enough apart that they’re aware of each other, but not so close that they fixate on trying to reach one another. Walk both dogs in the same direction with a comfortable buffer of distance between them (this will vary by dog). Then, turn back and trade places with the other dog-human team so that each dog has a chance to scent where the other dog walked. Allow the dogs to investigate potty spots, since urine-sniffing is one of the ways dogs pick up information about other dogs. Both handlers should remain calm and keep their grip on the leashes as loose as possible. If both dogs are offering relaxed, social behaviors towards one another, gradually decrease the distance between them while continuing the parallel walking. Don’t allow a direct face-to-face approach as the dogs get closer, since head-on is a stressful and unnatural way for dogs to meet. 4. Allow the Dogs to Interact Off-Leash If you feel comfortable with how the dogs are interacting, return to an enclosed area, drop the leashes, and allow them to interact. Give the dogs a few minutes to sniff one another while praising their calm interactions, and then encourage the dogs to continue moving with you for a final, brief walk together. At this point, the dogs might continue sniffing to learn more about each other, or they might begin playing. Look for the universal dog invitation to connect: a play bow where dogs put their elbows on the ground and rear end in the air.  As the dogs play, watch for the signs of a respectful interaction: a mutual give-and-take with pauses in the action.  Introducing a New Dog to Your Home After you introduce your new dog to your resident pet, you can introduce your new dog to your home. Instead of bringing both dogs inside right away, you should have a helper take your resident dog for a stroll. Then give your new dog a chance to check out his new living space alone. Keep an eye on your new dog as he investigates. When he’s checked everything out, bring him to an open area of your home, away from the front door. Cramped spaces can lead to jockeying for position and accidental scuffles. Once again, pick up any dog toys, treats, beds, prized possessions, or food that could create tension between the dogs. Then you can have your helper bring your resident dog inside. Daily Life After Introducing a New Dog Try to keep your household calm as the dogs acclimate to one another. Don’t throw a “welcome to the family party” on the first day home.  Maintain your resident dog’s typical daily schedule, and try to set aside one-on-one time with each dog, like going for solo walks. Always be aware of signs of brewing tension between your dogs, like low growling, hard stares, and body blocking. If you notice any of these signs, you should intervene immediately.  Separate the dogs and direct their attention to something else. Give them a break from one another for at least 20-30 minutes before allowing them to engage again.  Here are some more important tips for keeping the peace after introducing dogs: Monitor Mealtimes Always separate your new dog and resident dog during mealtimes. You can either place their bowls in different rooms or use a dog gate to separate them.  If one dog finishes first, don’t allow him to hover as the other dog eats. To prevent tension, you should keep them apart until both dogs have licked their bowls clean. Always pick up the bowls after feeding time. Give Each Dog Their Own Bed Some dogs are possessive of their resting spaces, so watch to make sure both dogs are acting appropriately around their beds. Even if a bed is big enough for both dogs to share, it’s a good idea to get a different bed for your new dog.   Introduce Toys Slowly Introduce toys back into the house slowly after the first introduction rather than bringing out the entire toy chest right away. Always supervise your dogs when they are trying out a new toy.  Look for playful interactions without signs of guarding, like standing over the toy or snapping at the other dog if he gets too close to it. Separate the Dogs When You’re Away  Alone time is an important aspect of the getting-to-know-you process. Whether you’re leaving the house for the day or just taking a shower, always separate your dogs when you can’t watch them. This obviously keeps them safe, but it also provides them with downtime apart from one another. In the long-term, it is always wise to supervise them together and separate them when no one is home. This will keep everyone safe and interactions more positive. Create Playtime Breaks Many dogs don’t understand when to say “when,” particularly if they’re having a good time together.  But that nonstop play can tip over into inappropriate behavior when dogs get overtired. Giving your dogs a break from one another allows them to relax and regroup.  Create spaces for each dog so that they can be separated—either in different rooms or behind a dog gate. Dogs needs a break from their housemates, just like all of us do.  Have Patience It can take months before your new dog and resident dog mellow into true comfort with one another, so have patience with them as they get used to siblinghood. Always acknowledge positive interactions between your dogs and enjoy watching the lifelong friendship bloom. Featured Image: iStock.com/YuriyS"}]