[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Eat Grass?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Beagle-standing-in-grass.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Beagle-standing-in-grass.jpg"}, "author": {"@type": "Person", "name": "Wailani Sung, MS, PhD, DVM, DACVB", "url": "https://www.petmd.com/author/dr-wailani-sung"}, "keywords": "Dog, Behavior, Adult, Zoo General Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-eat-grass"}, "datePublished": "August 31, 2021", "dateModified": "August 30, 2023", "description": "Dr. Wailani Sung talks about the myths of why dogs eat grass and whether they’re true or not.", "articleBody": "It&#039;s not uncommon to see your dog grab a mouthful of grass during their daily walk or a romp through the park. Ever wonder why dogs do that? There are many speculations as to why dogs eat grass. Many people believe that when dogs eat grass, they are trying to make themselves vomit. They think it’s an instinctive behavior that a dog engages in to rid themselves of something they should not have eaten. Some pet parents think dogs eating grass is an indication that their pup has an upset stomach or intestinal problem. Others believe that grass contains some essential nutrient their dogs instinctively know they need, or that grass offers much-needed fiber that aids in moving food through the dog’s gastrointestinal tract. They think that grass may serve as a laxative to help move stool along for dogs that are constipated. But what’s the true science behind dogs eating grass? Testing 6 Reasons Dogs Eat Grass There have been many speculations and theories, but there is limited research on exactly why dogs eat grass. So the truth is … that no one knows for sure. However, scientists have formed a few theories and disproved some myths based on the research we do have. 1. Instinctive Behavior Some scientists speculate that eating grass is an instinctive behavior for dogs that evolved from their wolf ancestors. We know from research on wolves that 2-10% of their stomach contents may contain plant material. Wild canids (from the Canidae family, which includes wolves, jackals, foxes, and coyotes) also have been observed to eat grass. 2. Supplementing a Missing Nutrient In one particular case report, an 11-year-old Miniature Poodle had a 7-year history of eating plants and grass and vomiting afterward. The problem resolved after the dog was placed on a commercial high-fiber diet. This was evidence that this particular dog was supplementing his dietary deficiency by eating grass and plants. Once provided with adequate fiber in his diet, the grass-eating behavior resolved. But can dogs actually digest grass? Dogs are primarily carnivores, meaning they eat meat. But recent studies have shown that dogs have evolved the ability to digest some carbohydrates in response to coevolving with humans. (Carbohydrates are sugar, starches, and fibers mainly found in fruit, grain, vegetables, and milk products). If dogs can digest some carbohydrates, then does this mean our dogs can really digest grass? The answer is no, not really. Grass mainly passes through the dog’s intestinal tract undigested. 3. Normal Dog Behavior In another study from 2007, researchers found that grass-eating behavior was influenced by how hungry your dog is and the time of day. There was less grass-eating when the dog had eaten a meal, and increased grass-eating beforehand. Grass-eating also occurred less frequently later in the day. The researchers believed that eating grass was normal dog behavior and was not indicative of an underlying illness. 4. Soothing an Upset Stomach One study fed one group of dogs were a diet containing fructooligosaccharide (FOS). The other group of dogs were fed a standard diet. FOS is extracted from sugar beets and passes undigested through the small intestines and into the large intestine, where it ferments. Large quantities of FOS can cause watery, loose stool. The dogs fed the standard diets had more episodes of grass eating compared to the FOS dogs that had diarrhea. This meant that dogs with gastrointestinal upset were actually less likely to eat grass. However, in this particular study, the diarrhea originated in the large intestines, so it doesn’t give us insight on grass-eating behavior in dogs that have gastrointestinal upset in their stomach or small intestines. 5. Curiosity Dogs, especially younger dogs, often explore with their mouths. Eating grass may be something that they try, like how some children eat dirt. Some dogs may learn to like the taste of grass. 6. Attention From Pet Parents Other dogs may have learned that when they eat grass, their pet parents pay more attention to them. You may talk to your dog more or offer dog treats to get them to stop eating grass and eat the treats instead. Sometimes, pet parents pull their dogs away from a patch of grass. This restriction may spur a dog to eat any grass as soon as they find it—because it’s forbidden. Does Grass Make a Dog Vomit? The 2007 study also recorded episodes of vomiting. There were five episodes of vomiting out of 709 grass-eating incidents. This study concluded that dogs do not eat grass to cause themselves to vomit. In another study of 1,571 survey responders, 9% of dogs were reported ill by the owners prior to eating grass. Only 22% of the owners reported that their dogs frequently vomited after eating grass. This study also found that younger dogs ate more grass than older dogs. These studies provide some evidence that dogs do not eat grass to induce vomiting. Should You Let Your Dog Eat Grass? Is Eating Grass Safe for Dogs? There are several safety risks for dogs that eat grass. Here are the most common. 1. Pesticides Pet parents need to be sure that the grass their dog eats does not contain any pesticides, which can poison dogs. If you suspect your dog has eaten grass treated with pesticide, bring them to your local veterinary clinic immediately for treatment. Dogs that have ingested grass treated with pesticides may show the following signs: Excessive salivation Nausea Vomiting Diarrhea Decreased appetite 2. Fecal Material Grass can be contaminated by droppings from other dogs and animals. Eating grass contaminated with fecal material can make your dog sick. Some intestinal illness, such as a parvovirus, are transmitted via the fecal-oral route. Parvovirus can cause serious gastrointestinal disease in unvaccinated dogs and puppies. Some dogs can die from this disease. Fecal material from other dogs and animals may also contain eggs or larvae from intestinal parasites. Dogs with intestinal parasites may lose weight and have diarrhea. In general, dogs should be on a monthly dewormer, commonly found in your dog’s monthly heartworm preventative, and receive regular fecal testing to look for intestinal parasites. There are certain intestinal parasites that need to be treated with different medications. How Can You Stop a Dog From Eating Grass? Here are some tips for discouraging your dog from eating grass: Keep our dog on a leash when walking through grassy areas. Time your outings for immediately after a meal when your dog’s stomach is full. Allow your dog access to grass later in the day. Use positive reinforcement and reinforce alternate behaviors. Every time your dog tries to eat the grass, calmly interrupt the behavior (through diversion, not scolding) and ask your dog to perform another behavior instead. This could be touching your hand to earn a treat or chasing their ball. Give your dog grass that you have grown yourself, given the fact that some researchers think this is normal dog behavior. This way, you won’t have to worry about your dog ingesting toxins or eggs and larvae of intestinal parasites. Featured Image: iStock.com/Andrei Kravtsov"}]