[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How To Train a Dog With Positive Reinforcement", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1094040768.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1094040768.jpg"}, "author": {"@type": "Person", "name": "Erika Lessa, CBST, CDBT, CDBC, CPDT-KA, Fear-Free Certified", "url": "https://www.petmd.com/author/erika-lessa"}, "keywords": "Dog, Adult, Puppy, Behavior, Training, Zoo Dog Training Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-to-train-a-dog-with-positive-reinforcement"}, "datePublished": "June 20, 2023", "dateModified": "August 30, 2023", "description": "It&#039;s important to understand how positive reinforcement works when training your pup. We break down everything you want to know about how to train your dog successfully with positive reinforcement.", "articleBody": "What Is Positive Reinforcement? You may have heard the term “positive reinforcement” and possibly some descriptions of what it means. The term actually has two meanings: It is a process that helps dogs (actually, all pets) learn new skills, and is also used to identify a group of trainers who use positive reinforcement as their main method of training. Compared with other methods, positive reinforcement strengthens behavior, builds trusting relationships between pet parents and their animal companions, and protects the behavioral health of pets.  Simply put, reinforcement is a process that strengthens a behavior. There are two categories of reinforcement: positive and negative. Positive Reinforcement vs. Negative Reinforcement Positive Reinforcement The “positive” in positive reinforcement doesn’t mean “good.” It means “added.” Reinforcement means to make something stronger. When using this method to train a pup, you add something immediately after the behavior that will strengthen that behavior throughout the dog’s training. The thing we add is typically something the dog likes or wants, like a treat or a belly rub. If the behavior doesn’t happen consistently over a period of time, positive reinforcement has not been achieved. An example would be teaching your dog to potty outdoors instead of on your new hardwood floors. When your dog begins to eliminate, wait quietly until they finish. Once they do, deliver a few delicious treats and verbal praise. This will create a desire for them to do their business outside and collect their prize. This should now happen more because it is being positively reinforced. If you are training your dog and the desired behavior is not happening more often when asked, then you are not successfully using positive reinforcement. “Positive reinforcement doesn’t work” is a statement that isn’t actually true. It is more accurate to say that “positive reinforcement has not occurred,” which means there is something wrong with the execution.  The dog also decides what has a reinforcing effect and what does not. For example, a dog that just ate a full meal might not find food as reinforcing as access to outside or play to burn off the energy from their meal. On the other hand, a dog that has been exercising for an hour and has not been fed in several hours may find food highly reinforcing. Negative Reinforcement The concept of negative reinforcement, a complex component of learning, also leads to a similar confusion. “Negative” does not mean bad; It means “subtracted.” Positive and negative reinforcement are similar because they both strengthen behavior. Positive reinforcement means adding something immediately after a behavior occurs and negative reinforcement means taking something away immediately after the behavior occurs. With negative reinforcement, the “something” that is taken away or removed is usually something the dog does not find pleasant and would like to avoid. For example, if there is something happening the dog thinks is scary, like a person running toward them or trying to pet them, they may snap at them. If the scary thing stops or goes away, then snapping may have been negatively reinforced. Negative reinforcement is a tricky process. It is often confused with punishment, and when used traditionally it is not a humane way to train your pet. That’s because they must be confronted with something they want to avoid—something they perceive as painful, scary, intimidating, or threatening. The minute a person adds something negative to a pet’s environment, there is fallout. Three major fallouts of using negative reinforcement are: Creating a negative conditioned emotional response Eroding trust with the handler Increasing fear, anxiety, and stress Positive Reinforcement Is Also a Movement Positive reinforcement is also a movement based on the philosophy that, as professionals and pet parents, we should be focused on strengthening the behavior we want to see, as opposed to reacting and punishing behavior we don’t want to see. Because of the way punishment is often used, it comes with multiple potential fallouts, like a statistical increase of fear-based behaviors and probability of aggression. Training is a tool that should serve as a fun and rewarding way to communicate with your dog.   How Do You Use Positive Reinforcement? When training your dog with positive reinforcement, you deliver a physical or verbal prompt for a behavior, wait for the dog to complete the behavior, and deliver something the dog wants. Repeat this process several times to assess the change in the behavior. Is the dog sitting more reliably, more frequently, or faster? It’s not enough to say, “I gave my dog a treat after he sat so I used positive reinforcement.” You may have done this, but if sitting on cue doesn’t happen more often, you have not positively reinforced the behavior.  Markers are also a helpful tool. Clickers are one of the more popular markers used in training. They help communicate to the dog exactly what they did to earn the reinforcer. It’s used to mark the exact moment the dog has completed the task and right before the reinforcer is delivered. For example, if you ask your dog to sit, wait for the moment your dog’s bottom contacts the floor and then immediately use the marker to “mark” that moment. Then deliver the treat. Working with a certified professional trainer can help get you clicking in no time. Tips on Using Positive Reinforcement Be sure you are actually using it: Track your training so you know that what you are working on is getting better. That is, when you ask your dog to sit, are they doing it immediately every time you ask? Training environments: Ensure there is very little distraction when practicing a new behavior with your dog. Select your reinforcers with care: In a structured session, use something you know will be satisfying to your dog. Remember, they decide what is reinforcing and what is not. Use a marker: Marking the behavior functions as a secondary reinforcer as long as the marker—clicker or word—is paired with the primary reinforcer. Sessions should be short and fun: Select one skill, work on it for 5 minutes, add verbal praise to your primary reinforcer, take breaks, and end the session while the dog is still enjoying it. Most importantly, have fun!"}]