[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Read a Dog&#039;s Body Language", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-1429309218.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-1429309218.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Adult, Behavior, Aggression", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-to-read-dog-body-language"}, "datePublished": "December 19, 2019", "dateModified": "April 28, 2023", "description": "Can you recognize the subtle ways that your dog communicates with you? Use these dog body language basics to understand what your dog is telling you.", "articleBody": "Dogs express their emotions with their bodies, but we’re not always able to correctly interpret the messages they’re sending. Or worse yet, we misunderstand their intent, which can make a challenging situation even worse. Learning to read what your dog is communicating is one of the most important things you can do to strengthen your relationship with them. While every dog will have their own unique nuances to their communication style, most dogs rely on similar postures to convey how they’re feeling. When reading a dog’s body language, it’s important to note that the dog’s entire body plays a role in signaling; for example, a wagging tail doesn’t necessarily mean that a dog is happy or relaxed, especially if the rest of their body is stiff. Everything from your dog’s ears and expression on their face to the placement of their feet, and of course, the tail, works together to help communicate your dog’s emotional state. Here are some dog body language basics to help you understand what your dog is trying to tell you. Relaxed Dog Body Language A relaxed dog is engaged in their surroundings and will have a loose, waggy posture. When dogs show relaxed body language, we tend to see them as being happy. Ears: Held in their natural position; pointed ears will stand straight, and floppy ears will hang slightly forward Eyes: Soft, and the forehead is neutral (without wrinkles) Mouth: Either closed without tension around the lips, or if the dog is active, open in a relaxed pant Tail: Wagging in a wide, sweeping motion that is even with the spine, or if the dog is engaged in play, wagging slightly higher The overall body posture will be soft and wiggly, and some of the dog’s movements might be overexaggerated, especially during play.  Examples of relaxed dog body language:    Image credit: iStock.com/bruev  Image credit: iStock.com/SariJuurinen Alert Dog Body Language An alert dog is assessing his surroundings for more information. Ears: Perked up and pointed forward (look at the base of the ear for floppy ear breeds) Eyes: Wide open and focused with a neutral, relaxed forehead Mouth: Closed without tension at the lips or around the snout Tail: Extended from the body, even with the spine and possibly wagging slightly The dog’s overall body posture is distributed evenly between the four feet in a “ready” position as they determine their next steps.  Examples of alert dog body language:  Image credit: iStock.com/eAlisa  Image credit: iStock.com/vyasphoto Stressed or Nervous Dog Body Language A dog that’s stressed or uncomfortable will exhibit many of the same postures as a nervous dog but might also perform a series of behaviors called “calming signals.” These movements are appeasement or displacement behaviors that represent an attempt to self-calm or reduce escalating tension. Calming signals include: Looking away Turning away Moving in a curve Slow movements Yawning Freezing Lip licking Lip smacking Sniffing the ground Raising one paw Scratching Shaking off (like after getting wet) Stressed dogs often avoid eye contact or look at the trigger, then quickly look away. A distressed dog might perform exaggerated yawns, sneeze, or lick their lips frequently. They might also shake their bodies as if their coat is wet, focus on self-grooming, or scratch themselves excessively. Example of stressed or nervous dog body language:  Image credit: iStock.com/imv Fearful Dog Body Language A fearful dog will have a stiff posture and might hunch over so that their back is curved and their head is close to the ground. Ears: Tucked back against the head Eyes: The dog might turn their head away from a stressor but angle their eyes toward it, causing the whites of their eyes to show (referred to as “whale eyes”). Mouth: The dog might keep their mouth tightly closed with the corners of the mouth pulled back, or they might begin panting without a temperature change or increase in activity. Tail: A fearful dog will tuck their tail so that it’s pressed up against the belly, and they will distribute their weight so that they are shifted back and away from potential triggers. The dog’s overall body posture is stiff and low, and they might shed more readily when nervous. Example of fearful dog body language:  Image credit: iStock.com/Charise Wilson Photography Appeasement Dog Body Language What used to be known as “submissive” behavior is now what we call appeasement body language. With appeasement gestures, the dog tries to appear small and as less of a threat. They might lower their body to the ground, or even flip over on their back to expose their stomach. Ears: Pinned back Eyes: Avoiding eye contact and squinting their eyes Mouth: There will be tension around the mouth, and the dog might pull back their lips to expose their front teeth in an “appeasement grin,” which looks like a smile, but is a way of showing deference. The dog might also lick around their muzzle frequently. Tail: Tucked or held low and moving in a slow, tight wag The dog might also raise a front paw in an appeasement gesture. Their overall movement is slow, and their weight will be shifted backward to appear less threatening. Example of appeasement dog body language:  Image credit: iStock.com/jwebb Aggressive Dog Body Language There are 11 different forms of aggression, ranging from predatory to fear aggression. In general, a dog showing aggressive body language is ready to react to a stressor. Ears: Dogs will hold their ears differently depending on the reason for the aggression. This is a scenario where it’s essential to take a dog’s whole body positioning into account. A fearful dog will typically hold their ears back and against their head. An assertive, confident dog will prick their ears forward or to the side. Eyes: Their gaze will be fixed on the stimulus with a hard, unwavering stare, with wrinkles across the forehead. Mouth: There is tension around the mouth, and the dog might also have wrinkles across the muzzle or a raised upper lip, exposing the teeth. Tail: Again, you will need to take a dog’s whole body into account here. A fearful dog may hold their tail low or tucked before an act of aggression but raise it during the act. A confident aggressive dog may hold their tail high above their body, and it will possibly be twitching from side to side in a tight wag. An aggressive dog’s overall body posture is rigid and tense, with minimal movement. The fur might be raised straight up (also called piloerection), particularly across the shoulders and at the base of the spine near the tail. The dog’s weight will be shifted forward in a stiff-legged “ready” stance. Example of aggressive dog body language:  Image credit: iStock.com/Piter1977 --- Featured Image: iStock.com/MStudioImages"}]