[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Signs a Dog Is Dying", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/woman-in-wheelchair-holding-rehabilitation-with-dog.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DAA1mSg5OzHP4lKrIq7RsFlcbFGB1YyC3AR57FWunOx8%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/woman-in-wheelchair-holding-rehabilitation-with-dog.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DAA1mSg5OzHP4lKrIq7RsFlcbFGB1YyC3AR57FWunOx8%3D.jpg"}, "author": {"@type": "Person", "name": "Leslie Gillette, DVM", "url": "https://www.petmd.com/author/dr-leslie-gillette"}, "keywords": "Dog, Senior, Adult, End of life, General Care, Euthanasia", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/signs-dog-dying"}, "datePublished": "February 27, 2023", "dateModified": "February 27, 2023", "description": "It’s difficult to know when an older dog has an illness that can be treated or if you should consider euthanasia. Dr. Leslie Gillette gives you signs that a dog may be dying and what you can do.", "articleBody": "As pet parents, we all fear the loss of our beloved canine companions. Many dogs age gracefully without serious health issues, but others may suffer from chronic, debilitating, or terminal illnesses that reduce their quality of life. Inevitably, we reach that heartbreaking realization that our companion is nearing the end of their time with us. One of the biggest questions that pet parents grapple with is whether the time is right—is it too soon? Other pet parents wonder if they can just let their pet die “naturally” at home, without medical intervention. Pet parents hope this scenario will play out peacefully, with their dog passing quietly in their sleep. The reality, however, is that natural death is not usually peaceful, and dogs with terminal illnesses could suffer for days from pain, nausea, and anxiety as their bodies begin to shut down. This is why the standard is for veterinarians to offer painless, humane euthanasia to end a pet’s suffering. What Are the Signs a Dog Is Dying? There are many clinical signs that may indicate a dog may be starting a decline toward death. However, these signs can also be vague indicators of other non-terminal health issues, so it’s important to have your dog examined by their regular veterinary team if you notice a change or decline in their health or daily routine at home. Changes may develop as early as three months prior to death. These changes can be physical or behavioral and may include: Mental/behavioral changes—This might include depression; confusion; agitation; restlessness; anxiety; increased clinginess; isolation; becoming detached from human or animal companions;  loss of interest in social interaction, activities, or toys; or aggression (usually due to chronic or persistent pain, but may also be from a brain tumor). Circulatory shutdown—Dogs in heart failure may develop a cough due to changes in the size of their heart, along with weakness caused by anemia and poor circulation of oxygenated blood through their system. Changes in breathing patterns—Dogs may start panting even while at rest, develop a cough, or have increased difficulty drawing a normal breath. This can be secondary to heart failure; a respiratory disease causing a change in their acid/base balance; cancer; or a metabolic disease such as diabetes, kidney failure, or liver or adrenal gland disorders. Changes in appetite or thirst—Appetite and water intake will gradually decline as the dog’s organ systems begin to shut down. Nausea, vomiting, or diarrhea may be present in dogs with underlying kidney, liver, or gastrointestinal disease. Loss of mobility—This can be due to pain, loss of muscle mass, lethargy, or weakness. Weight loss—This can be due to not eating or significant muscle atrophy due to neoplasia or other diseases. Incontinence (urinary and/or fecal)—Dogs may be physically unable to rise from their beds to go outside, or they may have musculoskeletal and neurological deterioration that affects their urethral and anal sphincters. Assessing Your Dog’s Quality of Life If you’re looking for signs that it’s time to talk about euthanasia, these questions can help determine your dog’s quality of life: Is your dog still eating and drinking? If they can’t eat or drink on their own, can you provide a way for them to eat or drink comfortably? Are they still able to enjoy the same activities and social interactions with you and other pets in the household? Is your dog comfortable at home, able to move about to urinate or poop, and able to rest without experiencing pain? Ultimately, are they having more good days than bad? If the answer to these questions is no, then it’s probably time to consider end-of-life care for your dog. Options can include palliative or hospice care, euthanasia (either at home or in the clinic, and discussions on how you might want to memorialize your dog after their death. Quality of Life Scale Similar to the questions above, you can also use the Quality of Life scale created by Dr. Alice Villalobos to assess a dog’s overall physical and mental well-being. The parameters for the scale include: Hurt Hunger Hydration Hygiene Happiness Mobility More good days than bad Each “H” and “M” is rated on a scale of 1-10. Total scores of 35 or higher suggest that a dog still has an acceptable quality of life and that palliative care options may be beneficial. Scores below 35 indicate an unacceptable quality of life and that the dog may need hospice or euthanasia considerations sooner rather than later.  What Is the “Natural” Dog Dying Process and Stages? A natural death does not mean a peaceful death. The stages of dying can be very stressful to watch. This is why euthanasia is used to provide a pain-free, humane end of life for pets. Without this, a pet’s breathing patterns continue to falter, and dogs may develop a “death rattle” in their chest, when mucus builds up in the throat. Their body temperature will begin to fall, and their extremities may feel cooler to the touch. Dogs that are dying are typically unable to rise to relieve themselves, so pet parents should have disposable pads and replaceable bedding to maintain proper hygiene and comfort. Dogs typically show no interest in eating or drinking at this time. The final transition to death comes when a dog’s organs shut down, they stop breathing, and their heart stops beating. Once breathing and heartbeat have stopped for 30 minutes after a natural death, pet parents can be assured that their dog has passed away. After death, there may be some brief muscle twitching, a last deep exhale, and loss of bladder and bowel control as the muscles relax. This can be very troubling to watch, because you may mistakenly believe your dog is still alive, so it is especially important to understand that this happens as part of death. How Does Euthanasia Help Dying Dogs? In contrast to the process of natural death, which can be prolonged and painful, euthanasia has evolved to offer a much less stressful experience for the pet parents and a fear-free experience for the pet. The euthanasia appointment will begin with veterinary technicians placing an IV catheter into your dog’s vein to ensure that all injections can be delivered easily. Your dog may feel brief discomfort as the catheter is inserted. After placement of the IV catheter, the veterinarian will give a sedative injection to allow your dog to relax and fall into a state of semiconsciousness. Next, the final euthanasia injection is given, and death typically occurs within a couple of minutes. Your dog may do a full-body stretch and take a deep breath before their body relaxes completely. Their pupils will dilate, breathing will cease, and their heart will stop beating. The veterinarian will confirm death by listening for a heartbeat, feeling for a pulse, and listening for breathing sounds. They may also gently touch the surface of the eye to make sure there is no blink reflex. What to Do if You Think Your Dog Is Dying If you are seeing signs of declining health or have scored the quality-of-life areas, take this information with you to your vet to discuss your options. They may say that your dog can go into palliative care, or they may suggest hospice or that you go ahead with euthanasia as soon as possible. Palliative Care vs. Euthanasia The goal of palliative care is to control pain and provide comfort during the declining stages of life. While palliative care is a valuable alternative to more aggressive medical therapies, it may not be a realistic option for all pets. You will have to see whether it makes sense for you and think of these questions:  Will you be required to give multiple medications with a complicated dosing schedule or frequent dosing adjustments? This is typical of diseases like diabetes mellitus, Cushing’s disease, Addison’s disease, heart failure, and certain types of cancer. Will your dog require mobility assistance that may exceed your physical abilities? For example, a 90-pound older person is probably not able to carry a large dog outside several times a day to go potty. Does the temperament of your dog make palliative treatment unsafe for you to attempt at home? Does the palliative care plan conflict with your personal, cultural, or spiritual beliefs about medical care, relief of suffering, and end of life options? Considering Euthanasia Once medications and other palliative efforts are no longer able to maintain an acceptable quality of life for a terminally ill dog, try to be open to the idea of humane euthanasia. While it can be a scary prospect, and many pet parents struggle with the issue of whether they can make that decision, it is a much more humane and loving option for dying pets than to opt for natural death at home. Dogs enter the final stages of death as their body systems fail, resulting in a buildup of toxins that the body can no longer excrete, leading to severe nausea, vomiting, and seizure activity in some cases. Intractable pain due to joint disease or neoplasia can also make resting in one spot unbearable while simultaneously making it difficult for the dog to stand, eat, drink, or go to the bathroom. Respiratory and cardiac failure do not often cause pain, but both can cause tremendous anxiety in dogs struggling to draw a breath. If your canine companion has reached a stage where comfort and quality of life have failed, contact your veterinarian immediately to schedule a euthanasia appointment. This appointment may take place in the clinic or at home, but decisions should be made quickly so as not to prolong your dog’s suffering. How to Comfort a Dying Dog The kindest thing you can do for your dog in their final days is to make sure they are as comfortable as possible. Keep clean, supportive (cushioned or orthopedic) bedding available, along with disposable potty pads to avoid soiling the bedding if incontinence is an issue. Some dogs may tolerate diapers, but you must change the diapers frequently, keeping the fur and skin free of urine and fecal matter to avoid skin irritation or infection in the genital area. If your dog has a favorite blanket or toy or an item of clothing that smells like you, keep those nearby to comfort them if you have to leave them unattended for a while. Spending as much time as possible with your dog will not only give them the emotional support and comfort they need, but it will also allow you to watch for signs of discomfort or anxiety. Continue all prescribed medications if your dog will tolerate them, to keep pain and anxiety to a minimum. Some dogs that are not eating well may experience nausea if medications are given on an empty stomach. Speak with your veterinarian about adjusting any medications to be sure that they are providing maximum relief. Dogs may also benefit from mild sedatives to help them sleep at night if they are restless. When your dog’s final moments arrive, you may feel conflicted about watching your friend transition to death. As difficult as it may be, it will provide great comfort for them to know their loving family is there with them. The decision of whether to allow children or other pets to be present during death should be made on an individual family basis, considering the age of the child and the temperament of the other animals in the home. Some experts believe that children and other pets should not be included in the final goodbye, but others feel that seeing their companion in the moments after death will help bring some level of closure and understanding that the pet has passed on. Featured image: iStock.com/AnnaStills"}]