[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "MDR1 Gene in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-964313318.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/iStock-964313318.jpg"}, "author": {"@type": "Person", "name": "Melissa Boldan, DVM", "url": "https://www.petmd.com/author/dr-melissa-boldan"}, "keywords": "Dog, Adult, Puppy, General health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/mdr1-gene-in-dogs"}, "datePublished": "April 3, 2023", "dateModified": "April 3, 2023", "description": ": Certain dog breeds have a mutated MDR1 gene which makes them more likely to have toxic reactions to certain medications. We&#039;re outlining everything you need to know about the MDR1 gene in dogs, including breeds affected, medications to avoid, and how to test for the gene.", "articleBody": "What Is the MDR1 Gene in Dogs? In 2001, a veterinary pharmacologist discovered that several herding-breed dogs were more likely to have a genetic mutation making them more sensitive to certain medications. The MDR1 (multidrug resistance 1) gene mutation causes a change in an important protective molecule called p-glycoprotein, which helps to eliminate medications and other toxic compounds from the dog’s body and prevents these medications from going places they shouldn’t, such as the brain. Dogs with a mutation of the MDR1 gene (or a defective MDR1 gene), also called the ABCB1 gene, are more likely to have serious side effects from certain classes of medication, namely ivermectin, an anti-parasite drug. Many Collie pet parents know that ivermectin drugs may be dangerous for their dog when used at non-FDA approved doses. The MDR1 gene mutation is responsible for this increased risk of toxicity. But it’s not just Collies, and it’s not just ivermectin. Other breeds and medications are linked as well. As we’ve learned more about genetics, we have developed ways to identify dogs that carry the MDR1 gene mutation and to make better choices in reducing their risks of serious medication side effects. How Do Medications Affect Dogs With the MDR1 Gene? In dogs with a defective MDR1 gene, P-glycoprotein is not functioning properly. Normally, P-glycoprotein acts like a bouncer in a nightclub that keeps medication and toxins out of areas they shouldn’t be in, such as the brain. Additionally, if toxins are found in the liver or kidneys, P-glycoproteins work to throw them out and excrete these compounds as bile or urine. Dogs with a mutation in the MDR1 gene and subsequent changes in the function of P-glycoprotein are unable to keep some drugs from crossing the blood-brain barrier, the network of closely knit blood vessels and cells that usually keep harmful substances and medications from entering the brain. When some drugs that are normally considered safe are able to cross the blood-brain barrier and get direct access to the brain, they cause neurologic problems like seizures, blindness, tremors, lack of coordination, and even death. Additionally, with the MDR1 gene mutation, these substances cannot be cleared from the body as efficiently, leading to drooling, nausea, or prolonged sedation.  Certain drugs, such as ivermectin, that are usually safe for dogs when given at proper doses can become life-threatening when they enter the brain and cause neurologic problems and serious drug reactions. How Do Dogs Develop the MDR1 Gene? Mutations in the MDR1 gene are hereditary—meaning the defective gene is passed down from one generation to the next. Dogs inherit an abnormal MDR1 gene from their parents: Every dog inherits two copies of the MDR1 gene, one from each parent. If both copies are mutated, then the dog will have drug sensitivity and toxicity. However, if they inherited even one abnormal MDR1 gene, they may still experience drug sensitivity, just less severe. This condition is inherited and the offspring of an affected dog will likely also be affected, depending on whether or not one or both parents carry two copies of the mutated gene. In litters where only one parent was affected, some puppies may carry the genetic mutation while other puppies do not. What Dog Breeds Have the MDR1 Gene? The most common breed affected by the mutated MDR1 gene is the Collie, with 70% of tested Collies being affected. Australian Shepherds and Mini Aussies are a close second, with about 50% of tested dogs having the mutated gene. The remaining breeds on the list below are less commonly affected, yet are reported to carry the trait: Collies Australian Shepherds   Miniature American Shepherds Shetland Sheepdogs Old English Sheepdogs Chinook German Shepherds Other herding breeds (e.g., Border Collies, Australian Cattle) Medications MDR1 Dogs Should Avoid Dogs carrying the MDR1 mutated gene are more sensitive to certain medications and more likely to experience a toxic reaction. Remember to always talk to your veterinarian before starting any new medication with your pet. The following list includes all currently known medications that affect dogs with the MDR1 mutated gene: Ivermectin: This common anti-parasite drug is used in many heartworm prevention products and is safe at low, FDA-approved dosages for monthly use, even for MDR1 breeds. Still, some pet parents will use heartworm prevention products containing another active drug, to be on the safe side. Ivermectin is also used at much higher doses for the treatment of some external parasites, like demodectic mange. While these elevated doses are well-tolerated by most dogs, dogs with a mutated MDR1 gene should NOT take this medication at higher doses. Talk to your veterinarian about which heartworm prevention product is best for your dog. If your dog is diagnosed with demodectic mange, your vet can help make a treatment plan that is safe for your pet. Never give ivermectin to your dog or take it yourself unless directed to do so by a veterinarian or medical doctor. Loperamide (Imodium): This anti-diarrheal drug is extremely toxic to dogs with the MDR1 gene mutation. While Imodium is available over the counter (OTC), it should absolutely NOT be given to any dog or breed that is likely to carry the abnormal MDR1 gene. Remember, always talk to your veterinarian before starting a new medication, even if it’s readily available OTC. Sedatives: Certain sedative drugs, like butorphanol and acepromazine, may cause toxicity in MDR1 gene dogs. They may be dosed lower by your veterinarian during anesthesia or avoided altogether to minimize risks. Acepromazine may be prescribed for sedation during thunderstorms, fireworks, travel, or other stressful events. If your dog is likely to have the mutated MDR1 gene, it is recommended that this drug either be administered in small doses or avoided. Your veterinarian may instead prescribe something like trazodone or another anti-anxiety medication instead. Chemotherapy agents: The chemo drugs vincristine and doxorubicin are also P-glycoprotein substrates and are slower to be metabolized and cleared by MDR1 dogs. These drugs may result in more side effects than other chemo drug choices. Your dog’s oncologist is the best person to discuss chemotherapy options with. Digoxin: This heart drug has increased toxicity risks in dogs with the mutated MDR1 gene. Remember that all dogs are individuals, and as such, each can experience individual sensitivity to different medications. If your dog has been prescribed medication and is experiencing side effects, reach out to your veterinarian immediately before continuing the medication. How To Determine if Your Dog Has the MDR1 Gene Currently, genetic testing is readily available to determine if your dog carries the mutated MDR1 gene. As advances in science continue, pet parents have more options now than ever. MDR1 testing can also be performed using blood drawn in the veterinary office. Talk to your veterinarian about your dog’s breed and what their recommendations are regarding testing. If you do independent testing, provide your vet with a copy of the results so they can keep your pet’s medical record up to date."}]