[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Take a Dog&#039;s Temperature", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1092980546.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1092980546.jpg"}, "author": {"@type": "Person", "name": "Melissa Boldan, DVM", "url": "https://www.petmd.com/author/dr-melissa-boldan"}, "keywords": "Dog, Adult, General health, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-to-take-dogs-temperature"}, "datePublished": "June 1, 2023", "dateModified": "June 1, 2023", "description": "If you need to take your dog’s temperature at home it’s important to know what to use, how to determine if they have a fever, and how to safely take your pup’s temperature.", "articleBody": "When they are sick, dogs can run a fever just like people. If your dog is acting like they’re not feeling well, it may be useful to take their temperature to find out whether they are running a fever and need to see their veterinarian. What Is a Normal Temperature for a Dog? The normal temperature of a dog runs much warmer than a human’s; their classic “normal temperature” is 101.5 F instead of the 98.6 F in humans. There is a range of normal that can vary among dogs, which has a lot to do with hair coat and what climate that particular breed thrives in. Additionally, your own dog can experience a change in their normal temperature depending on how excited or worked up they are and what the temperature and humidity are outdoors. Generally, a temperature anywhere from 99–102.5 degrees can be normal. Sometimes dogs can be hotter when they’re really worked up with excitement or anxiety, like at the veterinary clinic. It’s not unusual for an excited dog who is high-energy and panting to run a temperature of 102.5 after spending time barking at other dogs in the lobby before they make it to the exam room. Temperatures over 103 degrees may be considered a fever or hyperthermia. A fever occurs when a dog has an underlying illness that is forcing their immune system to respond. An infection is a common cause of a fever. This can be bacterial, viral, or even fungal. Inflammation (swelling) and autoimmune diseases are other common causes of fevers.Hyperthermia occurs when a dog’s temperature is high from overheating or overexertion. This occurs with heat stress and can be very serious.When a dog is running a fever over 103 degrees, they will often pant as they try to cool themselves. Just like people, dogs do not feel well when they have a fever. You may notice them acting lethargic or sad,  and they may not eat. Temperatures over 106  can have serious, life-threatening effects on the dog’s body as their organs overheat and begin to shut down. How To Tell if a Dog Has a Fever Unlike with humans, touching a dog’s forehead is not helpful to figure out if they have a fever. Contrary to popular belief, the temperature and moisture of their nose is also no help in showing if they are ill. Many people may assume their dog is sick if their nose is warm and dry, but the weather and environmental conditions can alter the temperature of a dog’s nose, ear tips, and forehead. The best way to figure out a dog’s temperature is with a thermometer. Because your dog’s temperature can vary greatly throughout the day, collecting multiple readings after waking up, going outside to play, and during down time can be helpful in determining your dog’s normal range. When dogs are running a fever, they may also show some of the following symptoms: Weakness and lethargy Acting quiet and depressed Decreased appetite or refusing to eat Being uninterested in walking, playing, or things that they normally enjoy Panting Glossy eyes Shivering Depending on what is causing the fever, a dog may also experience vomiting, diarrhea, urinary issues, ear or tooth pain, lameness, or generalized discomfort. How To Take a Dog&#039;s Temperature The most accurate way to take a dog’s temperature is to place a thermometer in their rectum. While there are several commercial temporal (forehead) thermometers labeled for pets, the dog’s forehead is covered in hair, and this method is usually inaccurate. Step 1: Make sure your thermometer works and is on. Step 2: Apply a lubricant to the tip of the thermometer. This is not required, but it can make it more comfortable for your dog. If you do not have any water-soluble lubricant at home, petroleum jelly, Vaseline, or coconut oil will all work just as well. Step 3: Ideally, have someone else help you hold your dog. Most dogs will find the thermometer surprising, and some do not like having their temperature taken. It is safer to have someone help to hold your dog so that they do not turn around and bite you if taken by surprise. Step 4: Lift your dog’s tail and insert the tip of the thermometer into the anus approximately 1 inch. When the thermometer beeps (if using digital) or after 60 seconds (if using mercury), remove the thermometer and read the temperature. Thermometers for Taking a Dog&#039;s Temperature Although the best way to check your dog’s temperature is with a rectal thermometer, there are several products on the market made for taking a dog’s temperature elsewhere, like the ear or forehead. However, they are much less reliable and readings can be variable. One degree makes a huge difference when figuring out whether a dog has a fever. Any thermometer can be used, whether it’s specifically marketed toward dogs or is marketed for people. Digital readings are preferred, as they tend to be quicker. It is a good idea to keep your dog thermometer clearly marked and separate from the thermometer you use for people in your household. My Dog&#039;s Temperature Is High. What Should I Do? If your dog has a mildly high temperature but is still eating and drinking normally, going to the bathroom normally, and has good energy, you can likely wait and speak with your normal veterinarian during regular office hours. If your dog has a high temperature and is lethargic, depressed, not eating, or vomiting, seek emergency care for them right away. If your dog develops a high temperature following exposure to heat, it is important to seek emergency veterinary care right away. High temperatures can lead to multi-organ failure and potentially death when not treated correctly. You can try to cool your dog at home using a cool bath, cold wet washcloths, and fans. Allow them access to small amounts of cool water often, but do not force them to drink. Do NOT give any over-the-counter anti-inflammatory medications without speaking with a veterinarian. Never give human medications to dogs without being directly told to do so by a veterinarian. Many human fever medications can have serious, life-threatening side effects in dogs, leading to ulcerations (tears) and perforations (holes) in the bowels, liver or kidney failure, and even death. The following guide can be helpful to determine next steps: Temperatures between 101.5–103 can be considered normal. If your dog has a temperature of 103–104.5 and is acting otherwise normal, you can apply home cooling methods (cool washcloth, fan, small frequent amounts of water offered) and recheck their temperature after 30 minutes. If your dog’s temperature is over 105 or their temperature is between 103–105 and they also have lethargy, shivering, vomiting, or other signs of severe illness, contact a veterinarian right away to seek treatment. If your dog’s temperature is over 105 degrees, seek emergency care Featured Image: iStock.com/Ocskaymark"}]