[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "18 Dogs That Love to Swim", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/water-loving-dogs-that-love-to-swim.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/water-loving-dogs-that-love-to-swim.jpg"}, "author": {"@type": "Person", "name": "Emily Sanders", "url": "https://www.petmd.com"}, "keywords": "Dog, General health, Adult, Zoo Adventurous Dog Pack, Zoo Labrador Retriever Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/dogs-that-love-to-swim"}, "datePublished": "July 21, 2023", "dateModified": "September 8, 2023", "description": "Water-loving dogs want nothing more than to splash around with their people. Here are the top dogs that love to swim, plus some water safety tips for pups.", "articleBody": "There’s a dog out there for every lifestyle, and that includes avid swimmers! If you enjoy spending your days in the water, these high-energy, water-loving dogs are more than happy to join you. They’ll gladly spend hours by the poolside, cruising on the lake, and splashing on the beach right beside you. What Is a Water Dog? Water dogs are bred to excel in or around water. Throughout history, people have relied on these dogs for various tasks, such as flushing out or retrieving game from the water, retrieving things that fell overboard from ships, and even delivering messages between boats. Nowadays, many of these dogs have retained a water-loving disposition and enjoy having jobs where they retrieve objects. And—no surprise here—they also tend to be excellent swimmers. Typically, water dog breeds can be identified by their waterproof coats, webbed feet, and love of swimming. They are often thought to be predecessors to modern retrievers, who, as pet parents know, always have time for a splash. 18 Dogs That Love the Water 1. Portuguese Water Dog Photo credit: Adobe/LyndaOriginally bred to work alongside fishermen, Portuguese Water Dogs have become highly prized pets due to their intelligence, loyalty, and affectionate nature. These energetic dogs sport curly or wavy fur that doesn’t shed often but does need regular grooming. To keep them happy and healthy, it’s important to provide them with lots of exercise, so be sure to take them for a swim or other heart-pumping activity for at least 30 minutes each day! 2. Irish Water Spaniel Photo credit: Adobe/slowmotiongliOne of the oldest spaniels, the Irish Water Spaniel is a rare water-loving dog. Although they resemble a Poodle due to their top knot and curly coat, these spaniels are larger and have a distinctive skinny, rat-like tail. They love swimming and excel at retrieving objects. 3. American Water Spaniel Photo credit: Adobe/SteveThis pooch is the state dog of Wisconsin. A great retriever with a sensitive disposition, the American Water Spaniel has a curly coat that repels water. These dogs make a fantastic addition to families seeking an intelligent and eager-to-please companion. 4. Spanish Water Dog Photo credit: Adobe/otsphotoThe very affectionate Spanish Water Dog is an energetic companion that thrives when given tasks to accomplish. Originally bred to herd cattle and retrieve waterfowl, these dogs thoroughly enjoy staying active by swimming or playing fetch in the water, where they use their webbed paws to help them swim. 5. Golden Retriever Photo credit: iStock/ChayantornThe Golden Retriever is one of the most popular dog breeds in the U.S. due to their intelligence, loyalty, and affectionate personality. Their famous golden coat is not only beautiful; it also helps repel water when they go for a splash—which is often! 6. Labrador Retriever Photo credit: iStock/ChalabalaOne of the best dogs for swimming is the Labrador Retriever. With their muscular body and wide, otter-like tail, Labs are perfectly designed for a great time in the water. Pet parents can also train their Labs for dock diving, which combines running, jumping, swimming, and retrieving—all activities loved by Labradors. 7. Chesapeake Bay Retriever Photo credit: iStock/ktatarkaChesapeake Bay Retrievers hold the distinction of being the first retriever breed officially registered by the American Kennel Club (AKC). Their thick double coat has a layer of oil that helps repel water and provides insulation to keep them warm as they swim, even in frigid temperatures. These water-loving dogs are the official state dog of Maryland. 8. Standard Poodle Photo credit: Adobe/Teemu TretjakovOriginally bred to hunt waterfowl, Standard Poodles are generally beloved for their laid-back disposition and cute wooly coat. Thanks to their history as water dogs, Poodles enjoy swimming. Their famously curly coat is water-resistant and won’t weigh them down as they swim. 9. Curly-Coated Retriever Photo credit: iStock/WirestockThe Curly-Coated Retriever is a smart and confident retriever that won’t hesitate to leap into a lake and paddle for hours. This affectionate breed is great with kids, so pet parents with children can look forward to some lakeside fun with the whole family, pooch included! 10. Flat-Coated Retriever Photo credit: iStock/martinedoucetIntelligent and energetic, the Flat-Coated Retriever was bred to retrieve game both on land and in water. Thanks to the breed’s history, modern descendants love swimming and are well-equipped for it: Their webbed feet and water-resistant fur make these dogs ever-ready for a dip. 11. English Setter Photo credit: Adobe/Rawpixel.comThe graceful English Setter is an excellent birding dog who particularly enjoys being in and around water. This breed loves the company of their pet parents and will gladly join them on a fun summer jaunt into the nearest pool for a good, long swim. 12. Lagotto Romagnolo Photo credit: iStock/majaivaThe Lagotto Romagnolo gets its name from càn lagòt, an Italian phrase meaning “water dog” in the Italian dialect of Romagna, where this breed was used for activities like waterfowl retrieval and working in wet marshlands. Today, Lagotto dogs still love a good swim, but are often used to hunt truffles instead of waterfowl, thanks to their keen sense of smell and excellent hunting instincts. 13. Newfoundland Photo credit: iStock/stanframHailing from Canada, the Newfoundland was originally bred to work on ships. These big dogs are adept at swimming and are strong enough to rescue a grown man from drowning. Their partially webbed paws and thick, water-resistant coat allow them to maneuver through the icy waters of Canada with ease, making them well-suited for jobs in water-related environments. 14. Irish Setter Photo credit: Adobe/EgooktamuckBeautiful and athletic, the Irish Setter makes a great addition to many families due to their outgoing, playful, and affectionate nature. These dogs are strong swimmers and love being out and about with their pet parents, whether it’s at the beach or in a backyard pool. Notably, at least three sitting U.S. presidents have had Irish Setters: Harry Truman, Ronald Reagan, and Richard Nixon. 15. Nova Scotia Duck Tolling Retriever  Photo credit: Adobe/annaavThe Nova Scotia Duck Tolling Retriever, although the smallest retriever breed, is packed full of energy. These intelligent working dogs have a water-repellant double coat that serves them well while retrieving ducks and other waterfowl. When pet parents bring them close to the water or something else they desire, these vocal dogs may express their excitement by emitting playful, high-pitched howls that sound like screams. 16. Otterhound Photo credit: iStock/LourdesPhotographyThe Otterhound is a breed of dog that was specifically bred for—you guessed it—hunting otters. These dogs possess several traits that make them ideal for this job: big, webbed feet; a high tolerance for cold water thanks to their thick double coat; and an exceptional sense of smell that enables them to track an otter’s scent, even underwater and several hours after the otters have left the area. 17. Barbet Photo credit: Adobe/Annabell GsödlThe Barbet, described by the AKC as resembling “a Muppet come to life,” is a shaggy, cheerful dog that loves to swim. Pronounced as “bar-bay,” the name Barbet is derived from the French word barbe, which means beard, a reference to the breed’s hairy chin. This French water dog is often mistaken for a Goldendoodle due to their similar appearance. 18. Boykin Spaniel Photo credit: Adobe/JonathanThe Boykin Spaniel has an easygoing demeanor at home, but don’t let that fool you: they’re a keen hunter and retriever when on the job. With their webbed feet, they excel at swimming, while their luxurious brown double coat keeps them warm. This lovable water dog is native to South Carolina and was specifically bred to work in swamps and lakes. Safety Tips for Taking Your Dog Swimming If you have a water dog, don’t automatically assume they’re an avid swimmer. While some dogs may naturally have a greater affinity for the water, it’s important to introduce all dogs to the water gradually and under supervision. To teach a dog to swim, follow these steps: Begin in shallow water and gradually let them move deeper, letting your dog stop where they feel comfortable. Never force your dog into deeper waters before they are ready. Offer praise and positive reinforcement as your dog gains confidence in the water. Ensure your dog has an easy and accessible way to exit the water. Be cautious of stagnant water, which can harbor toxic algae, and fast-moving water that might be too strong for your pooch to handle. Always follow proper safety precautions, such as using a life vest and supervising your pup at all times. Featured Image: iStock/stevecoleimages"}]