[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/k8rs3628rp", "@type": "VideoObject", "duration": "PT1M40S", "name": "5637103941001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/0a4afb8319c3323899df117301712a5f35bd7ddf.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/k8rs3628rp", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/493e57be3613b7d8e2b8d95af5eb9e9d180ff22b.m3u8", "transcript": "When faced with a case of upset stomach. It's natural to wonder if you can treat your dog with something like Pepto abysmal. The active ingredient in Pepto abysmal is bismuth substances late while this famously pink over-the-counter medication can work wonders on a dog's stomach it can cause more harm than good when it comes to your dog. Dogs can take Pepto abysmal but there are some potential risks involved, which is why the decision should be left to your veterinarian Pepto vSmart can cause a dog's stool to turn a dark greenish black color.\n\nAnd as a result, it can be difficult to discern if your dog is experiencing blood in the stool a potentially serious medical issue. Additionally Pepto abysmal tablets can appear opaque on an X-ray. So if your dog's gastrointestinal signs become worse the tablet can be mistaken for a metallic foreign body and can lead to unnecessary surgery or other medical procedures Pepto abysmal may help dogs of diarrhea in certain situations. But should only be given if directed by a veterinarian and at an appropriate dose.\n\nAdditionally dogs should not take Pepto abysmal long term and cat should never be given Pepto abysmal under any circumstance. It takes kids longer to clear the drugs solicit late from their systems, which makes them susceptible to buildup of the drug to toxic levels, which could lead to lethargy and ironically, a large number of gastrointestinal problems. If your dog has an upset stomach feeding a bland diet and contacting your veterinarian if the issue worsens are the preferred methods of treatment. If other signs of illness develop like vomiting, lethargy or an appetites your dog should be examined by your veterinarian.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/general-health/can-you-give-dog-pepto-bismol?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can You Give a Dog Pepto-Bismol?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/cocker-spaniel.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/cocker-spaniel.jpg"}, "author": {"@type": "Person", "name": "Nicole LaForest, LVT, BSc, MPH", "url": "https://www.petmd.com/user/719"}, "keywords": "Dog, Adult, Over the counter medication, General health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/can-you-give-dog-pepto-bismol"}, "datePublished": "April 3, 2023", "dateModified": "May 9, 2023", "description": "Pepto is a go-to for human stomachaches, but can you give a dog Pepto-Bismol? While the medication is OK in small doses, it might not be the best choice for your dog. Learn more about using Pepto-Bismol for dogs.", "articleBody": "It’s no secret that dogs love to eat anything and everything, including things that are not necessarily good for them. If your dog has ingested something they shouldn’t have, it’s natural to reach for the medicine cabinet. But while Pepto-Bismol is a go-to aid for human stomachaches, is it safe to give to your dog? What Is Pepto-Bismol? Pepto-Bismol is an over-the-counter medication used to treat upset stomach, diarrhea, indigestion, heartburn, and nausea in humans. This medicine also coats the lining of the stomach and intestines to help protect against irritation caused by acid buildup. While it’s not recommended as a daily supplement, people have found success using this medication on occasion to relieve digestive issues. The active ingredient in Pepto-Bismol is bismuth subsalicylate, which can also be effective in treating some of the same digestive issues in dogs. But before you give your dog any medication—even one considered relatively safe—it’s important to talk with your veterinarian first. Can Dogs Have Pepto-Bismol? When used in moderation, Pepto-Bismol isn’t toxic for dogs. In fact, it’s been found to be an effective treatment for diarrhea in dogs when given in small doses. But when Pepto-Bismol is used in excess, it can actually cause vomiting and diarrhea in dogs. Again, it’s important to talk to your veterinarian before giving any medication to your dog, as there may be other underlying issues at play. Pepto-Bismol is only recommended for mild cases of diarrhea and not for long-term or recurring problems. Chronic diarrhea could be indicative of a more severe underlying issue. Potential Side Effects of Giving Your Dog Pepto-Bismol Besides causing vomiting and diarrhea, giving your dog too much Pepto-Bismol can cause dehydration, liver failure, and can have serious consequences on the kidneys. Additionally, repeated use of the medication isn’t recommended because it’s been linked to gastrointestinal issues, such as ulcers. Other possible side effects include: Constipation Black stools Loss of appetite It’s also important to note that because bismuth subsalicylate has aspirin-like properties, it should never be given to dogs that have a clotting disorder or those taking other medications containing aspirin or salicylates without first consulting your veterinarian. Additionally, Pepto-Bismol can interfere with certain antibiotics, such as tetracycline and ciprofloxacin. Make sure you tell your vet if your dog has recently taken either of these medications. These stipulations aside, Pepto-Bismol may be given safely to most healthy dogs with no known health problems. However, this drug should never be given to puppies younger than 12 weeks old because of their sensitive digestive systems and immature organs, or to pregnant or nursing dogs without consulting your veterinarian first. In general, vets recommend not giving human medications (including Pepto-Bismol) to dogs unless it’s absolutely necessary. Pepto-Bismol Dosage for Dogs The amount of Pepto-Bismol you give your dog depends on their weight and should be determined by a licensed veterinarian or veterinary pharmacist. It’s important not to exceed the recommended dosage. The best way to find out how much Pepto-Bismol is safe for your dog is by consulting with a vet who knows your dog’s health history. If you give your dog Pepto-Bismol and their stomach upset symptoms persist after two days or get worse, talk to your vet immediately. There may be other underlying issues causing your dog distress. How To Help a Dog With an Upset Stomach Pepto-Bismol isn’t necessarily the best option for treating diarrhea or an upset stomach in dogs—it depends on what is causing the discomfort in the first place. Other medications may be more effective at targeting specific causes of digestive upset, such as inflammation or infection, than this over-the-counter drug. If your dog is experiencing an upset stomach, a bland diet of shredded chicken and white rice can help to sooth their soreness. Bone broth, pumpkin, potatoes, oatmeal, plain yogurt, eggs, and white fish may also be beneficial in getting them on the road to recovery. If you notice signs of digestive upset in your dog, always talk to your vet before making any decisions regarding medical treatment. While Pepto-Bismol is OK for dogs in small doses, remember that this drug was formulated specifically for humans. If your vet decides Pepto-Bismol is the right medication for your dog, follow all instructions carefully and never give your pet more than the dosage recommended by the veterinarian. Featured Image: iStock/Liudmila Chernetska"}]