[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Tear Stains: Causes, Treatment, and Prevention", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/tear-stains-in-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/tear-stains-in-dogs.jpg"}, "author": {"@type": "Person", "name": "Rhiannon Koehler, DVM", "url": "https://www.petmd.com/author/dr-rhiannon-koehler"}, "keywords": "Dog, Adult, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/dog-tear-stains"}, "datePublished": "April 11, 2023", "dateModified": "April 11, 2023", "description": "Dogs with tear stains can be unsightly, but they&#039;re typically not caused by any health conditions. If your dog&#039;s tear stains are accumulating, here&#039;s how to take care of the issue.", "articleBody": "We’re all familiar with the unsightly reddish-brown stains around the eyes of our (typically) white-furred friends. While we hope that dogs with tear stains aren’t self-conscious about it, these stains can be bothersome to us as pet parents. What causes those unsightly tear stains? Once you understand how tear stains on dogs develop, you’ll be better equipped to remove and prevent them in the future. What Are Tear Stains on Dogs?  Tear stains on dogs are reddish-brown stains that extend from the inside corner of the eye onto or down the sides of the dog’s muzzle. While many pet parents who have a white dog are familiar with the way tear stains look, it can be difficult to recognize the characteristic color in dogs with darker fur. Tear stains are problematic for many reasons: They can signal an underlying health condition, they can lead to infection if they aren’t cleaned, and they can be unsightly for pet parents. Dogs that have a short nose and large eyes, a flat face, white fur, or congenital tear duct abnormalities are more likely to develop tear stains. Predisposed breeds include: Bulldogs Boxers Lhasa Apsos Pekingese Pugs Bullmastiffs Boston Terriers Shih Tzus Maltese Poodles Cocker Spaniels Schnauzers Dachshunds Cairn Terriers West Highland White Terriers Samoyeds Bichons Frises Labrador Retrievers Golden Retrievers What Causes Tear Stains on Dogs? In both humans and our canine companions, tears typically drain from the eyes to the inside of the nose through something called the nasolacrimal duct. This is what causes your nose to run when your eyes get teary! While our pets don’t typically cry tears when they’re sad, they still have these same ducts passing tears from their eyes to their nose. Dog tear stains are typically caused by variations in the eyelid structure that cause tears to drain onto the face instead of down the nasolacrimal duct. Photo credit: iStock/tapanuthWhile it’s possible that your dog could have a blocked nasolacrimal duct or a condition that’s causing excessive tear production, most dogs with tear stains don’t have an underlying eye problem. That said, contact your veterinarian if your pet did not previously have tear stains and is now developing them. The characteristic reddish-brown color of dog tear stains is caused by an iron-containing dye molecule called porphyrin. When the body breaks down red blood cells, porphyrin is released. This molecule is excreted in the bile, tears, saliva, and urine of dogs. When excessive amounts of tears are released from the eyes, the porphyrin in the tears will stain the fur. How To Remove Tear Stains From Dogs Removing tear stains from dogs can take a bit of experimentation to find what works best for your pet, and there isn’t a one-size-fits-all approach. Before attempting to remove tear stains, it’s important that underlying medical conditions are ruled out. If a medical condition is suspected, follow your veterinarian’s recommendations for removing the tear stains and treating your pet’s condition.   Options for cleaning your pet’s tear stains include over-the-counter eye wipes, eye washes, and other at-home remedies. These include: Optixcare Dog &amp; Cat Eye Cleaning Wipes Petpost Tear Stain Wipes for Dogs Pawstruck Facial &amp; Tear Stain Dog &amp; Cat Wipes Miracle Care Eye Clear Cleaning Pads for Dogs &amp; Cats Angels’ Eyes Gentle Tear Stain Wipes for Dogs Optixcare Dog &amp; Cat Eye Cleaner Nutri-Vet Dog Eye Rinse TropiClean OxyMed Tear Stain Remover Whitening Dog Shampoo A warm washcloth and baby shampoo Always wipe away from your dog’s eye and avoid getting the product in the eye. Cleansers can be applied to cotton balls or gentle wipes. Speak with your veterinarian before putting any new solution in your pet’s eyes. This is especially important if your pet receives any prescribed eye medications. After cleaning the area, always dry the face with a clean towel. If the staining is severe, you may need to trim the hair to help remove the tear stain. Preventing Dog Tear Stains We can’t prevent tears in some dogs, like brachycephalic breeds whose face shape causes tears to accumulate on their face. But we can prevent staining through regular face cleaning. To prevent tear stains from developing, keep the hair around your pet’s eyes trimmed short. Using a slightly damp washcloth or cotton ball, clean the area around the eyes at least twice every day. You can also use ordinary contact lens cleaning solution that contains boric acid to clean around (not in!) the eye. Some supplements claim to reduce the amount of porphyrin in the tears, which should lead to less dyeing of the fur. Supplements to try are: Angels’ Eyes Natural Chicken Flavored Soft Chew Tear Stain Supplement for Dogs &amp; Cats NaturVet Tear Stain Plus Lutein Soft Chews Vision Supplement for Cats &amp; Dogs Zesty Paws Tear Stain Bites Chicken Flavored Soft Chews Supplement for Dogs VetClassics Tear Stain Soft Chews Dog &amp; Cat Supplement Petpost Tear Stain Soft Chews for Dogs Remember that what works well for one pet may not work for another. With patience and a bit of experimentation, you can develop a routine that gets rid of tear stains and keeps your dog’s face clean. Featured Image: iStock/enviromantic"}]