[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "23 French Bulldog Health Issues Pet Parents Should Know About", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/french-bulldog-health-issues.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/french-bulldog-health-issues.jpg"}, "author": {"@type": "Person", "name": "Brittany Grenus, DVM", "url": "https://www.petmd.com/author/dr-brittany-grenus"}, "keywords": "Dog, Adult, Puppy, General health, Zoo French Bulldog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/french-bulldog-health-issues"}, "datePublished": "June 5, 2023", "dateModified": "August 30, 2023", "description": "French Bulldogs are the most popular dog in the U.S., but they also have a lot of health considerations. Before you bring home a puppy, here’s what to know about common French Bulldog health issues.", "articleBody": "In 2022, the French Bulldog officially surpassed the Labrador Retriever as the most popular dog breed in the U.S., according to the American Kennel Club (AKC). While their short, stocky stature and “smush-nose” face make Frenchies adorable, they don’t come without drawbacks. In fact, one study found that French Bulldogs are more likely to develop over 20 common health disorders compared with other dog breeds. While many of these health issues can be treated, they often require surgery or are chronic (requiring lifelong management), and tend to come with expensive vet bills. While pet insurance is now recommended for most pets, it’s especially helpful in managing the medical costs that typically come with French Bulldogs. Common Health Issues for French Bulldogs Before bringing home a French Bulldog puppy, it’s important that you’re familiar with the many health conditions to which they’re predisposed. Here are some of the most common French Bulldog health issues and how they can be managed. 1. Brachycephalic Obstructive Airway Syndrome (BOAS) “Brachycephalic” is a term that translates to “short head.” It’s used to describe all flat-faced breeds, including French Bulldogs, Pugs, English Bulldogs, and Pekingese. Humans created these breeds by selectively breeding dogs with shorter heads. But there are some additional traits (such as narrow nostrils and a small windpipe) that were accidentally bred into them that can make it very difficult for these dogs to breathe. The result is brachycephalic obstructive airway syndrome (BOAS). While many aspects of a Frenchie’s troublesome anatomy can be surgically corrected, this often needs to be done by a surgical specialist and doesn’t come without its risks. Talk to your veterinarian to determine if your pet would be a good candidate. 2. Heatstroke Dogs don’t sweat like humans do—instead, they cool their bodies by panting. When dogs pant, moisture is evaporated from the mouth and upper respiratory tract, which helps them stay cool. When a dog’s airways are blocked due to BOAS, panting isn’t as effective, and it can be very difficult for these pets to cool down. This means French Bulldogs are predisposed to heatstroke, so it’s important to keep them inside on very hot and/or humid days. When you do let your Frenchie outside, only do so in the morning or evening when it’s cooler. It’s also important that they always have water and shade whenever they’re outdoors. 3. Sensitive Skin While the skin and tail folds on French Bulldogs are traits many find cute, the warm and moist environment those folds create predisposes this breed to skin infections. Pet parents should regularly clean their Frenchie’s skin and tail folds to help prevent these infections. French Bulldogs are also genetically predisposed to allergies. However, unlike in humans, allergies in dogs often present as skin issues—with the paws, belly, skin folds, and ears being most affected. Common signs of allergies include: Itchiness: Licking, chewing, and scratching excessively at the paws or body Redness of the skin Rashes Hot spots Hair loss Red bumps Acne Skin allergies most often present when a Frenchie is 1-3 years old. Unfortunately, determining the specific food or environmental allergens can be difficult and frustrating, as the process can take months to years and cost upwards of $1,000. These dogs also often have more than one allergy, which can make it that much harder to diagnose and treat. Fortunately, there are several treatment options available. However, these are often lifelong and can add up in cost over the years. 4. Ear Infections Frenchies are predisposed to ear infections for two reasons: 1. Allergies, which often cause ear infections in dogs 2. The shape of their ear canals French Bulldogs have narrower-than-normal ear canals, making it harder for debris and moisture to make their way out of the ear canal once it gets in. This makes it easier for infections to develop. Ear infections can easily be treated, but chronic ear infections in dogs can also change the skin that lines the ear canals. This further narrows the canal and leads to even more ear infections. Chronic ear infections can also predispose dogs to middle/inner ear infections (infections behind the ear drum), which can lead to neurologic issues such as head tilt or feeling off balance. Frenchies come with a slew of medical problems that can cost a lot of money to manage. You need to be financially prepared to handle any health issues that develop, and purchasing pet insurance is highly recommended.5. Birthing Issues French Bulldogs are rarely able to give birth naturally and almost always need a cesarian section (C-section). The reason? Again, it comes down to their breeding. Frenchies have been bred to have notoriously large heads but very narrow hips. This combination can make it difficult for moms to give birth naturally, as the large heads of the puppies cannot always fit through their mom’s narrow hips. This causes the puppies to get stuck in the birth canal, which puts both the mom and puppies at risk of death. 6. Back Injuries French Bulldog puppies can be born with a spinal deformity known as hemivertebra, or an incomplete vertebra (spinal bone). While this deformity does not always cause issues, it can result in compression of the spinal cord, which can cause weakness in the hind legs, as well as fecal and urinary incontinence. If compression of the spinal cord does occur, advanced imaging techniques such as myelography, CT scans, or MRIs are usually required to diagnose it. Mild cases of spinal cord compression can often be treated medically but severe cases may require surgery. 7. Higher Risk with Anesthesia The French Bulldog’s breathing issues go hand-in-hand with an increased risk under anesthesia. Because of their narrower trachea and congenital airway abnormalities, it can be much more difficult to insert an endotracheal tube, which is needed to help dogs breathe under anesthesia. When recovering from anesthesia, if their endotracheal tube is removed too soon, they may not be awake enough to compensate for their airway issues when breathing. This can cause respiratory distress and the need to be re-intubated. Frenchies are also more susceptible to inflammation of their already small airway after anesthesia, which, again, puts them at higher risk for respiratory distress. Frenchies are also predisposed to several stomach issues, which puts them at increased risk for vomiting and regurgitating, either after their pre-medication is given (prior to anesthesia to help them relax) or while under anesthesia. This then increases their risk of developing aspiration pneumonia after anesthesia. Because of these risks and issues, veterinarians typically take extra precautions with this breed to help mitigate risk. 8. Cataracts Cataracts are a hardening of the eye lens, causing it to be opaque (cloudy) rather than clear. As cataracts progress, they eventually lead to blindness. French Bulldogs are genetically predisposed to cataracts, and the only treatment is surgery.  9. Corneal Dystrophy and Corneal Ulcers Corneal dystrophy is another French Bulldog health issue that causes the cornea (the outer surface of the eye) to become opaque (cloudy). In general, the disease is not considered painful and doesn’t seem to significantly impact a dog’s vision. However, as it progresses, it does make dogs more susceptible to corneal ulcers (scratches on the surface of the eye), which are painful and require medical treatment. 10. Ocular Dermoids Dermoids are a growth of skin in an abnormal place. French Bulldogs are predisposed to having dermoids in their eyes. This is a congenital condition typically present at birth. While the dermoid itself isn’t necessarily uncomfortable, they often grow hair, which can cause irritation and inflammation of the eye.   11. Distichiasis Distichiasis is an abnormal growth of eyelashes in dogs. Instead of growing out of their normal hair follicles along the eyelid, they can grow out of the glands along the edge of the eyelid. This causes the eyelashes to rub on the eye, which can lead to discomfort, inflammation, and corneal ulcers. This can be corrected with surgery. 12. Entropion Entropion is an inward rolling of the upper and/or lower eyelids. It’s an inherited trait in French Bulldogs and can be prevented with good breeding. When the eyelid rolls inward, the hairs on the eyelid may touch the eye. This can cause irritation, increased tearing, conjunctivitis, and corneal ulcers. Surgery can correct the issue. 13. Tear Stains Dogs and cats have a duct that runs from the inner corner of the eye down through the nose. This duct is typically where most tears from the eye are drained. Frenchies are predisposed to the duct’s opening being too narrow—or not developing at all. This causes their tears to run down their face, causing brown or rust-colored tear staining. Pet parents can keep their dog’s face clean with frequent eye wiping. 14. Retinal Dysplasia Retinal dysplasia is an inherited trait in dogs that causes abnormal formation of the retina (the part of the eye that sends images to the brain). Mild cases don’t typically result in any issues, but in moderate to severe cases, pets may have difficulty seeing or may even be blind. Unfortunately, there is no treatment for this disorder. 15. Cherry Eye Dogs and cats both have a third eyelid in the inner corner of the eye. Cherry eye occurs when the tear gland attached to this third eyelid prolapses (flips outward). This often appears as a pink or reddish round mass at the inner corner of the eye. Frenchies are genetically predisposed to this disease. Fortunately, it’s not painful, but it can lead to chronic dry eye if left untreated. Surgery is needed to correct this. 16. Chronic Diarrhea French Bulldogs are predisposed to a number of gastrointestinal issues. One of the most common is food allergies, which can cause off-and-on diarrhea or soft stools. Frenchies are also genetically predisposed to inflammatory bowel disease (IBD), which causes chronic inflammation of the intestinal tract, leading to chronic diarrhea. Treatment for both allergies and IBD is lifelong, and often requires special prescription diets and medication. 17. Hiatal Hernia Another commonly inherited health issue in French Bulldogs is a hiatal hernia. This occurs when the diaphragm doesn’t develop properly, allowing the stomach to slide between the abdomen and chest, causing chronic regurgitation. Regurgitation most commonly occurs after eating and is a passive process where food slides back up the throat. This is different from vomiting, an active process that involves contraction of the stomach. Surgery can be performed to fix the diaphragm so the stomach can no longer slide through it. 18. Pyloric Stenosis French Bulldog puppies can also be born with an abnormality known as pyloric stenosis. The pylorus is a valve-like structure that allows food to pass from the stomach to the intestines. Brachycephalic dogs such as French Bulldogs are genetically predisposed to a thickening of this structure, resulting in narrowing of the opening that passes food into the intestines. Common symptoms include regurgitation, decreased appetite, weight loss, and dehydration. 19. Hip Dysplasia Hip dysplasia is a commonly inherited joint issue in French Bulldogs that results in a loose hip joint. This typically leads to arthritis and degenerative joint disease, which causes chronic pain. Medical management with pain medications, joint supplements, and physical therapy can be used to help with symptoms. Dogs with severe cases may need surgery. Responsible French Bulldog breeders will often have their dogs get special X-rays to ensure they don’t continue to pass on this trait. Always ask your breeder for all health information on your Frenchie puppy and their parents. 20. Luxating Patella Luxating patella occurs when the kneecap slips out of place. You might see your pet with luxating patella suddenly limp for a few steps while running. They may kick out their leg a few times, then continue running like nothing happened.  In mild cases, this condition can cause arthritis. Severe cases may need surgery to correct it. 21. Dental Disease Dental disease is the most common chronic disease in dogs and cats. Frenchies and other brachycephalic breeds are even more predisposed. All dogs have 42 teeth, whether they’re a Great Dane or a tiny Yorkie. But fitting all 42 teeth into a small dog’s mouth means that overcrowding is a huge issue, especially if you have a shortened jaw like a French Bulldog does. Overcrowding makes tartar build up faster. Frenchies also usually have an underbite, which further causes tartar buildup. As the tartar builds up on the teeth, it gets under the gumline, leading to gingivitis and deterioration of the gums and surrounding bone. Pet parents need to brush their French Bulldog’s teeth regularly using a soft bristle toothbrush and dog-specific toothpaste. You will also need to have your dog’s teeth professionally cleaned as your vet recommends. 22. Bladder or Kidney Stones Intact adult male French Bulldogs are predisposed to bladder and kidney stones made of a crystal called cystine. The cause for this is suspected to be genetic, but the gene has not yet been identified. Bladder and kidney stones can be incredibly uncomfortable. Fortunately, they can often be dissolved with a prescription diet that adjusts the acidity of the urine to help dissolve the stone. Surgery can also remove the stones directly from the bladder, which is required if the stone blocks the dog’s ability to urinate or if the stones aren’t dissolving well with the diet. 23. Pulmonic Stenosis Pulmonic stenosis is a congenital heart disease in which the pulmonary valve and artery (the valve and artery that lead from the heart to the lungs) are narrowed. This makes it harder for the heart to pump blood to the lungs to pick up oxygen, and in severe cases can lead to congestive heart failure. While not all cases require treatment, those that do will need a relatively high-risk procedure to widen the pulmonary artery and valve. Because this is an inherited trait, a good French Bulldog breeder will have a cardiologist assess their dogs prior to breeding.  Tips for French Bulldog Care French Bulldogs can be great dogs. But if you are going to get one, you need to be prepared. 1. Budget for Medical Care Frenchies come with a slew of medical problems that can cost a lot of money to manage. You need to be financially prepared to handle any health issues that develop, and purchasing pet insurance is highly recommended. 2. Keep Up With At-Home Care As soon as you bring home your French Bulldog puppy, a primary care veterinarian should evaluate them. Always follow through with wellness exams, and ask your vet what at-home care you should be working into your routine—especially when it comes to your Frenchie’s skin, teeth, and weight management. 3. Find a Reputable Breeder Because French Bulldogs are purebred dogs, most people find them through breeders. But it can be difficult to determine who is a responsible breeder and who isn’t. It’s incredibly important to only work with an ethical, reputable breeder. To make sure you’re bringing home a healthy, well-cared-for puppy: Ask your breeder if they are registered with the American Kennel Club (AKC). Check if they belong to the French Bull Dog Club of America—the organization recognized by the AKC as the official breed supervisors. Ask your breeder if your puppy’s parents have Canine Health Information Center (CHIC) numbers. This is a number given by the Orthopedic Foundation for Animals once the pet has had the recommended testing for breed-specific issues. You also can use this number to check the results of the tests through the Orthopedic Foundation for Animals website. The breeder should ask you a lot of questions as well. This means they care about making sure their dogs go to the right home and that the breed is a good fit for you. They will want to meet you, whether in-person or via a video call. The breeder will let you look at their facilities and be proud of their setup. The mother should be on site with the puppies. Good breeders focus on one breed, so there shouldn’t be many other breeds for sale. You may have to wait. Good breeders don’t have too many breeding females and don’t overbreed them, so you might be put on a waiting list. The puppies won’t be allowed to go home with you until they are at least 8 weeks old. A good breeder will give you veterinary records for your puppy. Avoid breeders who promote “rare” or “exotic” coat colors or patterns. These breeders typically prioritize making a quick profit off of coat color rather than ensuring they’re breeding for good health. Featured Image: Adobe/Atharia"}]