[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "25 Small Dog Breeds To Fit Any Lifestyle", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/small-dog-breeds.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/small-dog-breeds.jpg"}, "author": {"@type": "Person", "name": "Emily Sanders", "url": "https://www.petmd.com"}, "keywords": "Dog, General health, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/small-dog-breeds"}, "datePublished": "August 7, 2023", "dateModified": "August 7, 2023", "description": "There’s a lot to love about small dog breeds. And while these cute, small dogs are adorable, they’re not all the same. Here’s what to know about the best small dog breeds.", "articleBody": "Cute and compact, there’s a lot to love about small dog breeds. But there are also lots of different types of small dogs, and no two are exactly alike. Here are some of the best toy and small dog breeds that can fit into your family. 1. Chihuahua Photo credit: iStock/Ziga PlahutarWeight: 6 pounds or less Height: 5–8 inches Chihuahuas are charming little dogs who make adorable companions thanks to their sassy personalities and spunky nature. One of the longest-living dog breeds, Chis are full of energy and liven up any room they’re in—which is usually whatever room their beloved pet parents are in. 2. Pomeranian Photo credit: iStock/romasetWeight: 3–7 pounds Height: 6–7 inches With their cute strut and beautiful coat, Pomeranians are a popular lap dog. But they weren’t always the little dog breed we know today—Pomeranians are actually descended from sled dogs, and their predecessors weighed around 30 pounds. But once they captivated Queen Victoria and became more popular, Poms were selectively bred to be the tiny, cute dogs we know today. 3. Yorkshire Terrier Photo credit: iStock/STOWEN SETOWeight: 7 pounds Height: 7–8 inches The Yorkshire Terrier, or Yorkie, is a playful, energetic, and affectionate dog. Like other small dog breeds, Yorkies don’t handle the cold well and may be prone to hypoglycemia (low blood sugar). 4. Shih Tzu Photo credit: iStock/vitapixWeight: 9–16 pounds Height: 9–10 inches Small but mighty, the Shih Tzu was bred by Buddhist monks in Tibet to look like a little lion. These tiny, cute dogs are very attached to their pet parents and their long and luxurious coats need lots of attention to stay tangle-free. This breed does best with an attentive family who will brush them a few times throughout the week. 5. Papillon Photo credit: iStock/Oleksandra VyshnovaWeight: 5–10 pounds Height: 8–11 inches Elegant and stylish, Papillons are named after their wispy ears that resemble butterfly wings (papillon means “butterfly” in French). This small dog is also highly intelligent and needs ample activity and mental stimulation to ward off boredom. Some of the Papillon’s favorite pastimes are taking long walks, running an agility course, and playing with their favorite people. 6. Toy Poodle Photo credit: iStock/gollykimWeight: 4–6 pounds Height: 10 inches or less Toy Poodles are the smallest of the Poodle breeds (the other two being the Standard and the Miniature). Like their larger cousins, Toy Poodles are smart and playful, and they probably don’t mind bath night (which should be every two to four weeks). 7. Affenpinscher Photo credit: Adobe/Ilona DidkovskaWeight: 7–10 pounds Height: 9–12 inches German for “monkey terrier,” it’s easy to see how the Affenpinscher got their name: Their distinctive flat, bearded face makes this small dog breed look more like a monkey than a pup. Like other little dogs, Affenpinschers have a long lifespan that can reach 15 years or more. 8. Maltese Photo credit: Adobe/EvaWeight: 7 pounds or less Height: 7–9 inches The Maltese is a small white dog known for their straight, sweeping curtain of fur. Despite their long coat, this toy breed isn’t a heavy shedder and is often labeled as “hypoallergenic” (although there’s no truly hypoallergenic dog).  Still, Maltese can be a good choice for people with allergies. 9. Bichon Frise Photo credit: Adobe/PepsonaWeight: 12–18 pounds Height: 9–12 inches Another small white dog is the Bichon Frise. But what these dogs lack in size, they make up for in heart. Bichons are known for being curious, friendly, and eager-to-please, which makes them easy to train in both basic commands and fun tricks. 10. Biewer Terrier Photo credit: iStock/VSFPWeight: 4–8 pounds Height: 7–11 inches Pronounced “beaver,” Biewer Terriers are cute dogs that are small and love their family, making them ideal lap dogs. Originating from Germany, they are descendants of Yorkies, but with a unique genetic twist: they carry the rare piebald gene, resulting in white fur with patches of color. 11. Brussels Griffon Photo credit: Adobe/otsphotoWeight: 8–10 pounds Height: 7–10 inches Brussels Griffons are adorable and sociable companions. Their wide-set eyes give them a childlike, expressive face that adds to their endearing “Velcro dog” personality. These small dogs are equally happy to exercise and be a little couch tater tot. Here’s a fun fact: Griffons were the inspiration for Ewoks in Star Wars. 12. Alaskan Klee Kai Photo credit: iStock/Mary SwiftWeight: 6–25 pounds Height: 12–17 inches The Alaskan Klee Kai is a small dog breed that comes in three variations: Toy, Miniature, and Standard. They are a new and rare breed that began with one small Siberian Husky in the 1970s. Like Huskies, Alaskan Klee Kai dogs have an independent, talkative, and determined spirit. 13. Cairn Terrier Photo credit: Adobe/ksuksaWeight: 13–14 pounds Height: 9–10 inches Cairn Terriers are shaggy, athletic dogs bred in Scotland to hunt foxes and other small mammals. The breed saw a boost in popularity after 1939, when a Cairn Terrier named Terry starred as Toto in The Wizard of Oz. 14. Japanese Chin Photo credit: Adobe/jenngarciaWeight: 7–11 pounds Height: 8–11 inches An ancient dog breed with a noble past, Japanese Chin were once popular among Japanese aristocracy. With a long, silky coat and expressive eyes that give them a look of wonder, Chin are regal and elegant while still being tiny, cute dogs. 15. Bolognese Photo credit: Adobe/SasaStockWeight: 6–10 pounds Height: 10–12 inches Hailing from Bologna, Italy, Bolognese are small, fluffy dogs with wild white hair. Another ancient breed, these pups were often given as gifts among European nobility. Today, they’re a good-natured, easygoing lap dog. 16. Cavalier King Charles Spaniel Photo credit: iStock/Nigel WigginsWeight: 13–18 pounds Height: 12–13 inches The Cavalier King Charles Spaniel is a toy dog bred to keep laps warm. These sweet puppies were especially beloved by King Charles I and his son, Charles II, and were eventually named after them. Clever, friendly, and eager to please, CKC spaniels are the perfect choice for first-time pet parents. 17. Italian Greyhound Photo credit: Adobe/veeraWeight: 7–14 pounds Height: 13–15 inches Don’t be fooled by their name—unlike Greyhounds that can reach 70 pounds, Italian Greyhounds are a little dog breed. Standing just over 1 foot tall at the shoulders, Italian Greyhounds are sociable and sensitive. They are best suited for families with older children who know how to safely play with these small, slender dogs. 18. Chinese Crested Photo credit: Adobe/SuperStockWeight: 8–12 pounds Height: 11–13 inches The Chinese Cresteds is an ancient breed that comes in two varieties: powderpuff (with silky hair all over their little body) and hairless (with hair only on their head, tail, and ankles). With either type you choose, your Crested will need a lot of care to stay in tip-top shape, with powderpuffs requiring attentive grooming and hairless dogs needing special skincare. 19. Havanese Photo credit: iStock/Dorottya_MatheWeight: 7–13 pounds Height: 8–12 inches The only dog native to Cuba, Havanese are small, fluffy dogs who bounce through life. They are highly affectionate and get along well with children and other dogs, making them excellent family pets. These happy dogs are very sociable and love the company of people, so pet parents should be ready to give them lots of attention. 20. Lhasa Apso Photo credit: iStock/CapuskiWeight: 12–18 pounds Height: 11 inches or less Lhasa Apso roughly means “bearded lion dog,” and it’s not hard to see why. With their graceful mane-like coat, these elegant toy dogs resemble small lions. Lhasa Apsos originated in Tibet, where they were bred to be watchdogs and are considered sacred and symbols of good fortune. These dogs are affectionate and loyal to their family but may be wary of strangers due to their breeding history. 21. Miniature Schnauzer Photo credit: Adobe/everydoghasastoryWeight: 11–20 pounds Height: 12–14 inches Of the three types of Schnauzers, the Miniature Schnauzer is the smallest. These intelligent and charming dogs need lots of exercise due to their history as farm dogs. Give them a job, and these bearded puppies will have the time of their life. Mini Schnauzers also don’t shed much, making them good pets for families with allergies. 22. Border Terrier Photo credit: Adobe/bobWeight: 11–16 pounds Height: 12–15 inches The scruffy and scrappy Border Terrier is the smallest of the long-legged terriers. These little dogs are bursting with energy and will thrive with at least an hour of exercise every day. Border Terriers have a distinctive “otter head” that pet parents may find irresistibly cute. 23. Miniature Pinscher Photo credit: iStock/mgstudyoWeight: 8–10 pounds Height: 10–13 inches Hailed as the “king of toy breeds,” the Miniature Pinscher doesn’t let their small size slow them down. The Min Pin packs a bold personality despite their stature and needs plenty of action to stay happy. This German toy breed sports a short coat that needs minimal maintenance. 24. Toy Fox Terrier Photo credit: Adobe/VincentWeight: 4–9 pounds Height: 8–12 inches Standing less than 1 foot tall, the Toy Fox Terrier is feisty and playful. Their mischievous antics are typically a great source of entertainment for pet parents. These terriers overflow with energy and will benefit from regular outdoor exercise before coming home and running around your living room. 25. Silky Terrier Photo credit: Adobe/Dixi_Weight: 10 pounds Height: 9–10 inches Though they look a lot like Yorkies, the Silky Terrier is a separate breed that is native to Australia. This little dog is surprisingly energetic for their size and loves having a job to do. Pet parents need to provide Silkies with plenty of exercise to keep them happy, and Silkies also have a long, luscious coat that needs to be brushed every day. Featured Image: Adobe/annaartday"}]