[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Is Non-Anesthetic Teeth Cleaning Safe for Pets?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/anesthesia-free-dental.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/anesthesia-free-dental.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Adult, Dental health, General health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/is-non-anesthetic-teeth-cleaning-safe"}, "datePublished": "May 11, 2023", "dateModified": "May 11, 2023", "description": "Putting a pet under anesthesia can be scary, but it&#039;s safer than you&#039;d think. In fact, non-anesthetic teeth cleanings can be dangerous and not effective. Learn why here.", "articleBody": "Dogs and cats need routine dental care just like humans. Without it, plaque and tartar build up on a pet’s teeth, which eventually can lead to painful gingivitis, periodontal disease, infections, tooth loss, and even problems in the rest of the body (heart disease, for example). Even with good home dental care, pets will eventually need a professional dental cleaning. This really shouldn’t be too surprising—this is what is required with our own teeth, after all. But there is one big difference between how our teeth and our pet’s teeth should be cleaned: Pets need to be put under anesthesia for the cleaning to be safe and effective. Pet Dental Cleanings With Anesthesia Here’s a general outline of everything that’s involved in a dental cleaning performed under anesthesia at a veterinary office: The veterinarian will examine your pet to determine if there are any underlying health problems. They may recommend bloodwork and other tests if these haven’t been done recently. The pet will receive injectable “pre-meds” to relieve anxiety and discomfort. Veterinary staff will place an intravenous catheter and give injectable anesthetics through it. The catheter will also be used to administer fluids that support your pet’s blood pressure. The veterinarian will then put an endotracheal tube in place so they can give your pet oxygen and anesthetic gasses. The endotracheal tube also prevents fluid and debris in your pet’s mouth from getting into their lungs, which can lead to pneumonia. Your pet will be attached to equipment that helps the veterinarian monitor their blood pressure, heart rate and rhythm, and more. The veterinarian will fully examine your pet’s mouth. The mouth is rinsed with an antiseptic to decrease the amount of bacteria. The teeth are cleaned with both an ultrasonic scaler (a tool that vibrates at high speed) and a hand scaler. All surfaces of each tooth are cleaned, including under the gumline and between the teeth. The mouth is rinsed and an electric polisher is used to smooth all tooth surfaces. If the teeth are not polished, small scratches left on the teeth make it easier for plaque and tartar to adhere. After polishing, the mouth is rinsed again and a fluoride treatment can be applied. Dental probes are used to measure the depth of any pockets that form between tooth and gum. Abnormally deep pockets require treatment. Dental X-rays are taken to evaluate structures that can’t be seen with the naked eye. Additional treatments may take place depending on what has been discovered. What Is Non-Anesthetic Teeth Cleaning? So, what’s involved in a non-anesthetic teeth cleaning? And why isn’t it as good? Without the benefit of anesthesia, providers cannot see a pet’s entire mouth or clean all parts of the teeth. An anesthesia-free teeth cleaning typically goes something like this: The pet will be laid on their back or side and restrained. The provider will perform a limited oral exam. The mouth may be wiped down or rinsed with an antiseptic to decrease bacteria. Plaque and tartar will be removed from the visible parts of the teeth with a hand scaler. The provider may try to clean under the gums and use a dental probe to measure pockets, if possible. The parts of the teeth that can be reached will be polished (hopefully!) and the mouth rinsed. Is Non-Anesthesia Teeth Cleaning OK for Pets? Even though a pet’s teeth may look better after a non-anesthetic teeth cleaning, providers readily admit they can’t remove all tartar. Their services are not as thorough as what can be provided by a veterinarian when a pet is under anesthesia. This means that plaque and tartar will return quickly. An anesthesia-free teeth cleaning is essentially a cosmetic procedure, and the cosmetic benefits won’t last very long. Plus, a pet’s mouth can’t be fully examined without anesthesia. Oral health problems can be missed, left untreated, and allowed to progress until they become even more serious. While the desire to avoid anesthesia is understandable, trying to clean a pet’s teeth without it isn’t without risk either. Being restrained for long periods can be very stressful for pets. Having your teeth scraped and gums probed isn’t the most pleasant experience (think of your last trip to the dentist), and dental instruments are sharp! One quick turn of the head and your dog or cat may have a laceration or puncture wound in their mouth. And, without an endotracheal tube in place, the debris and fluid in a pet’s mouth can be inhaled into the lungs, putting them at risk for pneumonia. No major veterinary organization, including the American Veterinary Medical Association, American Animal Hospital Association, and the American Veterinary Dental College, recommends non-anesthesia teeth cleaning for pets. How Safe Is Anesthesia for Pets? Anesthesia isn’t as risky as many pet parents think, even if your dog or cat is elderly or has a chronic condition. Your veterinarian will fully evaluate your pet’s health (including with diagnostic testing, if necessary) and can tailor the anesthetic protocol they use to meet your pet’s individual needs. Your pet will be closely monitored while under anesthesia so that any physiologic changes, like a slow heart rate or low blood pressure, can be addressed quickly. For almost every pet, the only downside of anesthesia is being a bit groggy for a few hours after their dental procedure. A little grogginess is worth it when you consider all the benefits of a thorough exam, cleaning, and treatment. Why Do Some Vets Offer Non-Anesthetic Teeth Cleaning? With the benefits of dental care performed under anesthesia being so obvious, why do some vets even offer non-anesthetic teeth cleanings? Their thought is most likely that a little dental care is better than nothing for those pets whose parents won’t agree to anesthesia, but that doesn’t make it a good option for you and your pets. The best way to limit the number of teeth cleanings a pet will need over the course of their life is to brush their teeth daily. Talk to your veterinarian about types of home pet dental care that will keep your pets happy and healthy. Featured Image: Adobe/worlock1"}]