[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "CBD Oil for Dogs: What You Need to Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/iStock-183336016.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/iStock-183336016.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Adult, Anxiety, General health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/CBD-for-dogs-what-you-need-to-know"}, "datePublished": "July 11, 2023", "dateModified": "September 18, 2023", "description": "CBD for dogs has become popular over the last decade, but it’s not without side effects and considerations before giving to your pup. Dr. Barri Morrison shares what research has been conducted on CBD for dogs and why it’s important to chat with your veterinarian first.", "articleBody": "The use of cannabis and cannabis-derived products has been steadily and rapidly increasing in the last decade. CBD, or cannabidiol, is an oil that is extracted from the cannabis (marijuana) plant or hemp (a cousin to cannabis) plant. CBD can also be made synthetically in a laboratory. While there have been studies that suggest that CBD has medicinal properties, there has not been enough research to determine its long-term safety, side effects, or effectiveness. CBD is used in people to treat chronic pain, anxiety, inflammation, and to help improve sleep, although the only CBD product approved by the FDA is a prescription drug to treat seizures in humans. Although you might be tempted to try giving your dog CBD, it’s not advised to do so without a veterinarian’s approval and a discussion about the benefits and, more importantly, the risks to your dog. The American Veterinary Medical Association (AVMA) is a nonprofit organization that represents and helps to uphold standards for veterinarians in the United States. The AVMA develops stances on key issues and advocates for veterinarians and their pet patients. Its stance on CBD use in dogs is that there is not enough science behind it suggesting that it might be helpful for dogs. What Is CBD? Cannabis is a plant with more than 80 biologically active ingredients. CBD (cannabidiol) is the second most prevalent active ingredient in marijuana, with the first being THC (tetrahydrocannabinol). The difference between CBD and THC is that THC has a psychoactive property associated with the feeling of being “high,” and CBD does not. CBD is almost always in oil form, while THC can be in many forms, including the green flower that most people are familiar with. CBD has been suspected to have many medicinal properties. It works in people by attaching to specific receptors in the central nervous system (brain and spinal cord), intestines, muscles, bones, liver, spleen, heart, and lungs to enhance certain body functions. Can Dogs Take CBD? At this time, there is not enough research on the use of CBD in dogs to determine if it is safe for dogs; thus, it’s extremely important to talk to your dog’s veterinarian before giving them a CBD product. At that time, your vet will discuss the pros and cons of CBD for dogs and determine if the risk is worth the reward. Studies have shown that CBD can affect liver enzymes, which are involved with metabolism of medications. This means that the risk is not only in the CBD itself but also how it might affect your dog if they are on other medications. There are currently no products for dogs containing CBD that are FDA-approved.Because CBD is readily available, it might be tempting to start your dog on it for a variety of reasons. But doing so is never recommended unless you have your veterinarian’s explicit approval and recommended dose range. Possible Benefits of CBD for Dogs Some topics of studies already performed and studies that are ongoing to determine if there is any beneficial use of CBD in dogs include: Pain associated with arthritis Seizures Atopy (heightened tendency to develop allergic diseases) Fear-based aggression Stress and anxiety Cancer treatment, especially inhalant CBD for lung cancer CBD metabolism and its effect on the liver Inflammatory bowel disease (IBS) Symptoms and Signs of CBD Toxicity (or Adverse Effects) in Dogs  CBD, however, is not without its side effects in dogs. These side effects can be seen if your dog ingests too much CBD or is having a negative reaction to a CBD product: Diarrhea Vomiting Restlessness Slow or fast heart rate Rapid breathing Pale gums and other mucus membranes Contact your veterinarian immediately or bring your dog to the nearest animal hospital if they are experiencing any of these signs or they are showing any unusual behaviors while taking a CBD supplement. Should You Give Your Dog CBD for Pain? One of the first studies done involving CBD and dogs was performed at Cornell University’s College of Veterinary Medicine. The study was developed to see how CBD can help dogs with pain management. In the study, more than 80% of dogs with osteoarthritis experienced a decrease in their pain. A reduction in pain like this leads to a dog being more comfortable and more active. While encouraging, because the dosing was very high, some concern was raised about CBD’s short-term safety. So instead of reaching for a CBD product for your dog’s pain, it is always recommended that your dog first be examined by their veterinarian and that traditional pain and anti-inflammatory medications be used first, depending on the underlying condition. Joint supplements and fish oils are also great supplements to help dogs who are in pain from arthritis.   Should You Give Your Dog CBD for Seizures? Colorado State University (CSU) conducted a study working with hemp-derived CBD in dogs that have epilepsy, or seizure disorder. The goal of using CBD in dogs with seizures would be the same as with other anti-seizure medications—decrease the frequency of seizures while having minimal side effects. In this study, 89% of dogs had fewer seizures, although all the dogs also remained on traditional anti-seizure medications such as phenobarbital or potassium bromide while taking CBD. Another study at CSU by a veterinary neurologist is continuing to evaluate CBD’s safety and efficacy in dogs with uncontrolled seizures, as well as its possible interference with other medications. Because no conclusions have been drawn, at this time it is not recommended that CBD be given to dogs with seizures. Instead, seek traditional therapies for your dog with the guidance of your veterinarian. Should Your Give Your Dog CBD for Behavioral Issues? Cornell University remains at the forefront of the research into CBD use in dogs. A recent study was done giving dogs a CBD chew prior to a stressful event. Of the dogs studied, 83% showed a decrease in stress or anxious behaviors. The conclusion was that further research needs to be done using different CBD products and different dosages to understand how to effectively use CBD to treat anxiety in dogs. A study in western Australia is looking at CBD use for aggressive dogs and has shown promise in helping reduce aggression in shelter dogs. While these two studies might lead to CBD use in dogs for behavioral issues, it is currently recommended that you work with your veterinarian or a certified dog trainer to help resolve these issues with behavior modification and/or medications. Supplements such as Adaptil® Calm, Purina® Pro Plan® Calming Care, and VetriScience® Composure are also useful for minor behavioral issues in dogs. How Much CBD Can Dogs Have? While there have been some studies (and more ongoing) evaluating CBD use in dogs, it is not recommended at this time unless your veterinarian approves its use as safe for your dog.While many aspects about CBD use in dogs are still unknown, studies are slowly being performed to answer those questions and they do seem promising. Even though research studies might indicate that CBD use could be beneficial for dogs with certain conditions, it’s more important to know how dogs react to this supplement in a clinical situation, and that information is not yet available. Featured Image: iStock.com/timsa"}]