[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How To Choose the Right Crate Size for Your Dog or Puppy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-10/dog-crate-sizing.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-10/dog-crate-sizing.jpg"}, "author": {"@type": "Person", "name": "Rebecca Bermingham, CVT", "url": "https://www.petmd.com/author/rebecca-bermingham"}, "keywords": "Dog, Adult, Puppy", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/crate-sizing-for-dogs"}, "datePublished": "October 10, 2023", "dateModified": "October 10, 2023", "description": "There are lots of dog crate sizes, but which is right for your dog? Learn how to choose the right crate size for a dog or puppy here.", "articleBody": "Crates provide a safe haven for dogs, appealing to their desire to seek comfort in cozy spaces. Dogs are commonly referred to as den animals, and it’s instinctual for them to seek the safety of dens in times of illness, injury, fear, while raising young, or when they simply need a safe place to rest. By providing an appropriate place for our dogs to decompress and relax in our homes, we can improve their quality of life. Crate training can also be used to ensure our pets’ safety when they’re not supervised and to prevent bad habits like chewing. And when it comes to house training puppies, a well-fitting crate can be an indispensable tool. But with so many options for dog crate sizes and styles, it can feel overwhelming to choose the perfect one for your dog. Here’s what to know. Choosing the Right Dog Crate Size Here are some parameters that can be used to establish if a crate is appropriately sized for your dog.  The dog should be able to stand up with ease inside the crate, fit through the door effortlessly, and comfortably turn around. When they sit in the crate, there should be at least 2 inches of clearance above their head. When they lie on their side, they should be able to fully extend their limbs.  Keep in mind that if any of these parameters are too tight for the pet, it’s best to go to the next size up. Not having enough space in the crate can lead to negative feelings about the space and make crate training unpleasant for the pet. But having a too-large dog crate isn’t ideal either, particularly when it’s going to be used as a house-training aid, as this can lead to accidents in the crate. How To Find a Crate for Your Dog&#039;s Size  It’s important to base the size of the crate on your dog’s measurements, and not their weight or breed alone. Weight and breed recommendations give us an estimate, but each dog is an individual. Use measuring tape (or this printable measuring tape) to get the best understanding of your dog’s size. Base crate size on your dog’s measurements, and not their weight or breed alone.When choosing a crate, keep in mind that crate mats and dog beds will take up additional space. Make sure to account for the type of bedding you plan to use when taking your pet’s measurements and purchasing a crate. Dog Crate Sizing Chart Crate Size (L x W x H) Dog Weight Dog Length Dog Height Breeds 18” x 12” x 14” Up to 6 pounds Up to 10 inches Up to 10 inches Toy breed puppies 22” x 14” x 16” Up to 12 pounds Up to 16 inches   Up to 12 inches   Chihuahua, Maltese, Yorkie, Pomeranian 24” x 18” x 20” 13–25 pounds Up to 18 inches   Up to 14 inches   Shih Tzu, Bichon Frise, Havanese 30” x 20” x 23” 26–40 pounds Up to 24 inches   Up to 18 inches   Beagle, French Bulldog, Boston Terrier, Corgi 36” x 24” x 26” 41–70 pounds Up to 30 inches   Up to 20 inches   English Bulldog, Bull Terrier, Australian Cattle Dog, Pit Bull Terrier 42” x 28” x 30” 71–90 pounds Up to 36 inches   Up to 24 inches   Labrador Retriever, Golden Retriever, Boxer 48” x 30” x 32” 90–110 pounds Up to 42 inches   Up to 26 inches   Bernese Mountain Dog, German Shepherd, Rottweiler   How To Pick a Puppy Crate Because young dogs grow so quickly, there are a few options when choosing the best crate for a puppy. You can opt to purchase a crate for your puppy’s expected adult size and use a removable divider. Dividers can be moved back as the puppy grows so the crate can grow with them. For crates that do not have a removable divider, you can use bedding/pillows to block off space in the back of the crate to help create a more appropriately sized space for your puppy. You can purchase multiple crates as your puppy grows. This is a good option when the adult size of the pup is difficult to estimate. When purchasing a crate for a puppy, keep their potty training and teething needs in mind. An easy-to-clean, durable material that does not attract chewing is usually the best fit for younger dogs. Crates made of coated steel wire are excellent options because they are durable, easy to clean, provide good ventilation, and let your dog see what is going on around them. If your dog is more comfortable in an enclosed crate, you can always add a crate cover that can be removed as needed. Other Considerations When Finding the Best Dog Crate There are some other considerations when choosing the best crate for your pup and lifestyle. For example, if you frequently travel with your pet, an airline-compliant travel crate may be the best choice. Getting your dog comfortable in their travel crate before your trip can go a long way toward easing their stress. If your space will best accommodate a crate with a side entrance rather than a front entrance, that may be a feature to keep in mind during the purchasing process. Some crates have two entrances for added flexibility. Similarly, if you plan to have the crate in a living space, you may prefer a wooden or furniture-style crate. Consider how and where the crate will be used when choosing the best fit for your pup. Featured Image: Adobe/Christine Bird"}]