[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "The 10 Most Popular Dog Breeds of 2022", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/most-popular-dog-breed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/most-popular-dog-breed.jpg"}, "author": {"@type": "Person", "name": "Sarah Kloepple", "url": "https://www.petmd.com"}, "keywords": "Dog, Adult, Zoo Intelligent Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/most-popular-dog-breeds"}, "datePublished": "April 7, 2023", "dateModified": "August 30, 2023", "description": "Did your pet make the list of most popular dog breeds in the U.S.? Here&#039;s what to know about the most popular dogs by breed.", "articleBody": "There’s a new top dog in town—literally. The American Kennel Club (AKC) recently released its annual list of the most popular dog breeds, and this year’s results might surprise you: for the first time in history, the French Bulldog was crowned the most popular pup. This means that, after 31 years, the Labrador Retriever is no longer the most popular dog breed in America. (Labs aren’t far behind, though—they placed second).  What other dog breeds were deemed the most popular in the country? We’ve got a rundown of the results, and what you can expect from each if you’re looking to add one of these sought-after breeds to your home.   1. French Bulldog  Photo credit: Adobe/otsphotoThe French Bulldog has been climbing the ranks in popularity over the last 10 years, according to the AKC. It’s not hard to see why—Frenchies, as they’re often called, are easygoing, happy, compact dogs with a good-natured temperament and a bright personality.   They enjoy short walks, fetch, and games of tug-of-war. Their smaller size is ideal for any type of home, which has no doubt contributed to their popularity. French Bulldogs are prone to a handful of health issues, though, including brachycephalic airway syndrome, ear infections, and back injuries.  2. Labrador Retriever  Photo credit: iStock/THEPALMERLabrador Retrievers are known for their affectionate nature toward everyone they meet—even strangers—and they do exceptionally well with children and other dogs. This breed loves the water and makes a great companion for families who spend a lot of time outdoors.   Labrador Retrievers love to play and are known to be highly energetic throughout most of their lives. They’re a generally healthy breed, but common health issues include hip and elbow dysplasia, ear infections, and exercise-induced collapse.  3. Golden Retriever  Photo credit: iStock/cmannphotoAnother one of the most popular breeds is the Golden Retriever. They’re considered an intelligent, loyal, easy-to-train, and very affectionate breed. Like Labs, Golden Retrievers make wonderful family dogs because they’re great with young children and other pups.   Goldens enjoy a wide variety of activities, including running, long walks, retrieving, and swimming. They also make excellent therapy dogs and guide dogs for people with impaired vision. Golden Retrievers are usually healthy dogs, but due to poor breeding, some may have allergies, heart disease, eye issues, and hip dysplasia.   4. German Shepherd  Photo credit: iStock/ChristopherBernardGerman Shepherds are large yet agile, muscular, highly intelligent, and loyal dogs. They’re a breed known for their confidence, loyalty, and bravery. These pups love having a job to do, and German Shepherds are commonly used as working dogs in the military and police for patrolling, bomb sniffing, and search and rescue.   Although they have a long life expectancy for a large breed dog, they are prone to health issues such as gastric dilation and volvulus (which can be life-threatening). as well as cancer, allergies, and heart disease.   5. Poodle  Photo credit: iStock/Kurt PasAs an athletic, smart, and good-natured breed, the Poodle rounds out the top five most popular dog breeds. Their recognizable curly coat gives them their “hypoallergenic” reputation and requires regular and consistent grooming by a professional to stay healthy and tangle-free.   Poodles generally have a kind and friendly personality, but they’re very energetic and do best with regular exercise and training. A few health issues to keep an eye on include hip dysplasia, idiopathic epilepsy, and Von Willebrand disease.  6. Bulldog  Photo credit: iStock/Kenneth HornAnother identifiable breed—thanks to their wide stance, muscular low profile, and flat and wrinkled face with an underbite—Bulldogs often display a friendly, though stubborn, temperament.   That stubbornness might be confused with laziness, but the breed does enjoy and benefit from daily moderate exercise. Exercise could include brisk walks and backyard games of tug-of-war, but keep all exercise out of the sun—thanks to their smooshed-in face, Bulldogs can easily overheat. Bulldogs also commonly have skin and ear issues, most often due to allergies or moisture getting trapped in their adorable wrinkles.   7. Rottweiler  Photo credit: iStock/Peter DMoving up a spot on the most popular dog breed list, Rottweilers are loyal dogs that are eager to please their humans. They’re intelligent and respond well to positive reinforcement training, but if they grow bored they can develop unwanted behaviors to entertain themselves.   Providing mental stimulation is important for Rottweilers. They’re fans of running, hiking, dock diving, and tracking. Despite how active they are, the breed is prone to health problems including obesity and bone cancer.  8. Beagle   Photo credit: iStock/Tetiana GarkushaBeagles are famously led by their nose. This makes them a curious breed, but they’re also loving, affectionate, and active. Their sense of smell keeps their nose to the ground, and they love wagging their tails.   Beagles are also very smart, but they can be stubborn and have a short attention span when it comes to training. They respond best when you tap into their food-motivated nature! Common health issues that can afflict Beagles include ear infections, obesity, allergies, and cherry eye.  9. Dachshund  Photo credit: iStock/TimbicusDachshunds are commonly called “Doxies,” or “wiener dogs,” and they’re known for their long silhouette, short and muscular legs, brave and energetic personality, and alert nature. They’re also known for being willful, headstrong, playful, and mischievous.   Although they’re down for anything their favorite humans are doing, these pups aren’t built for extensive running, jumping, or swimming—all these activities can make them susceptible to injuring their long back. Instead, try activities like scent tracking, nose work, and puzzle toys.   10. German Shorthaired Pointer   Photo credit: iStock/jjMiller11German Shorthaired Pointers (GSP for short) are known for their speed, agility, and endurance. They’re often trained as hunting dogs and will point and signal when they’re trailing a game scent by stopping and standing with their nose pointing in the direction of the scent.   Despite their need for adventure, they’re typically a low-maintenance breed. Running, fetching, or agility games are great ways to spend time with them. But be on the lookout for health issues such as bloat, hip dysplasia, and elbow dysplasia.   Featured image: iStock/gollykim"}]