[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Imodium® For Dogs: Can You Give Dogs Imodium?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1408461849_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1408461849_0.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Adult, Puppy, Medication, General health, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/imodium-dogs-it-good-idea"}, "datePublished": "June 27, 2023", "dateModified": "October 13, 2023", "description": "When faced with a case of upset tummy in your dog, it’s easy to wonder if you really need to make a trip to the vet or if you can treat your dog at home with  Imodium®. Learn about dosing, side effects, and more with Imodium® for dogs.", "articleBody": "What Is Imodium®? Imodium® is an anti-diarrheal medication used in dogs to treat diarrhea that is not caused by an infectious agent such as bacteria, viruses, or intestinal parasites. While Imodium® and its active ingredient loperamide are FDA-approved for use in humans, these medications are not approved for use in dogs. Imodium is rarely used in the veterinary field. However, veterinarians can legally prescribe certain human drugs for animals in some circumstances. This is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether Imodium® is right for your pet. How Imodium® Works Imodium® treats diarrhea by acting on the smooth muscle of the digestive tract. It slows digestive motility, which is the natural forward muscle movement of the digestive tract that moves food through the body. This allows food and liquids to stay in the digestive tract for a longer time to allow for better reabsorption of water, electrolytes, and nutrients back into the body.  How Much Imodium® Can I Give My Dog? Diarrhea is a common response of the digestive system when change occurs. Some common causes of mild diarrhea in a dog are self-limiting, which means the diarrhea often resolves on its own within a short period of time. The diarrhea may occur from small exposures or ingestions from their environment, switching diets too quickly, or stress.  Diarrhea can also be due to bacteria, viruses, or parasites in the intestines. Imodium® is not recommended in these situations because it prevents the offending agent from passing and being excreted in a timely manner, which can cause inflammation in the intestines. Due to the possibility that the underlying cause of your pet&#039;s diarrhea has yet to be identified, veterinarians do not usually recommend that Imodium® be given at home. The most common use for Imodium® in the veterinary field is to treat diarrhea in dogs that occurs as a side effect of certain chemotherapy medications. It is important for your veterinarian to ensure that there is no infectious cause contributing to the diarrhea before prescribing Imodium®. Your veterinarian will generally try veterinary-specific medications first, but if the dog is not responding to those medications, they may recommend Imodium®. Imodium® Dosing for Dogs Your veterinarian will determine which form of Imodium® is appropriate for your pet, based on your pet’s traits and symptoms. If your veterinarian recommends that your dog take Imodium®, it is available as either a tablet or liquid. Imodium® tablets contain 2 mg of loperamide and should only be given to large dogs. Liquid Imodium® is typically available in a concentration of 1 mg/5 mL (0.2 mg/mL) and is preferred in smaller dogs. Your veterinarian will let you know how much and how often to use this medication. Is Imodium® Safe For Dogs? Imodium® can be used safely in dogs, but under very specific circumstances and only under direct supervision by their veterinarian. Imodium® should be used with caution in dogs with the MDR1 gene mutation (common in Collies, Shelties and Australian Shepherds). Dogs with this gene mutation have a hard time metabolizing certain type of medications, including Imodium®, which can reach toxic levels in the body. Imodium® is used with caution in dogs with certain underlying diseases like hypothyroidism, Addison’s disease, certain respiratory conditions, or brain injuries, since they are much more susceptible to the possible side effects. Side effects of Imodium® in dogs include: Constipation Bloating Lethargy Severe side effects can include: Impaired motility Inflammation of the intestines Pancreatitis Vomiting Drooling Weight loss Depression What Medications Can Dogs Take for Diarrhea? Speak with your veterinarian about how to treat your dog’s diarrhea. Generally, they may advise that simple diarrhea is often something that can be handled at home. If your dog is still eating, drinking, and engaging in play, your veterinarian may recommend that you try the following: Ensure your dog has plenty of fresh water. Probiotics to calm your dog’s digestive tract. Probiotics can help to maintain a balance of healthy bacteria in the intestinal tract, which can be upset by your dog’s diarrhea. One to two days of a bland diet of boiled chicken or lean hamburger plus rice (a carbohydrate and a protein), with some pure canned pumpkin added to offer an easily digestible low-fat meal. A kaolin- and pectin-based anti-diarrheal can help by coating your dog’s digestive tract and reduce excess water being lost in the stool. If your pet&#039;s diarrhea lasts more than two days, if they have developed additional symptoms, or you think your pet&#039;s diarrhea has an underlying cause, speak with a veterinarian as soon as possible or seek emergency veterinary care. Depending on the cause of your pet&#039;s diarrhea, they may need prescription medication like anti-nausea medication, dewormers, probiotics, antibiotics, or acid blockers to treat the cause and feel better. Your veterinarian will determine the best course of treatment for your pet. Featured Image: iStock.com/Nicolas Jooris-Ancion"}]