[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Monitoring and Managing Glucose Levels in Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Health", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-04/dog.at_.vet_.smiling.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-04/dog.at_.vet_.smiling.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Diabetes, Cat, Dog, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/monitoring-and-managing-glucose-levels-dogs-and-cats"}, "datePublished": "April 28, 2022", "dateModified": "March 16, 2023", "description": "Dr. Stephanie Howe explains how pet parents can manage glucose levels in their pets, including at-home tool options.", "articleBody": "If your pet is diabetic or recently diagnosed as one, you’re probably learning everything you can about managing a diabetic pet at home. In healthy pets (and people), a hormone called insulin moves sugar from the blood stream into the cells where it can be used for energy. If your dog or cat has diabetes, however, their pancreas does not produce insulin or sufficient insulin. Typically, pets are not classified into type 1 or type 2 diabetes as are humans. However, for understanding the similarities, type 1 diabetes is where the pancreas is not producing insulin. Dogs get type 1 diabetes and cats can have type 1 or type 2 diabetes.  With type 2 diabetes the pancreas is still producing insulin but not in sufficient levels. As a result of either type of diabetes, the amount of sugar (glucose) in their bloodstream can become dangerously high causing a condition called hyperglycemia. To keep your pet healthy, you’ll have to give it injections of insulin, but you’ll need to avoid overdoing it. If you give them too much insulin, their blood sugar levels could become dangerously low (hypoglycemia). That’s why regular monitoring of glucose levels and adjusting insulin doses is crucial, as directed by your veterinarian. What Impacts Glucose Levels in Diabetic Pets? Glucose comes from the food your pet consumes. Any type of carbohydrates will get broken down into glucose in the digestive system. This simpler sugar molecule will then be absorbed into the bloodstream and—with the help of insulin—move into their cells where it can be utilized for energy. What your pet eats has the biggest impact on its blood sugar level. Diabetic pets that use insulin should be on a strict feeding schedule. Two meals daily with minimal snacking is ideal, with diets high in insoluble fiber which slows glucose absorption. If your pet is overweight, it is very important to ensure steady weight loss with consistent calories. Your veterinarian might recommend a prescription diet designed to help control glucose levels and lower insulin requirements. Exercise is another major factor, because the more active you are, the more glucose your cells require. Most often, exercise is beneficial and may lower its insulin requirements. However, too much exercise could lead to hypoglycemia, so it is important to work with your vet to design an exercise program based on your pet’s weight, age and insulin dose. Other factors that may influence glucose levels include: Illness/Injury Dental disease Stress Certain medications Hormonal factors Age Dehydration Safe Ranges for Glucose Levels in Diabetic Pets Normal blood glucose levels in dogs and cats range from about 80 to 120 mg/dl. When looking at the blood glucose levels of a diabetic dog, ideally the highest glucose reading of the day should fall around 200 mg/dL; in cats, up to 300 mg/dL may be normal. If your pet has diabetes and does not get enough insulin, its blood glucose will stay elevated, and the cells will seek alternative sources of fuel. The pet’s body will break down muscle and fat into usable sources of energy, but blood sugar levels will remain elevated. When sugar in the bloodstream becomes too high it spills over into the urine, taking a lot of water with it. That’s why pets with uncontrolled diabetes become very thirsty and urinate more often. If your pet’s glucose levels regularly exceed those upper boundaries, they may develop problems such as: Weight loss Obesity Excessive hunger Cataracts Dehydration Depression Urinary tract infections Non-healing wounds Hind limb weakness or “dropped-hock” gait Blood sugar that goes too low (hypoglycemia) — defined as under 80 mg/dL — is also problematic. If you accidently give a diabetic pet too much insulin, this may be a medical emergency that requires contacting your primary care veterinarian or local emergency clinic for immediate treatment. If you see any of the following symptoms, especially if you have recently increased your pet’s insulin dosage, take it to a veterinarian immediately: Lack of appetite (anorexia) Vomiting Disorientation, weakness Lack of energy, lethargy Coma/loss of consciousness Tremors/seizures Insulin for Diabetic Pets Insulin is an injectable version of the hormone normally produced by your pet&#039;s pancreas. It is used to help the body move glucose from the bloodstream and into the cells where it can be used for energy. Every pet’s metabolism is different and there are multiple factors that can affect its blood sugar, so there is no set “right” amount of insulin for certain sized pets. As a result, there will be some trial and error required to determine the amount of insulin that your pet needs. When To Give Your Pet Insulin Most diabetic dogs will need to be given insulin injections twice a day. Your veterinarian will recommend a starting dose based on your pet’s weight, but it may change. After a few weeks, your vet should recommend bringing your pet in for a glucose curve test, which monitors where your pet’s sugar levels are over the course of about 12 hours. Results of this test are used to determine whether the insulin dose should be increased, decreased or kept the same. There are many kinds of insulin on the market, and many ways to categorize the range of products available. It is very important that your insulin syringes match the concentration of the insulin that you have for your pet. Insulin comes in two concentrations: 40 units of insulin per cc/ml or 100 units of insulin per cc/ml. The syringes then must match and will be labeled U-40 or U-100. Utilizing the incorrect syringe type will cause your pet to not receive the proper dose of insulin. Be sure to confirm with your veterinarian your insulin dosage along with any medical accessories (including syringes), to ensure accuracy for your pet. Monitoring Your Diabetic Pet at Home Monitoring glucose levels is important to ensure that your pet is getting the correct amount of insulin which ensures that its body can effectively utilize the energy that is being ingested with their diet. Monitoring helps to ensure that your pet has minimal side effects from blood sugar levels that are too high or too low, which will hopefully help to prevent long-term complications from diabetes. You will need a few pieces of equipment to monitor your pet’s glucose at home, including: Glucose monitor: a device that measures the level of glucose in a blood sample. Because healthy glucose ranges are different in dogs and cats, you should use a monitor (also called a glucometer or glucose meter) or purchase one  that has specific settings for both dogs and cats. Ask your veterinarian to recommend a glucometer that will ensure the most accurate test results. Glucose test strips: individual strips that collect the blood and work with your glucose monitor. It is best to use the test strips that are designed to go with the glucose monitor purchased, and to check expiration date of strips before each use. Remember to enter the code on the strips anytime you open a new package; this correlates to the batch of strips and helps ensure accuracy. Lancets and lancing device: A lancing device is a spring-loaded piece of equipment that holds the lancet and allows it to prick the skin in a manner allows for best and most accurate sample collection. Sharps container: A safe storage box that holds used needles and syringes used to check blood sugar levels or administer insulin. Many states require that you dispose of used needles in this fashion. Glucose curve test: A blood glucose curve test is a process where blood samples are taken every two hours for about  12 hours to establish a baseline of where the glucose ranges in the day. This test reports the lowest the glucose becomes for the day and report the highest level the glucose before their insulin dose takes effect. Generally, blood glucose curves are done multiple times in the life of a diabetic pet and will often be done in your vet’s office instead of at home.  Your veterinarian should administer a glucose curve test at least every few months. It is also recommended:  A few weeks after your pet starts taking insulin for the first time 1-2 weeks after any change in insulin dose Anytime you notice symptoms of high or low blood sugar After enough practice and learning, you will find a schedule and a system that makes sense for you and your pet. Always reach out to your veterinarian if you have any questions about your diabetic pet, insulin, or monitoring products. How To Draw Blood from Your Diabetic Pet Many pet owners are nervous about taking blood samples, but it gets easier with practice. Ideally, you should find at least two locations on your pet that are comfortable for both you and your pet and rotate through them. In cats, the best place to take blood from is the tiny vein at the edge of the ear flap (the marginal ear vein). Other options is the accessory carpal pad, or the pad on the front leg closest to the cat’s body.  Make sure that you don’t draw blood from a spot your cat will be walking on. In dogs, you can also target the marginal ear vein or accessory carpal pad. Other options in dogs include the inside of the upper lip or the callus on the elbows. It is best to find at least two locations on your pet that are comfortable for you and them and rotate through them. This way your pet does not get sensitive to excessive sampling in one area. Before drawing blood, be sure to warm the sample area so that you get an adequate sample. Warming the area helps to bring blood to the surface and makes for easier sample collection. You can simply rub the area with your fingers or apply a warm cloth. For pets that have long hair, shaving the sample site may make drawing blood easier. If you are sampling blood glucose only once a day, ask your veterinarian what time of day is best and test at that same time each day. There are several on-line tracking apps for monitoring blood sugar levels, (AlphaTrack, Vetsulin) that can be helpful when monitoring your pet’s glucose at home. Additional Home Monitoring Options for Diabetic Pets Continuous glucose monitoring is a new type of monitoring that was adapted from human medicine to help diabetic patients. Currently, no continuous glucose monitors (CGMs) are FDA-approved for use on pets at this time, but there have been several published studies that suggest the Freestyle Libre is safe, accurate and effective for use in both dogs and cats. Some vets recommend it off-label. Using a CGM enables you to constantly monitor your pet’s glucose levels without having to obtain blood samples. The Freestyle Libre is a small, round glucose sensor that has a tiny sampling tube that’s implanted under your pet’s skin at the veterinarian’s office. The sensor monitors tissue glucose levels continuously for 14 days and then the sensor and probe are removed until your vet recommends another round of monitoring. Monitoring is generally recommended after changes in insulin dosage, every three months in stable diabetics, or as directed by your veterinarian. It does not measure glucose in the bloodstream. Instead, it checks glucose in the fluid that is in the tissues under the skin. This sensor then links to an app on your phone or a reader (a separate device to collect and interpret the data from the sensor, which can be purchased separately) so you can easily keep tabs on glucose values. Each sensor is used only once, and it intended to be used for 14 days to provide continuous glucose data. There are multiple advantages to this system: It’s pain free, collects continuous glucose data over the course of 14 days and the data is collected at home where your pet is happy and comfortable. The downside, however, is that CGMS aren’t quite as accurate as manual glucometers. If your pet has a very abnormal reading, you’ll want to double check it with a glucometer.  Urine testing: Test strips can be used to measure how much glucose has spilled over into the urine because levels exceeded what the kidneys can handle. Your veterinarian might advise urine testing if your pet has been recently diagnosed with a diabetes. Featured Image: iStock.com/didesign021"}]