[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "FCE (Fibrocartilaginous Embolism) In Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Neurological", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/dogxray.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/dogxray.jpg"}, "author": {"@type": "Person", "name": "Michelle Diener, DVM", "url": "https://www.petmd.com/author/dr-michelle-diener"}, "keywords": "Dog, Condition, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/neurological/fce-fibrocartilaginous-embolism-dogs"}, "datePublished": "April 27, 2023", "dateModified": "April 28, 2023", "description": "Dr. Michelle Diener explains FCE or fibrocartilaginous embolism in dogs, including symptoms, diagnosis, and what to expect when it comes to treatment options.", "articleBody": "What Is FCE (Fibrocartilaginous Embolism) In Dogs? Just like people, dogs have discs between their vertebrae that act as a cushion and allow for the back to be flexible. These discs are called intervertebral discs. The center of each disc is made of fibrocartilage, which is a dense connective tissue. Sometimes, although rare, a piece of fibrocartilage from within a disc can migrate into the bloodstream and lodge within a spinal artery, preventing blood flow to a section of the spinal cord. This is called a fibrocartilaginous embolism (FCE), also referred to as a spinal stroke.  Fibrocartilaginous embolism or FCE in dogs occurs suddenly either when a dog is playing, or simply walking. A dog with FCE will cry out in pain briefly and then show neurologic signs, which may include acute weakness, incoordination when walking, and paralysis. While the pain usually subsides within minutes, the neurologic symptoms may or may not resolve. An FCE can occur anywhere along the spine and affect one or both sides of the body. If the FCE is in the cervical (neck) area, then all four legs may be affected, making the dog have severe difficulty moving around or lose the ability to walk. If the FCE is in the lumbar (back) region, then only one or both hind limbs will be affected. FCE is a rare condition and is considered an emergency due to the immediate onset and severity of symptoms. Symptoms of FCE (Fibrocartilaginous Embolism) In Dogs As mentioned, a dog that experiences FCE is often walking or playing normally and then suddenly cries out and has symptoms of FCE. Symptoms may include: Vocalization due to acute pain that subsides quickly (usually within minutes) Collapse Weakness (paresis) of one or more limbs Lameness Knuckling of one or more paws Dragging of one or more legs due to the inability to feel and move the leg(s) (paralysis) Inability to urinate (occasionally) Fecal incontinence (occasionally) Causes of FCE (Fibrocartilaginous Embolism) In Dogs A FCE forms when a piece of fibrocartilage from within one of the intervertebral discs suddenly loosens and migrates into the bloodstream, where it gets lodged within a spinal artery. It is unknown what causes the fibrocartilage to migrate or how it finds its way into the bloodstream.  All breeds of dogs are at risk for FCE, but large- and giant-breed dogs, such as the Labrador Retriever and Bernese Mountain Dog, are more predisposed. In contrast, the Miniature Schnauzer, Yorkshire Terrier, and Shetland Sheepdog have also been found to have a higher incidence of FCE even though they are small-breed dogs. Most dogs that experience a FCE are middle-aged, usually 3 to 6 years old. A FCE is more common in dogs that play a high-intensity sport, like Frisbee®, or suffer from a traumatic injury. However, a dog who is merely walking can also develop an FCE. How Veterinarians Diagnose FCE (Fibrocartilaginous Embolism) In Dogs A veterinarian will first perform a thorough physical exam. This will be followed by a neurological exam which will include assessing the dog’s gait and checking for a pain response, as well as testing the dog’s reflexes. Based on the neurological exam findings, the veterinarian can determine which section of the spine is affected. The following diagnostic tests may be recommended to diagnose an FCE: X-rays of the spine are often normal because the fibrocartilage that is forming the embolism is not visible on an X-ray.  Magnetic resonance imaging (MRI) is the gold standard to diagnose FCE. However, only a few veterinary hospitals have an MRI machine, so it may be difficult to find a location that can perform this test. An MRI takes multiple images of the spinal cord while the dog is under general anesthesia. Myelography is a contrast study that involves injecting a dye into the spinal canal and then taking X-rays of the spine. The dye should outline the spinal cord. If there is an FCE, some localized swelling of the spinal cord may be visible on the X-rays. Also, the dye may be absent in an area due to swelling caused by the FCE. This diagnostic test, however, does not give a definitive diagnosis of an FCE but can support that one may be present. Spinal fluid analysis may be recommended to rule out an infection within the spinal fluid. Most often the fluid is normal in dogs that have an FCE, but occasionally some inflammatory cells and extra protein may be present in the fluid where no infection is found. Treatment of FCE (Fibrocartilaginous Embolism) In Dogs There is no specific treatment for a FCE, which means that no medications or surgery is required. Physical therapy and supportive care are the best ways to help a dog with FCE. If the dog has lost its ability to urinate due to the FCE, then a veterinary professional must express the dog’s bladder as needed to prevent rupture and teach the pet parent how to do so as well. If the dog regains the ability to stand, it is best to use a harness and sling to support them and encourage them to walk, as this can improve recovery. If the dog can be referred to a veterinarian, who specializes in physical therapy, this can also help the dog regain function and confidence in walking again. The physical therapist can massage the area where the FCE is located, stimulate the muscles through neuromuscular electrostimulation, and provide hydrotherapy using an underwater treadmill to promote use of the limbs. Recovery and Management of FCE In Dogs Recovery from a FCE takes time. Most dogs with a FCE will start to show signs of improvement within 14 days, but recovery can continue up to 3 to 4 months after the onset of the FCE in some cases. The amount of recovery depends on the degree of the neurologic deficits. For instance, a dog that is paralyzed in one or more limbs has a more severe condition than a dog that is knuckling on one or more paws but still has feeling in its limbs. Repeated neurological exams will be needed to check reflexes and assess for pain response. A dog that does not suffer paralysis has a better prognosis.  With FCE in dogs, the amount of recovery will vary. Some dogs make a full recovery, while others are not as fortunate. Nerve deficits may persist and the dog may never walk normally again due to the affected limb(s). It may also show signs of fecal incontinence, and/or need the bladder expressed several times a day for life. Euthanasia should be considered if the dog’s quality of life is poor, and no improvement is seen after 14 days of when the FCE occurred. If a dog has an FCE, it is unlikely that the dog will suffer from another FCE in the future."}]