[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What To Feed a Dog With Diarrhea", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-854269414.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/iStock-854269414.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Puppy, Adult, Senior, Symptom, Diarrhea, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/what-to-feed-a-dog-with-diarrhea"}, "datePublished": "March 21, 2023", "dateModified": "October 26, 2023", "description": "It’s hard to know when to start feeding a dog with diarrhea, or even when you should take them to the vet. Dr. Sandra Mitchell answers all your questions about when, what, and how often to feed a dog that’s been having diarrhea.", "articleBody": "At your recent barbecue you asked everyone not to share food with your dog, but now your pup needs to go out more than usual. This last time, you see puddles of diarrhea all over the backyard. Your dog seems to be perfectly normal otherwise and is even asking to be fed. Now what? Should you feed your dog as usual or not feed anything for a while? Should You Feed Dogs That Have Diarrhea? It might seem counterintuitive, but for most healthy adult dogs, the best thing you can do to help get their system back on track is to not offer any food for 24 hours. For very young puppies (under 3 months), senior dogs, and those with other known health problems, call your veterinarian for advice before fasting. Sometimes a 24-hour fast will be appropriate, but other times, a 12-hour or even shorter fast might be advised. They may not even recommend fasting at all. When in doubt, make that phone call first. Fasting gets all the bad stuff moving down and out of a dog’s system. This gives it a short rest, like rebooting a computer. Never withhold water, however. Put away the food bowl and do not give treats, but keep plenty of fresh water available to them. Does a Bland Diet Work for Dogs With Diarrhea? Yes, a bland diet can help after the fasting period, as long as your dog has had no more episodes of diarrhea and has no other symptoms. If your dog seems ill, is vomiting, or still has diarrhea, call your veterinarian. This is very important, because you don’t want to upset their system all over again. The fasting-plus-bland-diet plan is most appropriate for dogs that simply got into something that upset their system, not for longer-term concerns like chronic conditions. If your dog seems to be OK and does not have an ongoing health condition or chronic diarrhea, offer a small amount of a bland diet. Bland food is easy for the system to digest and more likely to be tolerated. Small amounts given more frequently are also easiest for the body to process. For most dogs, an appropriate bland diet would consist of boiled chicken or boiled hamburger plus rice, to provide both a protein and a carbohydrate. Boiling is recommended to boil out as much fat as possible. The idea is to give your dog a very low-fat, easy-to-digest meal. It’s best to start with a very small amount—sometimes only a tablespoon or two—to see if your dog is up to eating and able to keep the food down. It is far better to give a small meal every two to three hours than a large one right away, even if your dog is begging for more. Most veterinarians will recommend a bland diet for three to five days after an episode of mild diarrhea, assuming your dog otherwise seems OK. Any animal that is still sick or vomiting needs additional care beyond the bland diet. Food for Dogs With Mild or Acute Diarrhea In most cases, vets consider mild diarrhea to be soft or loose stool that has lasted fewer than three days, with the dog still active and eating and drinking like normal, and no other symptoms. It is more worrisome if your dog seems to be feeling ill. You may notice that your dog is sleeping more than usual, is not eating well, is quiet, has vomited, has blood or mucus in their diarrhea, or seems sluggish. Acute diarrhea starts suddenly—in other words, your dog was perfectly normal on their 10 p.m. walk, and at 6 a.m., the floor was covered in diarrhea. Acute diarrhea can be mild or severe depending on additional signs of illness. If your dog has mild diarrhea, start with a 24-hour fast, but keep the water dish full. If your dog had breakfast at 8 a.m. and started having diarrhea at 9 a.m., don’t give any food (including treats) until the next day at 8 a.m. When you do offer food, use a prescription bland food from your veterinarian (not the pet store) or a home-prepared bland diet. This bland diet should be a 1:1 ratio of boiled meat to rice (for example, 1 cup boiled chicken and 1 cup rice), using the leanest possible meat. The most commonly recommended options are boiled chicken or boiled hamburger. Begin by feeding 2 tablespoons of the mixture per 10 pounds of body weight. Offer these small meals every two to three hours during the first day. It is better to offer too little food than too much. Over the next three days, gradually increase the portion size and decrease the meal frequency. Between days 3 and 5, start to blend in some of your dog’s regular food. By day 7, most dogs should be back on their regular dog food and feeling fine. If at any point your dog has more diarrhea, is vomiting, or is not feeling well, call your vet. After the initial fasting period, you should see steady improvement in your pet’s condition, and any setback is cause for concern. What To Feed Dogs With Chronic Diarrhea If your dog is having chronic diarrhea, with ongoing episodes over time, there is probably an underlying medical condition at play. Before you can settle on an appropriate diet, the health condition needs to be identified, diagnosed, and addressed—and diet is likely only part of the treatment plan. Prescription diets designed for dogs with diarrhea might be more appropriate if your dog has a long-term problem with diarrhea or a health problem such as inflammatory bowel disease. Prescription foods can help with long-term gastrointestinal problems because they are made to meet all nutritional needs over longer periods. Although a homemade diet like the bland diet is useful in the short term, it is extremely deficient in many of the nutrients needed to keep a dog healthy over the long run. While using it for a few days or a week will do no harm, over long periods it is likely to do more harm than good—which is why prescription foods come in to play. Many prescription foods are available through your veterinarian, with some of the most common being Hill’s Prescription Diet i/d (intestinal diet) and Purina EN (gastroenteric nutrition). Many other brands and formulas are available, and your veterinarian will help you sort out which is most appropriate for your dog over the long haul, depending on the underlying condition."}]