[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Honey?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/honey.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/honey.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Adult, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-honey"}, "datePublished": "February 1, 2023", "dateModified": "June 29, 2023", "description": "Honey can be a safe and even beneficial treat for dogs, if served in moderation. But feeding your dog too much honey can have adverse effects on their health. Learn more about whether dogs can eat honey.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be okay for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Honey is a go-to for when you want to make a treat even sweeter. And while we love to spread it on toast or add it to our tea, we might wonder if it’s safe to share with our furry friends. But can dogs have honey without any health risks? Is Honey Good for Dogs?  Here’s some sweet news: honey is non-toxic to dogs and completely safe in small quantities. Honey might even be beneficial to your pup because it’s rich in antioxidants, which help protect your pet’s body cells from damage. Certain types of honey, such as manuka honey, can even help with wound care thanks to antimicrobial properties that inhibit bacterial growth. Honey is also filled with vitamins and minerals, including: Ascorbic acid Pantothenic acid Niacin Riboflavin Calcium Copper Iron Magnesium Manganese Phosphorus Potassium Zinc Does Honey Help With a Dog’s Cough? We humans often use honey to help quell a scratchy throat and stop a cough. And it’s a home remedy that can be used for our pups, too. That said, always contact your veterinarian if your dog is coughing. There could be many different conditions causing the cough—and some are more serious than others. Can Honey Be Bad for Dogs?  Although honey can have a lot of healthy and healing properties, it’s incredibly high in sugar. And if dogs eat sugar repeatedly over time (or even just a lot at once!), it can harm their health. Eating sugar can cause your dog to have an upset stomach. This will typically showcase in minor, yet uncomfortable, symptoms such as decreased appetite, fatigue, diarrhea, constipation, and/or vomiting.  But if your dog eats a lot of sugar, either at once or over an extended time, more serious health issues can develop. This includes diabetes and obesity. How Much Honey Can Dogs Safely Eat? Treats of any kind should only be given to your dog in moderation and should only make up 10% of your dog’s daily diet. The other 90% should come from a well-balanced dog food diet.  Honey should never be a regular part of your dog’s diet. Always contact your veterinarian first before giving your dog any new treat. Based on their size, dogs should eat no more than the following portions of honey a day: Extra-small dog (2-20 pounds) = 1/4 teaspoon Examples: Yorkies, Chihuahuas, Pomeranians, Pugs Small dog (21-30 pounds) = 1/2 teaspoon Examples: Basenjis, Beagles, Miniature Australian Shepherds Medium dog (31-50 pounds) = 1 teaspoon Examples: Basset Hounds, Border Collies, Australian Cattle Dogs Large dog (51-90 pounds) = 2 teaspoons Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds Extra-large dog (91+ pounds) = 1 tablespoon Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees How to Feed Your Dog Honey You can let your dog lick some honey off a spoon, but there are other ways that are a bit more exciting. 1. Baked Into a DIY Doggy Treat Honey is a safe ingredient for homemade dog treats and meals. If you want to go all-out and spoil your dog, cook them some pork meatballs with a honey glaze. 2. Frozen Into a KONG Toy Mix a little honey into some peanut butter, stuff it into a KONG toy, and let it freeze overnight. It’s not only a tasty treat, but it’s a great way to keep your puppy occupied! 3. Blended Into a Doggy Smoothie Honey makes a great additive to a doggy smoothie. Just add a bit with some dog-safe fruits and veggies, plus some plain, sugar-free, xylitol-free Greek yogurt, and blend. The smoothie can be served on its own in a bowl or as a topper for your dog’s regular food. Featured Image: iStock/alvarez"}]