[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can Dogs Eat Cashews?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/dogs-begging-for-food.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/dogs-begging-for-food.jpg"}, "author": {"@type": "Person", "name": "Victoria Lynn Arnold", "url": "https://www.petmd.com"}, "keywords": "Dog, Adult, Nutrition, Can Dogs Eat", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/can-dogs-eat-cashews"}, "datePublished": "December 28, 2022", "dateModified": "June 29, 2023", "description": "Cashews are not toxic to dogs, but the nuts can be a choking hazard and your dog can be intolerant of the fat. Here&#039;s what to know before feeding your dog cashews.", "articleBody": "NOTE: Always check with your veterinarian first before giving your dog any new foods, especially “people foods.” What might be OK for one dog might not be good for your dog, depending on multiple factors, such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet. Are nuts safe for dogs to eat? It depends on exactly which nut you’re talking about. Some, like macadamia nuts, are toxic to pups. Others, like peanuts, are perfectly fine when properly prepped and fed in moderation. But can dogs eat cashews?  Cashews are not toxic to dogs, but there are some things to consider before you give them to your dog as a treat. Are Cashews Bad for Dogs? Although cashews are nontoxic for dogs, they should only be eaten in moderation. Cashews contain a high amount of fat, and eating fatty foods repeatedly over time can cause obesity or pancreatitis in dogs. As with any other food—especially nuts—there’s always a potential concern for them to be a choking hazard or cause an intestinal blockage. Thankfully, cashews are softer and more rounded than other types of nuts, such as almonds, and they are not sold inside shells (like pistachios). This can help reduce the chances of your dog choking on cashews, but pet parents should always supervise their pup while they snack. And remember that all nuts are not the same. For example, because macadamia nuts are toxic to dogs, it’s important to avoid feeding your dog mixed nuts.  Can Dogs Eat Cashew Butter? As long as there are no dangerous added ingredients like xylitol, macadamia nuts, or nutmeg, cashew butter is safe for dogs. It’s best to make a plain cashew butter at home instead of opting for the store-bought kind. That way you know exactly which ingredients are inside.  Can Dogs Be Allergic to Cashews?  The chance of your dog being allergic to cashews, or any other nut, is very unlikely. In fact, a 2017 study found that anaphylaxis to nuts has never been reported in dogs, despite it being a common allergic reaction in humans. However, your dog can be intolerant of the fat in the nuts, which can cause vomiting or diarrhea. But intolerance and allergies are different conditions! How Many Cashews Can Your Dog Eat?  Any snack for a dog—even healthy ones—should only make up 10% of your dog’s diet. The other 90% should come from a well-balanced dog food diet. Here are some general guidelines for safe feeding portion sizes.  Keep in mind that with any diet change or addition, it’s always best to consult your veterinarian about the proper portions for your individual dog’s diet.  Extra-small dog (2-20 pounds)  Examples: Yorkies, Chihuahuas, Pomeranians, Pugs, Shih Tzus One or two cashews ¼ tablespoon of cashew butter twice a day Small dog (21-30 pounds)  Examples: Basenjis, Beagles, Miniature Australian Shepherds two to three cashews ½ tablespoon of cashew butter twice a day Medium dog (31-50 pounds)  Examples: Basset Hounds, Border Collies, Australian Cattle Dogs, Siberian Huskies five to six cashews ¾ tablespoon of cashew butter twice a day Large dog (51-90 pounds)  Examples: Pit Bulls, German Shepherds, Labrador Retrievers, Australian Shepherds 10-12 cashews 1 tablespoon of cashew butter twice a day Extra-large dog (91+ pounds)  Examples: Newfoundlands, Bernese Mountain Dogs, St. Bernards, Great Pyrenees 12-18 cashews 1 ½-2 tablespoons of cashew butter twice a day How to Safely Feed Your Dog Cashews If you’d like to share some cashews with your pup, make sure they are completely plain. To reduce the chances of choking, chop the cashews or grind them into a powder (for a food topper) before serving. You can also feed your dog a dollop of cashew butter on a spoon or frozen into their KONG toy. Featured Image: iStock/fotyma"}]