[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/xeijqz7dzp", "@type": "VideoObject", "duration": "PT1M38S", "name": "5327091834001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/52dfc696214ccc228ce78df79e3668c4c9d263e0.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/xeijqz7dzp", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/858c3bd3213dac49b6a1d486e58e534b1150eb47.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/nutrition/are-you-feeding-your-dog-right-amount?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Are You Feeding Your Dog the Right Amount?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Nutrition Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/yellow-lab-waiting-to-be-fed.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/yellow-lab-waiting-to-be-fed.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/are-you-feeding-your-dog-right-amount"}, "datePublished": "May 5, 2020", "dateModified": "February 7, 2023", "description": "Knowing the right amount of dog food to feed your dog can be tricky. Here’s a veterinarian’s advice on how to figure out how much to feed your dog.", "articleBody": "One of the best ways to keep dogs healthy is to feed them the right amount of a high-quality dog food. Feeding your dog too much or not enough can have certain health consequences. Here’s why it matters and what you can do to determine how much to feed your dog. Why the Right Dog Food Amount Matters  If you feed your dog too little, they can suffer from nutritional deficiencies. However, If you feed your dog too much, it will eventually result in obesity and its related health issues, like: Musculoskeletal problems like osteoarthritis, cruciate ligament ruptures, and intervertebral disk disease Congestive heart failure Labored breathing Cushing’s disease Skin disorders Some types of cancer Shortened life span Reduced quality of life Giving your dog the right amount of quality dog food can help support your pet’s overall health and keep them feeling their best. How to Find the Right Amount of Dog Food for Your Dog You need to account for several factors when determining exactly how much your dog should be eating. Consider the Important Factors The correct meal size depends on factors like: Type of food Number of meals Body weight Metabolic rate Amount of exercise Look at the Feeding Guide on the Bag To start the process, take a look at the feeding guide on your dog food’s label. They are usually presented as a table that looks something like this:  Unless stated otherwise, these amounts give you the total that is recommended for your dog over a 24-hour period. Most adult dogs should eat two meals a day, and puppies often require three or more feedings, so you’ll need to divide the amount in the table by the number of meals you are offering. Take Your Dog’s Lifestyle Into Account Combine this information with your knowledge of your dog’s lifestyle to come up with the initial amount of food to offer your dog. For example, if I had a relatively inactive 35-pound Corgi who had a tendency to gain weight, I might start with a little less food than the table recommends. On the other hand, if my dog was a 35-pound Border Collie who never sits still, I would feed a little more. Consider Using a Calorie Calculator Another option is to try using a calorie calculator for dogs, but keep in mind that while these often spit out a precise number, your dog’s actual needs may be as much as 25% more or less. Determine Your Dog’s Body Condition Score Whichever method you pick, you’ll have to use a scale or body condition scoring system to fine-tune the amount of food you offer. Your veterinarian can help you decipher your dog’s body condition score (BCS) and determine an appropriate calorie amount. In general, dogs who are at a healthy weight: Have an “hourglass” figure when you look down on them from above. The abdomen should be narrower than the chest and hips. Are “tucked up” when you look at them from the side. This means that their chest is closer to the ground than their belly when standing. Have ribs that are not readily visible but are easily felt with only light pressure. Keep a Record of Your Dog’s Weight Change Check your dog’s weight every 2-4 weeks and keep a diary of your results. If your dog is inappropriately gaining or losing weight, adjust your portion sizes appropriately. Make sure to discuss these changes with your veterinarian so they can ensure that there are no underlying conditions. Reassess the Portion Size if You Switch Foods Every time you change dog food formulas, you will have to go through this entire process again, because the number of calories in the food will be different. Always Talk With Your Veterinarian Talk to your veterinarian if you have any questions about your dog’s health or diet. They can help you determine exactly how much food to offer based on the specifics of your dog’s case.  Dr. Jennifer Coates Featured Image: iStock.com/Chalabala Learn More: SaveSave"}]