[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Are Grain-Free Diets Bad for Dogs?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/grain-free-diet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/grain-free-diet.jpg"}, "author": {"@type": "Person", "name": "Jennifer S. Fryer, DVM", "url": "https://www.petmd.com/author/dr-jennifer-fryer"}, "keywords": "Dog, Adult, Puppy, General health, Nutrition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/are-grain-free-diets-bad-for-dogs"}, "datePublished": "June 6, 2023", "dateModified": "June 6, 2023", "description": "There has been a ton of talk about grain-free diets for dogs over the last decade, including its link to a heart condition. Dr. Fryer explains how grain-free food for dogs originated, why it would be recommended, and what food diets to chat with your veterinarian about when it comes to your pup.", "articleBody": "What Is Grain-Free Food? Most of us are familiar with wheat, rice, corn, and barley since these are part of our usual diet. We think of them as carbohydrates or “carbs.” Whole grains contain protein, fiber, vitamins, and minerals, which makes them healthy both for us and for our dogs. About 20 years ago, as veterinarians were seeking better diets for dogs with food allergies, nutrition companies conducted AAFCO (Association of American Feed Control Officials) food trials to determine the safety of hypoallergenic diets, some of which were grain-free. These diets have been fed safely to dogs and cats since that time. Starting about 2005 there was a rise in marketing by pet food companies that promoted grain-free diets as healthier for dogs with health issues or allergies, or because grain-free diets had fewer fillers. The word “filler” itself is misleading, as filler is defined as an ingredient that adds bulk to the food but no nutritional value to the pet (i.e. it is not digested). However, fillers added to pet foods are typically in the form of fiber, which feed intestinal bacteria and produce the short chain fatty acids that keep the intestinal tract healthy. Without fiber/fillers, the pet food would not be complete and balanced. Pet parents clearly want the best for their dogs. The information most readily available to pet parents online and pet stores at this time suggested that grain-free diets were healthy, even if veterinarians were not always on board. Is Grain-Free Food Linked to Health Conditions in Dogs? Dilated cardiomyopathy (DCM) is a breed-related disorder causing dilation and thinning of the chambers of the heart. This can lead to heart failure, arrhythmias, and sudden death. The breeds most commonly affected are the Doberman Pinscher, Golden Retriever, Great Dane, Boxer, and Cocker Spaniel. In 2018, the FDA began receiving reports of dog breeds with DCM that typically do not develop this disease. The common factor among these dogs was they all were eating grain-free or boutique (uncommon) diets. Once they were placed on a diet with grains, the dogs slowly recovered. Seventeen peer-reviewed studies over the last 4½ years have been published, with 1,382 dog cases and 20 cat cases (as of Dec. 23, 2022) reported to the FDA. The case numbers are also believed to be underreported, as the pets need a workup by a cardiologist and the FDA reporting process can be difficult. The original theory that this could be a taurine deficiency in these diets, which had been seen in rare cases, has proven to be more complex. One study in 2018 found taurine deficiency only in Golden Retrievers eating a grain-free diet. However, future studies could not find taurine deficiency in any breed, including the Golden Retriever. There does appear to be an association between pulses (part of the legume family, including peas, lentils, and chickpeas) being high in the ingredient list in the reported cases. There are no other major health issues associated with grain-free diets outside of DCM. Dogs given over-the-counter diets for food allergies may continue to experience itching, vomiting, or diarrhea if the diet was not made in a facility specifically dedicated or cleaned to prevent cross-contamination of proteins for food-allergic pets. Why Would Dogs Be Recommended Grain-Free Food? Celiac disease, a disease of gluten intolerance that is very common in people, is very rare in dogs. There is a line of Irish Setters in the United Kingdom that have gluten intolerance, similar to celiac disease. Some Border Terriers have epileptoid cramping syndrome, which is relieved by a gluten-free diet. These are the only known dogs with gluten-responsive medical issues. Dogs with food allergies may benefit from a limited ingredient diet or hydrolyzed diet, and some of these diets are grain-free. Therapeutic prescription hypoallergenic diets, which have gone through AAFCO or more advanced feeding trials, have not had reports of dogs developing DCM to date. These are the diets that veterinarians recommend, not just because of the DCM issue. Prescription hypoallergenic diets are made under rigorous protocols to prevent cross-contamination of ingredients, as well as testing for any rogue ingredients. Dogs are much less likely to have flare-ups of allergies or gastrointestinal issues because of these strict protocols. While the prescription diets are expensive, pet parents may ultimately save money on veterinary bills due to fewer relapses of their pet’s signs. Should I Feed My Dog Grain-Free Food? If you are considering a grain-free diet for certain reasons, including that your pup won’t eat their regular diet, is constantly itchy, or has a sensitive stomach, the first step is to seek veterinary advice. A medical issue may need to be addresssed in addition to the one you think is already happening. Also, your vet may recommend a different diet based on your dog’s age or overall health, based on clinical signs. Featured Image: iStock/VYCHEGZHANINA"}]