[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can I Reapply Flea Treatment Early?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/yorkshire-terrier-dog-running-on-grass.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/yorkshire-terrier-dog-running-on-grass.jpg"}, "author": {"@type": "Person", "name": "Liz Bales, VMD", "url": "https://www.petmd.com/author/dr-liz-bales"}, "keywords": "Dog, Parasites, Flea, Cat, Adult", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/parasites/can-i-reapply-flea-treatment-early"}, "datePublished": "June 12, 2019", "dateModified": "October 20, 2023", "description": "Has your topical flea medication stopped working? Instead of dosing your pet again, find out why your flea treatment might not be effective and what you can do about it.", "articleBody": "Are you still seeing fleas after using a topical flea prevention treatment? What should you do now? This is a question asked by frustrated people with itchy pets every day. You might be applying the medication incorrectly—and, if you did, wondering whether you should reapply. Or maybe the flea treatment simply stopped working for your pet (yes, that can happen). Here’s why you might still be seeing fleas on your dog or cat, and what you should do about it. Is It Safe to Reapply a Flea Treatment Early? If you’re finding fleas on your pet even after their topical flea treatment, you might be tempted to reapply it early. But this solution is not always recommended—and it can even lead to an overdose in some rare cases. Because there are so many different flea and tick medications available on the market, it’s difficult to speak to all of them in broad strokes. But to be safe, you should always follow the instructions on your specific topical flea medication package. Flea preventions typically use one or two active ingredients. Each brand uses different active ingredients that work in different ways to prevent fleas. If you have already reapplied your pet’s topical flea treatment early, stay alert for signs of an overdose. For most flea preventatives, overdose symptoms include: Profuse drooling Vomiting Tremoring Hyperexcitability Agitation Seizures Weakness Difficulty breathing  Call your vet immediately if you notice any of these symptoms. Why Isn’t My Flea Treatment Working? You’ve been diligently applying topical flea prevention to your pets, but you are still seeing them scratch—and you might even be seeing flea eggs or dirt. Here are four common reasons why this might be happening. 1. You’re Applying the Flea Treatment Incorrectly Incorrectly applying topical flea prevention is the most common cause for why it’s not working. Topical medication should be applied directly to the skin, not to your pet’s fur. You must part their hair so you can apply it to the skin. Read the instructions on the package—while most topical medications tell you to apply it all in one spot at the base of your pet’s neck, a few will have you apply it to several spots along your pet’s back where they can’t reach. Be sure to completely empty the tube, as the liquid is measured for your pet’s weight and the entire dose is required to be effective. 2. Your Flea Medication Has Become Ineffective Always talk to your veterinarian to find the best and most effective flea treatment for your pet. Your vet will know which products work well in your region, as some that may have been effective at one time may no longer be killing fleas the way they used to. They may also have personal favorites or recommendations based on your pet’s particular needs. 3. Your Home Hasn’t Been Treated for Fleas Most flea preventions do not repel fleas. Rather, flea preventions kill fleas by direct contact with the parasites or from the fleas feeding on your pet. New fleas from the environment can—and will—jump onto your pet to feed. So, along with using topical treatments, you need to treat your home to provide the best defense against fleas. And it’s not just adult fleas you need to watch out for. In fact, they only make up less than 5% of the flea population. You should be treating your home the other 95%—flea eggs, larvae, and pupae. Flea eggs and larvae can live in the environment for days or even weeks. To keep fleas out of your home: Regularly vacuum everywhere your pet spends time Wash all their begging in hot water Treat every pet in the household for fleas (even indoor-only cats!) Treat the home (either with a professional exterminator or a pet-safe flogger) 4. Not All of Your Pets Are on Flea Treatment Don’t forget to treat all dogs and cats in your house, not just the itchy ones. If one pet in the house has fleas, they all have fleas. It’s best to keep all pets on flea medication to prevent reinfestation. And remember: Just because you don’t see a flea doesn’t mean your pets don’t have them or don’t need to be on flea treatment. How to Apply Topical Flea Treatment Flea prevention is expensive, and you don’t want to waste a dose! But applying topical flea medication correctly can be a little tricky. Here are a few major brands and how to apply them. Note: While all these products are made for dogs and cats, they are species-specific. Always make sure you are using the dog product on a dog and the cat product on a cat. It’s also very important to use the appropriate weight range for your pet.   Bravecto® Bravecto® is a prescription flea/tick medication for dogs and cats. It can provide 12 weeks of protection against fleas and ticks, and eight weeks of protection against Lone Star ticks. Hold the tube upright and turn the cap one full turn. Make sure the seal is broken but DO NOT remove the cap. For cats: Part the hair at the base of the neck and apply the entire tube to the skin. You can apply to a second spot directly behind the first if there is overflow. For dogs: Part the hair at the base of the neck and apply to the skin; do this in one or more spots depending on the size of your dog. For larger dogs, choose two or three spots along the spine to continue the application. Revolution®/Revolution Plus® Revolution® is a once-a-month prescription product for dogs and cats. Revolution Plus® is only for cats. These products prevent heartworm disease and kill fleas as well as some intestinal parasites, and Revolution Plus® also kills ticks.  Hold the tube upright and press the cap firmly until you hear a click. Remove the cap and make sure that seal has been broken. Part the hair at the base of the neck and apply the entire tube to the skin. Keep the tube squeezed so the liquid isn’t sucked back into the tube. Make sure the tube is empty. Advantage Multi® Advantage Multi® is a once-a-month prescription product for dogs and cats. It prevents fleas, heartworms, and many intestinal parasites, but doesn’t have any tick prevention. Hold the tube upright and remove the cap. Flip the cap upside down and push the tip into the top of the tube. Twist the cap to break the seal, and then remove the cap. For cats and dogs under 20 pounds: Part the hair at the base of the neck and apply the entire tube to the skin.  For dogs over 20 pounds: Part the hair at the base of the neck and apply to the skin; do this in one to three more spots from the neck to the upper back depending on the size of your dog. Keep the tube squeezed so the liquid isn’t sucked back into the tube. Make sure the tube is empty. Featured Image: iStock.com/Liliboas"}]