[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Making Dogs Throw Up", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/little-mongrel-dog-with-chocolate.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DBKgDb0Hr5MOW45JvMGFDn4-nV25v8NUrnmoOZ1lxWYM%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/little-mongrel-dog-with-chocolate.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DBKgDb0Hr5MOW45JvMGFDn4-nV25v8NUrnmoOZ1lxWYM%3D.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, General Care, Poisoning, Emergency, Vomiting, Adult, Senior, Puppy", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/poisoning/making-dogs-throw-up"}, "datePublished": "February 24, 2023", "dateModified": "February 25, 2023", "description": "Is it safe to make your dog throw up at home? Find out what to do if your dog eats something poisonous or swallows part of a toy or another object.", "articleBody": "Dogs are naturally very curious, which can lead to eating things they are not supposed to eat. Non-food objects like rocks, socks, and underwear can all cause an intestinal blockage (obstruction) that could result in emergency surgery. Common food items that are dangerous for dogs include grapes, gum or candy containing xylitol, chocolate, and foods that contain garlic or onions.  Dogs can also get into their own prescriptions or human medications, such as Tylenol, non-steroidal anti-inflammatories (NSAIDs), birth control, benzodiazepines, cold and flu medication, antidepressant medications, and marijuana. Ingestion of chemical poisons such as rat poison, fertilizers, insecticides, pesticides, herbicides, and antifreeze is also a major concern.  When dogs eat something they’re not supposed to, one of the mainstays of treatment at the emergency clinic is often to induce vomiting. So you may think that you can just skip the trip and expense and try to make your dog throw up at home. Here’s some useful information on the pros and cons of making dogs vomit, and what to do if you suspect your pet may have eaten something dangerous.  Should You Make Your Dog Throw Up? When dogs eat something they’re not supposed to, your first instinct might be to make them throw it up. Often, this is correct and exactly what your veterinarian will recommend. However, inducing vomiting has some potentially serious risks and should not be done in every situation. If you think your pet has ingested a foreign object or potentially toxic substance, contact your veterinarian immediately.  Your vet can help you determine if making your dog throw up is the right thing to do, then monitor for any side effects.  However, in some cases, inducing vomiting may cause more damage than ingesting the toxin did. Situations where your vet may caution against inducing vomiting include: Certain caustic chemicals, such as toilet bowel cleaners or drain cleaners, may cause ulceration and lesions if your pet vomits.Other toxins, such as zinc or aluminum phosphides found in mole and gopher baits, can create a deadly phosine gas when they mix with stomach acid. In this case, making your pet vomit can cause damage to the lungs of people and pets who breathe in the gas.Sharp objects, like glass or pointed plastic, may damage your pet’s esophagus if they are made to vomit.Smooshed-faced dogs such as Pugs, Bulldogs, Boxers, and Boston Terriers are at higher risk for aspiration pneumonia due to their short noses and high incidence for brachycephalic airway syndrome. Aspiration pneumonia can be deadly in dogs. Some toxins are also more likely to cause aspiration pneumonia if the dog vomits, whether they have a flat face or not. For example, when dogs ingest Tide pods, the liquid detergent can become very foamy and more easily travel into the lungs. Your vet will need to determine on a case-to-case basis if the risks of inducing vomiting outweigh the benefits.It may also be too late to induce vomiting. If your pet ingests a foreign object or toxic substance, timing is important. A general recommendation is to induce vomiting within 2 hours of ingestion. If a foreign object has already moved from the stomach into the intestines, vomiting is no longer effective. Likewise, if a toxin has already been absorbed or your pet is showing clinical signs (especially neurologic signs like seizures), vomiting is no longer an effective or safe option. There are exceptions, but time is of the essence in the case of ingestions. Can You Use Hydrogen Peroxide to Make a Dog Throw Up? Ultimately, it’s safer to skip the hydrogen peroxide and contact your veterinarian. Hydrogen peroxide has been used for many years to induce vomiting at home. However, hydrogen peroxide causes severe ulcers in the stomach when administered orally to dogs. And recent studies have shown that it may be more dangerous than people used to believe, especially at higher concentrations or if you administer too much. Aside from hydrogen peroxide, also avoid these dangerous methods: Salt: Salt should never be used to induce vomiting, as ingestion of large amounts of salt can lead to life-threatening sodium levels in your dog&#039;s blood (hypernatremia), resulting in tremors, seizures, and even coma. Gagging pets: Sticking your finger down your dog’s throat will NOT make them vomit. Dogs do not have the same gag reflex as humans. This is traumatic for the dog and can result in injury to their throat as well as them reflexively biting you. Olive oil: Olive oil is not good for pets and may lead to pancreatitis, diarrhea, and increased risk for aspiration pneumonia if the pet does vomit.  Ipecac: This old method of inducing vomiting is very unsafe. Ipecac ingestion can cause potentially deadly heart issues such as slow heartbeat and abnormal heart rhythm. What to Do if Your Dog Ate Something They Shouldn’t Have If your pet eats something they should not have, don’t panic! The best thing to do is to immediately call your veterinarian. Quickly gather information on the product your pet ate, if known, how much they ate, and approximately when they ate it. Then call your veterinarian and share everything you’ve learned. They will advise you if vomiting is the best option and the best way to go about that. Most likely, your vet will recommend an immediate visit to their office or the local emergency hospital so they can handle the situation properly. If you cannot reach your veterinarian, call the Pet Poison Helpline at 855-764-7661 or the ASPCA Animal Poison Control Center at 888-426-4435 for more help determining if your pet needs to go to the emergency room. In life-threatening situations, the animal control center may be able to make recommendations to induce vomiting at home under specific guidance.  Inducing vomiting should always be done under the guidance of a veterinary professional. Making a dog vomit is a veterinary procedure that comes with potentially life-threatening risks if done incorrectly.  However, in cases of toxicity and foreign body ingestion, safely inducing vomiting under the supervision of your veterinarian can be lifesaving.  How Vets Make Dogs Throw Up The vet clinic will be able to administer medication to more safely induce vomiting in your dog. The most common drugs used in the veterinary clinic for this are: Apomorphine: This medication is typically given as an injection in a clinic and is effective in inducing vomiting in 94% of cases, typically within 15 minutes. Clevor (ropinirole ophthalmic solution): This medication is FDA-approved in dogs and is administered as an eyedrop. It is effective in inducing vomiting in 95% of dogs within 30 minutes.Featured Image: iStockPhoto.com/Sonja Rachbauer"}]