[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "1. What happens if my dog licks a cleaning product?", "acceptedAnswer": {"@type": "Answer", "text": "If your pet ingests a cleaning product, contact their veterinarian or one of the animal poison control centers (Pet Poison Helpline at 855-764-7661 or the ASPCA Animal Poison Control Center at 888-426-4435) immediately to determine if your pet needs to go to the ER. "}}, {"@type": "Question", "name": "2. Is Lysol toxic to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Many Lysol products, like most common household cleaning products, can be toxic to pets. For example, Lysol can contain ammonia, bleach, and phenols, which are all toxic ingredients. If your pet is exposed to Lysol, locate the product’s label and contact your veterinarian. "}}, {"@type": "Question", "name": "3. Can my dog get sick from smelling cleaning products?", "acceptedAnswer": {"@type": "Answer", "text": "Yes. Inhaling some cleaning products can be dangerous to pets and result in damage to the lungs, coughing, and trouble breathing. "}}, {"@type": "Question", "name": "4. Is Clorox toxic to dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Most Clorox products contain bleach, which is toxic to dogs. "}}, {"@type": "Question", "name": "5. Is Windex toxic to pets?", "acceptedAnswer": {"@type": "Answer", "text": "Some Windex products contain toxic ingredients such as ammonia or bleach. If you suspect that your pet has had exposure to Windex, locate the product label and contact your veterinarian or one of the animal poison control centers (Pet Poison Helpline at 855-764-7661 or the ASPCA Animal Poison Control Center at 888-426-4435). "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Common Cleaning Products That Can Harm Your Pets", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/cleaning-products-that-harm-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/cleaning-products-that-harm-pets.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Cat, Dog, Adult, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/poisoning/cleaning-products-that-harm-pets"}, "datePublished": "April 7, 2023", "dateModified": "April 7, 2023", "description": "Cleaning your house can be tricky with pets, as some cleaning products can be life-threatening if ingested, inhaled, or even touched. Learn more about which cleaning products can harm your pet, and which are pet-safe to use instead.", "articleBody": "According to the ASPCA Animal Poison Control Center, 8.3% of pet poison calls are due to exposure to household cleaning products. Depending on their ingredients, cleaning products can pose dangers if your pet licks, inhales, or ingests them, or if they’ve come into contact with your pet’s skin or eyes.  This can make deep cleaning your house a tricky feat for pet parents, as cleaning product labels can be very hard to read and interpret for possible pet poisons and toxins. Here’s some useful information on common cleaning products that may be harmful to your pet, and what to do if you suspect your pet was exposed to them. What Makes Cleaning Products Dangerous? Some common ingredients that are toxic to pets include ammonia, bleach, chlorine, formaldehyde, and isopropyl alcohol. However, the level of toxicity and degree of illness can vary significantly based on the concentration, how much the pet is exposed to, and the route of exposure (ingested, inhaled, contact).  Common clinical signs of cleaning product toxicity in pets when ingested include: Drooling or pawing at the mouth Vomiting Not eating Diarrhea Abdominal pain Lethargy Disorientation  Seizures Coma Common clinical signs of cleaning product toxicity in pets when inhaled include: Sneezing Coughing Watery eyes Trouble breathing Increased rate of breathing Open-mouth breathing (in cats) Bluish-colored gums Common clinical signs of cleaning product toxicity in pets when contact with the skin occurs: Redness and irritation Sores or blisters Rash Chemical burns 6 Cleaning Products That Are Toxic to Pets Here are some common toxic ingredients found in many popular brand-name cleaners: 1. Ammonia Ammonia most commonly appears on the product label as ammonium hydroxide, which is ammonia combined with water. Type of cleaner Example Window cleaner Windex Original Glass Cleaner Floor polishing wax Pledge Tile and Vinyl Floor Finish Drain cleaner ComStar Blow Out Drain Cleaner Bathroom cleaner Lysol Aerosol Bathroom Cleaner Multisurface cleaner Windex Advanced Glass and Multi-Surface Cleaner Glass and mirror cleaner Walmart Great Value Original Glass Cleaner Carpet cleaner Resolve High Traffic Foam Pet stain remover Resolve Instant Eraser   Other products that may contain ammonia can include furniture polish, toilet bowl cleanser, oven cleanser, and stainless-steel cleaner.  2. Bleach and Chlorine Bleach and chlorine are chemically identical. The difference is their concentration: Bleach is more likely to have 3%–6% concentration, whereas pool chlorine can be 10%–12% concentration. The toxic ingredient most commonly appears on product labels as sodium hypochlorite.  Type of cleaner Example Multipurpose cleaner Lysol Bleach Multi-Purpose Cleaner Tile cleaner Tilex Disinfects Instant Mildew Remover Bathroom cleaner Scrubbing Bubbles Foaming Bleach Bathroom Cleaner Disinfectant Comet Disinfecting Cleaner with Bleach Bleach Clorox Disinfecting Bleach Pool chlorine tab In the Swim Chlorine Tabs Drain cleaner Drano   3. Formaldehyde Formaldehyde has many precursors and byproducts, and can appear on the product label under many names, including formalin, formic aldehyde, methanal, methylene, and quaternium-15. Type of cleaner Example   Bathroom cleaner Comet Laundry detergent Woolite   5. Phenol Phenol may appear on a product label under many names, including butylated hydroxytoluene, benzenol, carbolic acid, phenolic acid, Bakelite, and alkylphenols.  Type of cleaner Example Soap Carbolic soap Disinfectant Lysol Laundry detergent Woolite   6. Isopropyl Alcohol Isopropyl alcohol is also commonly listed on product ingredient lists as rubbing alcohol, with a percentage to indicate the concentration. It’s found in both antiseptics and cleaning products. Type of cleaner Example Electronics cleaner Windex Electronics Wipes Hand sanitizer Germ-X Disinfecting spray Lysol What To Do if Your Pet Is Exposed to a Cleaning Product If your pet was exposed to a cleaning product, this may be a medical emergency. Act quickly to determine if they need to be seen at the emergency room. Try to determine: How your pet was exposed Which product was involved How much your fur baby was exposed to Toxicity in pets varies greatly among household cleaners and can range from mild to life-threatening. It’s best if you have the packaging or can find the product label online to verify which ingredients are present. Even with the product label, however, it can be hard to determine if a toxic ingredient is present, because those ingredients may have multiple names.  Gather as much information as possible, then call your veterinarian to discuss whether your pet needs to be seen. You can also call the Pet Poison Helpline at 855-764-7661 or the ASPCA Animal Poison Control Center at 888-426-4435 for more help determining if your pet needs to go to the emergency room.  Pet-Safe Cleaning Products When possible, switching to pet-safe cleaning products reduces the risk of exposure to toxic chemicals. Some favorites are:   Puracy disinfectant spray Aunt Fannie’s floor cleaner Nature’s Miracle cleaners Bona multi-surface cleaner How to Keep Your Pets Safe Around Cleaning Products Prevention is key when it comes to exposure to household cleaning products. When you’re cleaning in a home with pets: Keep cleaning products in a secure location, out of paw’s reach. Do not leave cleaning products unattended. Keep pets out of the room while you are cleaning. Ventilate the room by turning on fans or opening windows. Consider using fragrance-free or odorless products. Make sure all surfaces and products are fully dry before allowing pets back in the room."}]