[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Pregnancy, Birth, and Postpartum Care: The Complete Guide", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Reproductive", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-with-her-puppies.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-with-her-puppies.jpg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Condition, Reproductive health, Adult, Pregnancy, Symptom Checker, C-Section", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/reproductive/dog-pregnancy-birth-and-puppy-care-complete-guide"}, "datePublished": "May 2, 2022", "dateModified": "October 11, 2023", "description": "Ellen Malmanger, DVM, explains dog pregnancy signs, dog pregnancy tests, how long dogs are pregnant, the stages of birth, how dogs give birth, and what you need to look out for.", "articleBody": "NOTE: If you are thinking of breeding your dog, please contact your veterinarian about important steps to take to ensure safe and healthy breeding practices. In addition, female dogs ideally should not be vaccinated while they are pregnant, so please confirm with your veterinarian that your dog is up to date with her vaccinations and heartworm/flea prevention before breeding. Many veterinarians across the country specialize, or have a particular interest, in canine reproduction. It is crucial to contact a reproductive veterinarian before breeding your dog to keep her and her puppies as healthy as possible. The Society for Theriogenology has an active list of reproductive veterinarians and the procedures they perform. Just like humans require doctor appointments during pregnancy, dogs also require veterinary care before, during, and after they are pregnant.  If your dog is pregnant, this guide will tell you how to prepare a whelping (birthing) area, what to feed pregnant dogs, what to expect during the whelping process, and how to provide postpartum care. Dog Pregnancy Signs In the first few weeks, you may not notice any changes in your dog&#039;s behavior. Some pregnant dogs will seem more tired, some may vomit, and some may eat less. You may notice that your dog is gaining weight and her mammary glands are becoming more prominent. Late in pregnancy, many dogs will exhibit nesting behavior, such as dragging blankets to a safe place and rearranging pillows.   It is important to note that mammary development and color changes can also occur in non-pregnant female dogs during this time because of normal hormone changes. How Do I Know if My Dog Is Pregnant? Methods of confirming pregnancy include: A dog pregnancy ultrasound, which should be done around day 25–28 of the pregnancy. Abdominal X-rays, which can be done on day 45. There are available blood tests to determine pregnancy; however, they are inaccurate and not a valid method for determining pregnancy. Some vets may also be able to palpate (feel) a dog&#039;s abdomen to determine pregnancy, but this, too, is unreliable and can be unsafe for developing fetuses. Discuss these methods with your veterinarian for more information on which is best for your dog. Whether or not a female dog is pregnant, her hormones after a heat cycle are remarkably similar. Because of these hormones, false pregnancy (or pseudopregnancy) allows nonpregnant dogs to show symptoms such as lactation and maternal behavior changes. These changes are hormone-related and typically go away on their own with little or no medical intervention. Dogs experiencing pseudopregnancy rarely require medical treatment related to the condition, but side effects or complications are possible, and it is essential to talk to your veterinarian. If your dog isn’t going to be bred, spaying her can prevent future episodes. How Long Does Dog Pregnancy Last? A dog’s pregnancy length (or gestation period) is around 63 days from ovulation, or just over two months. Ovulation is determined by monitoring the hormones progesterone and luteinizing hormone (LH). Reproduction veterinarians commonly perform this testing. By determining the day of ovulation, a veterinarian can specify a highly accurate due date down to a three-day window. If ovulation timing is not performed, a dog&#039;s ovulation date is largely unknown, and the due date may range from 58–68 days from breeding. A dog’s pregnancy length (or gestation period) is around 63 days from ovulation, or just over two months.A veterinarian should examine the female dog before breeding to determine physical health and fitness for pregnancy. The pregnant mother should again be examined by a veterinarian in the middle and end of pregnancy for pregnancy diagnosis, health tests, and planning for whelping. What to Feed Pregnant Dogs Many pregnant dogs should be transitioned to a higher-calorie diet in the last few weeks of their pregnancy, especially for dogs with large litters. This diet should be a commercial diet labeled for pregnancy and lactation or a diet labeled for puppies. In addition, there are several high-quality, over-the-counter, veterinary-recommended diets labeled for pregnant dogs, such as Royal Canin Mother &amp; Baby dry food or canned food. Ask your veterinarian about the appropriate diet for your pregnant or lactating dog. Pregnant and lactating female dogs should be kept on this higher-calorie diet through weaning. It’s important to note that puppy foods designed for large breeds are generally not recommended for pregnant and lactating dogs because of their different vitamin, mineral, and caloric content. Raw diets are also discouraged due to the high potential for infections that can cause abortion or fetal compromise. Health Considerations for Pregnant Dogs Parasites You should have a fresh stool sample checked by your veterinarian during pregnancy, as intestinal parasites can spread to the puppies both in utero (in the womb) and during nursing. Do not use over-the-counter dewormers for your pregnant or nursing dog, as some of these could be dangerous. Instead, your veterinarian can prescribe the appropriate medication if her stool sample shows parasitic infection. Vaccinations Pregnant female dogs, ideally, should not have vaccinations. So make sure your dog is up to date on her shots and flea, tick, and heartworm prevention before she becomes pregnant. But there are a few circumstances in which a female dog should be vaccinated during pregnancy. Newborn puppies are born without an immune system. They rely on their first 24 hours of nursing to receive protective antibodies through the mother&#039;s first milk, called colostrum. To best protect puppies, the mother should have high antibody levels to pass on. If she is not up to date on one of the core vaccines—the combination distemper and parvovirus—veterinarians may elect to vaccinate a dog during pregnancy if the benefits outweigh potential risks. Talk to your vet at your pre-breeding exam to determine vaccination status. How to Prepare for Dog Birth Many dogs give birth naturally. However, there are some breeds, such as English Bulldogs, French Bulldogs, and other short-nosed dogs, that cannot typically whelp naturally. Planned caesarian sections are often required in these cases, so working closely with your veterinarian is essential.  For those whelping naturally, near the end of your dog’s pregnancy you should create a quiet nesting area for the whelping process. This area should be warm and comfortable, and your dog should be able to get in and out as she pleases while keeping the puppies contained. It’s also vital for the mother to be isolated from other dogs three weeks before labor and three weeks after delivery to prevent herpesvirus infection. This virus rarely causes disease in adult dogs but can be deadly for puppies. A pregnant dog’s temperature will drop well below 100 F within 24 hours of labor. Start taking her temperature a few days before her due date. Rectal temperatures are the most accurate. Many dogs give birth naturally. However, there are some breeds that cannot typically whelp naturally. Planned caesarian sections are often required in these cases.How Long Does It Take for Dogs to Give Birth? There are three stages of dog labor. Contractions in the first stage can last up to 12 hours. Puppies are usually born 30–60 minutes apart, but the mother dog may take a break between puppies that can last up to two hours. Here’s what happens in each stage. First Stage of Dog Labor: Start of Contractions The first stage is cervix relaxation and the start of intermittent contractions. However, you are not likely to see the contractions in the birthing process. Your dog will act restless during this stage, travel in and out of the nesting box, pant, dig, and sometimes even vomit. She will likely refuse food. This stage can last as long as 12 hours. Second Stage of Dog Labor: Stronger Contractions and Birth The second stage of labor begins with stronger, more frequent uterine contractions that eventually lead to the birth of a puppy. Puppies are usually born every 30–60 minutes, with 10–15 minutes of hard straining. Expect some puppies to be born tail-first, as this is not abnormal for dogs. It is normal for the mother to take a break during the whelping process, but it is important to know when to be concerned and call your vet. Signs for concern include: If your dog has been hard straining for more than 30 minutes If she takes longer than a four-hour break If there are fetal membranes in the birth canal without a puppy produced within 30 minutes If all puppies haven&#039;t been born within 24 hours If the mother seems to be in extreme pain Third Stage of Dog Labor: Afterbirth The third stage of labor includes passing all the fetal membranes, or placenta. The membranes, also known as afterbirth, are greenish-black and should not have a foul odor. Membranes should pass within 15 minutes of each puppy. Therefore, dogs will alternate between stages 2 and 3 with each puppy produced. How Many Puppies Can a Dog Have? The average litter size varies widely depending on the breed. Larger dog breeds typically have larger litters. The average number of puppies in a litter is six to eight, but some large breed dogs have been known to give birth to many, many more! Smaller breeds may have one to five puppies. Dogs that only have one or two puppies may not go into labor on their own and may require a C-section. Singleton pregnancies and dog breeds that do not typically give birth naturally may need a planned C-section, which you should discuss ahead of time with your veterinarian.  The average number of puppies in a litter is six to eight.Your veterinarian can take an X-ray in the last week of pregnancy to count how many puppies your dog is expecting. This clarity can help pet parents to prepare supplies and expectations. What Should You Do After a Puppy Is Born?  Puppies are born with a protective fetal membrane that the mother usually removes shortly after birth. If she does not remove this sac, you must manually remove it to stimulate the puppy to breathe. Break the sac, wipe away fluid from the puppy’s nostrils, open the mouth with the head facing down and wipe off any remaining fluids. Next, stimulate the puppy to breathe by stroking its body firmly with a towel. If the umbilical cord is not cut during birth or by the mother, you may need to cut it. But be careful not to pull on the cord, as this may cause damage to the puppy’s organs. Instead, break it about 1–2 inches from the puppy’s body, tearing it gently with your first two fingers and thumb. You may also want to purchase medical instruments, such as clamps and scissors, before the birth to assist in the process. If you are unsure how to complete this process or have any concerns, contact your veterinarian immediately. Issues to Watch for After Your Dog Gives Birth Here are some things to expect and what to watch for following the birth of the puppies. Vaginal Discharge Vaginal discharge may last in small amounts for up to eight weeks after the puppies are born. The discharge will normally appear reddish-black because it consists mainly of old blood. If the discharge is overly bloody, has an odor, or looks like pus, your dog should be examined by her veterinarian as soon as possible. If the discharge slows down but suddenly becomes worse, this could also be a sign to have her examined. Fever Continue taking your dog&#039;s temperature after whelping, as infections after birth are common. If her temperature is over 102.5 F or if she is acting sick, contact your veterinarian.  Metritis (Inflamed Uterus) Metritis, or inflammation of the uterus, can occur when a placenta is retained or some trauma occurs during delivery. Contact your veterinarian immediately if you see signs of: Fever Lack of appetite Odorous vaginal discharge Lack of interest in the puppies Lack of milk production Eclampsia (Drop in Blood Calcium Levels) Eclampsia may occur during whelping and the weeks after giving birth. It’s caused by the inability of the mother’s body to keep up with the calcium demand of lactation. Eclampsia is usually seen in toy breeds, and calcium supplementation during pregnancy predisposes a dog to this condition. Dogs with this condition will experience restlessness, abnormal mothering behaviors, itching face/nose, muscle spasms, a stiff gait, and even seizures. Consult your veterinarian as soon as possible if you see any of these behaviors, as eclampsia can be fatal. It is crucial to NOT supplement calcium during pregnancy, as it could have a counterintuitive and severe effect during lactation. Instead, talk to your veterinarian about calcium supplementation doses. Mastitis (Infected Breast Tissue) Mastitis, or inflammation of the mammary tissues, occurs when the mammaries become hard, red, and painful due to infection. The mother will likely be sore while nursing, but the puppies need to keep suckling to help reduce swelling and promote excretion of the infected material. It does not hurt puppies to nurse on these glands, even in the presence of infection, but the glands should be evaluated quickly. Contact your veterinarian if you are concerned that your dog may have developed mastitis, as your dog will likely need treatment. Agalactia (Not Producing Milk) Agalactia occurs when the dog’s milk is not produced. If the puppies are suckling well but not receiving any milk, it’s important to seek veterinary care and supplement puppies during this time. The first milk, or colostrum, provides the puppies with the necessary nutrients and antibodies from the mother to help build up their natural immunity to infections. If they do not get these essential substances during the first 24 hours of life, they will require additional veterinary care and will likely not thrive. Postpartum Care Here are the steps you should know for postpartum care, nutrition, and nursing. Keep Your Dog on a High-Calorie Diet Your dog should be kept on a higher calorie (pregnancy or puppy) diet for as long as she is nursing her puppies. Make sure she has food and fresh water readily available at all times. Create a Private Space for Your Dog and the Puppies Keep the mother dog and her puppies in a clean, quiet, low-traffic area of the house. If there is too much commotion around her, she may become stressed and neglect her puppies. Also, provide a safe space where she can rest away from her puppies while still having easy access to them. Monitor Nursing Newborn puppies should nurse every one to two hours, so your dog will likely be with them constantly for the first week or two. If you think that your dog may not produce milk or isn’t letting the puppies nurse, contact your veterinarian. Medications and vaccines should be avoided while your dog is lactating (nursing) unless approved by your veterinarian. Call Your Vet if Your Dog Seems Sick If your dog becomes ill, call your veterinarian immediately and let them know that she is nursing so they can prescribe safe medications if needed. Likewise, if your dog stops eating, vomits, or becomes very lethargic (weak and tired), or if you notice redness and swelling in any of her mammary glands, contact your veterinarian. Consider Spaying and Neutering There is no benefit to female dogs in having a litter of puppies. It can be highly demanding on her body, and some conditions during pregnancy, whelping, and nursing can be fatal. Talk to your veterinarian about spaying or neutering your dog when the time is right. Spaying is the only birth control for dogs. The cost of an unwanted pregnancy can be very high. Giving a litter of puppies proper veterinary care adds up quickly, and emergency cesarean sections can cost thousands of dollars. Small-breed dogs can be spayed at a younger age, as early as 6 months old. Large and giant dog breed spays may be delayed. Recent evidence shows that allowing some large-breed dogs to become skeletally mature before spaying or neutering may reduce the risk of joint problems later in life. For large and giant breed dogs, this may be anywhere from 9–18 months of age. Ask your veterinarian for their specific recommendation because there is no one-size-fits-all rule of when to spay or neuter your dog. There is no benefit to female dogs in having a litter of puppies. It can be highly demanding on her body, and some conditions during pregnancy, whelping, and nursing can be fatal.It is also important to consider the risk of pyometra (infection in the uterus), a life-threatening condition in intact (not spayed) dogs. The best way to prevent this serious and expensive medical condition is to have your dog spayed. In addition, spaying before the first heat cycle (which can occur as early as 6 months of age) can also reduce the risk of mammary cancer in your dog. Featured Image: iStock.com/JodiJacobson"}]