[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Rhinitis and Sinus Infections in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1466416341_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-1466416341_0.jpg"}, "author": {"@type": "Person", "name": "Jennifer S. Fryer, DVM", "url": "https://www.petmd.com/author/dr-jennifer-fryer"}, "keywords": "Dog, Adult, Symptom, Symptom Checker, Sinusitis/Rhinitis", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptom/rhinitis-sinus-infections-in-dogs"}, "datePublished": "June 20, 2023", "dateModified": "September 22, 2023", "description": "Dr. Jennifer Fryer explains what issues or conditions may be triggering your dog&#039;s sinus infection.", "articleBody": "What Is a Sinus Infection in Dogs?  When you think about a dog’s nose, you might imagine a wide-open space inside. But actually, the nose also contains tiny, bony curlicues of specialized skin cells covered with tiny hairs called cilia that help the dog smell and filter debris. These curlicues are very important filters that block dust, pollens, and other particles from getting into your dog’s airways. The sinuses, however, are open spaces where infections can occur. The frontal sinuses are in the back of the nose, near the forehead. The sphenoid sinus is near the middle of the head. In dogs, the maxillary recess in the cheek is so small that it is often empty. In brachycephalic dogs (short-nosed dogs, such as the Pug or French Bulldog), the frontal sinuses are very small or nonexistent. Sinuses have several important functions: They decrease the weight of the skull They improve the sound of the voice They buffer the nose from outside temperature changes They humidify the air the dog breathes in The mucosal lining of the sinuses helps fight infection Since sinuses are surrounded by skull bones, sinuses have little escape from infection when there is infection or a mass in the nose. Sinus infections can also be difficult to treat because there is little blood supply in the sinuses to deliver antibiotics. Symptoms of Sinus Infection in Dogs  Intermittent sneezing Nasal discharge (clear, gray, white, yellow, green, sometimes bloody) Swelling or depressions on the face or one side of the nose Swelling and drainage under an eye if a tooth root is abscessed Poor appetite This may be due to a reduced sense of smell In severe cases, this may be due to the inability to breathe easily while eating or drinking. If this is the case, veterinary care is needed immediatelyLethargy Hesitant to move their head because of pain Bad breath Noisy/congested breathing Open-mouth breathing and heavy panting If you see your dog excessively panting, the tongue is hanging low, has reddened or bluish gums, is acting disoriented, has a wobbly walk, is vomiting, or has a rectal temperature above 103.5 F, your dog needs veterinary care right away. Causes of Sinus Infection in Dogs   Trauma to the nose or face Nasal or sinus tumor Bacterial or fungal infection, such as Cryptococcus sp. or Aspergillus sp. (especially in German Shepherds)  Tooth root abscess, especially the upper fourth premolar Chronic idiopathic rhinosinusitis (meaning long-term, cause-unknown inflammation of the nasal passages and sinuses Ciliary dyskinesia, a genetic disease that affects the cilia, hair-like structures in the nose, ears, and lungs in dogs. The cilia do not move much, so any debris that lands in the respiratory tract is unable to be cleared away as it usually would. This makes the dogs prone to bacterial infections. Sinus cyst, especially in brachycephalic breeds How Veterinarians Diagnose Sinus Infections in Dogs  The sinuses are not accessible for examination in pups that are awake, except for visible loss of symmetry or deformity of the face. Diagnosis requires general anesthesia, a clinical examination, diagnostic imaging, and endoscopy with tissue biopsies. Additional testing may include: Complete blood count (CBC): This may be normal or show elevated white blood cell count. Fungal blood tests for Cryptococcus sp. or Aspergillus sp.: A cytology or biopsy may be needed for definitive diagnosis. Fine needle aspirate of a lymph node or facial swelling: The slides are sent to a pathologist for interpretation. Dental X-rays under anesthesia if a tooth root abscess is suspected. Skull X-rays under sedation: These are difficult to perform and give limited information. CT scan of the nose/skull under sedation or anesthesia: A CT scan gives excellent images of the nose, sinuses, and skull. Rhinoscopy: This is a lighted scope that looks inside the front and back of the nose and takes biopsies and cultures. Treatment of Sinus Infections in Dogs  The goal of treatment is always to address the underlying cause of the pain and nasal signs whenever possible. Treatment may include medication or surgery. Medical Therapy Dogs with bacterial infections in the nose and sinuses are typically placed on antibiotics given by mouth. Some vets may also prescribe antibiotics to be given as drops in the nose or with a nebulizer. Dogs with chronic (long-term or recurrent) sinusitis due to bacterial infections are often treated with many rounds of antibiotics. This can make the antibiotics less effective because of antibiotic resistance. Pet parents can help prevent resistance by making sure to complete antibiotic courses, getting veterinary advice before starting a course of antibiotics, and avoiding antibiotic use unless it is necessary. Dogs with ciliary dyskinesia are treated with nebulization and antibiotics as needed for recurrent infections. Dogs with chronic idiopathic rhinosinusitis may benefit from anti-inflammatory treatment with NSAIDs (such as meloxicam) or a steroid (such as prednisone) when symptoms flare up. NSAIDs and steroids should never be given at the same time.  If a veterinarian diagnoses a fungal infection, treatment depends on the type of fungal infection and its location (nose, sinus, and whether the infection extends into the brain). Aspergillus sp. infections are most common in German Shepherds but can be seen in any dog breed. The treatment is removal of visible fungus spots (plaques) within the nose and an infusion of sterile antifungal solution  into the nose.  Cryptococcus sp. is typically treated with medications such as amphotericin B or fluconazole. Occasionally, frontal sinus infections may be treated with rhinoscopy or surgical treatment for flushing or removal of fungal plaques. Surgery A dog that has had head or face trauma may suffer nose or sinus fractures. If so, they would need surgery to relieve their pain and prevent long-term sinus and nasal infections. Dogs with a tumor in the sinus or nose region may need surgery to remove the tumor or reduce its size. This surgery may be done after chemotherapy or radiation therapy has already been attempted to shrink the tumor. When an abscess (pocket of pus) is present in a tooth root, that infection can spread to the nose and sinus. Antibiotics alone will not clear the infection until the tooth has been removed while the dog is under anesthesia.  Brachycephalic (short-nosed) dogs with recurrent nasal/sinus infections may benefit from surgery to widen their nostrils and/or remove extra soft palate tissue from the back of the mouth and their everted laryngeal saccules in their throat to ease their breathing. Once they are able to breathe more normally, many short-nosed dogs have fewer sinus infections. Dogs with long-term infections of the frontal sinus may benefit from rhinoscopy or surgery with flushing and culture of the frontal sinus. The procedure is often recommended for dogs for whom repeated courses of medications have not relieved symptoms. Brachycephalic dogs with a sinus cyst may have the cyst removed by rhinoscopy or occasionally with surgery of the frontal sinus. Recovery and Management of Sinus Infections in Dogs  Medical Therapy Bacterial infections in the nose and sinus may be cleared by one course of antibiotics. But recurrence is common due to the anatomy of the nose, which allows for pockets of infection to persist. These infections typically are not life-threatening but may be bothersome to the dog and pet parent. Dogs with ciliary dyskinesia have a very guarded to poor long-term prognosis, as they have difficulty clearing infections with poorly functioning respiratory cilia. Chronic idiopathic rhinosinusitis is a recurrent disease. Some dogs have episodes of the disease with relief for long periods between episodes, while other dogs are persistently affected. If the episodes are persistent, a full diagnostic work-up including CT scan and rhinoscopy is recommended to rule out an underlying infection or nasal mass that could be complicating the disease. Dogs with aspergillus sp. infections in the nose have a better chance of cure if they are young, if more plaques were able to be removed before treatment, and if the dog was not sick for a long time before diagnosis. Brain infections have a more guarded prognosis. Similarly, cryptococcus sp. infections of the brain have a more guarded prognosis than nasal infections. Sinus infections are more difficult to clear, have a longer treatment time, and may require surgery. Surgery Recovery from surgery to repair fractures, trauma, or mass in the nose/sinus may take  several weeks, depending on the extent of the wounds and the complexity of the repair. The long-term prognosis is generally good after a fracture repair, although some dogs are more susceptible to bacterial infections due to loss of the normal bony structures inside of their nose. Dogs that had a tooth root abscess removed generally need to eat soft food for 7-10 days and will go home on antibiotics and a pain reliever. Once the area has healed, the prognosis is excellent. Brachycephalic dogs that have surgery to widen their nostrils and/or remove extra soft palate tissue and their everted laryngeal saccules to ease their breathing will have hospital stay and a recovery lasting about 10 days. Afterward, their prognosis for breathing better is very good. The surgery cannot change the size of the sinuses (due to the shape of the skull), but by improving airflow, nasal and sinus infection occurrences should decrease. Featured Image: iStock.com/Gorica Poturak"}]