[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Tips for Helping House Guests with Pet Allergies", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/allergies-guests-529672852.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/allergies-guests-529672852.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Allergies, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/8-tips-helping-house-guests-pet-allergies"}, "datePublished": "June 29, 2016", "dateModified": "August 30, 2022", "description": "If you have pets, you may have some friends or family members who are allergic to them. For severe allergies, visits away from home may be best, but for less severe allergies, there are some simple steps you can take that will make everyone breathe a little easier. Learn more.", "articleBody": "by Geoff Williams Some people love dogs and cats… from a distance. That is, the moment they get close and personal, they start sneezing or coughing, or worse, have trouble breathing. If you have pets, you may have some friends or family members who are allergic to them. And while some TV animal reality shows have created a lot of drama out of pet owners having to choose between a significant other or the dog or cat, there&#039;s really nothing entertaining about having someone you care for tell you that they can&#039;t visit your home or hang out with you because of their allergies. Obviously, if this is a friend or family member who has severe, life threatening allergies, common sense should tell you that you&#039;ll want to visit their home instead of risking a visit to yours, and with any luck, your relationship won&#039;t suffer. But if a house guest has less severe but still annoying allergies, and they&#039;re coming over for a visit, there are some simple steps you can take, along with a couple of Hail Mary passes, that will make everyone breathe a little easier. Start Cleaning OK, you figured that. But specifically, get out the vacuum, and if you don&#039;t already do it, keep your pets away from any guest bedrooms and off upholstered furniture, says Robin Wilson, an ambassador for the Asthma and Allergy Foundation of America and the author of Clean Design: Wellness for Your Lifestyle. She is also a New York City-based interior designer who specializes in creating healthy homes. Wilson advises people to limit their pets&#039; access to carpets and rugs, where possible. Why? Because carpets are like theme parks for pet allergens. If you have pet dander, it lives in your carpet and probably isn&#039;t going anywhere, unless you have your carpets professionally cleaned. Wilson also recommends that pet owners &quot;clean the areas where your pet spends the most time as carefully and frequently as possible,&quot; especially if your guest will be spending time in any of those areas. And pay particular attention to cleaning the guest room, says Sarah Nold, DVM, an on-staff veterinarian with Trupanion, a pet medical insurance provider that is based out of Seattle, WA. Pet dermatology is one of Nold&#039;s specialties. Even better, if you have a guest room, and assuming it&#039;s practical, Nold suggests that you keep it off-limits to the pets at all times. There&#039;s nothing worse than waking to finding yourself wheezing, hacking, and having trouble breathing. Keep Your Home Well Ventilated Open the windows, and if you have a window fan, use it, Nold says. &quot;Running a window fan or opening windows improves ventilation,&quot; Nold says. In other words, you&#039;re trying to create an exit door for those allergens. But keeping your home well-ventilated works best along with vacuuming and dusting, Nold says. Run an Air Purifier This solution may not be practical if you&#039;re on a tight budget. Air purifiers can be expensive; easily into the hundreds of dollars. But if you do buy one, buy one with an HEPA filter. &quot;A good purifier with an HEPA filter will remove at least 99.97 percent of airborne particles,&quot; Wilson says. &quot;You could put the air purifier in the room where you and your visitor will be most of the time, or in his or her bedroom, if your guest is staying over,&quot; suggests Patrick Mahaney, DVM, a Los Angeles-based holistic veterinarian. Bathe Your Dog &quot;You can do it, or have a professional groomer do it, but either way, it&#039;s a good idea for a dog to get a bath shortly before a visit to reduce some of the allergens and dander,&quot; Mahaney says. Brush Your Cat  &quot;Most cats don’t tolerate bathing, although if yours does, using a hypoallergenic shampoo to bathe your cat is an option,&quot; Nold says. &quot;However, regular brushing is usually sufficient to decrease the amount of dander and hair that is shed into the cat’s environment, such as your house,” says Nold.  “You can also use grooming wipes for cats, preferably hypoallergenic and fragrance free.&quot; She suggests you don&#039;t use any medicated shampoos or wipes on either your dog or cat, unless they&#039;ve been recommended by your veterinarian. Have Some Allergy Medicine Around It can&#039;t hurt to stock some over-the-counter allergy medicines in your cabinet for your house guest, Mahaney says, citing Claritin, Benadryl, and Tavist as some types of medications you may want to seek out. Keep Your Pets in Another Room or Out in Your Yard It depends on how bad your guest&#039;s allergies are, and, of course, it may not be practical or advisable to have your pets outside, if, for instance, your cats are indoor cats, or the weather isn&#039;t working in your pet&#039;s favor. But if your visitor&#039;s allergies are pretty bad, this might be the time to find a kennel or at least remember to keep your pet off in another room. Obviously, you don&#039;t want to clean your home and remove virtually every scrap of dog fur and cat hair only to fall into your natural habits and have your pets come bounding in when your guest arrives. Make Other Accommodations And if things get really sneezy and wheezy or you simply don&#039;t have the time to make your home allergy-free? &quot;You could prepare a listing of some nice local hotels,&quot; Mahaney says."}]