[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Eye Allergies: Symptoms and Treatment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-eye-discharge.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-eye-discharge.jpg"}, "author": {"@type": "Person", "name": "Matthew Everett Miller, DVM", "url": "https://www.petmd.com/author/dr-matthew-everett-miller"}, "keywords": "Dog, Allergies, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/dog-eye-allergies-symptoms-and-treatment"}, "datePublished": "July 6, 2020", "dateModified": "August 12, 2022", "description": "Do your dog’s eyes look a little goopy or have a discharge? Here’s what you need to know about dog eye allergy symptoms.", "articleBody": "If you notice that one or both of your dog’s eyes are red, you may be wondering what the cause could be. Dogs with allergies more commonly show symptoms related to the skin or intestinal tract, but it is possible that allergies may be causing the irritation in your dog’s eyes—just like in people with seasonal allergies. The medical term “allergic conjunctivitis” is used to describe inflammation of the eye that’s usually caused by environmental allergens like pollen and mold. Dogs with skin-based allergy symptoms (allergic dermatitis) are more likely to experience allergic conjunctivitis than dogs with no history of allergies. If you believe that your dog is suffering from allergic conjunctivitis, it’s important to have them seen by a veterinarian to rule out other more serious diseases that can have similar symptoms. Here’s what you need to know about dog eye allergies. Symptoms of Dog Eye Allergies  In dogs, redness of the eyes is a vague symptom that can be caused by a wide variety of underlying diseases. For allergic conjunctivitis, the redness is usually seen in both eyes. You may also notice symptoms like: Squinting of the affected eye(s) Pawing at the face Discharge coming from one or both eyes Dog Eye Allergies and Itchy Skin If your dog has a history of itchy skin, it&#039;s worth mentioning to your veterinarian. Dogs with itchy skin will more commonly experience allergic conjunctivitis than the general dog population. Affected dogs are usually under 3 years of age when they first become symptomatic. Although all dog breeds have the potential to develop allergic dermatitis, common breeds with a predisposition for this condition include: Boxer Cocker Spaniel French Bulldog German Shepherd Golden Retriever Labrador Retriever Poodle West Highland White Terrier How Do Vets Diagnose Dog Eye Allergies? Although a test called “conjunctival cytology” may reveal inflammatory cells that will confirm a diagnosis of allergic conjunctivitis, the cells are not always present. As a result, many veterinarians will diagnose eye allergies through the process of elimination. Your veterinarian may perform several brief tests to rule out diseases with similar symptoms, like eye infections, dry eye, or corneal ulcers. Other details, like your dog’s age, breed, and history of itchy skin, can also help point your veterinarian to this diagnosis. In rare cases, a biopsy of the conjunctival tissue around the eyes—taken while your dog is under general anesthesia—may be needed to achieve a definitive diagnosis, or to rule out other, more serious causes of red eyes. An emerging test called the conjunctival provocation test has shown promise as a quick and easy test to definitively diagnose allergic conjunctivitis. However, it’s currently not widely available and would likely be performed by veterinary dermatologists—not your general practice veterinarian. What Can You Give Dogs With Eye Allergies? In mild cases, simply flushing the eyes with sterile saline once or twice a day may be enough to remove the allergen and resolve the symptoms. You should not use contact solution for this purpose. Although antihistamines provide relief for people with eye-related allergies, antihistamines have a variable effect in dogs with this condition. Therefore, eyedrops containing steroids are often the treatment of choice for dogs with allergic conjunctivitis. It’s important to note that steroid-based eyedrops can be very harmful to dogs with other, similar diseases in the eyes, so you should never start treatment without first consulting your veterinarian. Severe cases may require the use of oral medications in addition to eyedrops. Follow-Up Testing and Treatments  Generally, a recheck is recommended after one to two weeks of treatment so that your veterinarian can assess how well the medications have worked. If minimal improvement is seen, it’s possible to be seen by a veterinary dermatologist, who can perform allergy testing and other diagnostics to uncover which allergens may be triggering your dog’s allergic conjunctivitis. If possible, the allergens are removed, often by changing the diet. If removing allergens is not possible, your dog’s dermatologist may suggest immunotherapy for long-term treatment. If the allergen can’t be removed or treated with immunotherapy, it is very likely that a dog with allergic conjunctivitis will experience flare-ups throughout her life. Fortunately, the symptoms caused by allergic conjunctivitis are fairly mild, and with proper treatment and management, affected dogs generally live long and happy lives. Featured Image: iStock.com/mustafagull"}]