[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Can a Dog Be Allergic to Cats?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Dog-looking-at-cat.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Dog-looking-at-cat.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Allergies", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/can-dog-be-allergic-cats"}, "datePublished": "May 6, 2019", "dateModified": "September 7, 2022", "description": "Can a dog be allergic to cats? Find out how to tell if your dog has an allergy to cats and what you can do about it.", "articleBody": "Reviewed for accuracy on May 6, 2019, by Dr. Katie Grzyb, DVM You already know that people can be allergic to cats. Exposure to cat dander creates a host of discomforting symptoms for humans, from sneezing and itchiness to wheezing and coughing. But can your dog be allergic to cats as well? Yes, dogs can actually be allergic to cats, and they can even suffer from many of the same symptoms as allergic humans do. But there are steps you can take to help manage your dog’s allergies so that your pets can happily coexist. Is Your Dog Allergic to Cats? While it’s fairly uncommon for a dog to be allergic to cats, it does happen. “We include a test for cat dander on our intradermal allergy test,” says Dr. Elizabeth Falk, a board-certified veterinary dermatologist at Cornell University Veterinary Specialists in Stamford, Connecticut. Dr. Falk explains that in her personal experience, “about 1 in 20 of my patients have a significant positive to cat dander on this test.” A dog that’s allergic to cats will have symptoms that are similar to other environmental allergies, says Dr. Susan Jeffrey, a veterinarian at Truesdell Animal Care Hospital in Madison, Wisconsin. Some of these symptoms include “lots of scratching and licking, leading to skin changes, such as redness, excoriations (repetitive scratching) and the development of pustules and/or crusts.” Some dogs may also exhibit respiratory signs, such as coughing, sneezing or watery eyes and nose, says Dr. Kristin Holm, a board-certified veterinary dermatologist with Veterinary Dermatology Consultation Services in Johnston, Iowa. “But this is not as common as it is in people.” Only your veterinarian can make an official diagnosis. Dr. Holm says that veterinarians first suspect that a dog has allergies based on his history. “It’s kind of like playing detective,” she says. “Then, the allergy can be confirmed through intradermal (skin) allergy testing or serum (blood) testing.” Is Treatment Available for a Dog That’s Allergic to Cats? There are no cures and no way to prevent an animal from developing allergies. The goal is to manage the symptoms, says Dr. Jeffrey. Dr. Jeffrey explains, “There are companies that make ‘allergy drops’ that are very similar to allergy injections that people with allergies receive. They desensitize the immune system to the allergens over a period of several months.” The desensitization process can take between 6-12 months. Dr. Falk says that veterinarians can tailor allergy vaccines, or “allergy drops,” to target specific allergies in dogs and build up their tolerance to the allergen. These treatments, referred to as allergen-specific immunotherapy, are generally quite effective in about 70 percent of dogs with allergies. Oral allergy medicine for dogs that works to stop itchiness—including antihistamines and Apoquel—is also available, says Dr. Jeffrey. “In addition, treatment of any secondary infections with antibiotics and/or antifungals will also help.” How to Help an Allergic Dog at Home There are some things you can try at home to help lessen your dog’s allergic reaction, says Dr. Holm. “The first is to strengthen the skin barrier from both the inside and the outside. From the inside, we can give higher levels or fatty acids, particularly eicosapentaenoic acid (EPA), through the diet or as a supplement.” “From the outside, bathing with shampoos designed to strengthen the skin barrier a few times a week is helpful, while also removing allergens from the skin and fur,” says Dr. Holm. Always talk to your veterinarian to determine the best solutions for your specific dog. Wiping pets with a damp cloth after they’ve been exposed to cat dander may also help decrease itching, says Dr. Jeffrey. Preventing Allergic Reactions to Cats in Your Dog The predisposition to developing allergies is largely genetic, says Dr. Holm. However, while it may sound counterintuitive, exposure to the allergen may actually be helpful, says Dr. Falk. “We used to think that children that grew up in houses with cats were more likely to be allergic to them, but we have discovered that the opposite is true; children that had cats in their households were less likely to develop allergies to cat dander.” While this is unproven, it is likely to be the case with dogs, too, according to Dr. Falk. “Having a mixed-pet household may decrease the likelihood of developing an allergy to a cat.” With allergen-specific immunotherapy, prescription pet medications and over-the-counter products available to manage allergies, you won’t need to find a new home for your kitty or dog. Check with your veterinarian for proper diagnosis and treatment recommendations. By: Paula Fitzsimmons Featured Image: iStock.com/PeopleImages"}]