[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does chlorpheniramine make pets sleepy?", "acceptedAnswer": {"@type": "Answer", "text": "One of the known side effects of chlorpheniramine is that it may make your pet sleepy. Slight drowsiness will usually decrease in severity the longer your pet is on this medication. If your pet is excessively sleepy, speak with your veterinarian about changing the dose of this medication or using an alternative product. If your pet is unable to be roused from sleep, this could be an emergency. Contact a veterinarian immediately or seek emergency veterinary care.  "}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Chlorpheniramine", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1321059181.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/iStock-1321059181.jpg"}, "author": {"@type": "Person", "name": "Stephanie Howe, DVM", "url": "https://www.petmd.com/author/dr-stephanie-howe"}, "keywords": "Dog, Cat, Medication, Allergies", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/chlorpheniramine"}, "datePublished": "November 28, 2022", "dateModified": "November 28, 2022", "description": "Chlorpheniramine is a common medication prescribed to treat allergies in dogs and cats.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What is Chlorpheniramine? Chlorpheniramine is an antihistamine frequently used in dogs and cats with allergies or itching associated with certain types of skin hypersensitivity. It has not been used with much success in dogs but is more widely used in cats, ferrets, and birds. In horses, it is used for insect bite hypersensitivity. Chlorpheniramine is an over-the-counter antihistamine that is best used to prevent allergies from occurring. Chlorpheniramine has also been used in dogs to prevent histamine release associated with mast cell tumors during surgery to remove these types of tumors. Chlorpheniramine is FDA-approved for human use under the brand names Aller-Chlor® and Chlor-Trimeton®. It is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field and veterinarians can legally prescribe or recommend certain human drugs for use in animals in certain circumstances. This is called extra-label or off-label use, because this use isn’t described on the drug label. In certain circumstances, your veterinarian may prescribe a compounded formulation of chlorpheniramine. Compounded medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by either a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. It is important to note that some chlorpheniramine products come in combination with other medications that are toxic to dogs and cats. As such, speak with your veterinarian about which product is right for your pet, as you will want to use products that  contain only chlorpheniramine when giving it to dogs or cats. How Chlorpheniramine Works Chlorpheniramine belongs to a class of medications called antihistamines. The body’s immune system releases a naturally occurring chemical called histamine to protect the body by responding to triggers (allergens) such as insect stings, parasites, or pollen. Histamine works to remove the allergen and can cause inflammation or pain, increase heart rate, dilate blood vessels, and increase stomach acid production in the process. Pets can produce other chemicals similar to histamine that also contribute to allergic reactions, which is why antihistamines such as chlorpheniramine tend to be less effective in pets than in humans. Chlorpheniramine Directions Follow the directions on the drug label or as provided by your veterinarian. Chlorpheniramine is typically given by mouth 2 to 3 times a day. Chlorpheniramine’s bitter taste may make it difficult to administer to pets. Some may become drowsy while on this medication, but the sedative effect typically lessens over time. Missed a Dose? Speak with your veterinarian about what to do if you forget to give a dose of chlorpheniramine. Generally, they will advise you to give it when you remember, or if it is almost time for your next dose, to skip the missed dose and resume your normal dosing schedule. In most cases, do not give extra or double doses. Chlorpheniramine Possible Side Effects The most common side effect of this medication is drowsiness. Additional side effects include: Vomiting Diarrhea Loss of appetite Constipation Dry mouth Excitement (especially in cats) Drooling (especially in cats – due to the bitter taste) Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans.  If you accidentally ingest a pet medication, call your physician or the national Poison Control Center hotline at 800-222-1222.   Monitoring No specific monitoring is required for this medication, but your veterinarian may recommend routine testing depending on your pets&#039; individual needs, other medications they may be on, or the issue that initially caused your pet to be placed on this medication. Call Your Vet If: Severe side effects are seen (see above) Your pet’s condition worsens or does not improve with treatment You see or suspect an overdose You have additional questions or concerns about the use of chlorpheniramine. Chlorpheniramine Overdose Information While chlorpheniramine is generally safe to use in pets, overdoses can occur. Symptoms of an overdose include: Excitability/agitation Seizures Fatigue (Lethargy) Loss of coordination Coma Dangerously low breathing or heart rate Severe dry mouth If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or contact an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Chlorpheniramine Storage Chlorpheniramine should be stored according to the medication label and at 77 F. Brief exposure to temperatures 59-86 F is acceptable. Keep the container tightly closed to protect this medication from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]