[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What home remedies are available for grass allergies in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "OTC shampoos (mild oatmeal shampoos, moisturizing shampoo, or medicated shampoo) can be used, as well as medicated wipes (KetoHex wipes or Mal-A-Ket wipes). Dogs with allergies can be safely bathed twice weekly without drying the skin. The shampoo needs to contact the skin for 10 minutes, prior to rinsing. Ask your vet about the best shampoo for your dog’s specific needs. "}}, {"@type": "Question", "name": "How can I tell if my dog is allergic to grass?", "acceptedAnswer": {"@type": "Answer", "text": "If your dog plays outside in grass, walks outside in grass, or simply lives near a grassy area and experiences symptoms of red, itchy skin or feet, or sneezing and runny eyes or nose, a grass allergy is likely. Your veterinarian can evaluate your dog’s skin and help determine if your dog has allergies. The vet may need to do further testing to determine a treatment plan. "}}, {"@type": "Question", "name": "Can you give a dog Benadryl® for grass allergies?", "acceptedAnswer": {"@type": "Answer", "text": "While Benadryl® or other anti-histamines may be recommended for grass allergies, often there are better options on the market with better efficacy for your pup.  These may include prescription allergy medications such as Apoquel (pill) or cytopoint (injection). It’s best to talk to your vet about the best choice for your pet. Featured Image: iStock.com/Chalabala"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Grass Allergies in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog.leash_.outside.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog.leash_.outside.jpg"}, "author": {"@type": "Person", "name": "Mindy Joyner, DVM", "url": "https://www.petmd.com/author/dr-mindy-joyner"}, "keywords": "Dog, Allergies", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/skin/can-dogs-be-allergic-grass"}, "datePublished": "March 2, 2022", "dateModified": "September 15, 2023", "description": "Dr. Mindy Joyner describes grass allergies in dogs, including symptoms, diagnosis, and treatment options.", "articleBody": "What Are Grass Allergies in Dogs? Grass allergies, which are common in dogs, are inhalant or contact allergies that can be caused by pollen associated with grasses. Grass pollens are airborne, so your dog doesn’t have to be physically on the grass to have symptoms. Grass allergies can lead to skin allergies or upper respiratory allergies.    Grass allergies are generally worse in the spring and fall seasons, when grass pollen is more prevalent due to the variation of seasonal species. But they may be a problem for your dog all year long. In dogs, the allergens (grass pollens) are absorbed by the skin and mucus membranes. Many dogs with grass allergies may also have flea allergies and food allergies.  Grass allergies can occur at any age, but most dogs start having allergies after the age of 1 due to prior exposure to the allergens. While the symptoms may be irritating for your dog, most are not life-threatening.    A severe allergic reaction, known as anaphylaxis, is rare. Anaphylaxis in dogs can occur within 5–30 minutes of contact with the allergen. Symptoms in dogs may include: Severe hives Facial swelling (especially around the eyes and muzzle) Wheezing Difficulty breathing An increased respiratory rate Vomiting and diarrhea, with or without blood.   If you think your dog is experiencing anaphylaxis or see any of these symptoms, seek veterinary care immediately.  Symptoms of Grass Allergies in Dogs Symptoms of grass allergies include:  Redness of the skin (erythema) Itching (pruritus), often constant Scratching, especially at the face, armpits, and sides of the body Licking or chewing, especially the feet A rash may also appear; but due to the haircoat on dogs, redness and a visible rash may be difficult to see  Causes of Grass Allergies in Dogs Grass allergies are caused by common grass pollens from grasses such as Bermuda, fescue, alfalfa, or rye. They have similar symptoms to allergies caused by pollens from trees (cedar, pine, oak) and weeds (ragweed, pigweed).   Dogs that enjoy rolling in the grass can get symptoms from direct contact. Others may get symptoms from inhaling the pollen during a walk or from simply being in an area where grass pollen is present—even indoors.   Grass allergies occur frequently during the spring and fall, when grass is growing and pollen leaves a yellow trail of dust behind. If a dog walks through an area where pollen is present and the pollen comes into contact with mucous membranes (nose, eyes, mouth), skin, and feet, the dog may experience symptoms. How Veterinarians Diagnose Grass Allergies in Dogs Your veterinarian will obtain a complete history regarding the symptoms present in your dog, including symptom duration, severity, seasonality, and treatment (if any).    The next step would be a thorough examination of the haircoat and skin. The distribution of hair loss, any lesions on the skin such as pimples, rashes, dry or oily skin; scratches (excoriations) due to itching, redness, or skin irritation (to indicate inflammation) will help determine the diagnosis.   Sometimes, symptomatic treatment can be initiated based on clinical symptoms alone, without any testing needed, depending on the case. If topical or conservative treatments are not effective, further testing may be needed to rule out other causes.  Allergy Testing Your Dog Your primary veterinarian may be able to perform serum blood testing for allergies. However, the gold standard of allergy testing and the one test that provides the most accurate result is called an Intradermal Skin Test, which is performed by a veterinary dermatologist. The intradermal test is usually performed under mild sedation. One side of the dog’s abdomen is shaved, and specific allergens are injected.   The area is monitored for the presence of hives, indicating an allergic reaction to the specific allergen injected in that location. If the allergens are identified, treatment is designed specifically for the individual pet.   Another option is hyposensitization therapy, which consists of “micro-dosing” the pet with the allergen to build up resistance over time.  Treatment of Grass Allergies in Dogs The goal of treatment will be to manage symptoms, as most grass allergies in dogs cannot be cured. Treatment is based on severity of symptoms. It’s always best to consult with your veterinarian on the best treatment for your dog. If symptoms are mild, the following topical therapies may be recommended:   Bathing in a hypoallergenic or mild oatmeal-based pet shampoo: Consistent bathing will help remove the allergens before they have time to be absorbed into the skin. This may help prevent or decrease the itching. There are several brands of oatmeal shampoos available without a prescription.   Trying a medicated shampoo: Medicated shampoos are not typically sufficient for treating an active infection, but they can help prevent an infection from happening by removing the allergens and reducing the amount of bacteria and yeast on the skin. Always talk to your vet about which medicated shampoo would be best for your dog.   Cleanliness after spending time outdoors: Ensuring that your dog’s feet and body are cleaned off after coming inside helps prevent licking and chewing of feet, a symptom of itching. You can use mild soap and water, aloe pet wipes, or medicated wipes that contain an antimicrobial and antifungal ingredient.    Antihistamines: Benadryl® may be effective for watery eyes, runny nose, and sneezing, but it is usually not effective for allergic skin conditions (allergic dermatitis). Be sure to discuss dosage with your vet before giving your dog any medication, even over-the-counter medications.   Fatty acids: Omega supplements and fatty acids can help decrease a pet’s skin inflammation and help with general itchiness.  For moderate to severe symptoms (including severe itching), other therapies may be recommended:  Short doses of corticosteroids: Medications such as prednisone, prednisolone, or temaril-P contain steroids which may be used in cases of severe itch.  These are by prescription only and typically should only be used short-term due to potential side effects of long-term administration.  Allergy medication: Apoquel® (a daily oral tablet), or Cytopoint® (an injectable given every four to eight weeks) may be prescribed to help alleviate itching. These are prescription medications, so your veterinarian will determine which is best for your dog.   Immunotherapy or hyposensitization therapy: These therapies can be used if the allergens have been identified by a blood or intradermal skin test. The treatment can be given in the form of weekly injections or an oral liquid medication, each of which are formulated specifically for the dog based on the results of the allergy test.   Recovery and Management of Grass Allergies in Dogs It’s important to determine, or at least narrow down, which grasses your dog is allergic to in order to prevent the symptoms. Dogs encounter all types of grasses, including those in yards, dog parks, or fields. It’s helpful to know which grasses are in your area, monitor symptom flare-ups, and avoid these areas when possible.  Allergies can be managed and symptoms controlled, but you should not expect a 100% cure. If symptoms are reduced by 80% (less itching), the treatment is considered successful. "}]