[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/y85p0zy63l", "@type": "VideoObject", "duration": "PT1M16S", "name": "5324819995001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/be67daa2b19d96202272cf4ead5b4251361da028.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/y85p0zy63l", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/02e95ab99bbda74fbc8e28966ff0ff302ac2e8e2.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/wellness/evr_multi_hype_of_hypoallergenic_pets?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Hypoallergenic Pets for People With Allergies", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/woman-with-cat-allergies-has-her-cat-in-her-lap.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/woman-with-cat-allergies-has-her-cat-in-her-lap.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Breed, Allergies", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_multi_hype_of_hypoallergenic_pets"}, "datePublished": "May 17, 2011", "dateModified": "September 6, 2022", "description": "Do you have pet allergies but really want to be a pet parent? Here are the types of pets that are as close as you can get to being hypoallergenic.", "articleBody": "Reviewed for accuracy on December 20, 2019, by Dr. Katie Grzyb, DVM If you have allergies, it can feel like your options are slim to none when trying to find the right pet. You might give up on ever having a pet if every animal you’ve encountered has caused sneezing, wheezing, coughing and itching. But all is not lost—there are plenty of pets that are as close to being hypoallergenic as you can get. Here’s a breakdown of which pets are best if you suffer from pet allergies. Click on a species to skip to that section: Dogs Cats Exotics &amp; Fish Small Animals Birds “Hypoallergenic” Dogs Contrary to popular belief, there is no such thing as a “hypoallergenic” dog. While some non-shedding, short-haired and hairless dog breeds are promoted as such, allergies are more complicated than fur alone. &quot;Unfortunately, this is a common myth,&quot; says Dr. Sonal R. Patel, a California-based allergist who is board–certified in allergy and clinical immunology. &quot;There are no &#039;nonallergenic&#039; dog breeds. The protein that causes allergies is found in an animal&#039;s saliva, dander and urine.&quot; So a specific type of fur alone will not guarantee any hypoallergenic qualities. But don’t lose all hope. Some dog breeds are known to produce fewer allergens. “There are low-allergen dogs,” says Dr. Sara Ochoa, a companion animal and exotic veterinarian in Texas and consultant for DogLab. “They are not 100% hypoallergenic, but they do not produce as much of the allergens as other dogs.” The following breeds may be more suitable for people with allergies: Low-allergen dogs: BasenjiBedlington TerrierSchnauzerIn addition to being low-allergen, breeds that shed very little don’t spread allergy-inducing dander around the home as widely, explains Dr. Ochoa. Low-allergen and low-shedding dogs: Airedale Terrier Bichon Frisé Chinese Crested Kerry Blue Terrier Poodle Portuguese Water Dog Soft Coated Wheaten Terrier West Highland White Terrier Keep in mind, however, that even low-allergen dogs can cause reactions. “There is no guarantee that picking a dog of a particular breed is a good way to reduce the amount of allergens in your home or to avoid symptoms,” says Dr. Patel. “Hypoallergenic” Cats  If you suffer from allergies, cats are particularly tricky pets. “Cats seem to be more allergenic than dogs,” says Dr. Patel. “Almost all already allergic people exposed to cats on a regular basis will develop a cat allergy.” The major allergen responsible for cat allergies is Fel d1, explains Dr. Patel. This protein is found primarily in cat saliva, which is spread throughout the animal’s fur during grooming. Currently, researchers are working on a novel new way to treat cat allergies. By immunizing cats against Fel d1, a new vaccine could effectively neutralize the protein, according to a promising study published in the Journal of Allergy and Clinical Immunology. However, until those options become publicly available, here’s what we know about potentially allergy-friendly cat breeds. A 2017 study suggested that Siberian cats may have Fel d 1 mutations that cause them to elicit less allergy responses, notes Dr. Ochoa, but further research is needed. Similarly to dogs, lower-shedding cat breeds spread less allergens around the home, says Dr. Ochoa. For people with mild cat allergies, the following “hypoallergenic” cat breeds may be less problematic. Bengal Burmese Colorpoint Shorthair Cornish Rex Devon Rex Javanese Ocicat Oriental Shorthair Russian Blue Siamese Sphynx Exotics &amp; Fish: The Most Allergy-Friendly Pets If you have allergies, you might consider an exotic pet, like a reptile, amphibian or fish. Because these animals lack both dander and fur, they’re essentially allergen-free, says Dr. Ochoa. “They’re great for people with allergies,” says Dr. Ochoa. “I have never encountered an owner who is allergic to their reptile, amphibian or fish. I recommend these to people who have severe animal allergies, but still want a pet.” `The only issues that Dr. Ochoa notes is that some people may be allergic to their reptile’s lunch. Feeder insects such as crickets, grasshoppers and locusts can exacerbate allergy and asthma symptoms. Highly sensitive individuals should consider herbivores, such as iguanas, or stick with a fish tank, says Dr. Ochoa. Birds That Are Less Allergenic  While our feathered friends don’t have fur, they do produce dander. However, birds are generally considered a safe choice for those with allergies. “Even people who are very sensitive to cats and dogs rarely have an issue with birds,” says Dr. Patel. For those who are especially sensitive, Dr. Patel recommends the following bird species. In addition to having less dander, their petite size reduces other possible triggers. Canaries Finches Parakeets Small Animals That Are Less Likely to Set Off Your Allergies  While reptiles have their fans, you may prefer to have a furry friend. Smaller companion animals (or pocket pets) including rats, mice, ferrets, gerbils and hamsters may be suitable for some homes. “It’s true that they’re mammals, so they carry similar allergenic potential as cats and dogs,” says Dr. Patel. “But they’re so much smaller that they produce considerably fewer allergens in their environment.” Small animals with longer hair, including many breeds of rabbits and guinea pigs, should be avoided, says Dr. Ochoa.   “Not only are people more allergic to these small pets, but they eat hay,” she points out. “Many people are very allergic to the hay that rabbits and guinea pigs need to eat to survive.” Before Bringing Home Your Pet  When you adopt a pet, you’re making a lifelong commitment to the animal. With this in mind, it’s important to ensure that allergies won’t inhibit your ability to care for your companion. Fortunately, there are ways to both test for allergies and reduce symptoms. “If you plan to introduce a pet into your home, have an evaluation by a board-certified allergist, including skin testing,” recommends Dr. Patel. “This will tell you for certain what you are allergic to.” If you’re found to be allergic to dogs or cats, consider immunotherapy, also known as allergy shots. “These shots will eventually desensitize you to these animals, so that you may one day be able to have a family pet without compromising your health or well-being,” says Dr. Patel. By: Monica Weymouth Featured Image: iStock.com/Maica"}]