[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Sago Palm Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/sago.palm_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/sago.palm_.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Adult, Puppy, Emergency, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/sago-palm-poisoning-dogs"}, "datePublished": "April 20, 2023", "dateModified": "April 20, 2023", "description": "Sago palm poisoning in dogs is a medical emergency. Dr. Veronica Higgs explains why sago palms are poisonous to dogs and what to do if you suspect your dog ingested a sago palm.", "articleBody": "What Is Sago Palm Poisoning in Dogs? Sago palm is an extremely toxic houseplant and landscaping plant seen in tropical and subtropical environments. It is common in the southern states, such as southern Florida and Georgia, but sold across the United States. The sago palm is a member of the order Cyadacae, genera Cyads, Macrozamia, and Zamias. Examples of Cyad family commonly include: Japanese cycad (Cycad revoluta), Cycad (Cyas cirinalis), Cardboard palm (Zamia furfuracea), and Coontie plant (Zamia pumila).  How Are Sago Palms Poisonous to Dogs? All parts of the sago palm are toxic, but the seeds (nut) are the most toxic. Ingesting as little as one seed can result in poisoning and even death to dogs.  A sago palm plant Image credit: Adobe/ New Africa  Sago palm seeds, the most toxic part of the plant. Image Credit: Adobe/ jlf46 There are three main toxins found in sago palms: Cycasin: This is the primary active toxic agent that results in gastrointestinal signs and liver damage that leads to liver failure. β-Methylamino-L-alanine (BMAA): BMAA is responsible for neurologic signs, such as seizures and coma. There is also another unidentified compound present in the plant known to cause neurologic signs. Symptoms of Sago Palm Poisoning in Dogs Ingestion of sago palm typically results in gastrointestinal signs within 15 minutes, but can be delayed up to several hours. These signs can include: Drooling Inappetence Vomiting (with or without blood) Diarrhea (with or without blood) Neurologic signs may be seen within 4 hours after ingestion of sago palm and can include: Weakness/Lethargy Stumbling Collapse Tremors Seizures Coma Finally, severe liver failure can be seen within 2 to 3 days after ingesting sago palm. Additional clinical signs of liver failure may include: Distended abdomen Abdominal pain Increased drinking and urinating Yellow discoloration to eyes, gums, skin (jaundice) Black-tarry stool (melena) Bruising Bleeding from nose or mouth Bloody urine Your Dog Ate a Sago Palm. Now What? If you see your dog eat any part of a sago palm plant or seed (nut), or suspect that it may have eaten it, go to a local veterinary emergency hospital immediately. Dogs should be treated as quickly as possible, as sago palm is extremely deadly.  Do not induce vomiting at home unless you have been specifically instructed to do so by a veterinarian.  You and your veterinarian can also contact one of the animal poison control centers for additional information. Call the Pet Poison Helpline at 855-764-7661, or the ASPCA Animal Poison Control Center at 888-426-4435 when heading to the veterinary emergency hospital.  How Veterinarians Diagnose Sago Palm Poisoning in Dogs Your veterinarian will collect a thorough history and, if possible, it is helpful to take a piece of the plant (leaves and/or seed). Also take a photo to make sure that the ingested plant was indeed a sago palm. The veterinarian will start with a good physical examination to assess your dog’s mental and neurological status. A complete blood count, serum blood chemistry, and urinalysis will likely be recommended for a baseline evaluation. Immediately after ingestion, the liver values are expected to be normal, but they will need to be monitored daily for the next 72 hours to monitor for signs of liver damage or even failure. Clotting times, specialized liver function tests (such as ammonia and bile acid tests), and abdominal ultrasound may also be recommended.  Treatment of Sago Palm Poisoning in Dogs If your pet ate any part of a sago palm within a recent four-hour period your veterinarian may recommend inducing vomiting at the hospital for decontamination. If your dog is already showing neurologic clinical signs, it may be too late to induce vomiting, as there is a risk of aspiration pneumonia.  Your vet  may provide activated charcoal to bind any additional toxin in the stomach.   Unfortunately, there is no specific medication for sago palm poisoning in dogs. Treatment is largely supportive care and treating clinical signs. Aggressive treatment is typically required for sago palm poisoning as it’s extremely deadly to dogs. Your dog will likely need to be hospitalized for a minimum of 48 hours and start on IV fluids for hydration and increased blood flow to the liver.  Additional medication will be given to treat the symptoms of vomiting and diarrhea, as well as treatment for tremors and seizures. Liver protectant medications are a crucial part of the treatment for sago palm poisoning, as well as antibiotics to help with acute liver failure. Blood or plasma transfusions, vitamin K, oxygen therapy, and blood sugar support using IV dextrose, may be needed depending on the severity of the poisoning. Recovery and Management of Sago Palm Poisoning in Dogs Early diagnosis and aggressive treatment are crucial in treating sago palm poisoning in dogs. Ingestion of any part of the sago palm can be fatal and dogs have their best chances of survival if seen quickly by a veterinarian.  Unfortunately, even with treatment, only 50 percent of dogs with sago palm poisoning survive. Rapid decontamination and aggressive treatment may improve survival odds, as well as potentially decrease the risk of severe long-term effects. Most dogs will remain hospitalized for observation and treatment for a minimum of 48 to 72 hours, but it may be longer, depending on the degree of liver damage. Typically, the veterinarian will recheck bloodwork to reassess liver values and clotting ability. Severely affected dogs may have permanent liver damage. Liver protectant medications will likely be continued for a minimum of 4 to 6 weeks but potentially for the rest of the dog’s life.  Prevention of Sago Palm Poisoning in Dogs Prevention is key when it comes to toxicities in dogs. Sago palms are deadly, so if you have pets, do not have them in your home or as part of your landscaping. If you live in an area where sago palm plants are common, such as southern Florida and Georgia, check your backyard regularly for any leaves or seeds of the sago palm that may have blown into your yard.  The best way to prevent sago palm poisoning in your dog is to prevent them from having access to these deadly plants. "}]