[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Poison And Toxicity", "item": "https://www.petmd.com/dog/emergency/poisoning-toxicity"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Carbon Monoxide Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/poisoning-toxicity/e_dg_carbon_monoxide_poisoning"}, "datePublished": "August 16, 2010", "dateModified": "August 17, 2022", "description": "Carbon monoxide is produced by all sorts of everyday equipment: older cars not equipped with catalytic converters, barbecues, or propane heaters and cookers, to name just a few. And in an enclosed space, the levels of gas can quickly become poisonous for dogs. Learn how to handle to such an emergency.", "articleBody": "Carbon monoxide is produced by all sorts of everyday equipment: older cars not equipped with catalytic converters, barbecues, or propane heaters and cookers, to name just a few. And in an enclosed space, the levels of gas can quickly become poisonous for dogs. What To Watch For A dog near a carbon monoxide leak will first demonstrate lethargy. Unless supplied with fresh air, the dog will eventually fall unconscious and die. Primary Cause Carbon monoxide poisoning is generally caused by leaky equipment. This may occur in enclosed, unventilated spaces, though even large areas like garages can become a death trap if the leak is not plugged quickly. Immediate Care It is vital you move the animal suffering from carbon monoxide poisoning to a wide, well-ventilated area. However, do not put yourself in danger while attempting to rescue the dog. If he has stopped breathing, perform artificial respiration. And if after you check his pulse you notice his heart has stopped, perform CPR (cardiopulmonary resuscitation) as well. If breathing restarts, contact your vet immediately for advice on how to proceed. If the dog is still not breathing, continue CPR and artificial respiration (if possible) while you transport the animal to the vet or emergency hospital. Prevention All equipment that uses propane or produces carbon monoxide as a by-product should be serviced regularly -- for your safety as well as your pet’s. Never leave the engine running while a car is in the garage or, if you are performing maintenance on the vehicle, open the garage door and keep the area well-ventilated."}]