[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Alcohol Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1296020685.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-09/iStock-1296020685.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/poisoning/alcohol-poisoning-in-dog"}, "datePublished": "September 26, 2022", "dateModified": "August 15, 2023", "description": "Dr. Barri Morrison explains alcohol poisoning in dogs, including the most toxic types of alcohol poisoning, and what to do if you suspect your dog has been poisoned.", "articleBody": "Alcohol poisoning is a common ingredient in many products besides drinks. Different types of alcohol are used in everything from hand sanitizer to antifreeze, and alcohol poisoning can quickly become fatal for a dog. The following are types of alcohol and an example of how they are used: Ethyl alcohol (also known as ethanol) is the type of alcohol in drinks but can also be used as a fuel additive. Methyl alcohol (also known as methanol or wood alcohol) is most often used in products like paint removers, ink, and antifreeze. Isopropyl alcohol (also known as isopropanol) is commonly known as rubbing alcohol for its disinfecting properties, but it is also used in alcohol-based flea sprays. Alcohol poisoning can occur by swallowing a substance or absorption through the skin. If you suspect your dog has gotten into alcohol or is showing signs of alcohol toxicity, contact your veterinarian or Pet Poison Helpline as soon as possible.  What Is Alcohol Poisoning in Dogs? All three main types of alcohol—ethanol, methanol, and isopropanol—are rapidly absorbed by the digestive tract (stomach, intestines, and colon) and through the skin. These chemicals can depress the central nervous system (CNS), damaging the organs throughout the body and impairing their ability to function. If left untreated, alcohol poisoning in dogs can cause organ failure and death. The kidneys will try to eliminate toxins through urine, and from the lungs through exhalation (breathing out), but enough alcohol can overwhelm these systems and lead to toxicity. Sources of Alcohol Poisoning in Dogs Ethanol (ethyl alcohol) includes the type of alcohol humans consume, but it is used in other products as well. Sources of ethanol include: Alcoholic drinks Fermenting (rising, raw) bread dough Some oral liquid medications Some mouthwashes Rotting/fermenting fruits Hand sanitizer Methanol (methyl alcohol) is also called wood alcohol and is used in many household products. Products include: Windshield washer fluid Gasoline additives Canned heating fuels such as Sterno Household solvents such as paint removers Isopropanol (isopropyl alcohol) is best known as rubbing alcohol. It is more potent than the other two types of alcohol. Besides rubbing alcohol, it is used in: Detergents Antifreeze Nail polish remover Alcohol-based external flea sprays and grooming agents Glass/window cleaners Perfumes and colognes Symptoms of Alcohol Poisoning in Dogs Symptoms of alcohol poisoning vary depending on the amount ingested/absorbed compared to your dog’s weight, and if your dog has a full or an empty stomach. Larger ingestions/exposures and having an empty stomach can cause the signs to be more severe. Clinical signs of alcohol poisoning in dogs begin around 15-30 minutes after ingestion but can take up to 60 minutes to become evident. Symptoms may include: Vomiting Excessive salivation Frequent urination, which may include increased thirst Diarrhea Lack of coordination Disorientation Depression Tremors Difficulty breathing Collapse, weakness Severe cases can progress to: Coma Low body temperature (hypothermia) Low blood pressure (hypotension) Seizures Low heart rate (bradycardia) Shallow breathing If fatal, death is often related to: Respiratory failure Hypothermia Low blood sugar (hypoglycemia) Other metabolic changes such as metabolic acidosis (too much acid in the bloodstream) Other conditions can also occur, such as aspiration pneumonia due to vomiting or muscle paralysis in the throat. Your veterinarian can do a blood alcohol level test to confirm diagnosis of alcohol toxicity. What To Do If Your Dog Ingests Alcohol Alcohol poisoning in dogs is time-sensitive. If you believe your dog has consumed alcohol or was exposed to products containing alcohol, contact your veterinarian or veterinary ER hospital as soon as possible. You can also contact the ASPCA Animal Poison Control Center at 888-426-4435 or the Pet Poison Hotline at 855-764-7661 for help. If your pet has been exposed to an alcohol toxin on the skin, such as with a flea spray, your vet may recommend bathing them with a shampoo. It is never recommended to make your dog vomit at home. All induction of vomiting should be done with the guidance of a veterinarian or veterinary staff to avoid the risk of aspiration pneumonia and chemical burns to the digestive system. The following information, if known, is extremely important to provide to your veterinarian:  The product your dog was exposed to How much they ingested or what was applied to the skin When the exposure occurred What abnormal signs you are seeing with your dog (if any)  Bring any product packaging you might have with you when you go to the vet or animal hospital. This helps them identify the type of alcohol poisoning to treat. Make sure your dog is safe from falls or other injury, due to intoxication, as you travel there. Treatment Options for Alcohol Poisoning in Dogs Your dog will probably require overnight hospitalization for treatment and monitoring. Your veterinarian will perform a complete physical examination, run baseline blood work, and recommend other diagnostic testing such as chest x-rays to assess your dog’s condition and organ function. Depending on the kind of alcohol ingested, your vet might give your dog a dose of activated charcoal to bind the toxin and eliminate it from the body. Supportive care will be provided to treat stomach pain or nausea, to control seizures, or to help your dog’s heart function. Other supportive care may include IV fluids, sugar (via IV or injected), warming to increase body temperature, and breathing treatments. If your dog eats bread dough, your vet will probably flush his stomach with water to prevent more alcohol formation (dough is fermented in the stomach to produce alcohol). In severe cases, oxygen supplementation with a mask, mechanical ventilation (breathing for the dog with a tube in throat) and even hemodialysis (filtering blood with a machine) might be needed. Prognosis for Dogs Treated for Alcohol Poisoning The longer a dog is intoxicated with alcohol, the more severe the effects on their body. However, in most cases of ethanol ingestion, the prognosis is good and most animals recover within 12 to 24 hours. Dogs that have secondary complications such as aspiration pneumonia or dogs that have preexisting medical conditions have a more guarded prognosis, and recovery can take much longer. If no organ damage is present, there are rarely long-term effects. Severe cases that require dialysis and machine ventilation have a guarded to poor prognosis. Isopropanol toxicity is the most severe alcohol poisoning and carries the worst prognosis.   How to Prevent Alcohol Poisoning in Dogs It is critical that all alcoholic beverages and any other products containing alcohol be kept out of reach of your dog. Check with your veterinarian before giving your dog any medications that contain ethanol. Never feed raw bread dough to your dog or leave it to rise in areas that your dog can reach. Dispose of any bread dough in a garbage container that your dog cannot gain access to; use a pet-proof lid if necessary. In addition, check with your vet before using any alcohol-based sprays for grooming or fleas, regardless of what the label advertises. When having parties or gatherings with your dog around, make sure your guests do not leave drinks unattended or allow your dog to drink from their alcoholic beverages. Featured Image: iStock.com/AJ_Watt"}]