[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Poison And Toxicity", "item": "https://www.petmd.com/dog/emergency/poisoning-toxicity"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Should I Do If My Dog Ate Weed?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/yellow-lab-lying-on-wood-floor.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/yellow-lab-lying-on-wood-floor.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/poisoning-toxicity/what-should-i-do-if-my-dog-ate-weed"}, "datePublished": "August 26, 2019", "dateModified": "August 17, 2022", "description": "Did your dog get ahold of some weed? Here’s what you need to know about dogs eating marijuana and what you should do.", "articleBody": "Reviewed for accuracy on August 26, 2019, by Dr. Katie Grzyb, DVM “My dog ate weed—now what?” You’re not alone in asking this question. According to a veterinary study in Colorado, incidences of marijuana intoxication in dogs increased dramatically following the drug’s legalization. “An increasing number of pets are being diagnosed with marijuana toxicity,” says Dr. Jim D. Carlson, a holistic veterinarian and owner of Riverside Animal Clinic &amp; Holistic Center, located in the Chicago area. “As marijuana laws are changing, so is the exposure that pets have to the drug.” While marijuana toxicity may be common, it’s a serious condition that requires swift recognition and treatment. Are Some Forms of Marijuana More Toxic to Dogs? Since the legalization of marijuana is more widespread, it’s now available in many different forms. From the plant to oils and edibles, there are plenty of opportunities for dogs to get their paws on some weed. However, each of these types of weed have their own risks for dogs. “The toxin in marijuana, tetrahydrocannabinol, or THC, is highly concentrated in the flower buds and tiny leaves on top of the plant,” explains Dr. Ibrahim Shokry, BVSC, MVSC, PHD, professor of Pharmacology and Toxicology at Ross University School of Veterinary Medicine. “Marijuana leaves have less than 10% THC. Oils and butters used in making candies and food products contain the highest concentrations of THC—up to 90%—and are the most toxic,” says Dr. Shokry. What If Your Dog Ate an Edible? In addition to THC, many edibles contain other dangerous ingredients. “Edible forms can add to the toxicity, as they are often formulated in combination with ingredients such as chocolate, which can be lethal in high enough doses, and butter, which can cause GI upset and potentially pancreatitis,” says Dr. Caroline Wilde, staff veterinarian at pet medical insurance company Trupanion. Symptoms of Marijuana Toxicity in Dogs While most humans experience fairly pleasant effects from marijuana, dogs don’t simply get the munchies and take a nap. “Clinical signs develop within minutes to hours of exposure and last for hours to days,” says Dr. Shokry. “They are mainly signs of central nervous system depression.” Clinical signs include: Incoordination Sensitivity to loud noises Low heart rate Dribbling urine Dilation of the pupils Low or high body temperature Additional symptoms include: Vomiting Irregular heartbeat Urine retention Dr. Rachel Barrack, founder of Animal Acupuncture in New York City, says that extreme cases can cause: Tremors Seizures Comatose state Dogs experience these distressing side effects more strongly than humans. “Dogs have more cannabinoid receptors in their brains than people,” says Dr. Barrack. “Therefore, the effects of marijuana are more severe and potentially more toxic.” Don’t Be Scared to Take Your Dog to the Vet If you suspect that your dog ate marijuana, seek immediate veterinary care, without hesitation. Your pet’s health is more important than any embarrassment you might feel, and it’s critical to be honest with your veterinarian. It’s also important to inform them of the exact type of marijuana your pet has eaten, as different forms have different toxicities. “Rest assured that you aren’t the first person to come in with a case of this nature,” assures Dr. Carlson. “We are only in the business of providing the best care for your pet, not judging or getting law enforcement involved if you live in a state where marijuana isn’t legalized.” What Tests Will the Vet Do? Your dog is going to be very disoriented and confused. While you quickly get ready to go to the veterinarian, keep them in a quiet room to help reduce sensory stimulation. Once you arrive at the vet’s, they will evaluate your dog to see the level of toxicity and the current state of your dog’s body functions. “To determine the health status of your pet, organ function and the seriousness of the toxicity, expect your veterinarian to perform blood work and a urinalysis,” says Dr. Carlson. “Dogs sometimes eat the container the drug was kept in or other material when ingesting marijuana, making diagnostic imaging necessary,” he explains. Blood pressure is often checked, too, since the heart rate can be greatly decreased and these animals sometimes require intravenous fluids to support their blood pressure. Treating a Dog That Ate Weed In cases where the ingestion is quickly discovered, your veterinarian may induce vomiting to prevent the onset of symptoms, says Dr. Wilde. In most cases, however, that window has passed, and symptoms must be treated on a case-by-case basis. Dr. Wilde explains that most treatment will consist of supportive care, which includes (but is not limited to): Hospitalization for continued monitoring Administration of fluids Cardiovascular support Regulation of temperature In some cases, anti-nausea medication If a marijuana edible also contained chocolate, treatment is more aggressive. Chocolate can cause high heart rates, seizures and even death, so treatment can include antiarrhythmics, anticonvulsants, fluid therapy and activated charcoal, adds Dr. Wilde. How to Prevent Marijuana Toxicity Although the symptoms and treatment can be scary, most dogs recover from marijuana toxicity.  “This might be a noted medical episode for your dog, but marijuana toxicity is not often fatal in pets,” says Dr. Carlson. Even so, it’s important to ensure that it doesn’t happen again. If you use marijuana, keep an up-to-date inventory of all products, and ensure that they’re out of your dog’s reach at all times. “Owners should take care in the storage of marijuana in the home,” advises Dr. Carlson. “Storing the drug high in a cabinet in a container such as a jar with a metal lid will prevent accidental injury.”  By: Monica Weymouth Featured Image: iStock.com/Chalabala"}]