[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/ov195fiwal", "@type": "VideoObject", "duration": "PT3M8S", "name": "5361926708001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/eb32340f407069360b5169bd86ccd472d6121555.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/ov195fiwal", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/ea6b68fef87c807233cb0d1faf0bb74c4362799e.m3u8", "transcript": "Antifreeze toxicity is one of the most common forms of poisoning in cats and dogs largely because antifreeze is found in so many households. The toxic ingredient in antifreeze is called ethylene glycol. Pets generally come into contact with antifreeze when it leaks from a car's engine onto the ground when it spilled onto the ground while being added to a car's engine or when the container is left uncapped. It's recognized by its bright green colouring and its sweet taste to pets.\n\nUnfortunately even small amounts of ethylene glycol can be incredibly dangerous to pets. It's rapidly absorbed into the body's gastrointestinal tract and can result in fatal damage to the brain, kidneys, and liver. Less than three ounces of antifreeze is sufficient to poison a medium sized dog while as little as one teaspoon could be fatal to a cat. Signs of antifreeze poisoning can develop within an hour of ingestion early symptoms include nausea, vomiting depression twitching muscles an uncoordinated gait decreased reflexes and head tremors increased urination and increased thirst later symptoms often develop within 12 to 24 hours of ethylene glycol ingestion including mark depression, lack of urine production anorexia seizures vomiting coma and a severely low body temperature.\n\nSymptoms at this point are often sudden and could be fatal. The severity of symptoms will depend on the amount of antifreeze ingested. If you believe your pet has ingested antifreeze or any product containing ethylene glycol regardless of whether or not they're showing symptoms they should see a nearing immediately. If your pet has vomited or had diarrhea, you may want to collect a sample of it and bring it with you to your veterinarian.\n\nStandard tests to determine antifreeze poisoning include a urinalysis and a complete blood profile, which will be analyzed immediately. An ultrasound may also recommended to look at the liver and kidneys, which may be swollen in response to the ingestion of ethylene glycol bloodwork and urinalysis and pets that have ingested antifreeze often have similar results to those pets suffering from kidney failure. Depending on how much time has passed and dogs that have consumed antifreeze in small amounts may experience kidney failure within days of ingestion. Unfortunately death due to kidney damage is common among animals who have been poisoned by antifreeze prevent antifreeze poisoning by keeping all products containing ethylene glycol out of your pets reach firmly closed and stored properly.\n\nAlso make sure to dispose of containers in a safe way when pouring antifreeze in your car. Take care not to spill it and cleanup any spills immediately check your car's radiator and engine and make sure there are no leaks and if there have them repaired immediately. Additionally it's best to keep your pet out of the garage and away from any areas where antifreeze may be stored or used in your home. Cats should be kept indoors and dogs should be provided access to a well fenced yard away from any gutters driveways and roads where antifreeze may be spilled and when they're out they should always be unleashed at all times.\n\nLastly consider switching to a pet friendly antifreeze that contains a betraying agent to make the product taste bad or maybe made from propylene glycol rather than ethylene glycol.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/emergency/poisoning-toxicity/antifreeze-poisoning-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Poison And Toxicity", "item": "https://www.petmd.com/dog/emergency/poisoning-toxicity"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Antifreeze Poisoning in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog-in-car.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-03/dog-in-car.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Poisoning, Symptom Checker, Antifreeze", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/poisoning-toxicity/antifreeze-poisoning-dogs"}, "datePublished": "March 22, 2022", "dateModified": "September 12, 2023", "description": "Dr. Veronica Higgs explains what antifreeze poisoning is and how it can be treated in dogs.", "articleBody": "  Antifreeze, or automotive radiator coolant, is the most readily available source of ethylene glycol. This colorless, odorless, possibly sweet-tasting liquid is highly toxic to dogs.   According to the American Association of Poison Control Centers, ethylene glycol is the second most common cause of fatal poisonings in animals. This is likely due to the readily availability of antifreeze, its possible pleasant taste, and the fact that just a small amount can be fatal. The Humane Society Legislative Fund estimates that at least 10,000-90,000 animals die each year from antifreeze poisoning.  In 2012, manufacturers in the United States started adding a bittering agent to antifreeze to combat this problem. However, there is currently no evidence whether this has made the product less palatable to dogs.  Unfortunately, dogs can easily get into antifreeze when it leaks from cars. They can drink from puddles of antifreeze or just step in them and lick the antifreeze off their paws. Even ingesting just a little antifreeze can be fatal—less than ½ a teaspoon per pound can be enough to kill a dog.  Antifreeze poisoning affects the gastrointestinal tract, liver, brain, and kidneys. Once ingested, ethylene glycol is rapidly absorbed from the stomach and metabolized in the liver, leading to acute kidney failure.  Aside from antifreeze, there are many other sources of ethylene glycol, including windshield deicing agents, brake fluid, motor oil, photography developing solutions, wood stains, solvents, inks/printer cartridges, eye masks, snow globes, and winterized toilet bowls.    Here’s what you need to know about the symptoms to watch for, what to do if you think your dog ingested antifreeze, how antifreeze poisoning is treated, and tips for keeping your dog away from this toxic substance. Symptoms of Antifreeze Poisoning in Dogs   The symptoms you’ll see depend on how long it’s been since your dog ingested antifreeze. Stage 1 (30 mins – 12 hours after ingestion): Unmetabolized ethylene glycol has very similar effects to ethanol, so at this stage, a dog may appear intoxicated. Central nervous system (CNS) signs may include depression, stumbling, a “drunken” gait (ataxia), muscle twitching, decreased reflexes, and trouble getting up/standing. You may also see vomiting, increased thirst (polydipsia), and increased urination (polyuria).    Stage 2 (12 – 24 hours after ingestion): After 12 hours, your dog may temporarily appear to recover and act relatively normal. During this period, the ethylene glycol is being metabolized into toxic metabolites. Even though your dog may seem normal, underlying damage is occurring. You may see an increased respiratory rate, but you won’t notice the increased heart rate and beginning stages of dehydration.    Stage 3 (36-72 hours after ingestion): In the final stage, the toxic metabolites will be built up in sufficient quantities to cause severe kidney failure, which may lead to seizure, coma, and death.    What to Do If You Suspect That Your Dog Ingested Antifreeze  If you think your pet has ingested antifreeze, seek immediate veterinary attention. Antifreeze is very quickly absorbed once ingested and starts forming toxic metabolites quickly. Any delay in care can be deadly.   Given the life-threatening nature of antifreeze poisoning in dogs and the specialized testing and treatment needed, your dog will most likely need to be treated at a 24-hour emergency and specialty hospital. Dogs need to be treated within 8-12 hours of ingestion but have the best prognosis if treated within the first 5 hours. There is no time to lose in getting them to the emergency veterinarian.   Once a pet shows signs of kidney damage, the prognosis is extremely poor. The bottom line is that if you suspect at all that your pet may have ingested antifreeze, go to the closest veterinary emergency room immediately.     How Do Vets Test for Antifreeze Poisoning in Dogs?  In many cases, pet parents don’t actually see their dog ingest ethylene glycol. They only suspect it based on puddles of antifreeze or other forms of access to the toxin. In this case, your veterinarian will start with a physical examination and bloodwork. Unfortunately, immediately after ingestion, these blood tests won’t usually show anything yet because it takes time for the ethylene glycol to metabolize and create toxic byproducts. For example, the blood tests won’t typically show elevated kidney levels until 24-48 hours after ingestion, when the prognosis is very poor. Vets may also look for calcium oxalate crystals, which will show up at least 6 hours after ingestion.    That’s why it’s best to go to an emergency clinic. Many emergency vets use a test that can measure levels of ethylene glycol in the blood using test strips. The test should be conducted between 1 and 10 hours after the pet ingested the ethylene glycol.   How is Antifreeze Poisoning in Dogs Treated? In many cases, when a dog has ingested a toxin, the standard treatment is to induce vomiting. However, vomiting is not usually useful for dogs that have ingested ethylene glycol because the toxin is absorbed too fast. If your dog has any neurologic signs, such as acting drunk, trying to make them throw up can lead to a choking hazard. Instead, your vet will try to prevent the toxin from metabolizing into its more dangerous forms. The preferred antidote is 4-methylpyrazole (4-MP, fomepizole). Dogs that are treated with 4-MP within 5 hours of ingesting antifreeze tend to fare better. Your dog will be hospitalized for observation and administration of 4-MP for 36 hours. IV fluids and additional supportive care will also be given to treat dehydration, electrolyte imbalances, vomiting, and nausea.  Ethanol was also used as an antidote since the mid-1970s but has fallen out of favor due to negative side effects, including increased central nervous system depression. 4-MP has fewer side effects than ethanol with similar effectiveness. Once a pet has elevated kidney values, their prognosis is poor. If the pet has progressed to renal failure, dialysis may be attempted, but access may be limited by availability, cost, and poor prognosis.   How to Prevent Antifreeze Poisoning in Dogs  Prevention and education are the keys to preventing antifreeze poisoning in dogs. Here are some helpful tips: Be aware of possible sources of ethylene glycol (antifreeze, windshield deicing agents, brake fluid, motor oil, photography developing solutions, wood stains, solvents, inks/printer cartridges, eye masks, snow globes, and winterized toilet bowls). Keep antifreeze stored in a sealed container away from pets. Immediately clean any antifreeze spills. Watch for any suspicious puddles in driveways or garages and keep your dog away. Featured Image: iStock.com/anna-av"}]