[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Poison And Toxicity", "item": "https://www.petmd.com/dog/emergency/poisoning-toxicity"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Asian Lady Beetles: Could They Harm Your Dog?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-asian-lady-beetles.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-asian-lady-beetles.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/poisoning-toxicity/asian-lady-beetles-could-they-harm-your-dog"}, "datePublished": "October 25, 2017", "dateModified": "August 17, 2022", "description": "Are Asian lady beetles a threat to your pet? Find out whether your dog is at risk, how to prevent encounters with Asian lady beetles, and what to do if your dog ends up with a mouthful of bugs.", "articleBody": "By Paula Fitzsimmons When a graphic image of Bailey, the dog with over 40 Asian lady beetles stuck to the roof of her mouth, surfaced in 2016, pet parents were naturally alarmed. Fortunately, her veterinarian was able to remove the beetles, and Bailey was restored to good health. As a good dog parent, you’d like to know if Asian lady beetles are a threat to your pet. The short answer is yes. But the good news is that these encounters are rare, and when they do occur, they’re usually quite treatable. Find out whether your dog is at risk, how to prevent encounters with Asian lady beetles, and what to do if she ends up like Bailey.   Asian Lady Beetles 101 It can be tough to spot the difference between a multi-colored Asian lady beetle (Harmonia axyridis) and a native North American species like the nine-spotted ladybug (referred to as C-9). One handy way to tell the difference is to look at the area behind the beetle’s head (called the pronotum)—the Asian beetle’s is yellow-colored with black markings in the middle. Asian beetles also vary widely in color from yellow to black, and have anywhere from zero to 19 spots on the outer shell, in contrast to C-9’s standard nine. Both species are from a family of lady beetles called Coccinellidae, and both have voracious appetites for nuisance pests like aphids, scale insects, and mites. Beetles are so effective at pest control, in fact, that the federal government has introduced them from eastern Asia to help control our aphid populations. They’ve been prolific across the country since about the mid-1980s, and are present in much of the continental United States, except for Montana, Wyoming, and parts of the Southwest.  While Asian beetle populations have grown in numbers, North American species like C-9 (Coccinella novemnotata) have dwindled during the past several decades, according to The Lost Ladybug Project. So chances are, the little orange oval-shaped tomato bug you’ve encountered recently is the Asian variety. Asian lady beetles may be coveted for their role as natural pest control agents, but they also have a reputation as a nuisance species. Their hefty appetites extend to non-pest insects, like monarch butterfly eggs and larvae (whose numbers have already been reduced), says Dr. Robert Koch, assistant professor and extension entomologist at the University of Minnesota, Department of Entomology in Saint Paul. They’re also hardier and more aggressive than North American ladybugs (who experts say don’t pose a risk to dogs). In the fall, “they aggregate on and in homes and other buildings to find protected locations for spending winter,” he says. It’s not unusual to see thousands of Asian beetles congregated in an area. When Barton County, Kansas, (where Bailey is from) experienced a bumper crop of sugarcane aphids last year, Asian beetles were also on hand to enjoy the feast. “We literally had swarms of them,” says Dr. Lindsay Mitchell, owner of Hoisington Veterinary Hospital in Hoisington, Kansas, and Bailey’s vet. One of the reasons they’re able to remain stuck so firmly to a dog’s palate is because of their size and shape, says Patrick (PJ) Liesch, assistant faculty associate and extension entomologist with the Department of Entomology at the University of Wisconsin, Madison. “Insect exoskeletons are made out of a tough material known as chitin, which does not readily break down,” he say. “In the mouth of an animal, this material would be somewhat similar to the hull of a popcorn kernel.” Plus beetles have hard, thickened wing covers that protect their hind wings from damage, Liesch says. “In lady beetles, these wing covers give the insects a rounded, hemispherical shape, which would make them difficult for the dog’s tongue to remove.” Are Asian Lady Beetles a Threat to Dogs? When attacked, Asian lady beetles release body fluids (called hemolymph) containing stinky and poisonous chemicals. “Hemolymph is corrosive, and can cause chemical burns to the mouth and/or gastrointestinal tract. It also has a strong repellent odor and foul taste,” says Dr. Elizabeth Doll, a veterinarian with WVRC Emergency and Specialty Pet Care in Waukesha, Wisconsin. That awful taste and odor is why few dogs will attempt to eat more than a few of them, she says. Dog and beetle conflicts are so rare, that aside from anecdotal reports (like Bailey’s), a lone formal published paper exists on the subject. In this case, the patient had 16 Asian lady beetles embedded in the mucous membrane covering the hard palate, Doll says. If a dog quickly swallows the beetles, erosion to the mouth appears to be minimal, says Dr. Nancy C. Hinkle, professor of veterinary entomology in the Department of Entomology at the University of Georgia, Athens. “Likely the dog will quickly seek water to wash away the taste—which is a good thing, because it minimizes the chance that beetles will get stuck in the esophagus.” If the chemical burns are not treated properly, an infection could develop and potentially become serious. “Luckily for any dog with damage to their mouth, the gums and tissues of the mouth heal very quickly—usually within seven days,” says Dr. Jonathan Babyak, clinical assistant professor in the Emergency and Critical Care Department at Cummings School of Veterinary Medicine at Tufts University. The cases that Mitchell saw, “were limited to anorexia due to painful ulcerations in the mouth,” she says. “The ulcers calmed down with manual removal of the beetles and treatment of the ulcers.”  But Dr. Jennifer Coates, veterinary advisor with petMD, adds, “While I’ve not seen any cases myself, veterinarians have reported a few cases of dogs ingesting these beetles and subsequently developing vomiting, diarrhea, and other signs of gastroenteritis. One dog even died as a result.” What Precautions Can You Take Against Asian Lady Beetles? As uncommon as these encounters are, it doesn’t hurt to be vigilant for your dog’s sake. Animals are going to be curious and eat things they shouldn’t eat. Some dogs—like Bailey, who has had to have beetles removed several times after that initial incident—are more curious than others, Mitchell says. “I don&#039;t know that there is a great way to prevent it,” she says. “If the owner notices a great number of these Asian lady beetles around, they may peek into their pet’s mouth after they have been outside. If a pet owner notices that their pet is drooling or not wanting to eat, simply look in their mouth.” Your best option as a dog parent is to keep beetle numbers in your home low, says Dr. Michael Skvarla, insect identifier and extension educator in the Department of Entomology at Penn State University in University Park. “Ways to do this include mechanical exclusion, such as caulking cracks around windows, doors, pipes, and the attic where beetles enter a home, and vacuuming up beetles once they enter a home,” he says. Asian lady beetles seek out sheltered spots in fall in anticipation of winter. “Out in nature, this would include cliff and rock faces and loose bark of dead trees,” Liesch says. “However, these insects can also readily sneak into buildings. Depending on the conditions, large numbers of these insects can occasionally be active indoors during the late fall, winter, or early spring months.” What to Do If Your Dog Encounters Beetles Some signs of a dangerous encounter with beetles include excessive drooling or foaming at the mouth, reluctance to eat, and a foul odor coming from the mouth, Doll says. “The beetles may be visible within the mouth, or open sores may be seen. Possible side effects after ingesting large quantities of beetles include reduced appetite, vomiting, diarrhea that may be bloody, and lethargy.” If any of these signs are present, call your vet for an immediate evaluation. Treatment starts with physically removing the beetles, which your vet may need to perform under sedation or, if severely impacted, under general anesthesia, Babyak says. “Secondly, damage from the hemolymph should be treated with appropriate medications and nursing care. Usually, we would think about treating pain, inflammation, and accelerating healing by removing dead or severely injured tissue. An antibiotic may be necessary to treat or prevent infection. This treatment would be considered routine by most primary care veterinarians.” Mitchell treats her patients with a mouthwash containing sucralfate, lidocaine, and diphenhydramine to treat ulcers and reduce discomfort. Treatment for every canine patient she has seen, including Bailey, has fortunately been successful. Chances are, your dog won’t end up like Bailey. But Asian beetle encounters are still a possibility, especially if your pup is the curious type. Being mindful of your dog’s surroundings while outside, and keeping beetle numbers in your home to a minimum, goes a long way to ensuring she doesn’t end up with a mouthful of bugs…or worse."}]