[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Poison And Toxicity", "item": "https://www.petmd.com/dog/emergency/poisoning-toxicity"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bleach Poisoning in Pets: What You Should Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-bleach-poisoning-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-bleach-poisoning-pets.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/poisoning-toxicity/bleach-poisoning-pets-what-you-should-know"}, "datePublished": "February 27, 2017", "dateModified": "August 17, 2022", "description": "The severity of bleach poisoning in dogs and cats depends on the type of bleach your pet was exposed to and how much they ingested. Find out the signs and symptoms of bleach poisoning in pets and how to treat it.", "articleBody": "By John Gilpatrick Is bleach poisonous to dogs and cats? The short answer is &quot;yes,&quot; but it&#039;s a little more complicated than that. Dr. Lynn Hovda is the director of veterinary services for the Pet Poison Helpline. She and her colleagues field calls about bleach poisoning regularly, but most cases aren&#039;t emergencies. &quot;It all depends on the type of bleach the pet is exposed to,&quot; she says. &quot;The majority of cases are regular household bleach, which is an irritant but not a corrosive agent.&quot; This means the symptoms can sometimes be treated by you at home relatively quickly and painlessly. Other cases involving ultra-concentrated bleach can more serious, Hovda says. Household bleach has a pH level around 11, while ultra-concentrated is generally closer to 12 or 12.5. This is mostly used by professional cleaners and on farms, so Hovda says calls about these cases are few and far between, but the handful the Pet Poison Helpline does receive every year are serious—severe lesions on the skin, down the esophagus, and into the stomach that can take weeks or months to heal. Non-chlorine bleach (also known as color-safe bleach) may also be dangerous because it contains hydrogen peroxide. This may cause vomiting in addition to tissue irritation. It’s an important condition to be aware of so you can initiate or seek treatment as quickly as possible. Continue reading for more information about bleach poisoning in pets. How Do Pets Get Into Bleach? For the most part, it&#039;s exactly as you&#039;d expect, says Tina Wismer, DVM, DABVT, DABT and medical director of the ASPCA Animal Poison Control Center. &quot;People are cleaning their floor and pour some bleach into a bucket,&quot; she says. &quot;Maybe they step away for a minute and forget to block it off from their pets or they spill some and aren&#039;t able to clean it up in time.&quot; If you dilute the bleach with water before using it to clean, you may prevent the worst possible poisoning. &quot;The more diluted it is, the less toxic it is,&quot; Wismer says. Severity of the poisoning also depends on how much the animal is exposed to, and dogs and cats (as well as some breeds of each) will react differently to consuming the chemical. &quot;Some dog breeds like Pomeranians will turn their nose up at bleach after tasting it,&quot; Hovda says. &quot;Labradors, however, might down the entire bucket.&quot; She adds that cats are more like Pomeranians but they could experience bleach poisoning if they walk on a bleach spill and lick their paws afterward. What Are the Signs and Symptoms of Bleach Poisoning? The ultra-concentrated bleach will cause chemical burns and lesions both internally and externally. Color-safe bleach generally causes vomiting, and if it has a high concentration, blood might appear, Wismer says. For the majority of cases, which involve household bleach that has been diluted in water, symptoms begin within minutes. These include heavy drooling (especially in cats) and redness and irritation on the skin and in and around the mouth. Hovda says you may also notice your pet pawing at her mouth or in other ways acting abnormally. Vomiting is less common in these cases, but for the Labrador-type pets who consume a lot, it may come back up. How is Bleach Poisoning Treated? Cases involving ultra-concentrated bleach are emergencies. If you think your pet has consumed or been topically exposed to concentrated bleach or has potentially gotten any type of bleach in her eyes, you should consult a veterinary professional immediately. Exposure to diluted household bleach and color-safe bleach can sometimes be treated at home. If the irritation is limited to the skin, give your dog a long bath with lots of water and a little bit of dog shampoo or mild dishwashing soap, Hovda says. Pets who have ingested a small amount of color-safe bleach will usually vomit a few times and then return to normal. If your dog or cat drank some bleach and is drooling but not vomiting, you want to encourage him to drink to rinse off any bleach that is still in contact with the lining of his gastrointestinal tract. This is easier for dogs, who usually eat and drink anything you put in front of them, than it is for cats. Hovda suggests using a little bit of tuna water to make it more appealing for cats to drink. Giving your dog or cat a small bowl of milk can also encourage him to drink and help neutralize any bleach that is still present. For most of these cases, the symptoms should subside 30 to 45 minutes after treatment, Hovda says. If they do not, it’s best to consult your vet who can evaluate your pet’s condition and, if necessary, prescribe medications to relieve discomfort and help the lining of the gastrointestinal tract heal.                                                    How Can Bleach Poisoning Be Prevented? Keep bleach away from your pets. When not in use, bleach should always be kept in a place that&#039;s not reachable by your dog or cat. While you&#039;re cleaning, Wismer says you should put your pet in another room and do whatever you can to make the bleach totally inaccessible. &quot;Leave your pets with some of their favorite toys to keep them occupied and entertained while you clean,&quot; she says, and whatever you do, clean up spills right away. You never know what can happen if you leave them unattended."}]