[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Poison And Toxicity", "item": "https://www.petmd.com/dog/emergency/poisoning-toxicity"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Protect Your Pet From Toxic Blue-Green Algae", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/pond-covered-in-algae_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/pond-covered-in-algae_0.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/poisoning-toxicity/how-protect-your-pet-toxic-blue-green-algae"}, "datePublished": "August 27, 2019", "dateModified": "August 17, 2022", "description": "Toxic blue-green algae can be deadly for your pets. Find out what makes algal blooms so harmful and how you can keep your pets safe.", "articleBody": "Reviewed for accuracy on August 27, 2019, by Dr. Jennifer Coates, DVM It’s a terrifying headline that keeps popping up lately: Harmful algal bloom kills beloved pet. According to the National Oceanic and Atmospheric Administration (NOAA) website, harmful algal blooms (HABs) have been reported in every coastal US state. Blue-green algae spottings are on the rise; the Environmental Protection Agency (EPA) says that it’s a major problem in all 50 states. Here’s what you need to know about harmful algal blooms and how you can keep your pets safe. What Are Blue-Green Algae?   Blue-green algae are not actually algae at all—they’re a type of bacteria called cyanobacteria. Cyanobacteria are a group of microorganisms that can be found in any aquatic environment as well as many locations on land. These microorganisms occur naturally, and they make oxygen and help cycle nutrients in the environment and food chain. However, there are several species of cyanobacteria that produce very potent toxins called cyanotoxins. What Makes Blue-Green Algae Toxic to Pets? These cyanotoxins include toxins that affect different parts of the body—for example, neurotoxins (brain), hepatotoxins (liver) and dermatologic toxins (skin)—and some can cause serious and even fatal illness for humans and pets. Cyanotoxins are more commonly fatal for our pets because they are more likely to swim and drink from potentially contaminated water sources. People, on the other hand, would be less likely to jump into or drink water from a water source that has a bad smell or a visible algal bloom. What Causes Algal Blooms? An algal bloom is a rapid increase in a population of algae within an aquatic environment. Harmful algal blooms consisting of blue-green algae tend to appear in nutrient-dense waters under warmer environmental temperatures (most commonly seen during mid- to late-summer months). Recent studies suggest that environmental changes have played a large role in the surge in number of algal blooms seen across the US. According to a 2013 study, “Mounting evidence indicates that global climate change, watershed degradation and increased nutrient loading of freshwater systems are contributing to the increased frequency, severity, extent and broader geographic distribution of harmful algal blooms (HABs), including cyanobacteria HABs (cyanoHABs).” How Can I Protect My Pet From Harmful Algal Blooms? The best way to protect your dog from exposure to harmful algal blooms is to never let them swim in or drink from lakes, ponds, and other potentially contaminated bodies of water, especially if they have visible algal blooms or a bad odor. The EPA&#039;s page on pets and toxic algae says not to let your dog swim or drink if: The color of the water is off. (HABs can be bright green, blue, brown or even red, and can sometimes look like paint floating on top of the water.)The water looks like it has a slimy film or foam on the surface.It has a pungent, off-putting smell.Reporting and Tracking Harmful Algal Blooms If you suspect that a pond, lake or water source is contaminated with blue-green algae, you should report it to your state’s health department. The EPA provides a list of resources for reporting potential HABs for each state. By reporting these instances, you can not only help prevent other people and pets from exposure, but you can also help researchers to understand, track and prevent these blooms. You can also check your state health department or environmental protection department to see if they have an online tracking system set up. For example, the Florida Department of Environmental Protection has an Algal Bloom Sampling Status tool that provides a map with testing results for various bodies of water. They also provide a way to report a potential algal bloom so that the water can be tested. The New York State Department of Environmental Conservation also has a HABs Location Map that displays reported and confirmed HABs within the State of New York. Signs That Your Dog Has Been Exposed to Blue-Green Algae Toxins Symptoms associated with exposure to harmful algal blooms vary depending on the type of cyanobacteria involved and the toxins they produce. Hepatotoxin-Producing Cyanobacteria For example, exposure to a hepatotoxin-producing cyanobacteria can lead to: VomitingDiarrheaBlood in the stool or black, tarry stoolPale mucous membranesJaundiceNeurotoxin-Producing Cyanobacteria On the other hand, symptoms associated with neurotoxin-producing cyanobacteria typically include: DisorientationWeaknessMuscle twitches and tremorsSLUD (excessive salivation, lacrimation (tearing), urination, and defecation)Difficulty breathingSeizuresHeart failureParalysisExposure to Harmful Algal Blooms Exposure to HABs can lead to death. However, hepatotoxins tend to work a little more slowly—and, therefore, respond better to treatment—while neurotoxins can act so quickly that dogs can’t get to the veterinarian in time to be saved. What to Do If Your Dog Has Been Exposed If you suspect that your dog has come into contact with water containing blue-green algae, wash them off immediately using clean water. If your dog has ingested water containing blue-green algae, get to the nearest veterinarian as quickly as possible. Unfortunately, there are currently no antidotes for the toxins. As long as a dog is not neurologically impaired, it may be possible for the veterinarian to induce vomiting and/or give medications like activated charcoal or cholestyramine to prevent absorption of more toxin. Subsequent veterinary care and the dog’s prognosis will depend on the type of cyanotoxin a dog has had contact with and the severity of their symptoms. With appropriate and timely treatment, some (but unfortunately not all) dogs that have been exposed to blue-green algae can be saved. By: Kendall Curley Featured Image: iStock.com/Aliaksandr Bukatsich"}]