[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/kdgpyf10gk", "@type": "VideoObject", "duration": "PT1M40S", "name": "5351986104001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/aee3cba4b03bb074e05a04503da29ca57b024393.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/kdgpyf10gk", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/3cdecab7cc67ed2dea2f724787e817bb0cc3a7b6.m3u8", "transcript": "[NO SPEECH]", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/emergency/poisoning-toxicity/how-dog-proof-your-trash-can?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Emergencies", "item": "https://www.petmd.com/dog/emergency"}, {"@type": "ListItem", "position": 2, "name": "Poison And Toxicity", "item": "https://www.petmd.com/dog/emergency/poisoning-toxicity"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Dog-Proof Your Trash Can", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Poison &amp; Toxicity", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-trash-can-dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-trash-can-dog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Poisoning", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/emergency/poisoning-toxicity/how-dog-proof-your-trash-can"}, "datePublished": "March 23, 2017", "dateModified": "August 17, 2022", "description": "The trash cans in your home contain various dangerous threats to your dog. Learn why it’s important for your dog to stay out of the trash, and what you can do to prevent any harmful incidents.", "articleBody": "By Aly Semigran  When it comes to making your household safe for your pet, it doesn’t just stop at locking up the medicine cabinet or avoiding bringing home certain plants. Another major consideration is learning how to properly secure and dog-proof your trash cans. From the kitchen to the bathroom, the trash cans in your home contain various dangerous threats to your dog, ranging from expired medications to rotten foods. Learn why it’s important for your dog to stay out of the trash, and what you can do to prevent any harmful incidents. The Dangers of Kitchen Trash Cans for Dogs Because of the smells emanating from kitchen trash, dogs are instinctually drawn to what they perceive as a meal in those bins. Their urge to find out what’s in the trash, however, can lead to more than a messy kitchen floor. “Things dogs find in the trash may be harmful to deadly—everything from poisons to string to gums and candies containing Xylitol to bones or rotting food,” says training and behavior specialist Caryl Wolff of the Los Angeles-based Doggie Manners. “[These things] mean an expensive trip to the veterinarian, at the very least.” Dr. Allison Witherow, of Allison Animal Care in Savannah, Georgia, has seen the results of animals getting into the trash firsthand, including a patient who ingested a wine cork. “Whenever an animal eats something that he or she is not used to, there is always the possibility of gastrointestinal upset like vomiting or diarrhea,” Witherow warns. “If there is raw meat in the trash that an animal ingests, the bacteria in that raw meat can cause infections or expose him or her to parasites just like it could in a person who eats raw meat.” In addition to raw meat, other toxic foods to dogs like chocolate, grapes, and onions can “result in serious illness and hospitalization,” Witherow explains. Your dog accidentally getting into the trash is not only a risk to him, but may pose a problem for you and the rest of your family. “If your pet takes something out of the trash and carries the garbage around the house, there could be trail of contamination,” says Witherow. “Or a young child or a baby can unknowingly come into contact with harmful medications or germ-filled food.” But veterinarians warn against trash other than food, too. Wrappings and packaging can create blockages in a dog’s intestinal tract, Witherow notes. Discarded kitchen cleaning supplies also present a poisoning risk if pets ingest or lick them. Denise Herman, the founder and head trainer of New York City’s Empire of the Dog, also reminds pet parents that the trash can itself may be dangerous for dogs. “It&#039;s possible for a dog to actually get stuck in a trash can with an automatic closing lid,” she says. The Dangers of Bathroom Trash Cans for Dogs While your bathroom trash can is likely smaller than your kitchen one, it doesn’t mean there are fewer risks for your pet getting into it. In fact, the access is likely easier, as the trash can is lower to the ground and may not have a lid. Witherow warns that bathroom trash cans may hold medications, gels, or cleaners—items that could pose a potentially deadly risk to pets. She also points out that personal hygiene accessories like razors can lead to internal damage if ingested by a pet. Even discarded dental floss can be a danger to the gastrointestinal tract, Witherow says. How to Dog-Proof Your Trash Can There are simple—but important—steps that pet parents can take to dog-proof their trash cans. According to Donna Dougherty, the owner of Go Green Cleaning Experts in West Chester, Pennsylvania, the location of your garbage can is pivotal. She recommends keeping trash cans—with secure, tightly fitted lids—in pantries or closets, or underneath the sink, preferably closed with a child-proof lock. It’s not just containing the trash itself that will make a huge difference, but eliminating the smells that beckon to your dog and his powerful nose is also an effective preventative measure. “Empty your trash can frequently. Or after dinner, place your scraps in a plastic bag and place the bag in your garage or take it out to dumpster,” suggests Dougherty. “This way the smell is not lingering there for your dog the next day when you go to work.” Another helpful tip Dougherty has for pet parents is to place weight in the bottom of the bin so that dogs can&#039;t easily knock over the trash can and spill its contents on the floor. “Bricks, stones, weights, sand in a bag will help to secure your bin.” Last but not least, when cleaning out your trash bags, whether in the kitchen or bathroom, make sure the bag is securely closed and out of reach from your dog. What to Do If Your Dog Has Ingested Something From the Trash “If a dog has eaten trash, a pet parent needs to, first of all, try to determine what was in the trash. If there was a known toxic substance or medication, then a list should be made,” says Witherow. “It is ideal if you can estimate the amount of the toxic material or the amount and strength of any medications.” Concerned pet parents can also call their local ASPCA poison control center to discuss what has happened with a veterinary toxicologist. But Witherow always suggests contacting your veterinarian if you think your pet has ingested something from the trash. “Even if the items in the trash are not obvious toxins, if your dog is acting ill, you need to get in touch with your veterinarian,” she says. “I never recommend that you induce vomiting unless it has been recommended by the toxicologist or by your veterinarian. Some substances become more dangerous if vomiting is induced.” Keeping Your Dog Away From the Trash Herman says that keeping your dog away from the trash starts early. “One of the easiest things to start with is to make sure the dog doesn&#039;t begin a pattern of scavenging,” she says. She suggests tapping into your dog’s scavenging instincts by offering him safer alternatives like pet-safe bones and treat-filled toys. “Meeting the dog&#039;s needs for chewing and hunting-type activities is one way to funnel what is a normal behavior into a safe outlet instead of a dangerous outlet,” says Herman. Wolff recommends finding ways to keep your dog distracted and happy, in order to make the trash seem like a less appealing target. This might include tiring him out with exercise, leaving him toys to play with, and making sure he is well fed before you leave him home alone. She points out that pet parents can also take measures into their own hands. Simple steps—such as closing bathroom or kitchen doors, or hiding the trash can away behind a closed door—are good options. Pet parents can also try crate training the dog to avoid messy and dangerous mishaps when no one is home.  See Also:"}]