[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Do Dogs Tilt Their Heads?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-157531381.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/iStock-157531381.jpg"}, "author": {"@type": "Person", "name": "Erika Lessa, CBST, CDBT, CDBC, CPDT-KA, Fear-Free Certified", "url": "https://www.petmd.com/author/erika-lessa"}, "keywords": "Dog, Head Tilt, Symptom Checker", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/why-do-dogs-tilt-their-heads"}, "datePublished": "June 6, 2023", "dateModified": "October 7, 2023", "description": "Ever wonder why your dog tilts their head when you speak to them? We’re sharing everything you want to know about why dogs tilt their heads.", "articleBody": "Why Do Dogs Tilt Their Heads? There are few people who can hold back their adoring reactions when they come upon a dog that tilts their head in response to hearing their voice. The head tilt creates an instant connection; humans see this behavior as the dog showing intent interest, fixed on every word we say. Head tilt in a dog is a normal behavior occurring in many—but not all—dogs. Outside of some medical causes, there is no reason for concern. While there has been little research published affirming theories about the behavior, we are still intrigued. So, why do dogs tilt their heads?  Do Dogs Tilt Their Heads to Hear or See Better? One possibility for why dogs tilt their heads has to do with the way they hear. Tilting their head could function to better orient them to sounds. Have you ever tried blowing air across the top of an open bottle in front of a dog? Many will tilt their heads, some in both directions, making it appear as if they have a reflexive nature. If the dog is experiencing the sound for the first time, it could be accompanied by some wrinkles around the forehead, indicating curiosity.   Research has shown that dogs will turn (not tilt) their heads to orient themselves to sound. Results also point to the direction—left or right—as linked to which side of their brain is actively processing  the sound. But there has not been much research to see if head tilting serves a similar function.  Vision may also be a reason for the head tilt. Depending on the shape of the dog&#039;s snout, tilting their heads may give them a better perspective when trying to visually focus on something in the environment. Unfortunately, there is very little research to statistically prove or disprove any popular thinking.  Is Head Tilting Part of a Cognitive Process? There is one study, noted as the first to attempt to describe and collect data on head tilting in dogs. The original hypothesis looked at head tilting being connected to the way a dog uses  different sides of their brain to process information. In other words, the dogs were tilting their heads to one side or another to help them think about the sounds and determine what they mean. Researchers found that head tilting happened most frequently in Gifted Word Learners (GWL). GWL dogs are able to learn multiple labels for toys and retrieve them successfully beyond the ratio of chance. As part of that same study, one experiment resulted in the GWL dogs performing head tilts 43% of the time, as opposed to 2% of the non-GWL dogs when asked to find a toy by name. The other possibility is that head tilting is somehow related to the process of identification and matching the known word to the visual memory of the toy. This type of cognition may explain the occurrences of head tilting when phrases the dog has learned are used. For example, “Want to go for a ride?” is usually a sure thing for a head-tilting dog that loves the car.  Interestingly, researchers noticed that dogs who tilted their heads did so in a consistent direction, likely making preferred direction an individual trait. This tracks with some theories about dogs, like humans, having a dominant side. But this observation may conflict with the sight and sound theories. Of course, if a dog naturally offers a head tilt for whatever reason and positive reinforcement occurs, the instances of head tilting will likely increase. Once the dog is offering this behavior voluntarily, it can be done on cue, creating a cute trick for warming hearts.  When Is a Dog Tilting Their Head Reason for Concern?  If your dog is tilting their head independently of things they may be seeing or hearing, there might be an underlying medical cause. The persistent tilt will most likely be accompanied by additional symptoms, based on the severity of the problem. A nutritional deficiency, ear infections, or damaged ear drums can also lead to a head tilt.  Other issues can be more severe, such as vestibular disease. This disease presents with a head tilt plus movement issues, like circling and stumbling, drooling, and vomiting. Vestibular disease can also be caused by tumors or growths in the inner ear. If you notice any of these symptoms, contact a veterinarian as soon as possible for a diagnosis and treatment plan. Dogs with vestibular disease usually make a full recovery depending on the underlying cause. If you are lucky enough to own a dog that tilts their head in response to hearing your voice or seeing your movements, enjoy every endearing moment. Featured Image: iStock.com/Philary"}]