[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Stop a Puppy From Chewing Everything in Sight", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/how-to-stop-puppies-from-chewing.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/how-to-stop-puppies-from-chewing.jpg"}, "author": {"@type": "Person", "name": "Jeannine Berger, DVM, DACVB, DACAW, CAWA", "url": "https://www.petmd.com/author/dr-jeannine-berger"}, "keywords": "Dog, Puppy, Chewing, Zoo Puppy Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-to-stop-puppy-from-chewing"}, "datePublished": "December 16, 2022", "dateModified": "August 30, 2023", "description": "Chewing is a natural puppy behavior, but that doesn&#039;t mean you want yours eating up your house. Here&#039;s how to stop a chewing puppy from ruining your stuff.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. It’s easy to get frustrated when your puppy chews up your expensive Italian shoe or gnaws on the legs of your furniture—especially when he’s seemingly ignoring all the toys you’ve bought him. But don’t get mad or discouraged. A chewing puppy is completely normal, and, although it can drive you crazy, this behavior is simple to fix. Why Puppies and Dogs Chew  There are three main reasons why dogs chew: 1. They’re Teething Puppies lose their puppy teeth and grow permanent replacements when they’re between 12 weeks and 6 months old. They have 28 puppy teeth, and then 42 permanent teeth will erupt. This can be a painful time for your pet—and when he’ll want to chew on almost anything he can get his mouth around. 2. It’s Natural Seeking Behavior Puppies are very curious and eager to explore new things. And because they don’t have hands, the best way to investigate is to put something in their mouth and chew on it. This gives your puppy information about taste, texture, weight, and consistency of their new find. 3. It’s Play Behavior Curiosity may drive a puppy to first put something in his mouth, but if he finds the leg of your table or favorite slipper fun, he’ll start chewing, carrying, or tossing it as a form of play. It’s a way to entertain himself and have fun. How to Stop Puppy Chewing Chewing is a natural puppy behavior, but that doesn’t mean you have to accept that your clothes are going to be shredded. Here’s how you can curb the chewing and save your stuff. 1. Puppy-Proof Your Home While we want our puppies to explore and play, we also need to keep them safe. It’s critical that we make it easy for puppies to learn what objects are fair game for play and keep them out of danger. This can easily be done by puppy-proofing your home. The easiest way to puppy-proof your home is to dedicate a dog-safe area. This can be a small room or confined area within your home that is blocked off with a dog gate or wire pen. No items should be kept in that space that you don’t want the puppy to get into. Whenever the puppy can’t be actively supervised, he should be safely confined to this area. Your dog’s designated area should be filled with dog-safe enrichment. This includes: Comfortable bedding A crate A water bowl Toys Dog-proofing is also an important step if you adopt an older dog, as a new environment can spark his curiosity and lead to bad chewing habits. 2. Choose the Right Dog Toys Along with taking things away from your dog he shouldn’t chew on, you need to give him fun items he can chew. When choosing a toy for your puppy, offer a variety of safe choices. Pet parents should pick toys that are the right size and consistency for your specific puppy, and a variety of colors and textures. Good toys for chewing puppies include stuffed dog toys with squeakers, as well as KONG toys. It’s important to rotate the toys frequently so your pup won’t get bored.   Always supervise your dog when he’s playing with toys. Chew toys should never be harder than your dog’s teeth, or they could chip or fracture their pearly whites. Talk to your veterinarian about safe options for your dog. 3. Interrupt and Divert New dogs and puppies aren’t going to immediately know what items are off-limits for chewing—it’s your job to teach them. If your pup does manage to get their jaws on a favorite shoe or another household item, go get a favorite toy and start playing with it in a happy, animated way. Squeaky toys are great here, as they get your pup’s attention quickly. Pretty soon, your puppy will come to you and may even have dropped the now-boring shoe to check out what you’re having so much fun with. Give your “fun” toy to your puppy and remove the item he was originally chewing on. This is a great opportunity to teach your puppy the “drop it” command. If he doesn’t want to trade the shoe, try offering a more desirable toy or a treat. Once he takes the toy from you, continue playing with your puppy for a while. Pick up the left-behind shoe later and place it somewhere your puppy does not have access to. When you catch your puppy chewing on something he shouldn’t be, do not laugh or yell at him. Your puppy might think you’re excited about his newfound chew toy, and you’ll be unintentionally rewarding his behavior. Or he’ll become afraid, and you’ll end up hurting your bond—an outcome you don’t want. But if you see that your puppy is chewing on a potentially dangerous object, quickly remove the item from his mouth as fast as possible. Contact your veterinarian immediately if you think your puppy may have ingested anything dangerous or toxic. 4. Keep Them Occupied Providing dogs of all ages with ample enrichment is incredibly important for their healthy development. Mental and physical enrichment should be balanced based on individual needs. For instance, a young puppy may need playtime between naps and enjoy finding kibbles in a snuffle mat. An older dog might need multiple daily walks or even dog sports like flyball or agility to stay engaged. If your dog stays engaged and active, he’ll be less likely to try entertaining himself by chewing your pillows. 5. Use an Aversive An aversive is something pet parents can use to keep their puppy away from certain areas or from chewing on large objects. These tools can keep your puppy from chewing up your couch or table legs, and common aversives include: Sticky tape Plastic coverings Bitter apple spray Motion-activated deterrents These give your puppy a negative association with the area they try to chew—not with you, which is critical. Aversives can be effective if your puppy has more desirable choices to chew on (toys!) nearby. Pretty soon, the puppy will learn what is and what is not fair game for chewing, and you can remove any aversives. 6. Never Use Punishment Tactics Chewing can be frustrating, but never use harsh punishment, like yelling or swatting, toward your dog. Punishment only makes things worse in the long run, sets training back, and leads to a break in the human-animal bond. With any unwanted behaviors like chewing, always revisit your management plan. Tighten up the puppy-proofing so hopefully the chewing of unwanted items is a non-issue going forward, and make sure your dog has lots of toys to chew instead. Featured Image: iStock/gradyreese"}]