[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Eye Protection for Dogs: Is It Necessary?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-eyewear-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-eyewear-dogs.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, General Care, Eye health, Blindness", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/eye-protection-dogs-it-necessary"}, "datePublished": "August 29, 2017", "dateModified": "August 30, 2022", "description": "Can dogs benefit from wearing sunglasses or protective eyewear? Find out when eye protection may be recommended for your canine companion.", "articleBody": "By Paula Fitzsimmons When you want to block out the sun’s harmful ultraviolet rays or protect the delicate skin around your eyes, you may reach for sunglasses or other protective eyewear. The same goes for people who are sensitive to light or need to protect themselves from eye injuries at work or while playing sports. Since protective eyewear is good for your own eye health, you naturally want to know if your four-legged friend can also benefit. Why Do Dogs Wear Goggles? There are two general reasons for dogs to wear dog eye protection, says Dr. Jessica Stine, a veterinary ophthalmologist with BluePearl Veterinary Partners in Clearwater, Florida. Besides the fact that a dog wearing goggles is adorable, dog eye protection is “either to protect the eyes from injuries or to protect the eyes from the sun. There are indications for both.” Your dog’s breed can also be a factor. Some breeds are at a higher risk than others for developing eye problems, so may benefit from wearing protective eyewear. Blind dogs and dogs exposed to harsh conditions—like working dogs—may also be good candidates. Here’s a look at why your dog may need to wear sunglasses or other dog eye protection. Make sure to check with your veterinarian first to see if protective eyewear is a good fit for your canine companion. Dog Breeds That May Benefit from Protective Eyewear When it comes to vision, some breeds are more likely than others to have issues with their eyes. Boston Terriers, Shih Tzus, Pugs, and other breeds known as brachycephalics have prominent eyeballs, says Dr. Brady Beale, a clinical instructor in ophthalmology at the University of Pennsylvania School of Veterinary Medicine in Philadelphia. “Prominent eyeballs are much more susceptible to abrasions, ulcers, and cuts.” Because their eyes are large and situated closer to the ground, brachycephalics tend to run into plants or other items that might harm their eyes, says Stine, who is board-certified in veterinary ophthalmology. So “they may benefit from protective eyewear when they’re outside to prevent self-trauma to the eyes.” Sun exposure can worsen an autoimmune disease called chronic superficial keratitis (or pannus), especially in German Shepherds and Greyhounds, says Dr. Lucien Vallone, clinical assistant professor of ophthalmology at the College of Veterinary Medicine and Biomedical Sciences at Texas A&amp;M University in College Station. Pannus is not painful in most cases, but can result in blindness if left untreated, he says. “While topical anti-inflammatory therapies are the mainstay of therapy, reducing sun exposure can also help. Protective eyewear is often recommended for dogs suffering from this specific disease.” Blind dogs who have persistent ocular trauma, as well as active dogs who work in an environment where there is higher risk of trauma to the eyes—search and rescue dogs, police dogs, those who work in harsh conditions, for example—may also be good candidates for eye protection. “They may help prevent ocular trauma such as foreign bodies like plants, punctures and abrasions, and other potential irritants,” says Dr. Peter Accola, a veterinary ophthalmologist at WVRC Emergency and Specialty Pet Care in Waukesha, Wisconsin. Eye Protection After Surgery or Trauma When a dog is recovering from eye surgery—like cataract removal or a procedure to correct a corneal defect—protection is critical for vision health, says Vallone, who is board-certified in veterinary ophthalmology. “Dogs with ocular irritation and without eye protection can cause severe harm to their own eyes, as they have a tendency to itch, rub, or scratch at their face. This behavior can cause corneal ulcers to worsen and can complicate recovery from eye surgery.” In most cases, vets use Elizabethan collars (e-collars) to prevent damage, Vallone says. “These cone-shaped, plastic collars are designed to prevent dogs from traumatizing their eyes through scratching, or by pressing their face and eyes forward onto rough or abrasive surfaces.” Dr. Jessica Meekins, an assistant professor of ophthalmology at Kansas State University’s College of Veterinary Medicine, usually prescribes an e-collar for her patients, “but sometimes goggles or visors are used by myself or other veterinary ophthalmologists.” A major concern with eyewear is that they can dislodge and do more damage to a dog’s eyes, says Beale, who is board-certified in veterinary ophthalmology and practices at Pet Emergency Treatment Services in Lancaster, Pennsylvania. “I have used some goggles and visors and have been thrilled, but want to be cautious that we’re not doing more harm than good.” Protecting Against Sun Damage Ultraviolet light is bad for dogs, but not in the same way it is for us. “While UV light is the most common cause of cataracts in people, dogs develop cataracts due to heredity or as a side effect of diabetes,” says Meekins, a board-certified veterinarian. “They simply don’t live long enough for the cumulative effects of UV exposure to induce cataracts.” So, should dogs wear sunglasses? UV light can have other consequences for dogs, including worsening pannus, she says. And “while uncommon in dogs, UV light can also increase risk of the development of a certain kind of surface ocular cancer called squamous cell carcinoma.” Protection from the sun in the case of pannus is the most common reason Accola, who is board-certified in veterinary ophthalmology, recommends eyewear. Although pannus is considered hereditary, he says UV radiation from the sun contributes to the disease. “Reduction of exposure to direct sunlight is reasonable in hopes of reducing the severity of this condition and eyewear is one way to achieve this.” Helping with Eye Pain and Discomfort Dog eye protection can be useful for dogs experiencing eye pain, especially when it’s a result of scratches or abrasions of the clear surface (cornea) of the eye, Vallone says. Signs your dog may have eye pain include squinting, redness of the eye, tearing, pawing or rubbing at the eye, or general lethargy, Stine says. These signs are your cue to call your vet sooner rather than later. “A lot of the more severe eye problems that I treat may have been prevented if they had been recognized earlier at home. Any squinting dog should be evaluated by a veterinarian that day, ideally.” If you’ve ever had your eyes dilated (for example, during an eye exam), you know how a bright, sunny day can cause discomfort. The same applies to your dog, Stine says. In dogs, light sensitivity may be due to an age-related change in vision called iris atrophy, a condition where “the muscles that control the pupil are no longer able to close the pupil down to a small pinpoint,” she says. This means the dog’s pupils will stay dilated. What Type of Eyewear Should You Choose for Your Dog? There are different factors to weigh when choosing &quot;dog sunglasses.&quot; One of the biggest challenges, Meekins says, is getting a dog used to wearing them. “Some dogs will wear goggles or a visor readily, and others never accept them.” Eyewear should be comfortable and fit properly, Stine says. “All sunglasses for dogs are going to be goggle-style glasses with straps. No dog is going to keep human-style sunglasses on for long.” The dog goggles or visor shouldn’t impede your dog’s lifestyle. “A dog should be able to easily eat and drink and also navigate throughout their environment while wearing eye protection,” Vallone says. You’ll most likely need to purchase doggie eyewear from a store. “Unlike people, who often need prescription glasses or sunglasses for short-sightedness, far-sightedness, or astigmatism, dogs don’t often require corrective lenses,” he says. “Prescription lenses are thus fairly uncommon in veterinary medicine.” Protecting your dog’s vision begins with a professional evaluation. “As always, it’s important to make sure you are taking your dog to your primary care veterinarian every year, and twice a year for older dogs,” Stine says. If your vet agrees that protective eyewear is beneficial, choose a high-quality pair of glasses that fit properly and are comfortable for her to wear. As a bonus, they may even make her look more endearing than she already is."}]