[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/jknwprimcm", "@type": "VideoObject", "duration": "PT1M56S", "name": "5327096657001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/7eb05b97a9b1d5e3a9f81c6a62ee53bda7cae92e.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/jknwprimcm", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/72499f1e723447ebcdf5e7668c75824ca41eab32.m3u8", "transcript": "Family members living in close I know how easy it is to catch a cold from each other. Humans transfer cold viruses through contact with infected individuals. Contaminated services or airborne germs. But can our dogs also suffer from cold germs.\n\nThe answer is simply yes. Dogs can get colds from being in contact with other infected dogs or drinking from contaminated water sources. But the type of cold a dog suffers from is different from the type A human suffers from dog colds are not zoonotic meaning humans cannot get colds from dogs and dogs cannot catch colds from humans. Dog cold symptoms are similar to human cold symptoms canines will exhibit sneezing, coughing, or running or stuffy nose and maybe even watery eyes.\n\nIf your dog is presenting with any of these symptoms it's important to make sure they aren't related to a more serious virus or disease. For instance allergies or asthma may trigger respiratory symptoms in dogs and a cough with a noticeable hacking sound could be a sign of kennel cough. The canine influenza virus or the canine distemper virus may also bring about vomiting fever and discharge from the eyes, nose. Make sure to get your dog checked by your veterinarian to rule out any serious medical problems for otherwise healthy dogs that are exhibiting light sneezing or coughing.\n\nSimple at home treatments may suffice. Pet parents should make sure the dog consumes plenty of water and consider placing a humidifier near the dog's rest area while recovering from a cold it's best for a dog to get plenty of rest so activities and travel should be restricted until the cold symptoms have dissipated in dogs with a weakened immune system who do not recover from colds quickly. Antibiotics or other medications may be prescribed by your veterinarian. If you have a puppy or a senior dog it's best to have him evaluated by your vet to discuss treatment options.\n\nSince young and old dogs tend to have more immune problems and healthy adult dogs.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/why-do-dogs-get-fevers?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Tell if Your Dog Has a Fever and What to Do About It", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/dog-resting-on-couch.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/dog-resting-on-couch.jpg"}, "author": {"@type": "Person", "name": "Cathy Meeks, MS, DVM, DACVIM", "url": "https://www.petmd.com/author/dr-cathy-meeks"}, "keywords": "Dog, Fever, Symptom Checker, Fever", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/why-do-dogs-get-fevers"}, "datePublished": "July 30, 2020", "dateModified": "September 12, 2023", "description": "Dr. Cathy Meeks, DVM, explains what causes dog fevers, the dog fever symptoms to look out for, and how to treat a dog fever.", "articleBody": "Dog fevers are defined by having a higher-than-normal body temperature, and they have a variety of causes. So how can you tell if your dog has a fever? How do you take their temperature, and what’s considered a fever in dogs? What causes dog fevers and how do you treat them? How to Tell if a Dog Has a Fever Dog fevers can be very difficult to detect at home and are often discovered at the veterinary office. This is because a dog’s temperature is naturally higher than a human’s, and it is almost impossible to detect a fever by touching a dog’s skin. How Do You Take a Dog’s Temperature? The only way of accurately knowing if your dog has a fever is to take their rectal temperature with a digital thermometer. This is done by lubricating the tip of the thermometer and inserting it into the rectum approximately 1 inch. It is important to have another person holding your dog’s head while you do this, as some dogs may not be tolerant of this at home. If a dog does not seem ill, there is no benefit to taking your dog’s temperature at home on a regular basis, because it can also go up with overactivity or if your dog  has been outside in a warm environment. What Temperature Is Considered a Fever in Dogs? The normal range for a dog’s body temperature is between 100ºF and 102.5ºF. Anything above 102.5ºF is considered a fever or hyperthermia (overheating). A true fever is the body’s response to a disease process, whereas hyperthermia is caused by exposure to excessive heat or overheating from overexertion. What Are Some Symptoms of Dog Fevers? Dog fever symptoms can vary from mild to severe depending on how high the temperature is and what disease is causing it. Symptoms can include: Lethargy Loss of appetite Vomiting Diarrhea Shivering What Causes Dog Fevers? There can be several different causes of dog fevers, but they generally fall into one of these categories: Inflammation Infection Immune-mediated Cancer In some cases, despite extensive diagnostics, a cause is not found. This is called “fever of unknown origin.” Anything that can stimulate the immune system can cause a fever. For example, it is not uncommon for pets to get a low-grade fever after being vaccinated. This is because the immune system is being stimulated to protect the body against different diseases. Bacterial infections, fungal infections, or viral infections can all stimulate an immune response and cause a fever as well. Cancer is another disease process that usually stimulates the immune system, resulting in a fever. The most common cause of fever from inflammation is pancreatitis. This is an inflammation of the pancreas that can lead to vomiting, diarrhea, anorexia, and a painful abdomen. The cause is not clear and thought to be different in dogs than in cats and humans. Autoimmune diseases are a group of diseases that can stimulate the immune system to attack a part of the body with no underlying cause. Examples of autoimmune diseases include lupus, uveitis, and rheumatoid arthritis. These diseases can also result in dog fevers. What to Do if Your Dog Has a Fever If you feel that your dog may be ill, taking their temperature at home is a good start if you can do so. If your dog has a fever above 102.5ºF, that warrants a visit to the veterinarian. It is considered an emergency if your dog is extremely lethargic, has blood in their stool or vomit, stops eating, or has a fever above 104.5ºF.   It is extremely important to never give your dog over-the-counter medications, such as ibuprofen, to reduce the fever. These medications are toxic to pets and can result in serious harm or death. Getting a diagnosis for dog fevers as soon as possible and instituting treatment will usually result in more favorable outcomes. Most causes of fever can be treated if caught early.    How Are Dog Fevers Treated? Treatment of a fever in dogs is largely dependent on the cause of the fever. Oftentimes several diagnostics, such as bloodwork, radiographs (x-rays), and ultrasound, are necessary to determine the cause. In some cases, a cause cannot be identified. In dogs that have infections, the treatment is usually a course of antibiotics or antifungal medications. In other diseases, such as pancreatitis, there isn’t one anecdotal treatment, and medications are given to alleviate the symptoms until the inflammation subsides. This can take days to weeks and will depend on the level of severity. Cancer is treated with either chemotherapy and/or radiation therapy depending on the type of cancer that is diagnosed. Some types of cancer respond well to these treatments, where others may not respond as well or at all. Autoimmune diseases require drugs that suppress the immune system so that it stops attacking the different areas of the body. Most of these diseases are manageable but not usually curable. See Also: Featured Image: iStock.com/SolStock"}]