[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Do if Your Pet Gets Sick or Injured on Vacation", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/sickvacationdog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/sickvacationdog.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Travel, Safety, Disease, Wound", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/what-do-if-your-pet-gets-sick-or-injured-vacation"}, "datePublished": "June 29, 2016", "dateModified": "August 30, 2022", "description": "Planning ahead may not avert a crisis but will help you get medical care for your dog or cat.", "articleBody": "By Samantha Drake More people than ever are bringing their pets along on vacation, supported by the proliferation of pet-friendly accommodations and activities. But what happens if your dog or cat gets sick or injured far from home and your regular vet? Some conditions, like dehydration or overheating, you can do your best to prevent. Other hazards are not so predictable. In the blink of an eye, your dog or cat can be stung by a bee, eat a poisonous plant, or cut his paw. “It’s scary not knowing what will happen. That’s partly why people don’t travel with pets,” says Amy Burkert, who runs the Go Pet Friendly website and blog with her husband, Rod. The Burkerts have traveled around the country in an RV full-time for more than six years with their two dogs, Buster, 9 and Ty, 12. A little research and education—as well as some level-headed decision-making—can go a long way toward protecting your pet’s health and safety on the road. Plan Ahead The time and effort you put into planning ahead will pay off in the event your pet gets ill or sick while you’re on vacation. “A few hours spent preparing in advance can mean the difference between life and death for your pet,” says Melanie Monteiro, the Los Angeles-based author of The Safe Dog Handbook, and creator of The Safe Dog website. Taking the following steps will help ensure everything you need to handle a pet’s health problem: Research the area you’re visiting. Every area has its own hazards in terms of environmental threats and illness outbreaks, Burkert points out. Dog owners living or traveling on the East Coast, for example, must keep an eye out for ticks that can spread Lyme disease, while vacationers in the upper mid-West should be aware of blue-green algae, also known as Cyanobacteria, which is microscopic bacteria found in freshwater lakes, streams, ponds and brackish water ecosystems that can be highly toxic to people, pets and livestock, she notes. Get recommendations for local vets and veterinarian hospitals. Recommendations may come from friends who live in the vacation area, your own vet who may know a colleague in the area, or contacts such as campground owners. Don’t wait until a problem occurs to start Googling—a little advance research can save everyone a lot of stress. advises Burkert. Bring your pet’s medical records. As Burkert points out, in an emergency, remembering details of your pet’s medical history will be a challenge. She recommends scanning your pet’s medical records and storing them on a flash drive so they’re easy to pack, access and transfer to the treating veterinarian if needed. Also bring your own veterinarian’s contact information in case the treating vet has questions, adds Burkert. Monteiro also advises “loading up your phone with numbers and apps” before traveling with a pet. Phone appscan help keep pets medical records organized and accessible while traveling and even give users access to vet-answered questions while on the go. Pack a first-aid kit. This should include everything you need to handle your pet’s minor cuts, splinters or upset stomach, says Burkert. Also bring a muzzle that your dog is comfortable wearing. In an emergency situation, a dog that’s in pain and surrounded by strangers in a pet hospital could lash out at staff, explains Burkert. Take a pet safety training course. Online or in-person courses for dog owners provide training in everything from reading a dog’s vital signs to performing CPR. A first aid course helps people become more familiar with handling their pets in different situations, says Monteiro. “It doesn’t take a high level of skill to be your dog’s hero,” she notes. Get familiar with your pet’s healthy vital signs. Do you know when your dog is overheated or not feeling well? Knowing his or her baseline vital signs including pulse and body temperature can help you detect health issues, says Denise Fleck, the Burbank, Calif.-based owner of Sunny-dog Ink, which offers hands-on pet first aid training as well as advice on caring for senior pets and disaster preparedness for pets. Fleck recommends doing your own “weekly head-to-tail checkup” of your pet to become more in tune with your pet’s health. Routine checkups also help acclimate your dog or cat to being handled in a different way. Crisis Control Hopefully, none of these preparations will be necessary. But if your dog or cat does become ill or gets injured, you must decide if the pet needs emergency assistance or urgent care. If you aren’t sure what to do, call your vet for advice or to talk you through what to do in a crisis, says Burkert. A local vet is the animal equivalent of urgent care and vets often reserve a few open time slots for emergencies. “They’ll be able to squeeze you in,” Burkert says, but be sure to call first. If emergency care is needed, go straight to the nearest 24-hour veterinarian hospital. It’s important to note that 911 responders are not usually trained in vet care, she notes. In addition, make sure you have basic first-aid supplies with you if you’re going to be far from assistance. “Part of first aid is doing the best we can with what we have,” Fleck notes. If you can’t bring your pet’s first aid kit with you on a hike or day trip, Fleck recommends carrying the following supplies with you in a small backpack: - Water for hydration - Antihistamines for allergic reactions - Chemical cold packs to reduce swelling - Bandages for cuts and scrapes - A blanket or tarp to protect or help transport the pet. Above all, be sure to give your pet frequent water breaks and try to stay calm if something does happen because your pets depend entirely on you. As Fleck notes, “Pets are part of the family and it’s our responsibility to keep them safe.” Image via Shutterstock"}]