[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Should I be worried if my dog’s eye is watering?", "acceptedAnswer": {"@type": "Answer", "text": "If your dog’s eyes are watering, but they appear comfortable and are not squinting, make sure to bring it up during your next wellness appointment. If your dog has watery eyes with squinting, decreased appetite, lethargy, or other signs of illness, seek veterinary care immediately."}}, {"@type": "Question", "name": "Are watery eyes painful for dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Most of the time, epiphora is not a painful condition. Occasionally, dogs may experience some mild discomfort or itchy eyes from chronic irritation."}}, {"@type": "Question", "name": "Will allergies cause watery eyes in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "Allergies are a common cause of watery eyes in dogs. Featured Image: iStock.com/Daniel de Andres Jimenez"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Watery Eyes (Epiphora) in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Eyes", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/Man-cleaning-dogs-eyes.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/Man-cleaning-dogs-eyes.jpg"}, "author": {"@type": "Person", "name": "Melissa Boldan, DVM", "url": "https://www.petmd.com/author/dr-melissa-boldan"}, "keywords": "Dog, Condition, Eye health, Symptom Checker, Eye Discharge", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/eyes/watery-eyes-epiphora-dogs"}, "datePublished": "August 3, 2023", "dateModified": "September 22, 2023", "description": "Watery eyes or epiphora in dogs, is a common condition where a dog’s eyes excessively water. Most commonly water eyes are due to allergies or other eyelid issues. We share everything you need to know about the condition.", "articleBody": "What are Watery Eyes in Dogs? Epiphora is the medical term for the clear, watery substance that drains from a dog’s eyes that looks like excessive tears. You may notice that the moisture leads to a red-brown discoloration of the fur around their eyes. The discoloration is from a normal pigment in tears called porphyrin, and can lead to staining that is especially noticeable in dogs with white fur. Normal tear production is important to keep your dog’s eyes lubricated. Extra tears are stored in the tear ducts in the corner of dogs’ eyes near their nose. When the eyes are irritated by dust, hair, pollen, or other irritants, the stored tears can help to flush the particles from their eyes. Watery eyes are very common in dogs and are associated with things that irritate the eye and abnormal drainage of tears, or they may simply be normal for the dog’s breed.  A pet parent should seek veterinary care if the discharge is greenish-yellow and their dog is squinting. This may indicate an eye injury. Symptoms of Watery Eyes in Dogs Excessive tearsReddish-brown discoloration of the fur under the eyesRubbing, pawing at the eyesGlassy eyesDampness under the eyesWhy Does My Dog Only Have One Watery Eye? Epiphora can affect one or both eyes. It is more common for both eyes to be affected. Occasionally a dog will have an irritant (like an ingrown hair on the eyelid) that rubs only one eye. Sometimes a nasolacrimal duct, which runs from the eyes to the nose, will become plugged on only one side, leading to abnormal drainage of tears. Green-yellow drainage and squinting of one eye can also be signs of a corneal ulcer. If your dog has drainage from one eye that is not watery or obviously clear, and is accompanied by squinting or pain, they need to be seen by a veterinarian right away. Causes of Watery Eyes in Dogs Epiphora is usually caused by conditions that irritate the eye, the abnormal drainage of tears, or because that breed tends to have watery eyes. Several conditions can cause acute (sudden) or chronic (long-term) irritation to the eyes. The following are some of the more common conditions leading to irritation of the eyes and subsequent watery eyes: Allergies: Pollen and dust are common eye irritants.Eyelash abnormality: There are several different eyelash abnormalities where the eyelash either is ingrown (trichiasis), grows from an abnormal spot (distichiasis) or grows on the inside of the eyelid (ectopic cilia).Eyelid abnormality: Sometimes a dog can be born with eyelids that are either rolled in (entropion) or rolled out (ectropion) too much. This can result in the skin and/or hair rubbing on the eye or excessive drying of the eye and subsequent tearing.Prolapsed third eyelid: This condition is commonly referred to as “cherry eye” and occurs when the gland of the third eyelid comes out of the pocket it normally sits in.Small eyelid masses: These are quite common and can rub on the surface of the eye, leading to chronic irritation.Viruses: Some viruses can cause irritation and watery eyes.Glaucoma: Glaucoma occurs when the pressure inside the eye is too high. This can result in excessive tearing as well.Abnormal drainage of tears: occurs when tears cannot drain out of the eyes normally. This forces them to back up and causes watery eyes. Normally, dogs have a small duct that runs from the inner corner of the eye out the nose.The following conditions can lead to abnormal drainage of tears and subsequent watery eyes: Shallow eye sockets: Some breeds have large, bulging eyes and very shallow eye sockets. This can result in tears overflowing, because there is not enough room in the eye socket for the tears produced to be stored.Plugged nasolacrimal duct: The duct that runs from the inner eye to the nose can become clogged with debris or become inflamed or infected.Imperforate puncta: Some dogs are born without a normal nasolacrimal duct opening to the eye. This condition is called imperforate puncta, and is more commonly seen in Cocker Spaniels. When the tears do not flow out normally, they become backed up and leak from the eyes, leading to epiphora.Watery eyes can be normal for a breed due to genetics. Some breeds of dog (such as Poodles, Shih Tzu, and Pekingese) can have epiphora with normal nasolacrimal systems and no obvious irritants. How Veterinarians Diagnose Watery Eyes in Dogs Veterinarians diagnose epiphora with a physical exam. Your vet may decide to measure the amount of tears produced using a method called the Schirmer tear test. A small absorbent strip is placed within the lower eyelid for one minute. If your vet suspects an eye injury, they may check for scratches (corneal ulcers) by staining the cornea with fluorescein. Your vet may also check the pressure in your dog’s eyes using tonometry, in which a hand-held probe gently touches the eye’s surface. This painless procedure checks for glaucoma. Treatment of Watery Eyes in Dogs Treatment is varied, based on the underlying cause of your dog’s watery eyes. If irritation from allergies, like pollen, is the cause, your veterinarian may recommend an antihistamine along with artificial tear drops to flush the eyes. If there is an abnormality like an ingrown eyelash, rolled eyelid, or eyelid mass, surgery may be recommended to correct the problem. In some cases, no treatment is required if the excessive tearing is the result of shallow eye sockets or a normal condition for that breed. For these dogs, gently wiping the tear tracts regularly with gentle wipes, like Optixcare® Eye Cleaning Wipes, can be helpful to avoid accumulation of debris and secondary bacterial infections. Recovery and Management of Watery Eyes in Dogs Some conditions that cause watery eyes in dogs can be treated and carry a good prognosis for recovery. Chronic irritation from eyelid or eyelash abnormalities can be resolved with surgery. Allergies do not have a cure and are instead managed long term. Allergies may be seasonal or year-round and can be treated with various allergy medications, from over-the-counter antihistamines to prescription medications like Apoquel® or Cytopoint®. In breeds that are genetically prone to watery eyes with no abnormalities of the nasolacrimal system, the condition can only be managed. While the eyes will continue to produce excess tears, the goal is to prevent moisture on the skin from growing bacteria and the development of secondary skin infections. These dogs may require regular wiping of the tear tracts with gentle wipes that are labeled for dogs. Angels’ Eyes® Tear Stain Wipes are commonly used for routine cleansing and to minimize tear staining. Sometimes medicated products, like Douxo® Antiseptic Antifungal Wipes, are used to reduce overgrowth of yeast and bacteria. Remember, it is important to prevent any of these products from getting in your dog’s eyes and to only cleanse the skin beneath the eye where the tears fall."}]