[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Advancements in Dog Mammary Tumor Therapy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/healthy-puppy-after-medical-exam-picture-id589118396.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/healthy-puppy-after-medical-exam-picture-id589118396.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Lumps and Bumps, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/advancements-dog-mammary-tumor-therapy-0"}, "datePublished": "November 28, 2018", "dateModified": "September 7, 2022", "description": "Find out about the recent advancements in therapies for the treatment of dog mammary cancer.", "articleBody": "Image via iStock.com/gilaxia By Diana Bocco Mammary tumors are three times more common in dogs than they are in humans, according to Dr. Carol Osborne, DVM, from Chagrin Falls Veterinary Center &amp; Pet Clinic. They are also more common in adult, non-spayed female dogs, with obesity and older age increasing the risk significantly. While a combination of surgery, chemotherapy and radiation remains the main form of treatment for cancerous tumors, veterinary scientists are finding new ways to extend the life of dogs diagnosed with cancer. In some cases, the new treatments are helping canine cancer patients go straight into remission. Penn Vet Shelter Canine Mammary Tumor Program Researchers at the University of Pennsylvania are studying properties of collagen in canine tumor microenvironments, as well as markers that predict clinical outcomes. This would help them to accurately predict how these things affect tumor behavior and what treatment will be the most effective in different cases. “While there are several individual studies that identify various markers, many of these studies are small, the treatments vary and the follow-ups are inconsistent,” says Dr. Karin Sorenmo, DVM, DACVIM, DECVIM-CA (Oncology), who runs the Penn Vet Shelter Canine Mammary Tumor Program. Through the program, Dr. Sorenmo and other scientists are working to understand the risk factors for metastasis and to map out what and where the targets or strategies in treatment may be. “This data set can be used to test the predictive value of numerous biomarkers, and it provides a practical method for clinicians to determine the dogs’ risk for metastasis, and therefore their need for systemic therapy,” Dr. Sorenmo says.  Because there are several factors that contribute to poor outcome in the treatment of canine cancer, Dr. Sorenmo says it’s important to develop a high-quality bioscoring system so that veterinarians can predictably identify dogs at risk and potentially test new drugs or interventions in this subpopulation. Finding Study Candidates With Malignant Tumors The Penn Vet Shelter program collects high-quality clinical data and outcome information on a large group of dogs with mammary tumors, according to Dr. Sorenmo. Because most pet dogs are spayed at a younger age, Dr. Sorenmo started a program that finds study candidates among homeless dogs. “Shelters or rescues with dogs with mammary tumors contact me if they have a candidate,” Dr. Sorenmo explains. “During the first 4-5 years, I took all comers, but ended up with many benign tumors, so the last 3-4 years, I have restricted enrollment to dogs with tumors over 3 cm, and this has resulted in changing the population so I get approximately 80 percent malignant tumors.” All dogs enrolled in this program undergo what Dr. Sorenmo calls standard of care, which means routine pre-surgical staging, tumor removal and spaying. “The follow-up monitors for metastasis and recurrence,” says Dr. Sorenmo. “These dogs get free mammary tumor care and recheck chest X-rays for the remainder of their life, so it is a good deal for them.” Clinical Trial Success With Synchronization Immunotherapy A clinical trial that started in Australia with Biotempus Limited, an independent life sciences company, is now seeing great success in the US as well. Dr. Osborne is leading the US trial, which involves mapping the immune cycle of dogs to decide on the best possible time to use chemotherapy treatment. The trial began in April 2018 and is slated to run till the end of the year.   “Our bodies, as well as our pets’ bodies, naturally cycle,” explains Dr. Osborne. “Now that the immune system’s cycle has been identified, it only makes sense to take advantage of this new discovery in our quest to cure cancer.” The system is simple: CPR (C Reactive Protein) readings are taken daily through a simple blood test for up to 14 days, and the results are entered into a software system that defines the body’s peak day for optimum immune system function, explains Dr. Osborne. Once the immune system’s peak day has been identified, the dogs receive one oral dose of a chemotherapy pill called Cyclophosphamide on that day. “This allows us to mesh or synchronize the timing of the chemo pill with the body’s peak immune system function so that they work together to allow the body to eliminate or cure the cancer with no harm to the patient,” Dr. Osborne explains. By giving the chemo dose at the exact time, the body’s immune system can more easily identify, target and eliminate the cancer cells naturally, Dr. Osborne explains. “The chemo pill kills the T-regulatory cells from ‘hiding’ the cancer cells so that the T-Effector cells (the good guys) of the immune system can ‘see’ the cancer cells and kill them naturally.” Dr. Osborne explains, “This is how the immune system normally works in general to protect us from various bacteria, viruses and other pathogens; the problem with cancer is that the body’s immune cells are not usually able to recognize the foreign cancer cells, so they do not kill and eliminate them.” The results have been nothing short of astonishing. “I watched, for example, an osteosarcoma bigger than an orange shrink to become smaller than a small lemon in a matter of hours,” Dr. Osborne explains. “The same exact trial was conducted at select Mayo Clinics for humans suffering with cancer and the results have been promising, and this immunotherapy is still being used and perfected for human cancer patients today.”  While getting a cancer diagnosis for your dog is heartbreaking, there are more and more options available to help you fight back. Always talk to your veterinarian about new treatments and clinical trials that might be happening near you and ask whether they are accepting canine cancer patients."}]