[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Melanoma Tumors in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/cute-maltese-dog-looking-at-camera-picture-id1065831880.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/cute-maltese-dog-looking-at-camera-picture-id1065831880.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Lumps and Bumps, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/evr_dg_melanoma_tumor_in_a_dog"}, "datePublished": "May 2, 2011", "dateModified": "September 7, 2022", "description": "Learn more about melanoma tumors in dogs, and what they mean for your dog’s overall health.", "articleBody": "Reviewed and updated for accuracy on April 29, 2019 by Dr. Hanie Elfenbein, DVM, PhD Melanoma tumors in dogs demand immediate attention. In fact, early recognition of these malignant tumors of melanocytes (pigment-producing cells) is key. It can lead to more successful attempts at removal and identification of the grade or stage of cancer in order to direct treatment. As a group, though, melanomas can be either benign or malignant. The risk of metastasis (spreading) for benign forms of melanoma is not very high, but these can be locally invasive, meaning there is harmful to normal tissue where the tumor forms. Malignant melanomas in dogs, conversely, can metastasize (spread) to any area of the body, especially the lymph nodes and lungs, and present very challenging and dangerous prospects for the dog. Here’s what you need to know about melanomas in dogs. Benign Melanomas in Dogs Benign cutaneous melanomas in dogs are usually seen as round, firm, raised, darkly pigmented masses from 1/4 inch to 2 inches in diameter. They occur most often on the head, digits (toes) or back. Malignant Melanomas in Dogs Lymph-node swelling or enlargement may be a clinical sign of malignant spread of a melanoma in dogs. An abnormally concentrated amount of melanin (pigment) is often another hallmark of dog melanomas. However, some melanomas do not display the characteristic darkly pigmented color of most melanomas. These are called amelanotic, and may be mistaken for other types of tumors unless evaluated by your veterinarian. The location of the tumor may predict its severity—tumors on the face, mouth, eye, feet and haired skin areas are especially concerning, though it is important to confirm that any lump is not cancer. Diagnosis A definitive diagnosis is made via microscopic analysis (histopathology evaluation by a specialist in veterinary pathology) of a small section of the growth. This is also called a tumor biopsy. The examining pathologist usually will grade the specimen according to how actively the cells are replicating. This gives an approximation of how likely the growth is to invade and spread. If an entire growth is removed, the pathologist can report on the tissue&#039;s grade as well as any evidence that parts of the tumor may not have been thoroughly excised by the surgeon. Your veterinarian will also want to examine your pet for metastasis by taking X-rays of the chest and tissue samples from lymph nodes. This process, called “staging,” helps your veterinarian select the right types of treatment and gives you important information about your pet’s prognosis. Treatment Treatment of melanomas in dogs is best provided by surgical excision of the tumor and nearby surrounding tissue. Localized tumors in a dog may be completely removed with the patient being cured. However, if a malignant melanoma has had the opportunity to spread to distant areas of the body, the prognosis for the dog is not favorable. Chemotherapy has been performed with marginal success, though complete remissions of metastatic melanoma cases are rare. Fortunately, most cutaneous (skin) melanomas are benign; nevertheless, individual growths should be evaluated carefully, as any given melanoma may become malignant. There is also a melanoma vaccine for dogs. Unlike most vaccines, this therapy does not prevent melanoma tumors from forming, but rather helps the body rid itself of any remaining melanoma cells after the tumor has been removed. This can be helpful when the tumor is in a place where your surgeon is unable to remove the entire mass, such as the mouth, eye and toes. Case Presentation of Melanoma in Dogs A Golden Retriever was presented for routine vaccinations. The attending veterinarian—as part of the pre-vaccination physical exam—noticed an abnormal, darkly pigmented, raised tissue mass at the lateral edge, or the dog&#039;s right corneal-scleral junction. The suspicious mass was creating a slight deviation in the smooth surface of the cornea and seemed to be invading both the sclera (white area of the eyeball) and the cornea. Because the veterinarian suspected that the mass was a melanoma, referral to a specialist in Veterinary Ophthalmology was done. Dr. Sam Vainisi of the Animal Eye Clinic in Denmark, Wisconsin, evaluated the 4-year-old Golden Retriever and recommended surgery. Using a CO2 laser, the growth was excised. Because of the depth and diameter of the growth, as well as the unusual location, Dr. Vainisi performed a frozen-tissue, corneal-scleral graft with healthy tissue from the clinic&#039;s eye bank to fill in the defect. The tissue graft was carefully sutured into the surgical site. Topical and oral dog antibiotics and an anti-inflammatory medication were used after the surgery, and healing of the surgical site was uneventful. The photos below display the melanoma prior to the surgery and six months after. Annie, the patient, is healthy and active and is expected to have no visual impairment as a consequence of the tumor. Thanks to the specialist&#039;s careful evaluation and surgical excision of this melanoma, Annie is expected to have no further problems with the eye. Benign Melanoma in the Eye of a Dog (click on an image to see the close-up view)  Two views of a dark, raised mass of six month&#039;s duration at the corneoscleral junction in a Golden Retriever. Two views of the healed surgical site, six months after surgical excision and with tissue transposition. If you discover a darkly pigmented, raised, thickened growth anywhere on your dog, be sure to have your veterinarian evaluate it. Keep in mind that pigmented (black) areas of the skin are common in dogs (and cats), especially in the tongue, gum and eyelid tissues. These darkened areas may be completely normal for that individual. However, if any darkly pigmented areas are actually raised above the normal surface or seem thickened, ulcerated or inflamed, an exam is indicated. Any new areas of pigmented or raised tissue should be evaluated by your veterinarian. Featured Image: iStock.com/miodrag ignjatovic"}]