[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Treating Oral Cysts in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-oral-cysts.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-oral-cysts.jpg"}, "author": {"@type": "Person", "name": "Sarah Wooten, DVM", "url": "https://www.petmd.com/author/dr-sarah-wooten"}, "keywords": "Dog, Lumps and Bumps, Cancer", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/treating-oral-cysts-dogs"}, "datePublished": "January 26, 2018", "dateModified": "September 7, 2022", "description": "Unerupted teeth in dogs can sometimes cause oral cysts, also called dentigerous cysts. Left untreated, oral cysts can cause pain and irreversible damage to the surrounding teeth and jaw. Learn more about oral cysts in dogs.", "articleBody": "By Sarah Wooten, DVM A dog is supposed to have 42 adult teeth. If your dog has less than 42 teeth and has not had any adult teeth extracted, what does it mean? While it is possible that your dog is just missing teeth (they never developed at all), there is also a possibility that a missing tooth isn’t missing at all, but unerupted or impacted under the gums. When a tooth fails to erupt, sometimes nothing happens and the tooth resorbs or lies dormant, never causing any problems. In other cases, however, an unerupted tooth can develop an oral cyst. Left untreated, oral cysts can cause pain and irreversible damage to the surrounding teeth and jaw. The good news is that oral cysts, also called dentigerous cysts, can be prevented if detected and treated before they cause disease. While oral cysts can be seen in all breeds of dogs, small breeds, brachycephalic breeds like Pugs and Shih Tzus, Bulldogs, and Boxers seem particularly prone to development of oral cysts. The reason oral cysts are more common in these breeds is due to dental crowding—there just isn’t a lot of room in the mouths of short-nosed breeds, and that can spell trouble. What Are Oral Cysts in Dogs? In a dog, an oral cyst is a fluid-filled sac that surrounds the enamel of an unerupted tooth. Oral cysts are considered benign in that they don’t invade local tissues. However, as the sac expands, it puts pressure on surrounding teeth and bone. Within a remarkably short period of time, oral cysts can destroy teeth and weaken the jaw enough to cause a pathological fracture, which is why early detection and treatment is so important. Oral cysts typically form in premolars on the lower jaw, though any tooth can be affected. If a cyst grows large enough, it can be seen by the naked eye as a blueish swelling of the gums. The problem with oral cysts is that by the time they grow big enough to be seen, it has been causing pain and irreversible damage to the jaw and surrounding teeth, and surgical repair may be extensive. Treating Oral Cysts in Dogs Treatment of oral cysts is surgical in nature, and requires complete surgical removal of the entire oral cyst. If the entire lining of the cyst is not removed, the cyst will likely come back. Your veterinarian may recommend that the cyst be submitted for biopsy to rule out life-threatening oral melanoma, or other conditions such as radicular cysts, periapical cysts, granulomas, or abscesses. Any surrounding teeth will be evaluated at the time of surgery. If surrounding teeth are not vital, then they will need to be extracted or treated with a root canal. If the oral cyst has caused bone loss, your dental surgeon may recommend a bone graft to regrow bone and stabilize the jaw. The best treatment for oral cysts is to catch them before they even start. In puppies and young dogs, multiple physical exams that include complete oral exams and teeth counting are an important part of ensuring that your dog does not suffer from an undiagnosed oral cyst. Prevention of development tooth problems is another reason why puppy visits and regular exams with your local veterinarian are so important. If you take your puppy to a vaccine clinic for puppy shots or get vaccines from a feed store, your puppy is not getting the care that he or she needs to have the best lifelong health. Missing Teeth or Unerupted Teeth in Dogs If your veterinarian notices that your dog has unexplained missing teeth and recommends intra-oral dental X-rays under sedation or general anesthesia, then schedule it to be done as soon as possible. If it is a young dog who still needs to be spayed or neutered, X-rays can be done at the time of the surgery. The good news is that if your veterinarian tells you that your dog’s teeth developed normally and are all accounted for, then there is no longer any concern about oral cyst development. If an unerupted tooth is detected in a young dog, then have it removed as soon as possible to avoid the risk of an oral cyst. If you have an older dog (7 to 8 years or older) who has an unerupted tooth that is detected on dental radiographs with no evidence of cyst formation, follow your veterinarian’s recommendations. He or she may recommend removing the tooth or yearly monitoring of the tooth with radiographs. Boxers sometimes can have supernumerary teeth—that is, more than 42 teeth. If you have a young Boxer with a normal tooth count, talk with your veterinarian about his or her recommendations. You may want to err on the side of safety and have the teeth X-rayed at the time of spay or neuter to rule out the possibility of undetected, unerupted supernumerary teeth."}]