[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Pet Medication: Antibiotic Use and Misuse", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/5435342541_562e179a1b.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/5435342541_562e179a1b.jpg"}, "author": {"@type": "Person", "name": "T. J. Dunn, DVM", "url": "https://www.petmd.com/author/tj-dunn"}, "keywords": "Dog, Pain, Prescription medication, Antibiotics", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/evr_dg_pet_medication_antibiotic_use_and_misuse"}, "datePublished": "March 10, 2011", "dateModified": "September 7, 2022", "description": "One of the greatest challenges veterinary and human doctors face today is to make appropriate antibiotic selections that effectively help the patient recover from bacterial, yeast and fungal infections -- while at the same time not harming the patient.", "articleBody": "By T. J. Dunn, Jr., DVM Returning to his lab one morning in 1928 after a two-week vacation, Scottish microbiologist Sir Alexander Fleming realized that one petri dish inoculated with Staphylococcus bacteria had been accidentally left open. About to dispose of the worthless moldy dish, he noticed a clear halo devoid of any bacterial overgrowth surrounding each mold colony. For some strange reason the bacteria weren’t growing in these small halos of agar surrounding the greenish mold. Curious, as all scientists are, he asked himself why not? Instead of discarding the &quot;contaminated&quot; petri dish, he explored the antibacterial properties of the unusual mold, called Penicillium notatum, and the rest is history. Since Fleming’s discovery of penicillin huge strides have been taken in the research and development of wide varieties of antimicrobial chemicals, and researchers continue to seek newer, safer, and more effective methods of interfering with bacterial and other microorganism replication. One of the greatest challenges veterinary and human doctors face today is to make appropriate antibiotic selections that effectively help the patient recover from bacterial, yeast and fungal infections -- while at the same time not harming the patient. How would harm come to a patient being administered antibiotics? One common example is the over-prescribing of antibiotics -- using them when not really indicated. Recently a young Wirehaired Fox Terrier was presented to me because of sudden onset of loose, foul smelling stool. There was no history of the dog having eaten anything unusual, the diet was excellent, no intestinal parasites were evident on the fecal analysis, and the patient was not dehydrated, vomiting, nor acting depressed. The temperature was normal and abdominal palpation revealed a loose, gassy and non-painful character. My diagnosis was a viral enteritis -- call it &quot;intestinal flu,&quot; if you like. After discussing my diagnosis, and my preferred treatment of withholding all dog food for 24 hours, allowing plenty of fresh water, and simply allowing the dog to eat small amounts of yogurt every two hours until the following day, the owner asked ,&quot;Aren’t you going to give him some antibiotics?&quot; I had to convince the concerned and skeptical owner that if my diagnosis was correct, this patient did not need antibiotics and in fact might develop a much worse diarrhea if we went that route. Plus, once an antibiotic is used in a patient there is the potential for that patient to develop a resistant population of bacteria. And someday, when antibiotics are truly needed, if that antibiotic is chosen as a treatment the infection may be refractory to the drug. What this patient needed was to have &quot;good&quot; bacteria reintroduced into the gastrointestinal tract so that the correct balance of bacterial flora could be reestablished. Antibiotic administration should be reserved for patients who truly need them. Indiscriminate or casual use of antibiotics may lead to bacterial resistance in a patient as well as set up the potential for a future allergic reaction to the drug. Conversely, in urinary tract infections and in skin infection cases called pyoderma, long-term administration of antibiotics may be necessary to eliminate tough infections. Often, with pyoderma, antibiotics are actually under-prescribed. According to veterinary dermatologist Rusty Muse of Tustin, California, most pyoderma cases require an appropriate antibiotic for as long as six to eight weeks to be effective.   Dr. Muse states, &quot;The skin receives only 4% of the heart’s output so effective blood delivery of antibiotic concentrations have a much more difficult time saturating the skin cells in microbe-killing amounts than in organs well perfused with blood such as the liver. At our dermatology clinic we have discovered that about 10% of the ‘allergy’ patients are actually suffering from chronic pyoderma and have not responded well to antibiotics previously used. Sometimes that failure for an infection to clear is due to too low of a dose being given or the dose not being given as often as directed or for as long as directed. In some cases, especially if a culture and sensitivity have not been done, the antibiotic chosen may not be the best choice for the specific bacteria causing the pyoderma.&quot; &quot;There are four principles to keep in mind regarding appropriate antibiotic use,&quot; continues Dr. Muse. “One is that the correct choice of antibiotic needs to be made for a particular infection. The second is the proper dose must be given. Third is that the dose must be given at defined intervals because some medications should be given once a day and others four times a day to achieve consistent and effective tissue levels of the antibiotic. And finally, the antibiotic needs to be given long enough to truly effect a cure.&quot; In general, most veterinarians select what they consider to be an appropriate medication, and if the results are not favorable, laboratory identification of the bacteria and testing for the bacteria’s vulnerability to specific antibiotics is done. This is termed &quot;doing a culture and sensitivity.&quot; Should this, however, be done in every situation where an infection is discovered? According to Mark G. Papich, DVM, Professor of Clinical Pharmacology in the College of Veterinary Medicine at North Carolina State University, &quot;For routine infections, empirical treatment with ‘first line’ drugs can be used without obtaining lab tests (culture and susceptibility tests) first. For refractory infections, or cases that are more serious and/or life-threatening, lab tests are recommended.&quot; Some failures of antibiotic administration might be due to early withdrawal of the drug by the owner when it appears that an infection has &quot;cleared up.&quot; Every veterinarian has experienced the exasperation of faulty owner compliance with prescription instructions. A typical scenario goes like this … the veterinarian sees a patient again for the same problem a few months after prescribing an antibiotic. A different prescription is suggested to fight the infection and the owner says &quot;I’ve still got quite a few left from the last time, Doctor. Should I just start those again?&quot; Bingo! So that’s why the medication didn’t work; it wasn’t used for the entire treatment time! &quot;Another concern regarding indiscriminate use of antibiotics in small animals&quot; states Papich, &quot;is the resistance problem. When animals are exposed to antibiotics, there is a good chance that the endogenous population of bacteria will mutate or acquire resistance factors that may change them from being susceptible to being resistant. When these bacteria later on are the cause of a urinary tract infection, wound infection, or other opportunistic infection, there is a good chance that they will be resistant to standard drugs.&quot; Some antibiotics, such as the tetracyclines, should not be given with dairy products that contain lots of calcium because the calcium binds with the antibiotic and reduces the effectiveness. Some antibiotics, as mentioned, must be given every six hours, some every eight, some every 24 hours. One prescription may need to be given with food and another on an empty stomach. One group of antibiotic might cause severe diarrhea, another could permanently discolor emerging tooth enamel if given to young pups, another group could cause bone marrow suppression, and another could potentially do harm to the auditory nerve and cause permanent deafness. The moral of this story is to expect antibiotics to be used only when truly needed and then to be used according to the directions. And if your veterinarian seems reluctant to dispense an antibiotic when little Snuffy has the sniffles, now you know why. Take heart that if the sniffles turn in to something worse, antibiotics are available if needed. Image: Petra Fritz / via Flickr"}]