[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Keep Your Dog From Licking Their Wounds", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Health", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-licking-his-paw-on-cement-floor-picture-id877962738.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-10/dog-licking-his-paw-on-cement-floor-picture-id877962738.jpg"}, "author": {"@type": "Person", "name": "Brittany Grenus, DVM", "url": "https://www.petmd.com/author/dr-brittany-grenus"}, "keywords": "Dog, Licking, Wounds", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-keep-your-dog-licking-their-wounds"}, "datePublished": "October 29, 2021", "dateModified": "September 8, 2023", "description": "Dr. Brittany Grenus gives tips on how to keep dogs from licking and infecting their wounds aside from the standard plastic cone.", "articleBody": "Wounds are very common in dogs. And no matter how severe or minor a dog’s wound is, one thing is consistent—they will insist on licking it. It is a common misconception that letting dogs lick at their wounds is beneficial and will help them heal. While there is a little truth to this, dogs in general tend to lick their wounds excessively, which can cause a number of problems. Here’s some insight on why dogs are compelled to lick their wounds, how to stop them, and how to tell if your dog’s wound has become infected. Why Do Dogs Lick Their Wounds? One of the primary reasons dogs lick their wounds is to help soothe the pain and discomfort. Licking the site of the wound overstimulates the brain, which in turn can help temporarily numb the pain. This is similar to humans rubbing or holding their wounds. Since dogs don’t have hands to rub or hold their wounds, they use the only tool they have for self-soothing—their tongues. Another reason dogs lick their wounds is to clean away debris and bacteria. Studies have shown that dog saliva has a small amount of bacteria-killing properties. However, the effect is slight and it’s only effective against Escherichia coli and Streptococcus canis.1 So while licking will slightly help decrease these two types of bacteria, there are many other bacteria that can start to overgrow in the wound. Unfortunately, this means that dog saliva ultimately does not help clean or heal the wounds, so it’s best to prevent dogs from licking their wounds. What Will Happen If My Dog Keeps Licking the Wound? Although licking the wound can provide a small benefit initially, most dogs lick their wounds excessively. This can actually introduce more bacteria into the wound, leading to an infection. Not only can licking wounds lead to infections, it can also cause irritation and damage to the surrounding tissues and the wound area. This, in turn, can lead to delayed healing and potentially even increase the size of the wound. In some cases, dogs lick at their wounds so much they reopen wounds that are healing. After having surgery, dogs can even lick themselves so aggressively that they pull out the sutures and open the incision site. How to Keep Dogs From Licking Their Wounds Dogs can harm themselves in numerous ways by licking their wounds, so it’s important know how to prevent them from licking. While the infamous plastic “cone of shame” is the standard option, you may not know about some of these other options: Soft Cone (Elizabethan Collar) The Elizabethan collar is also known as an e-collar or a “cone of shame.” While it is considered standard to use a hard plastic cone to prevent a dog from licking, several types of soft cones are now available that your dog may find more comfortable. The most important thing is finding the right size cone for your pet. The end of the cone should extend at least 2 inches beyond your dog’s muzzle; otherwise, they will be able to get around the end of the cone and lick.   Inflatable Pet Collar These can be much more comfortable for your dog and more convenient for you. When wearing these, dogs knock fewer things over, run into fewer objects in the house, and don’t hurt people with a hard plastic cone when they inevitably walk into them. The downside to these is that they can be ineffective if the wound is on the paw, or with dogs that are very flexible or very determined. Dog Clothing For wounds on the chest or belly, T-shirts or other pet clothes can help cover the wound and prevent your dog from licking at it. Recovery Suits These are specialized clothes made to cover a dog’s wounds. Various suits have been designed to cover just about any wound a dog may have. Booties/Socks For wounds on the feet, dog booties or socks can be a great way to prevent your dog from licking. Wound Dressings Depending on the type and severity of the wound, a wound dressing may be applied to the area by your veterinarian. This not only helps protect the wound but also prevents your pet from licking at it. Do not apply your own dressing to the wound without consulting your veterinarian first. How Can You Tell If Your Dog&#039;s Wound Is Infected From Licking? If you notice any of these signs of infection, contact your veterinarian right away: Redness Inflammation Thick or colored discharge Pus Reopening of the wound A wound that is taking a long time to heal or not healing at all References Hart BL, Powell KL. Antibacterial properties of saliva: Role in maternal periparturient grooming and in licking wounds. Physiology &amp; Behavior. 1990;48(3):383-386. doi: 10.1016/0031-9384(90)90332-xFeatured image: iStock.com/Tevarak"}]