[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Collapsing Trachea in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/yorkie-tracheal-collapse.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/yorkie-tracheal-collapse.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Coughing, Condition, Symptom Checker, Collapsing Trachea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/collapsing-trachea-dogs-everything-you-need-know"}, "datePublished": "January 10, 2018", "dateModified": "September 12, 2023", "description": "Collapsing trachea refers to a relatively common disease that causes chronic coughing and other symptoms in dogs. Here, learn everything you need to know about tracheal collapse in dogs.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. What Is Tracheal Collapse in Dogs? In both people and pets, the trachea is the tube that carries air from the nose and mouth through the neck and into the lungs, often referred to as the “windpipe.” The trachea is made up of C-shaped cartilage rings with a thin membrane across the top to complete the circle to form the tube. If the cartilage rings become weakened or the membrane become stretched out or floppy, the shape of the trachea flattens. This flattening, called “tracheal collapse,” can make it harder to get air into the lungs and breathe normally. As a result, many dogs with tracheal collapse will make a dry, goose-like honking cough sound.  Tracheal collapse in dogs is often mild. You may notice some clinical signs, but the dog is able to live a normal life. However, in severe situations, tracheal collapse can cause respiratory distress and significant trouble breathing. If your dog is having any trouble breathing, this is a medical emergency, and your pet should be seen by a veterinarian immediately. Symptoms of Tracheal Collapse in Dogs A dog with a collapsing trachea experiences chronic, intermittent bouts of coughing that tend to get worse with exercise, heat/humidity, excitement, stress, eating, drinking, or when pressure is applied to the trachea. The sound of the cough can be quite distinctive and is often described as a goose honk. Dogs develop other clinical signs that vary with the severity of the collapsing trachea—in other words, how narrow (or even completely closed) the airway becomes. Additional symptoms can include: Retching Rapid or difficult breathing Exercise intolerance Blue-tinged gums Fainting If your dog has blue-tinged gums, trouble breathing, or has fainted, contact your veterinarian immediately.  Causes of Tracheal Collapse in Dogs No single, specific cause has been identified to explain all cases of tracheal collapse in dogs. A congenital (meaning present at birth) weakness of the cartilage within the trachea seems to play a big role, but environmental factors and concurrent diseases may bring out symptoms. Some of these risk factors include:  Overweight or obese dogs (fat pushes against the trachea) Airway irritants, such as air fresheners or smoke Recent anesthesia, such a dental where an endotracheal tube was placed in the throat Upper respiratory tract infection, such as kennel cough or a bacterial infection Heart enlargement, which can be seen in dogs with heart murmurs or congestive heart failure (the enlarged heart presses on the trachea) While tracheal collapse can occur in any breed or size of dog, small dog breeds are most at risk for developing a collapsing trachea, including: Yorkshire Terriers Pomeranians Chihuahuas Shih Tzu Toy Poodles Tracheal collapse is most frequently diagnosed in middle-aged or older dogs, but it can also be seen in younger dogs. How Veterinarians Diagnose Collapsing Trachea in Dogs Your veterinarian will start with a thorough history of any coughing or risk factors.  If you can capture a coughing episode on video at home, that’ll help your vet during the examination, although sometimes the vet can trigger the cough by gently pressing on the dog’s throat. A combination of breed, clinical signs, and physical examination may make your vet suspicious of collapsing trachea. If the classic “goose honking” cough is noted or suspected based on the pet parent’s description, your vet may perform a chest and neck x-ray to screen for evidence of collapsing trachea. However, the trachea collapse can wax and wane, so it isn’t always visible on regular x-rays. For a more advanced evaluation, your veterinarian may refer you to a specialist with fluoroscopy (a type of moving x-ray) or bronchoscopy (inserting a tube with a small video camera at the end into an anesthetized dog’s airways). A complete blood count, serum blood chemistry, and urinalysis will all likely be recommended for a baseline evaluation. Additionally, an echocardiogram (ultrasound of the heart) may be recommended to rule out any underlying heart disease. Treatment for a Collapsing Trachea in Dogs Treatment for collapsing trachea in dogs may be medical, surgical, or a combination of the two. A veterinarian can provide supplemental oxygen and other treatments to ease your dog’s breathing and diagnostic tests can be run to determine the cause of his symptoms. Medications Most dogs diagnosed with a collapsing trachea are treated with medications. Drug options may include: Cough suppressants (e.g., butorphanol or hydrocodone): Every time a dog coughs, his airways become more irritated and inflamed. Cough suppressants play a duel role by controlling an annoying symptom and helping reduce irritation that promotes more coughing. Anti-inflammatories (e.g., prednisone or fluticasone): Corticosteroids are often prescribed to reduce swelling and inflammation of the trachea. These medications can be given orally or by inhalation. Inhaled steroids have a lower incidence of side effects. Bronchodilators (e.g., theophylline, terbutaline, or albuterol): These medications can widen small airways within the lungs, which eases the pressure put on the trachea. Sedatives (e.g., butorphanol or acepromazine): When dogs become anxious or excited, their symptoms often get worse. Light sedation can help. Antibiotics: Dogs with tracheal collapse are at a higher-than-average risk for respiratory infections. Veterinarians will often prescribe a course of antibiotics when an infection is diagnosed or suspected. Medical management may be effective in up to 70% of dogs with tracheal collapse. But it’s important to remember medical management is typically needed for the life of the dog, even if surgery is performed.  Furthermore, a surprisingly high number of dogs with tracheal collapse also suffer from other conditions, such as: Obesity Heart disease Liver enlargement Dental problems An elongated soft palate Laryngeal paralysis All of these may make a dog’s symptoms worse and need to be adequately treated to maximize your pup’s quality of life. Surgery If medical management cannot adequately control a dog’s symptoms, you can consider surgical options. A veterinary surgeon may recommend placing rings on the outside of a dog’s trachea or a stent inside the trachea, both of which serve to prevent collapse. Which type of surgery is best depends on the specifics of your dog’s case. Both can be successful, although surgical complications are relatively common, so surgical correction of collapsing trachea is usually reserved for severe cases.  Unfortunately, there is no way to cure a dog’s collapsing trachea and, despite intervention, the tracheal cartilage can continue to deteriorate. Therefore, it’s important to continue with the treatments recommended by your veterinarian and to closely monitor your dog’s condition. If at any time you notice your dog’s cough or other symptoms getting worse, call your veterinarian for advice. Managing Tracheal Collapse in Dogs In addition to the above medications and surgical options, weight loss is a major component of management of tracheal collapse. In general, carrying extra weight may make it harder to breathe. But with tracheal collapse, the extra fat in the chest may physically push on the trachea, making the condition worse.  Airborne irritants also promote coughing in dogs with tracheal collapse. The dog’s home should be free of cigarette smoke and strong fragrances. Allergen and dust exposure should be reduced when possible.  Exercise has both benefits and potential risks for a dog with a collapsing trachea. It can help with weight management and keeping dogs calm, but it might make matters worse when it’s associated with rapid breathing, overexcitement, or exposure to irritants. Long, slow walks are usually best if your dog’s temperament and symptoms allow. And whenever you take your dog out, swap out a collar for a harness to avoid putting pressure on your dog’s trachea."}]