[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dry Mouth in Pets: What to Do About It", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-dry-mouth-pets.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-dry-mouth-pets.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Symptom", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/dry-mouth-pets-what-do-about-it"}, "datePublished": "May 18, 2017", "dateModified": "September 7, 2022", "description": "Dry mouth has numerous causes in dogs and cats. Here&#039;s what you can do to prevent the discomfort and complications that can be associated with dry mouth in pets.", "articleBody": "By Jennifer Coates, DVM Drool—it’s one of the less desirable aspects of pet ownership, right? But in reality, saliva plays a number of vital roles. It moisturizes food, making it easier to swallow, is essential to oral comfort, and helps prevent dental disease and infection within the mouth. That’s why dry mouth (xerostomia) in pets can be so devastating. Causes of Dry Mouth in Dogs and Cats Dry mouth has numerous causes in dogs and cats. Dehydration or a fever can result in dry mouth, but the sensation should resolve once the underlying problem is dealt with. People often complain about dry mouth when taking different types of medications, and sometimes owners will notice pets licking their lips or smacking their gums when they are on the same types of drugs. It’s probably safe to assume that animals experience dry mouth under these circumstances, too. Commonly used veterinary drugs that could be expected to lead to dry mouth in pets include antihistamines, decongestants, diuretics, sedatives, atropine, anesthetic agents, and many (many) more. If your dog or cat seems to be annoyed by a sensation of dry mouth after being given a pet medication, talk to your veterinarian about the possibility of decreasing the dosage or switching to a different drug. But several other causes of dry mouth in pets aren’t quite as straightforward to treat. Let’s take a look at these and what can be done to prevent the discomfort and complications that can be associated with dry mouth in pets: Radiation Treatment Radiation treatment for cancers of the head and neck that damages the salivary glands is a common cause of dry mouth in people. Since radiation treatment is being used more frequently in veterinary medicine, cases of dry mouth in pets could be expected to rise, too. Radiation-induced dry mouth may be permanent or temporary. Immune-Mediated Disorders Dry mouth can also be caused by the pet’s immune system attacking the salivary glands. In a condition that resembles Sjögren&#039;s syndrome in people, pets can develop both dry eye (keratoconjunctivitis sicca) and dry mouth due to an abnormal immune reaction directed against both tear and salivary glands. Medications that suppress the immune system (e.g., cyclosporine, prednisone, and prednisolone) can be used to improve a pet’s production of saliva in these cases. Dysautonomia Dysautonomia (also called Key-Gaskell syndrome) is caused by degeneration of nerves within a certain part of the nervous system. The cause has not yet been identified. Pets with dysautonomia can develop dry mouth as well as poor appetite, vomiting, pupils that don’t respond to light normally, elevation of the third eyelid, dehydration, constipation, difficulty eating and urinating, poor tear production, and a slow heart rate. Treating the symptoms of dysautonomia can make pets feel better for a period of time but most are eventually euthanized due to poor quality of life. Nerve Damage Dry mouth is also possible when the nerves that control the salivary glands are damaged. This may occur because of traumatic injury, surgery, a tumor that is growing in or around the nerves, infections (possibly in the middle ear), etc. Sometimes this type of dry mouth will develop in conjunction with neurogenic keratoconjunctivitis sicca (KCS or dry eye). While most cases of KCS occur because of an abnormal immune reaction, a minority develop because of nerve damage. The nerves that run to the tear glands and salivary glands are close to each other, so something that damages one can easily damage the other. Complications Associated with Dry Mouth in Pets Pets with moderate to severe dry mouth typically have some combination of the following symptoms: Saliva that is very thick and “ropy”Bad breathDry and possibly cracked tongue and oral mucous membranesInflamed and/or infected oral tissuesDifficulty chewing and swallowingSevere dental disease Managing Dry Mouth in Pets Whenever possible, the underlying cause of dry mouth should be diagnosed and treated so that saliva production can return to normal. If a primary problem cannot be identified or effectively treated, home management and therapies aimed at preventing and treating the complications associated with dry mouth can help keep pets comfortable. Options include: Routine use of mouthwashes designed for petsDrinking water additives to prevent infections and dental diseaseRegularly scheduled dental cleanings that may include tooth extractionsDaily tooth brushingPilocarpine to stimulate saliva production, particularly before mealsOffering foods with a high water contentYour veterinarian can help you come up with a management plan that is ideally suited for your pet’s specific situation."}]