[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Not Drinking Water?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/Dog-standing-by-water-bowl.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/Dog-standing-by-water-bowl.jpg"}, "author": {"@type": "Person", "name": "Jennifer Grota, DVM", "url": "https://www.petmd.com/author/dr-jennifer-grota"}, "keywords": "Dog, Drinking Less, Symptom Checker, Drinking Less", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/why-my-dog-not-drinking-water"}, "datePublished": "June 8, 2020", "dateModified": "September 12, 2023", "description": "Are you worried that your dog is not drinking enough water? Here’s a veterinarian’s explanation for why your dog may be avoiding the water dish.", "articleBody": "Water is essential to life. It has even been called the most important nutrient with regards to survival. It’s very important for your dog to drink enough water to stay hydrated and healthy. What if your dog is not drinking enough water? Here’s how to calculate how much water your dog needs along with some reasons why your dog may not be drinking the amount of water they should. How Much Water Should Dogs Drink Daily? There’s a simple way to calculate how much water your dog should drink each day if you know the weight of your dog: Divide your dog’s weight in pounds by 2.2 to determine their weight in kilograms. Then, multiply that number by 50 to determine approximately how many milliliters of water per day your dog should be drinking. dog’s weight in pounds/2.2 = dog’s weight in kilograms dog’s weight in kilograms x 50 = milliliters of water per day For example, a 40-pound dog should drink about 909 milliliters of water per day, which is equivalent to just under 4 cups. 40 pounds/2.2 = 18.1818182 kilograms 18.1818182 kilograms x 50 = 909.091 milliliters (about 4 cups of water) How Can You Tell if Your Dog Is Well-Hydrated? If your dog is well-hydrated, they should have: Nice and bright eyes Moist gums Sunken eyes and “sticky” gums may indicate dehydration. What Causes a Dog to Not Drink Enough Water? Most dogs drink plenty of water to meet their hydration needs. But what if your dog is not drinking water? Here are six possible reasons why your dog is not drinking enough water. Limited Access to Water All dogs should have fresh water available in a clean bowl 24/7. However, just having a bowl out for them may not be enough. You have to consider the quality of the water, the placement of the bowl, and the number of bowls available. If the water is dirty or contaminated with debris, your dog may refuse to drink it. Since some dogs may have preferences on how they like their water placed, you may need to offer water in different locations or elevations to see what they like. There may be times when a dog is denied access to water by another animal in the household. This is known as resource guarding. If you notice one of your other pets blocking your dog’s access to the water bowl, try placing additional bowls of water in various locations of your home. Also consider whether your dog may have had a frightening experience in the area where the water bowl is. Some dogs are more noise-sensitive than others, so having the water bowl in a noisy area like a laundry room or high-traffic hallway may discourage them from drinking as much water as they should. Change in Water Source Many dogs are sensitive to the taste of the water that they are commonly offered. For example, a dog that has always been offered tap water from a municipal water source may find drinking well water off-putting if the family moves to a new home in the country. Likewise, if your dog is accustomed to drinking distilled or bottled water and you switch to tap water, he may drink less than he should. In these situations, try to help your dog gradually adjust to the new water by mixing the two types and slowly phasing out the old water type until your dog accepts the new water. Type of Food The type of food your dog eats contributes to their hydration. Some types of foods contain less moisture, causing your dog to drink more water, while others contain more moisture, so your dog drinks less. If only dry kibble is fed, your dog will need to drink more water to meet their hydration needs. However, if your dog eats only wet or canned food, they will get a large amount of water from that food, so you may notice her drinking less water. If you are feeding a kibble-only diet, keep an eye on water bowl levels to make sure your dog is drinking enough water. Oral Disease There are also some medical conditions that affect your dog’s ability to drink water. Dogs with an infected or broken tooth and tumors in the mouth often find it painful to drink. Bad breath can be a sign that your pet is suffering from an oral issue. Similarly, a fracture or dislocation of a dog’s jaw or one affecting a dog’s jaw, may be physically preventing your dog from being able to drink. If you suspect any of these conditions, it is important to have your dog examined by a veterinarian to determine the best treatment. Nausea There are some diseases that can cause nausea in dogs, and nausea can cause a dog to drink less. Kidney disease often causes increased thirst in the early stages. However, as the disease progresses and kidney enzyme levels rise, dogs often become nauseous. This nausea may then result in decreased appetite, decreased thirst, and possibly even vomiting. Diseases that cause inflammation in the gastrointestinal tract, such as pancreatitis and gastroenteritis, may also cause nausea. If you notice changes in your dog’s thirst that are also accompanied by decreased appetite, vomiting, or diarrhea, have your dog examined by a veterinarian as soon as possible so the underlying cause can be determined and corrected. Neurologic Disease Although it’s rare, there are some neurologic diseases which may impact thirst. One that’s commonly known is rabies. There is a phase of rabies in which affected animals refuse to drink water. Thankfully, rabies is a preventable disease since safe and effective rabies vaccines are available through your veterinarian. While not terribly common, disorders of the part of the brain called the hypothalamus may cause dogs to not drink water. If your dog stops drinking water and also exhibits unusual behavior or changes in gait, seek veterinary help immediately. Water is a basic need for all living creatures. Clean and refill your dog’s water bowl daily to make sure your dog has fresh water available at all times. Seek the help of your veterinary medical team if you see unusual changes in thirst. Featured Image: iStock.com/AVAVA"}]