[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Gagging?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/small-dog-barking.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/small-dog-barking.jpg"}, "author": {"@type": "Person", "name": "Sandra C. Mitchell, DVM, DABVP", "url": "https://www.petmd.com/author/dr-sandra-c-mitchell"}, "keywords": "Dog, Gagging, Symptom Checker, Gagging", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/why-my-dog-gagging"}, "datePublished": "May 21, 2019", "dateModified": "September 12, 2023", "description": "Find out why your dog might be gagging and what you should do when you see a dog coughing and gagging.", "articleBody": "There it is again—that horrible sound coming from your dog at night that almost reminds you of a goose honking in their sleep, and it’s almost always followed by a harsh gagging sound. While dog gagging can be a benign behavior, there are things you need to know and be aware of so that you know when it is time to visit your veterinarian. The Difference Between Dog Gagging, Coughing and Vomiting, and Why It’s Important Dog gagging is sort of a nonscientific description of the noise an animal makes usually just before or after a cough. It sounds sort of like they are trying to vomit while also coughing. There is a difference between coughing, vomiting and dog gagging, and it is important to be able to distinguish between them. If you can take a video of the behavior, it will help your veterinarian to distinguish what is happening. Loosely speaking, however, when a dog coughs, this really doesn’t bring anything up, other than perhaps spraying some saliva or some mucus, which is usually quickly swallowed. When a dog vomits, it is usually pretty obvious because food or stomach contents wind up on the floor.  Dog gagging usually happens in conjunction with a cough. When a dog is gagging, they may widely open their mouth and make a retching sort of sound. But unlike with vomiting, nothing will come out of the dog’s mouth except just a small amount of mucus that may or may not be swallowed. With gagging, there will be no expulsion of stomach contents, like with vomiting. It is important to notice whether your dog COUGHS and then gags or GAGS and then coughs. Believe it or not, it does matter. For a veterinarian, the order in which these two actions happen can help them determine which types of diseases they need to be considering. What Causes Dog Gagging? Gagging is caused by inflammation in the area of the larynx. There are a number of things that can cause a dog to gag, and it will often require a veterinary exam to sort the problems out.  When a dog coughs first and then gags, we are commonly thinking about problems which cause bronchitis and lower respiratory disease. When a dog gags first and then coughs, we are considering things along the lines of dysfunction of the larynx. Two very common things that can cause gagging in dogs are infectious problems and laryngeal paralysis.   Kennel cough, which is a type of respiratory infection, is a common cause of dog gagging, which results in a harsh, goose-like cough, sometimes followed by a gag. There are other infectious diseases that can also cause gagging, and a more severe disease—pneumonia—can sometimes cause gagging in dogs, as well. Laryngeal paralysis can occur often in older Labrador Retrievers. In this condition, the larynx no longer closes properly, allowing some food and fluid to access the airway. Another feature of this condition is a very loud, harsh panting. Laryngeal paralysis often starts out subtly and worsens with time. When Should I Be Concerned About a Dog Gagging? Just like us, every dog sometimes swallows wrong and has a bout of dog coughing and gagging, so this isn’t a problem to immediately be concerned about. If your pet is bright, alert, breathing normally, eating and drinking as expected, and appears to be feeling fine, you should monitor the problem for 48-72 hours.  If the gagging lasts longer than this, it may well be something more significant than just some minor reaction from swallowing wrong. If any other symptoms are present—your dog appears worried or distressed, is having ANY trouble breathing, has an increase in noise during breathing, or is not feeling well in any fashion—I would recommend an exam sooner rather than later. Whenever the respiratory system is not quite right, we tend to take the condition seriously as veterinarians. So, if you sense something isn’t right, I would recommend taking steps to get it diagnosed. What Can a Veterinarian Do to Help Dog Gagging? What happens at the veterinary appointment will vary quite a lot depending on the specifics of what your dog is displaying. In all cases, a complete physical examination is indicated. Sometimes, the doctor may be able to make a tentative diagnosis based on this exam alone. Other times, some additional tests may be required. The most common initial tests include blood work (looking specifically for signs of infection) as well as radiographs of the neck and lungs. Particularly, if the veterinarian is concerned that laryngeal paralysis is a possibility—or if the dog may have swallowed some foreign material such as a ball that is lodged—sedation may also be required for a complete exam of the larynx. The good news is that most cases of dog gagging are relatively straightforward to treat. Even the causes that are more significant, such as from pneumonia or laryngeal paralysis, do have treatments available to either cure or significantly reduce the gagging and make your dog more comfortable. By: Dr. Sandra Mitchell Featured Image: iStock.com/Blaza1980"}]