[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Feed Dogs After They’ve Vomited", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/domestic-dog-and-a-bowl-with-dry-food-on-wooden-floor-background.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DUdB0qPh1upDadaSZXHT9TU--n4p-vJVX3iMBFtIXqs0%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/domestic-dog-and-a-bowl-with-dry-food-on-wooden-floor-background.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DUdB0qPh1upDadaSZXHT9TU--n4p-vJVX3iMBFtIXqs0%3D.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Adult, Puppy, Senior, Symptom, Vomiting, Digestive health, nma1", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/what-feed-dogs-after-theyve-vomited"}, "datePublished": "March 29, 2023", "dateModified": "April 19, 2023", "description": "Dr. Jennifer Coates explains whether you should feed or fast a dog that has been vomiting, and gives some options for food that’s gentle on their stomach.", "articleBody": "Dogs vomit for many reasons. Some are life-threatening, others are just a mild annoyance, and a whole bunch of causes fall somewhere in between. But once your dog is on the road to recovery, you’ll wonder what to feed them so they don’t start vomiting again. In this article, we’ll look at what and how to feed dogs at home after they’ve vomited—and even more importantly, when you should head to the veterinarian’s office instead. Should You Feed a Dog After They Vomit? The short answer is no, whether it’s an emergency situation or not. Emergency Cases of Vomiting in Dogs Your dog may need to be seen by a vet right away, and trying home treatments first or giving your dog some food could be dangerous. If any of the following apply to your dog, call your veterinarian or a veterinary emergency hospital immediately for advice: Your dog is very young or old, or has a health problem that could make them especially vulnerable to dehydration, inadequate nutrition, and other effects of vomiting Your dog has vomited at least three times within 24 hours Your dog is trying to vomit but nothing is coming up There is blood in your dog’s vomit Your dog seems weak, disoriented, or in pain Your dog has severe diarrhea or other worrisome symptoms in addition to vomiting Mild Cases of Vomiting in Dogs On the other hand, if your otherwise healthy adult dog has just vomited once or twice and seems to feel pretty good, it’s possible they just ate something unusual or have a mild case of gastroenteritis and will feel better soon. In this case, you don’t need to rush to the vet, but the first step in treating mild vomiting in a healthy adult dog is to stop feeding them. Putting food into an upset tummy is irritating and makes it more likely that vomiting will continue. Take your dog’s food away for 12–24 hours, and don’t give them any treats or table scraps. Leave water out for your dog to drink, but if they tend to “tank up,” keep the water level low to encourage them to drink small amounts frequently. However, there are some dogs that should never go without food. Young puppies can become hypoglycemic if they don’t eat frequently enough. Dogs that are on insulin for diabetes or have tumors in their pancreas (insulinomas) are also at high risk for hypoglycemia if they don’t eat regularly. Call your veterinarian for advice before withholding food for any dog that isn’t healthy and at least 1 year old. What to Feed Your Dog After Fasting After the fasting period (if appropriate), you can use food as treatment if your dog’s vomiting is acute and mild. Acute vomiting starts suddenly and doesn’t last for more than a few days—food poisoning or stomach bugs like norovirus are common examples of acute vomiting in people. Mild vomiting doesn’t significantly affect a dog’s overall well-being or occur more than two or three times in 24 hours. If you didn’t know your dog vomited, you might not think anything was wrong. So your dog has acute and mild vomiting, and you’ve withheld food for 12 to 24 hours. Now what? Start reintroducing food gradually. Think of how you might start eating after you’ve been vomiting: You wouldn’t immediately order yourself a pizza; you’d probably start with toast or a few crackers and see how it goes. You want to do something similar for your dog. Start by offering your dog a small amount of bland food that’s easy to digest. Your options are: Homemade Food Mix the following: Boiled, white-meat chicken (no skin or bones) or lean hamburger meat Cooked white rice or boiled and mashed potatoes While these recipes are not nutritionally complete and balanced for long-term feeding, they are safe for dogs to eat for a few days. Over-the-Counter Food These highly digestible diets, easy on a dog’s stomach, are offered by reputable pet food manufacturers: Blue Buffalo True Solutions Blissful Belly Evanger&#039;s Classic Recipes Chicken &amp; Rice Canned Dog Food Royal Canin Canine Care Nutrition Digestive Care Prescription Diets Most veterinarians will have at least a few cans of prescription, highly digestible dog food in stock. These are two good options: Hill&#039;s Prescription Diet i/d Digestive Care Purina Pro Plan Veterinary Diets EN Gastroenteric Your Dog’s Regular Food If your dog is on a special diet or you simply can’t get your hands on a highly digestible dog food, slowly start your dog back on their regular diet. Wet foods are generally a better option than kibble, at least in the short term. Wet foods tend to be more digestible than dry, and the extra water will help keep your dog hydrated. How Much to Feed Your Dog Each Day After Vomiting How you start feeding your dog again is just as important as what you feed them. This feeding guide will help you gradually transition back to a normal diet for a dog that has been vomiting. Day 1 Fast your dog (only healthy adults) for 12–24 hours. If there is no vomiting in that time, you can move on to Day 2. Day 2 Offer your dog 10% of their normal meal size. Wait a few hours. If your dog has not vomited, offer them 25% of their normal meal size. Wait a few hours. If your dog has not vomited, offer them another 25% of their normal meal size. Wait a few hours. If your dog has not vomited, offer them 50% of their normal meal size. Day 3 Offer your dog 50% of their normal meal size. Wait a few hours. If your dog has not vomited, offer them another 50% of their normal meal size. Wait a few hours. If your dog has not vomited, offer them a normal meal size. Day 4 Feed your dog their normal amount of food divided into three evenly spaced meals over the day. Day 5 and on Follow this guide on how to switch your dog’s food to get them back to their regular diet, if necessary. Call your veterinarian if at any point during this process your dog starts vomiting again, won’t eat, or their symptoms are getting worse. Is There a Prescription Diet for Dogs With Chronic Vomiting? There are prescription diets for many conditions that cause chronic vomiting. Once a dog’s vomiting has continued for more than a couple of weeks, it is considered chronic rather than acute. Many health problems can cause chronic vomiting in dogs, including: Intestinal parasites Inflammatory bowel disease Partial gastrointestinal blockages Viral or bacterial infections Chronic or relapsing pancreatitis Organ dysfunction (kidney or liver disease, for example) Food allergies or intolerances Side effects of certain drugs Cancer Diet plays a part in managing many of these diseases. For example: Veterinarians often prescribe hypoallergenic diets like Hill&#039;s Prescription Diet z/d or Purina Pro Plan Veterinary Diets EL to help with inflammatory bowel disease and food allergies. Diets that are very low in fat, like Royal Canin Veterinary Diet Adult Gastrointestinal Low Fat Dry Dog Food, may be appropriate for dogs with chronic pancreatitis. Dog foods made with moderate amounts of high-quality protein are often recommended for dogs with chronic kidney disease. Good options include Hill&#039;s Prescription Diet k/d Kidney Care, Purina Pro Plan Veterinary Diets NF Kidney Function, and Royal Canin Veterinary Diet Adult Renal Support D Thin Slices in Gravy. Dogs with chronic vomiting often don’t have a great appetite. You may find it tempting to prepare your dog home-cooked meals, but this can be dangerous if it goes on too long. Most recipes for home-cooked diets are not nutritionally complete and balanced, even for healthy dogs. Add in a chronic illness, and preparing a healthy diet for long-term feeding becomes almost impossible without the input of a veterinary nutritionist. It’s vital for dogs that have been vomiting to get the right nutrition. Your veterinarian can help you pick the best food based on the specifics of your dog’s case. Featured image: iStock.com/Rawf8"}]