[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Pet Medications", "item": "https://www.petmd.com/pet-medication"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "How much ondansetron can a dog take?", "acceptedAnswer": {"@type": "Answer", "text": "With any medication, the safest way to know the proper dose for your dog is to ask your veterinarian. They will recommend the appropriate dose for your dog depending on their individual needs, other medications they may be on, and their age, weight, and breed."}}, {"@type": "Question", "name": "Does ondansetron treat other conditions besides vomiting in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "No, ondansetron is a medication that is specifically used to treat nausea and vomiting. No vet writer or qualified reviewer has received any compensation from the manufacturer of the medication as part of creating this article. All content contained in this article is sourced from public sources or the manufacturer. Featured Image: iStock.com/Antonio_Diaz"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ondansetron for Dogs and Cats", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1404747542.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-08/iStock-1404747542.jpg"}, "author": {"@type": "Person", "name": "Molly Price, DVM", "url": "https://www.petmd.com/author/dr-molly-price"}, "keywords": "Dog, Cat, Medication, Vomiting", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/pet-medication/ondansetron-dogs-and-cats"}, "datePublished": "July 31, 2023", "dateModified": "October 6, 2023", "description": "Ondansetron can be prescribed by veterinarians to treat nausea and vomiting in dogs and cats. Learn how ondansetron works, side effects, directions, and more.", "articleBody": "PetMD’s medications content was written and reviewed by veterinary professionals to answer your most common questions about how medications function, their side effects, and what species they are prescribed for. This content shouldn’t take the place of advice by your vet. What Is Ondansetron? Ondansetron is a prescription medication used to treat nausea and severe vomiting in dogs and cats. It is specifically used to relieve nausea and vomiting in dogs with parvovirus, in dogs undergoing chemotherapy, in dogs with vestibular disease (a syndrome of medical conditions causing loss of balance), and in cats with chronic kidney disease. Ondansetron may also be used to prevent nausea and vomiting as a premedication prior to anesthesia. Ondansetron can be used as a solo medication but is more often used in combination with other medications. Ondansetron is available as an oral tablet, oral disintegrating tablet, and oral solution. It is also available as an injection for certain medical conditions under direct veterinary supervision in a hospital setting. Your veterinarian will determine which combination is best for your pet, based on its circumstances and symptoms. Ondansetron is FDA-approved for human use under the brand names Zofran®, Zofran® ODT, and generic ondansetron. Ondansetron is currently not FDA-approved as a veterinary medication. However, it is readily utilized in the veterinary field, and veterinarians can legally prescribe certain human drugs in animals in certain circumstances. This practice is called extra-label or off-label use because this use isn’t described on the drug label. Your veterinarian will determine whether this medication is right for your pet. Ondansetron is also a prescription medication for humans, frequently with dosages and side effects different from those prescribed for your pet by a veterinarian. Due to possible side effects, pets should not be given any medicine prescribed for humans. In certain circumstances, your vet may recommend a compounded formulation of ondansetron. Compound medications are prescribed if there’s a specific reason your pet’s health can’t be managed by an FDA-approved drug, such as if your pet has trouble taking pills in capsule form, the dosage strength is not commercially available, or the pet is allergic to an ingredient in the FDA-approved medication. Compounded medications are not FDA-approved. They are created by a veterinarian or a licensed pharmacist on an individual basis to best suit a patient’s particular needs. You can learn more about compounded medications here. Ondansetron Considerations Ondansetron should be used with caution in dogs with the MDR1 gene mutation. Dogs with this gene mutation have a hard time breaking down certain medications such as ondansetron. Ondansetron should not be used in pets with a sensitivity or allergy to it, or in pets with certain medical conditions such as liver disease. Speak with your vet to ensure this medication is right for your pet. Giving ondansetron with certain medications can result in health risks to your pet, so it is important to discuss your pet’s medications and medical conditions with your veterinarian. How Ondansetron Works Serotonin is a naturally occurring neurotransmitter found in the gastrointestinal tract and brain. It communicates signals from the gastrointestinal tract to the vomiting center of the brain called the chemoreceptor trigger zone (CRTZ), which triggers nausea and vomiting. Ondansetron works by blocking the release of serotonin, thereby reducing nausea and vomiting. Ondansetron Directions Follow the directions on the drug label or per instructions  provided by your veterinarian. Ondansetron may be given with or without food. Missed a Dose? Speak with your veterinarian about what to do If you forget to give a dose of ondansetron. Generally, they may instruct you to give it when you remember, or, if it is almost time for your pet’s next dose, to skip the missed dose and resume your normal dosing schedule. Do not give extra or double doses. Ondansetron Possible Side Effects Ondansetron is typically well tolerated in most pets. Possible side effects include: Constipation Diarrhea Extrapyramidal clinical signs (head shaking) Arrhythmias Sedation Hypotension Human Side Effects While this is a human prescription medication, there are different dosages and side effects that can occur in humans. If you accidentally ingest this medication, call your physician or the national Poison Control Center hotline at 800-222-1222. Call Your Vet If: Severe side effects are seen (above) You see or suspect an overdose You pet’s condition worsens or does not improve with treatment You have additional questions or concerns about the use of ondansetron Ondansetron Overdose Information Signs of an overdose of ondansetron may include constipation, diarrhea, grogginess, and head shaking. Ondansetron overdose can also cause elevated liver levels, abnormal heart rhythm, and abnormally low blood pressure. If you suspect an overdose, immediately contact your veterinarian, seek emergency veterinary care, or call an animal poison control center. Consultation fees often apply. Pet Poison Helpline (855) 764-7661 ASPCA Animal Poison Control (888) 426-4435 Ondansetron Storage Ondansetron should be stored according to the manufacturer’s product instructions at controlled temperatures between 36-86 F. The injection version of ondansetron should be stored between 36-77 F. Keep the container tightly closed in order to protect from moisture and light. Compounded medications should be stored according to the compounding pharmacy’s label. Keep out of reach of children and pets."}]