[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "8 Surprising Causes of Dog Coughing", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/petmd-dog-coughing.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/petmd-dog-coughing.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Coughing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/8-surprising-causes-dog-coughing"}, "datePublished": "July 25, 2017", "dateModified": "September 7, 2022", "description": "Your dog&#039;s cough may be nothing more than a reaction to inhaling an environmental irritant, but there are other less common culprits. If your vet can’t find the root of your dog&#039;s coughing, here are eight surprising causes to consider.", "articleBody": "  By Paula Fitzsimmons   Your dog has started to make hacking, honking, and whooping sounds, and you’re naturally concerned. That cough may be nothing more than a reaction to inhaling an environmental irritant. “Coughing is an important body defense to keep the respiratory tract free of harmful substances, foreign materials and debris, and excessive secretions,” says Dr. Camille DeClementi, vice president of the ASPCA Animal Hospital in New York City. Similar to how we reflexively cough when inhaling dust, for example.   In other cases, it may signal a more serious underlying condition. Some of the most common causes of coughing in dogs are heart disease, chronic bronchitis, heartworm disease, and respiratory infections caused by bacteria, viruses, or fungi.   Beyond the usual suspects lurks other, less common culprits that may be behind your canine companion&#039;s hacking. If your vet can’t find the root of your dog&#039;s coughing, here are eight surprising causes to consider.    A class of rat poisons called anticoagulants work by preventing blood from clotting, which results in bleeding. Our dogs are not immune to the danger. “Ingesting anticoagulants can cause a dog to bleed into her chest cavity, which can lead to coughing,” DeClementi says. A dog who has ingested rat poison needs to be taken to an emergency clinic (pronto) to prevent life-threatening bleeding, she says.    Depending on the amount of blood lost, the patient may need a blood transfusion, says Dr. Susan Jeffrey, a veterinarian with Truesdell Animal Hospital in Madison, Wisconsin. And because anticoagulants block the synthesis of vitamin K (which is necessary for normal clotting), the dog will need vitamin K therapy until the effects of the anticoagulant wane.   Avoid putting your dog and yourself through this agony by focusing on prevention. “Don’t use these products where dogs can eat them,” DeClementi recommends. Better yet, invest in a humane method of rodent control, like a no-kill trap, and practice trap and release.    Any number of airborne irritants lurking in your home can cause your dog to cough, DeClementi says. Some of these include dust mites, fireplace ash, dandruff, litter tray dust, second-hand smoke, mold, aerosolized products like household sprays, air fresheners, and even deodorants.   You may not react to these irritants, but they can still be a problem for your companion. “Dogs have a much stronger sense of smell than we do, so what might not bother us, may bother dogs,” Jeffrey says.   Not every dog exposed to these irritants will cough, however. “It’s similar to people—not everyone who goes outside and breathes in the air is going to start coughing from pollen,” says Dr. Cathy Meeks, a veterinarian with BluePearl Veterinary Partners in Tampa, Florida. But a dog with an underlying respiratory condition like bronchitis or simply one who is more sensitive to a particular trigger may be more susceptible.   You probably know that a pudgy dog is at added risk of developing a number of health issues like arthritis, and congestive heart failure. Another good reason to put your best friend on a diet is that the extra weight is tied to coughing, Jeffrey says.   “Some dogs can be so obese that the fat puts pressure on the respiratory tract, and that can cause a cough.” The only solution for this, she says, is weight loss. Talk to your vet about putting your dog on a safe and sensible diet.   Even a pound of extra weight can be harmful to your faithful companion. (Take petMD&#039;s interactive online “Is My Pet Fat?” quiz to see how your dog fares.)   It’s hard to imagine a single blade of grass causing respiratory problems, but this is precisely what Meeks, who is board certified in veterinary internal medicine, encounters on occasion. When using an endoscope to check a dog’s airway expecting to see infection, she sometimes finds a blade of grass instead.    Specific types of grass (found mostly in the western part of the country) produce grass awns or foxtails with sharp “blades” that can penetrate a dog’s skin. The blade can poke its way through the dog’s skin and migrate into the lung. This can lead to coughing too, Meeks says.   Grass awns that migrate into the lungs or chest cavity can result in more than just bouts of coughing. “They can cause pneumonia, lung abscesses, pneumothorax, pyothorax, or a combination of these conditions,” adds Dr. Anusha Balakrishnan, a veterinarian at Cornell University Veterinary Specialists in Stamford, Connecticut.   Lungworms are parasites that cause infection in the pulmonary artery and right heart ventricle in dogs, Balakrishnan says. They then move out into the airways of a dog’s lungs. “Clinical signs may vary from coughing or exercise intolerance, to life-threatening pulmonary edema (excess fluid in the lungs).”   Lungworms are not nearly as common as heartworms, Meeks says, but they can indeed explain your dog’s cough. “Dogs can get infected by eating prey infected with the worm. They migrate out of the intestines into the bloodstream and into the lungs.&quot;   Dogs can also get infected by ingesting slugs and terrestrial snails that serve as hosts for the parasite, says Balakrishnan, who is board certified in emergency and critical care. Treatment typically requires prescribing de-worming medication such as fenbendazole, “with advanced respiratory support required for severely affected dogs.”   A dog’s lung can rotate and twist, a condition called lung lobe torsion. “The lung turns over on itself, blocking the airway,” Meeks explains. In addition to coughing, lung lobe torsion can result in symptoms like coughing up blood, pain, fever, and lethargy.   Vets often have trouble pinpointing precisely why this happens, but lung lobe torsion is more common in dogs with fluid in the chest, Meeks says, or “it can possibly occur as a result of heart disease or another condition.”   Some breeds tend to be more at risk. “Smaller dogs like Pugs, as well as large, deep-chested breed dogs may be predisposed,” says Dr. Zenithson Ng, a board-certified vet and clinical assistant professor at the University of Tennessee, College of Veterinary Medicine.   The Afghan Hound is 133 times more likely to develop lung lobe torsion than other breeds, according to a report by MediMedia Animal Health. Smaller breeds at higher risk (aside from Pugs) include Yorkshire Terriers, Beagles, and Miniature Poodles.   One of the most common and deadliest gases resulting from house fires is carbon monoxide, which binds to hemoglobin molecules (the stuff that makes blood turn red) and leads to a decrease in blood oxygen levels, Balakrishnan explains.   Another dangerous gas is hydrogen cyanide, formed by the burning of certain materials, including plastics, wool, and silk, she says.   “Other common clinical consequences that have been reported in patients with smoke inhalation injury include acute upper airway obstruction, bronchospasm, small airway occlusion, pulmonary infection, and respiratory failure.”   House fires also produce soot that she says can adhere to the lining of the respiratory tree and weaken respiratory trace defenses.   Coughing is a common symptom for all of these conditions associated with smoke inhalation.   Certain types of medicines vets prescribe to their canine patients are accompanied by the side effect of coughing. One commonly prescribed class of medications that can make dogs cough are angiotensin converting enzyme (ACE) inhibitors. ACE inhibitors typically cause coughing that is dry, hacking, and irritating, and usually occurs at night, he says.   It may be tempting to blame your dog’s cough on an ACE inhibitor, especially if the coughing started at the same time you began giving her the medication. But don’t make assumptions. “It can be confusing because ACE inhibitors are used to treat heart disease.” And coughing is also a symptom of heart disease.   Always run any persistent cough past your vet. “We give a complete physical exam, get complete history of when and how the cough developed, and use diagnostic tools like X-rays, blood tests, and ultrasound to help us get to the bottom of the causes of coughing,” says Rosenthal, who is board certified in internal medicine   Mostly likely, your vet will attribute your dog’s cough to one of the more common causes, like cardiac issues or a respiratory infection. But there may be times when one of these less likely culprits is to blame."}]