[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/d3e7h9090x", "@type": "VideoObject", "duration": "PT1M57S", "name": "5327088522001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/89546f24fd0ac1014276b7da42964c0068d4986e.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/d3e7h9090x", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/dce8b88e56848083e5a4c8b173f79706ba744adf.m3u8", "transcript": "While it may not be a pleasant topic to discuss diarrhea in dogs is a common problem and one that pet parents want to cure as quickly as possible. Although diarrhea is generally not a cause for major concern. Prolonged diarrhea or bloody diarrhea may signal a more severe medical problem and should be addressed by your veterinarian immediately while diarrhea may be a symptom of certain gastrointestinal diseases or infections more common causes include a change in diet or scavenging activities such as eating garbage or ingesting small objects. If your dog is not vomiting and is acting normally you can switch over to small portions of boiled chicken and plain white rice instead of feeding their normal food.\n\nIf your dog is vomiting you can remove food for about a 12 hour period and limit your dog to just quarter before introducing the chicken and rice combination. In either case make sure your dog drinks frequently to avoid dehydration feed small portions of the chicken and rice regularly until your dog's soul returns to normal. If the diarrhea does not resolve in 24 hours or you start seeing bloody or mucous coated stools you should call your veterinarian immediately and make an appointment for further evaluation. Your veterinarian may check for intestinal parasites food allergies bacterial infections tumors and metabolic issues.\n\nSometimes a diagnosis can be reached with a simple fecal examination while other times more invasive procedures like a colon Skippy or an ultrasound may be recommended to keep your dog diarrhea free. It's best to avoid sudden dietary changes and keep your table scraps away from your pup. Do not let your dog play with small objects that could result in intestinal blockage and ensure garbage and debris are always out of your dog's reach. If your dog's diarrhea is severe or reoccurring it's best to consult with your veterinarian regarding the best treatment options.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/symptoms/what-causes-dog-diarrhea?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Causes Dog Diarrhea and How to Treat It", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Common Emergencies", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/shutterstock_574666147.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/shutterstock_574666147.jpg"}, "author": {"@type": "Person", "name": "Laura Dayton, DVM", "url": "https://www.petmd.com/author/dr-laura-dayton"}, "keywords": "Dog, Diarrhea, Digestive health, Symptom Checker, Diarrhea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/what-causes-dog-diarrhea"}, "datePublished": "February 7, 2021", "dateModified": "September 12, 2023", "description": "Dr. Laura Dayton explains everything you need to know about dog diarrhea--from types and causes to treatments.", "articleBody": "  Click to jump to Dog Stool Infographic There are few things that will bring an animal into the vet quite as quickly as a bout of diarrhea. For most small animal veterinarians, it is something we see on a daily basis. Sometimes, dog diarrhea cases are easy with quick fixes. Unfortunately, this is not always the case. Chronic or extensive dog diarrhea cases can be frustrating for both the pet parent and the doctor because they are expensive and difficult to understand. This article will break down the causes, diagnostics, and treatments for dog diarrhea into simpler terms. Jump to a section here: What Causes Dog Diarrhea? What Kind of Human Foods Can Cause Diarrhea? Types of Dog Diarrhea Large-bowel diarrhea in dogs Small-bowel diarrhea in dogs Acute diarrhea in dogs Chronic diarrhea in dogs Diarrhea with vomiting What Does the Color of the Stools Mean? What to Give Dogs for Diarrhea at Home When Should You Call the Vet About Dog Diarrhea? Dog Diarrhea Testing and Treatment What Treatments Will the Vet Prescribe for Dog Diarrhea? What Causes Dog Diarrhea? In a very broad definition, diarrhea is caused by the malfunction of the gastrointestinal tract. The list of all the causes of diarrhea is extensive. Here are just a few examples: Vascular: Infarction (a clot blocking blood flow to a section of the intestine), shock such as from heatstroke, or an allergic reaction can cause lack of blood flow to the GI tractInfectious: Viral (Parvo, distemper, coronavirus (NOT COVID-19)), anthelmintic parasites (roundworm, hookworm, whipworm), protozoal parasites (giardia, coccidia), bacterial (clostridium, leptospirosis, salmonella, E.coli, small intestinal bacterial overgrowth (SIBO))Trauma: Torsion or twisting of the GI tract, a penetrating wound, being hit by a car, a foreign body, caustic toxin exposure (bleach, etc.), NSAID toxicity, and ulcerationAutoimmune: Inflammatory bowel disease (there are many more specific diagnoses under this broad category), lymphangiectasiaMetabolic: Renal (kidney) disease, hyperthyroidism, hypoadrenocorticism or Addison’s disease, hepatitis/hepatopathy, exocrine pancreatic insufficiency (EPI)Iatrogenic (doctor speak for you did it yourself): Dietary indiscretion, stress induced, chocolate toxicity, overfeeding—especially in puppiesInflammatory: Pancreatitis, hemorrhagic gastroenteritisNeoplasia: lymphosarcoma, focal neoplasia (primary vs. metastatic)What Kind of Human Foods Can Cause Diarrhea? We’ve all done it—fed our dogs a little bit off our plate or topped the bowl of kibble with a little something yummy. I know the temptation is real, and that sweet face asking for more is tempting, but just say no! Our pets’ digestive systems are very different from our own. In general, dogs and cats are not well equipped to digest large volumes of fat, or even any amounts that are in excess of whatever their normal is. Treats that are high in salt and sugar can lead to diarrhea by simple osmosis—pulling water into the gastrointestinal tract as it is digested. If you are going to feed your pet “human food,” stick with safe fruits and vegetables such as carrots, green beans, or apples (without seeds). Types of Dog Diarrhea When attempting to narrow down our list of causes, we break dog diarrhea down into two major categories: large-bowel and small-bowel diarrhea. Large-Bowel Diarrhea Large-bowel diarrhea, or diarrhea arising from the large intestine or colon, is characterized by: Increased frequency Small volumes of stool Straining to defecate Red blood in the stool as well as mucous Pet parents are often very concerned when they see blood in their dog’s stool. While this is certainly a sign of inflammation and a good time to come to the vet, a small amount of blood is often par for the course when dealing with a large-bowel diarrhea. Here’s why. The job of the colon is two-fold: Storage of stool until it’s ready to exit Resorption of water to prevent dehydration Since the colon needs to pull water out of the poop, blood vessels are very close to the surface and easily break with straining and inflammation. Likewise, there are mucous glands in the colon to help lubricate stools for easy passage. When there is inflammation, they will overproduce their mucous coating. When the colon isn’t working right, stools can also be very watery. If there is a large volume of blood noted in the stools (the stool is all blood or looks like raspberry jam), this is more concerning and should be addressed with more urgency. Small-Bowel Diarrhea Small-bowel diarrhea or diarrhea arising from the small intestine is characterized by: Large, goopy poops produced at normal frequency Stool is often fatty and frothy Stool rarely has red blood or mucous There is typically no straining involved The job of the small intestine is absorption of nutrients. When there is inflammation or dysfunction, there can be a lack of absorption, resulting in fatty stools. We can also see signs of malnutrition in dogs with small-bowel diarrhea: Weight loss Poor hair coat Ravenous appetite Acute Diarrhea in Dogs Some episodes of dog diarrhea can be easily cleared up. An acute onset of diarrhea can often resolve on its own with minimal intervention from you. When your dog’s diarrhea has lasted for 48 hours or more, or you see blood in the stool, or your pet has additional symptoms (vomiting or inappetence), it is time to visit the vet. Chronic Diarrhea in Dogs Chronic diarrhea is persistent despite initial treatment or is recurrent in nature. Causes include (but are not limited to): Parasites such as whipworms Inflammatory bowel disease Exocrine pancreatic insufficiency Hyperthyroidism or other metabolic condition Cancer Dysbiosis Chronic diarrhea in dogs can sometimes lead to weight loss, a dry and unthrifty hair coat, and lethargy. If your pet is continuously exposed to a diet that they are sensitive to, this can also cause chronic intermittent diarrhea. Some dog and cat foods that are marketed as healthier for your pet can also be high in fat and protein. Grain-free diets remove healthy fiber content from the dog food, which can be very rough on a sensitive system. It is important to look for balance in a diet and that it comes from a reputable company that is doing their homework when it comes to their formulations. Diarrhea With Vomiting in Dogs When dog diarrhea occurs with vomiting, a new section of the gastrointestinal tract has entered the picture. Gastroenteritis is the group term for inflammation of both the stomach and the upper GI tract. Sometimes a high-fat treat, even a small one, can trigger pancreatitis—a condition wherein the pancreas, which produces digestive enzymes, among other things, becomes inflamed. This condition can cause acute vomiting and diarrhea as well as abdominal pain. In very severe cases, pancreatitis can even be fatal. Vomit that contains blood can look red, brown, or black. Unlike a small amount of blood in the stool, any amount of blood in vomit is concerning and should result in a trip to the vet right away. What Does the Color of Your Dog’s Diarrhea Mean? The color of your pet’s bowel movement is most often impacted by what they are eating. Simply put, lighter colored foods will result in a lighter colored poop. There are a few color indicators that are important to note when talking to your vet. Yellow Diarrhea Yellow diarrhea is most typically caused when a pet parent has started feeding a bland diet, such as chicken and rice. The chicken and rice are white, and when they mix with yellow bile in the gastrointestinal tract, it comes out as yellow stools. Bloody Diarrhea Bloody diarrhea or hematochezia is caused when there is large bowel diarrhea or colitis. This occurs when small blood vessels in the lower part of the GI tract break open and bleed a bit into the stool. A small amount of blood is not overly concerning, but if the stool is primarily blood, your pet should be taken to the vet right away. Black Diarrhea Black diarrhea or melena is caused when blood is being digested before it is passed. This stool looks like newborn baby poop and can have a black or greenish color. Melena can be seen with conditions such as bleeding ulcers or foreign bodies. What to Give Dogs for Diarrhea at Home  You should never use your own human medications on your pets. Only administer medications as prescribed by your veterinarian. Antibiotics can make diarrhea worse In my experience, Pepto Bismol just results in pink vomit Imodium works by paralyzing the gastrointestinal tract. This can be a problem for pets that eat things they aren’t supposed to (such as toxins or foreign objects) or have parasites that need to be moved through. The best thing you can do for your dog at home when diarrhea hits is to feed them a bland diet. Think simple protein (lean chicken, beef, ground chuck, white fish, or cooked eggs) and simple carbohydrates (white or brown rice, white or sweet potatoes) combined. Feed small, frequent meals that help heal the GI tract but do not overwhelm it. In the case of stress-induced diarrhea, starting a fiber supplement a few days prior to the stressful event can help prevent the diarrhea from starting. Psyllium fiber can be purchased over the counter in products like Metamucil. You can also opt for canned pumpkin as a source of fiber that you can add to your dog’s food. When Should You Call the Vet About Dog Diarrhea? If you have tried giving a bland diet for 48 hours and the diarrhea is persistent, it’s time to go to the vet. Other signs that would warrant a prompt appointment would be: Vomiting (especially if there is blood present) Weight loss Severe diarrhea with large amounts of blood Diarrhea after administering vaccines or medication If you are ever unsure, it is best to err on the side of caution and call your vet&#039;s office.  Dog Diarrhea Testing and Treatment When you go to the vet, they may recommend one or a few tests to help them weed through the extensive list of possible diagnoses: Fecal flotation looks for the presence of intestinal parasites. Giardia tests look for the presence of the Giardia parasite. Gram stains look for certain types of bacteria and/or an overgrowth of bacteria. Parvo testing screens for parvovirus. Chemistry and CBC bloodwork look for signs of protein loss, metabolic disease, inflammation, anemia, and much more. CPL tests look for the presence of pancreatic lipase, which can be elevated in pets with pancreatitis. Imaging (radiographs or ultrasound) looks for evidence of obstruction, cancer, gall bladder disease, inflammatory bowel disease, and much more. It is important to bring the following information with you to your veterinary appointment: Thorough history of the illness, including when it started Symptoms you have noticed Colors of stools Whether or not there is anything you can think of out of the ordinary that may have brought the diarrhea on When an owner can provide a thorough history, it sometimes means a doctor can narrow down the list of tests they want to run—which can help save time and money when coming to a diagnosis. What Treatments Will the Vet Prescribe for Dog Diarrhea? The treatment that your vet prescribes will depend on their diagnosis or suspected diagnosis. Medications Used for Dog Diarrhea Metronidazole and Tylosin are two antibiotics that have known anti-inflammatory properties in the gastrointestinal tract. When a bacterial overgrowth is suspected, additional antibiotics may be added, such as amoxicillin. Probiotics and fiber can be an important part of resolving diarrhea. The good bacteria in the GI consume fiber and produce short-chain fatty acids that help heal the intestine. In the case of diarrhea caused by cancer, a chemotherapeutic drug may be prescribed. Antacids and stomach protectants can help to resolve stomach and upper GI irritation, and anti-nausea drugs are often added when vomiting or inappetence is an issue. Other options include deworming and/or anti-inflammatories such as prednisone. Change of Diet for Diarrhea in Dogs Other components of treatment may include a bland prescription diet, a high-calorie diet, or a hypoallergenic diet. When dealing with diarrhea, the answers can be easy all the way up until they aren&#039;t! Ultimately, it’s important to always loop in your veterinarian when you are concerned about your pet&#039;s illness. Remember that our pets can&#039;t talk to us to tell us how bad they feel. When in doubt, always consult your veterinarian. References: Jan S. Suchodolski, 1 , * Melissa E. Markel, 1 Jose F. Garcia-Mazcorro, 2 Stefan Unterer, 3 Romy M. Heilmann, 1 Scot E. Dowd, 4 Priyanka Kachroo, 5 Ivan Ivanov, 5 Yasushi Minamoto, 1 Enricka M. Dillman, 5 Jörg M. Steiner, 1 Audrey K. Cook, 5 and Linda Toresson 6, &quot;The Fecal Biome in dogs with acute diarrhea and idiopathic inflammatory bowel disease&quot;, PLoS 2012; 7(12): e51907.doi10.1371/journal.pone.0051907, Accessed 22 October 2020 M.Volkmann, J.M. Steiner, G.T. Fosgate, J.Zentteak, S. Hartmann, B. Kohn, &quot;Chronic Diarrhea in Dogs- Retrospective Study in 136 cases, J Vet Internal Med 2017; 31: 1043-1055 Ives, Gemma. &quot;Acute Diarrhea in dogs and cats: considering the use of antibiotics&quot;, Veterinary Practice, 04 July 2020, veterinary-practice.com, Accessed 22 October 2020 Groves, Ellie. &quot;Dietary Management of Chronic diarrhea in dogs&quot; Veterinary Practice, 19 July 2019, veterinary-practice.com, Accessed 22 October 2020 Dog Stool Infographic  Featured Image: iStock.com/jonathandowney"}]