[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Coughing?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/dog-coughing.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/dog-coughing.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Symptom, Coughing, Respiratory health, Symptom Checker, Coughing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/why-is-my-dog-coughing"}, "datePublished": "November 17, 2022", "dateModified": "September 12, 2023", "description": "Is coughing in dogs no big deal, or something you should worry about? Find out what could cause your dog to cough and when you need to see the vet.", "articleBody": "The occasional cough in an otherwise healthy dog is usually nothing to worry about. But just like us, when a dog’s coughing becomes a constant or recurrent problem, it can be a sign of serious illness. Knowing some of the most common causes of coughing in dogs can help you determine when you need to worry. Causes of Dog Coughing Coughing in dogs has many possible causes. Here are some of the many causes and available forms of treatment. Infections Viruses, bacteria, fungi, and parasites are all types of infections that can cause dogs to cough. They can infect a dog’s upper respiratory tract, lung tissue (pneumonia), airways (bronchitis), or a combination (bronchopneumonia). Kennel cough is the most common infectious cause of coughing. It can be caused by several types of viruses and bacteria working alone or in combination. Canine influenza virus is becoming increasingly prevalent in the United States and leads to symptoms like coughing, fever, and nasal discharge. Lungworms are parasites that cause infection in the pulmonary artery and right heart ventricle in dogs. They are not nearly as common as heartworms, but they can explain your dog’s cough. Dogs can get infected by eating prey infected with the worm. They migrate out of the intestines, into the bloodstream, and into the lungs. This can cause coughing and other signs. Dogs can also get infected by ingesting slugs and terrestrial snails that serve as hosts for the parasite. Supportive care is an important part of treating coughs caused by infections. Dogs should be encouraged to rest, drink, and eat. Cough suppressants can help with especially severe symptoms. Humidifiers or nebulizers can help as well. You can also make environmental changes around the home such as not smoking, not using aerosol cleaners or sprays, not burning incense, and using an air purifier. Antibiotics are effective only against bacteria. Viral infections generally have to run their course. Other medications are available that work against some types of fungi and parasites. Treatment typically requires deworming medication such as fenbendazole, and advanced respiratory support for severely affected dogs. Chronic Bronchitis When a dog is coughing due to chronic inflammation of the airways and no other cause can be identified, chronic bronchitis is the most likely diagnosis. Dogs with chronic bronchitis tend to have a dry, hacking cough that worsens with exercise or excitement and over time. Treatment includes medications that decrease inflammation (such as fluticasone or prednisolone) and dilate airways (albuterol or terbutaline). Ideally, these medications are given by inhalation, with inhalers specially made for dogs, to reduce potential side effects. They can also be given with an oral medication if necessary. Allergies Allergies are immune system hypersensitivities to substances in the environment called allergens. These can include dusts, pollens, certain plants, smoke, other animal dander, food, insects, and even human dander. When exposed to these substances for many months or years, the immune system becomes sensitive and can overreact to future interaction with them. Allergies can cause itching, sneezing, wheezing, runny nose/eyes, vomiting, diarrhea, and coughing. Coughing due to allergies is secondary to inflammation in the airways and lungs. Treatment is based on the underlying cause of the allergies. It can include environmental changes such as using air purifiers and humidifiers and eliminating certain allergens from the diet or household. Treatment may also include using bronchodilators to open the airways, anti-inflammatory medications such as steroids, antibiotics, and in severe cases, other stronger immunomodulatory medications such as cyclosporine.  Reverse Sneezing While technically a “reverse sneeze” is not a cough, many dog parents mistake the sound with coughing. Reverse sneezes tend to happen in clusters when something like postnasal drainage, foreign material, inflammation, or parasites irritates the back of a dog’s nasal passages. Just like normal sneezes, reverse sneezes every so often are nothing to worry about. If they become severe or frequent, or you see nasal discharge or a change in the symmetry of your dog’s face (bulging eyes or sinuses), they should be seen by a veterinarian for diagnosis and appropriate treatment. Heart Disease Many types of heart disease can make dogs cough, including mitral valve endocardiosis (degeneration), dilated cardiomyopathy, and congestive heart failure. Depending on the type of heart disease your dog has, your veterinarian may prescribe some combination of medications that make the heart pump more efficiently, normalize blood pressure, and reduce the abnormal buildup of fluid. These medications include pimobendan, ACE inhibitors, or diuretics. Other interventions like surgery or the placement of a pacemaker may be appropriate in some cases. Collapsing Trachea Small dogs are more at risk for a weakening of the cartilage rings that partially encircle the trachea. This causes the trachea to collapse on itself when the dog breathes in. This leads to tracheal irritation and a chronic cough that is often described as sounding like a goose honk.  Medications that dilate airways, decrease inflammation, suppress coughing, and treat secondary infections can help. Humidifiers or nebulizers can help too, as well as environmental changes such as not smoking, not using aerosol cleaners or sprays, not burning incense, and adding an air purifier to the home. In severe cases, surgery may be necessary to provide these dogs with an acceptable quality of life. Pulmonary Hypertension Pulmonary hypertension refers to high blood pressure in the lungs that reduces blood flow and oxygen delivery to the lungs. Pulmonary hypertension or high blood pressure within the pulmonary arteries makes it harder for your dog to get enough oxygen.  This causes coughing, fainting/collapse (called syncope), shortness of breath, right-sided congestive heart failure, and increased fluid buildup within the abdomen (ascites).   Pulmonary hypertension can be caused by chronic lung disease, heartworm disease, or conditions that cause the body to create blood clots within the pulmonary arteries (pulmonary thromboembolisms). This condition is diagnosed via echocardiogram, an ultrasound of the heart, by measuring the pulmonary artery pressure. Therapy is typically palliative rather than curative. Medications for pulmonary hypertension are life-long in most cases. This is usually treated with sildenafil (Viagra), and sometimes, other cardiac medications are recommended. Heartworm Disease Heartworms can also cause dogs to cough. Heartworms are transmitted when a mosquito bites an infected dog, picks up the larval form of the parasite, and then bites another dog and passes the larvae to them. The larvae migrate to the heart and lungs of the newly infected dog, where they mature into spaghetti-like adults. Their presence causes inflammation that can lead to coughing and potentially fatal heart and lung damage. Medications that prevent heartworm disease are extremely safe and effective. If a dog was not on heartworm medication and becomes infected, the treatment is costly, lasts 6-9 months or longer, and requires intensive, often painful injections. Treatment for heartworm disease can itself be fatal, but it is necessary if a pet tests positive. That’s because the disease is also terminal if left untreated. Foreign Objects Stuck in the Throat/Airways Dogs will sometimes inhale foreign material or objects that then get stuck in their airways. The body’s natural response is to try to cough it out. If this doesn’t work, the material must be removed by a veterinarian using an endoscope or through surgery. It’s hard to imagine a single blade of grass causing respiratory problems, but this can happen. There have been cases where vets have used an endoscope to check a dog’s airway, expecting to see infection, and they found a blade of grass instead.  Some types of grass found mostly in the western US states produce bristles or clusters with sharp “blades” that can penetrate a dog’s skin. These are commonly called grass awns or foxtails. The blade can then migrate into the lungs or chest cavity and lead to coughing. In more serious cases, this can develop into pneumonia, lung abscesses, pneumothorax, pyothorax, or a combination of these conditions. Laryngeal Paralysis Dogs with laryngeal paralysis cannot fully open the passageway into their windpipe (larynx) due to weakness of the nerves that control the surrounding muscles. This leads to coughing as well as noisy breathing and shortness of breath. Surgery to permanently hold one side of the larynx open can help ease the breathing of dogs with laryngeal paralysis, but it also puts them at higher risk for developing aspiration pneumonia, which is another cause of coughing in dogs. Cancer Coughing can be one of the first symptoms that owners notice when a dog has cancer of the lungs, other parts of the respiratory tract, heart, or surrounding tissues. Treatment may include surgery, chemotherapy, radiation, or palliative care. Rat Poison A class of rat poisons called anticoagulants works by preventing blood from clotting, which results in bleeding. Ingesting this type of rat poison can cause a dog to bleed into their chest cavity, which can lead to coughing. A dog that has ingested rat poison needs to be taken to an emergency clinic immediately to prevent life-threatening bleeding.  Depending on the amount of blood lost, the dog may need a blood transfusion. And because anticoagulants block the synthesis of vitamin K, which is necessary for normal clotting, the dog will need vitamin K therapy until the effects of the anticoagulant lessen. Don’t use rat poison around dogs. Invest in a humane method of rodent control, like a no-kill trap, and practice trap and release.  Esophagitis Esophagitis is a condition where the esophagus becomes inflamed. It is similar to gastro-esophageal-reflux disorder (or GERD) in humans. Acidic stomach fluid moves from the stomach and up the esophagus, irritating the lining. This can be caused by gastrointestinal upset, certain foods, prolonged anesthesia, and some medications, particularly doxycycline. Symptoms include drooling, decreased appetite, lip smacking, regurgitation, and coughing due to pain/inflammation.  Treatment usually includes antiacids to decrease stomach acid such as omeprazole or famotidine, mucosal protectants such as sucralfate, or promotility agents such as metoclopramide or cisapride.  Severe cases of esophagitis require hospitalization, pain medication, intravenous fluid therapy, and sometimes feeding tubes to allow the inflammation to heal.  Tumors in the Larynx and Trachea The larynx is a flexible tube-like structure located at the top of the trachea (airway tube). It is made of semi-flexible cartilage and helps produce sound/vocalization as air passes through it.  The trachea is composed of cartilage rings and allows oxygen to enter the lungs and carbon dioxide to exit the mouth. Tumors or masses that growth in the larynx or trachea are rare, but they can impede the ability to breath, swallow, eat, and drink. The most common types of tumors in these regions are chondromas, chondrosarcomas, osteochondromas, and squamous cell carcinomas. These tumor types are usually locally aggressive and they can sometimes spread to other areas of the body.  Treatment includes surgery to remove the tumor, often followed by radiation therapy and/or chemotherapy.  Aspiration Pneumonia Aspiration pneumonia is inflammation or infection in the lungs that’s usually caused by inhaling food, water, regurgitated matter, or vomit. This leads to bacterial growth in the lungs, which causes inflammation, trouble breathing, coughing, and sometimes decreased oxygen levels. Treatment includes medications that treat bacterial infection, such as antibiotics; treatment of the underlying cause of the aspiration pneumonia; and sometimes hospitalization with oxygen therapy, intravenous fluids, and other systemic medications. Inhaling Indoor Irritants Household sprays and airborne irritants can cause your dog to cough. Some of these include dust mites, fireplace ash, dandruff, litter box dust, secondhand smoke, mold, household sprays, air fresheners, and even deodorants. You may not react to these irritants, but they can still be a problem for your dog because of their stronger sense of smell. Not every dog exposed to these irritants will cough, but a dog with an underlying respiratory condition like bronchitis or one that’s more sensitive to a particular trigger may be more susceptible. Obesity Extra weight can also lead to coughing because extra fat can put pressure on the respiratory tract. This is called Pickwickian syndrome or obesity hypoventilation syndrome. The only solution for this is weight loss. Talk to your vet about putting your dog on a safe and sensible diet. Lung Lobe Torsion A dog’s lung can rotate and twist, a condition called lung lobe torsion. The lung turns over on itself, blocking the airway. In addition to coughing, lung lobe torsion can result in symptoms like pain, fever, lethargy, and coughing up blood. Vets often have trouble pinpointing precisely why this happens, but lung lobe torsion is more common in dogs with fluid in the chest, heart disease, or another condition. Some breeds tend to be more at risk. Smaller dogs like Pugs, Yorkshire Terriers, Beagles, and Miniature Poodles, as well as large, deep-chested breeds may also be predisposed. The Afghan Hound is 133 times more likely to develop lung lobe torsion than other breeds, according to a report by MediMedia Animal Health. Diagnosing the Cause of a Dog’s Cough The first step in treating a dog’s cough is figuring out the underlying cause. Your veterinarian will first ask questions about your dog’s health history, travel, and preventive care, as well as when the symptoms started and how they progressed. They will then perform a complete physical exam. Sometimes a tentative diagnosis can be reached at this point, but reaching a definitive diagnosis often requires testing. Depending on your dog’s unique situation, some combination of the following tests may be necessary: Blood chemistry panel Complete blood cell count Serology to rule in or out various infectious diseases B-type natriuretic peptide (BNP) blood test for heart disease Urinalysis Fecal examination Chest x-rays Echocardiography (ultrasound of the heart) Measurement of blood pressure Electrocardiogram (ECG) Examination of fluid samples taken from the airways Upper gastrointestinal endoscopy to assess the esophagus and stomach lining Bronchoscopy to assess the trachea and major airways (bronchi) that go to the lungs What To Do if Your Dog Is Coughing Never give your dog over-the-counter cough syrups meant for humans. If your pet is coughing a lot and/or has any of the following signs, seek immediate veterinary care: Lethargy Difficulty breathing Not interested in food Persistent vomiting Diarrhea Weight loss Coughing up blood Nasal discharge, especially if it’s green or yellow Eye discharge, especially if it’s green or yellow Heavy or rapid breathing Protrusion of one or both eyes Change in facial symmetry (face looks strange or off) A whistling sound when breathing Change in bark noise Exercise intolerance (getting winded/tired more easily) Dogs With Mild Coughs If your dog has just recently developed a mild cough and is acting normal otherwise, waiting two days to see whether the condition will clear on its own is reasonable. However, minor coughs should not last longer than that. If your dog isn’t better on the third day or has any of the above signs, take them to the vet right away. Placing your dog on the floor of a steam-filled bathroom with a hot shower running can help alleviate the cough. Sit with your dog in the bathroom for up to 15 minutes. Follow this treatment with coupage, which is the gentle stroking of both sides of the chest with cupped hands, for 2-3 minutes. Ask a vet how to properly perform coupage to avoid harming your pet.  How Vets Treat Coughing in Dogs The first major goal of treatment for a dog’s cough is to diagnose and treat the underlying cause. Diagnosing the underlying disease may require an extensive diagnostic workup. In cases of severe disease, your dog may need to be hospitalized for intensive care and treatment. Oxygen can be given to dogs that are having difficulty breathing, and broad-spectrum antibiotics will be used to curtail the most common types of infections that cause coughing. If your dog is prescribed antibiotics, follow the entire course of the medicine. Many people will forget to keep giving the antibiotic once their dog’s symptoms have improved. In these cases, the infection returns, sometimes worse than before. The vet may then treat the cough itself. In most cases, the cough is not the issue; it is the underlying disease that needs to be treated. Cough suppressants made for dogs are not always medically helpful, especially for certain diseases like respiratory infections. Suppressing cough will not resolve the problem, and in fact, it may only hide the condition and allow it to worsen. Your vet will decide whether to give them after confirming a diagnosis. Follow-Up Treatment and Recovery Carefully measure and double-check the dosage for all medications you give to your dog, as any drug can be dangerous in the wrong amounts. One of the leading causes of death in household pets is overdoses of medication. Stay in communication with your veterinarian throughout the treatment period, relaying information about your dog&#039;s response to the treatment and whether they are improving or worsening. You may also need to take your dog back to the clinic for follow-up examinations so your veterinarian can evaluate your dog&#039;s disease status and treatment progress. The treatment will be adjusted accordingly. In some dogs, long-term therapy is required for a complete recovery. Featured Image: iStock/miodrag ignjatovic"}]