[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Heavy Breathing in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/dog-breathing-heavy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/dog-breathing-heavy.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Symptom, Symptom Checker, Trouble Breathing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/heavy-breathing-dogs"}, "datePublished": "December 15, 2022", "dateModified": "September 12, 2023", "description": "Should you be worried if your dog is having trouble breathing? Here are the signs to look for and what to do if your dog is breathing heavily.", "articleBody": "Heavy breathing in dogs is often a medical emergency. If your dog is breathing heavily for no apparent reason—they haven’t been exercising or experienced stress or excitement—consult a vet immediately. This is especially true if the heavy breathing is accompanied by lethargy, coughing, eye or nose discharge, a change in the color of the gums, collapsing, weakness, an elevated sleeping respiratory rate, bleeding, bruising, or a known trauma. Panting can be normal for dogs, especially after being active, in warm weather, under stress, or excited. However, if this panting becomes persistent or turns into heavy breathing, it may be an underlying sign of illness or injury. Some conditions related to abnormally heavy breathing can be life-threatening if not appropriately diagnosed and treated. 10 Types of Heavy Breathing in Dogs Heavy breathing is a general term that can include many types of abnormal breathing in dogs, such as: Labored Breathing—Labored breathing is a medical emergency. Dogs that are having trouble breathing often stand with their front legs wider apart to allow their chest to fully expand. They may also stretch their necks. Labored breathing can be accompanied by coughing; pale, gray, or blue/purple gums; or fluid from the mouth or nose. If you see these signs, take your dog to an emergency veterinarian as soon as possible. There can be many causes for labored breathing, including congestive heart failure, pulmonary hypertension, pneumonia, pulmonary contusions, pneumothorax (air around the lungs limiting their ability to expand), fluid around the lungs (blood or infection), cancers, or bronchitis.Rapid Breathing—Rapid breathing is normal if your dog is exercising, excited, or stressed, but it should not continue when they are resting or sleeping. If your dog has an increased respiratory rate (usually greater than 30 breaths per 60 seconds) when sleeping or resting, this is a medical emergency; there may be an underlying issue with your dog’s lungs, heart, or airways.  Breathing Heavily Through the Nose—Flaring of the nostrils can be connected to heavy play or exercise, stress, aggression, or excitement. However, if your dog is nose-breathing heavily while at rest or is experiencing labored breathing, it is a medical emergency.Breathing From the Stomach—Healthy dogs should have normal rhythmic breathing, and their chest and abdomen should move in and out together. If the abdomen is pushing as your dog breathes out, it could mean they are having trouble removing air from their lungs. This is considered a medical emergency that’s often seen in dogs with congestive heart failure, fluid or air around the lungs, or bronchitis.Shallow Breathing/Shortness of Breath—If your dog is taking short, quick breaths when they don’t have hiccups, have not been exercising, and are not under stress, it may indicate a deeper issue that should be evaluated by your vet.   Breathing Heavily While Resting—Heavy breathing at rest or during sleep can be the first sign of a problem with the lungs or airways. The sleeping respiratory rate (or SRR) is monitored in dogs with heart disease or congestive heart failure because it can be an early sign that their lungs are filling with fluid.Breathing Heavily at Night—Breathing heavily at night or when sleeping may be a sign of underlying lung or airway conditions. If your dog is also pacing or coughing, has an outstretched neck, has changes in the color of their gums, or is having difficulty getting comfortable, these can be signs of congestive heart failure, and your dog should be evaluated as soon as possible.Older Dog Breathing Heavily—With older dogs, underlying conditions such as heart failure, lung cancers, and bronchitis may cause heavy breathing, so these dogs should be watched more closely.Puppy Breathing Heavily—Heavy breathing in puppies may mean there’s an underlying medical issue, or it might just be that your puppy is excited. If your puppy is bright, alert, playful, and eating well, heavy breathing may be nothing to worry about. Puppies are also prone to heavy breathing during sleep due to dreaming. However, if your puppy is lethargic, has nasal or eye discharge, is vomiting, has diarrhea, is coughing, stops eating, or gets tired quickly during their usual exercise or activities, have them evaluated by a veterinarian as soon as possible. Puppies can be prone to pneumonia, heartworm disease, lungworm, and even congenital heart issues.Stuffy Nose and Breathing Heavily—Your dog may breathe more through their mouth if they have nasal congestion. If the heavy breathing is paired with lethargy, nasal/eye discharge, changes in facial symmetry (bulging eyes or sinuses), chronic sneezing, or changes in appetite, call your veterinarian for guidance. Causes for a stuffy nose include allergies, viruses, infections, pneumonia, cancers, or foreign objects in the nasal cavities.How to Help a Dog That’s Breathing Heavily Heavy breathing should not be ignored and can be fatal if left untreated. Your dog should be seen by a veterinarian immediately if they: Can’t get comfortable or lie downPace constantlyAre severely lethargicAre weak or collapsingAre standing with an outstretched neckHave a change in the color of their gums from pink to blue, purple, gray, or whiteHave a swollen bellyHave fluid coming from their mouth or noseHave yellow or green eye or nasal dischargeStop eatingAre vomiting or have diarrheaLess concerning signs include: Chronic coughingIncreased sleeping respiratory rate (greater than 30 breaths per minute)Slightly decreased appetiteIntermittent vomiting/soft stoolExercise intolerance (for example: Your dog used to walk 1 mile with no problem, but now your dog lies down after a few minutes of walking or excitement.)Unfortunately, there are no home remedies for heavy breathing in dogs, especially in severe situations. Getting them to a veterinarian as soon as possible for examination, diagnostic testing, and possible therapy is crucial. Why Is My Dog Breathing Heavily? Heavy breathing is a clinical sign of many medical conditions in dogs. These include: Left-sided congestive heart failure—When this happens, the main pumping chamber of the heart (left ventricle) has to work harder to push blood out to the body, usually because of a narrowed heart valve. Some blood might even leak backward into the left atrium. This raises the blood pressure in a dog’s heart and the lungs, which causes fluid to accumulate in their lungs.Pain—Dogs in pain may pant or breathe heavily. For example, a dog with pancreatitis may have significant abdominal pain, which can cause heavier breathing.Pneumonia—Viruses, bacteria, and fungus can all cause inflammation or infection in the lungs. This leads to heavy breathing with coughing, nasal and eye discharge, lethargy, fever, and decreased appetite.Bronchitis—Chronic inflammation or decreased elasticity (flexibility) in the airways and lungs can lead to heavy breathing and coughing.Heartworm disease—Heartworms can infest the heart and block the blood vessels between the heart and lungs. This can cause scarring of the lungs and congestive heart failure. Even after treatment, the lungs may have permanent scarring, which decreases the elasticity of the airways.Cancers—Certain types of cancers can affect the larynx (the beginning of the airway), trachea (the tube-like airway structure going from the mouth to lungs), or the lungs. Primary lung cancer is rare in dogs, but metastatic lung cancer (meaning it has spread from other areas to the lungs) is quite common.Lung Bulla—Bulla are walled-off air pockets within the lungs. Small bulla may burst and be of no consequence, but larger bulla may cause major breathing issues when they rupture. This condition can cause air to build up around the lungs, making it difficult for the lungs to expand. This can be fatal if left untreated. Veterinarians are unsure to the cause of bulla in the lungs, but it is thought these are congenital or caused by trauma to the chest cavity.Lungworm—Dogs can get parasites that infest their lungs, causing inflammation and infection. Pulmonary hypertension—This is a medical condition caused by high blood pressure (hypertension) in the arteries of the lungs. It can lead to coughing, trouble breathing, fainting, heavy breathing, congestive heart failure, collapse, or sudden death.Pulmonary contusions—Contusions, or bruising of the lungs, are usually caused by trauma to the chest cavity from penetrating wounds or blunt force trauma. It can take up to 3-5 days for the bruises to fully form, so it’s extremely important to monitor a dog’s breathing up to a week after a trauma.Noncardiogenic pulmonary edema—Pulmonary edema refers to abnormal fluid within the lungs that may reduce the amount of air your dog gets with every breath. Noncardiogenic means the edema isn’t caused by underlying heart disease, but instead could be caused by things like drowning, choking, or electrocution.Acute, severe bleeding—Blood loss from ruptured tumors, rat poison, clotting issues, or trauma can lead to anemia or low red blood cells. Red blood cells are carriers of oxygen to our body’s cells, so having less of them means there is less oxygen in the body, which can lead to heavy breathing.Cushing’s disease—This is a condition where the adrenal glands produce too much stress hormone and cortisol. The body responds with increased thirst, urination, and panting. You may also notice a bloated abdomen due to abdominal muscle weakness. This condition can also cause chronic skin and urinary tract issues.How Vets Diagnose Heavy Breathing in Dogs The first step is to identify any underlying conditions that might be causing the heavy breathing. Your vet will likely rely on a number of tests and procedures, including: Thorough physical examination and listening to the lungs and heartChest x-raysBlood tests, including a complete blood count, chemistry, and acid/base statusHeartworm testingPulse oximetry to measure oxygen levels in the bloodstreamMore specific testing may also be recommended, including: Echocardiography (ultrasound of the heart) to rule out heart disease, pulmonary hypertension, fluid in or around the lungs, tumors of the heart, and heartworm diseaseBronchoscopy (endoscopy of the airways) to help look for inflammation, growths, or foreign objects, or to sample tissuesCT scan to detail abnormalities in the airways and lung tissueBaermann fecal testing to rule out lung wormsTreatments for Heavy Breathing in Dogs Treatment is based on the underlying cause of the heavy breathing: Left-sided congestive heart failure is often treated with oxygen therapy, hospitalization, and diuretics to remove fluid from the lungs to stabilize the pet. Once your pet is stable, oral medications are sent home to help support heart function. In milder cases, oral medications may be started without hospitalization. If your dog is coughing persistently, has an elevated sleeping respiratory rate, collapses or faints, has exercise intolerance, or seems lethargic, get them evaluated by a veterinarian as soon as possible, as this can be fatal is left untreated.Pain is treated with analgesic (pain-relieving) medications, including non-steroidal anti-inflammatories (NSAIDs, such as carprofen or Galliprant), steroids (such as prednisone), and/or anticonvulsants (such as gabapentin) or opioids in a hospital setting (such as fentanyl, hydromorphone, or morphine).Pneumonia treatment depends on the underlying cause. Bacterial pneumonia is treated with antibiotics, while anti-fungals, or anti-virals are used to treat pneumonia caused by fungal or viral infections. Treatment may also include oxygen therapy and intravenous fluid therapy. Severe cases of pneumonia can be fatal if left untreated. Bring your pet to a veterinarian if you notice heavy breathing with any of the following: persistent coughing, vomiting/diarrhea, decreased appetite, nasal/eye discharge, or lethargy.Bronchitis is treated by trying to decrease allergens in the home, as well as giving anti-inflammatories (often prednisone or Temaril-P) and bronchodilators (such as albuterol or terbutaline). Short courses of antibiotics may be necessary to prevent infection. Bronchitis can range from mild to severe, so monitor your dog closely for persistent or worsening issues and report these to your veterinarian.Heartworm disease requires a standardized protocol of injections to kill the worms. Treatment is typically administered in a hospital, since these injections can be fatal. Heartworm disease may also be treated with steroids, antibiotics, and sometimes sedatives to keep your dog calm over the 6-8 month period of strict rest. Left untreated, this disease is always fatal. If your dog is coughing, can’t exercise, and/or is lethargic, take them to a vet as soon as possible, especially if your dog has not been administered heartworm prevention or if you have lapsed in dosing intervals.Cancer treatment is dependent on the type and location of cancer. Most cases are treated through surgery and chemotherapy, with or without radiation. Sometimes steroid therapy is used for certain types of cancer therapy. Unfortunately, most cancers are fatal if left untreated.Ruptured lung bulla that cause symptoms such as air filling the chest and lung compression are treated with a chest tap (thoracentesis) to remove the air. If no air refills, then no further treatment is needed. If air continues to fill up the chest, the vet may place a surgical chest tube, order a CT scan to investigate the location of the bulla, and recommend surgery.Lung worm is treated with anti-parasitic medication or dewormers such as fenbendazole. These are usually easy to treat and are not often fatal.Pulmonary hypertension may require treatment from a medication called sildenafil (sold under the trade name Viagra) to decrease blood pressure in the arteries of the lungs. Severe pulmonary hypertension can lead to fainting, collapse, congestive heart failure, or sudden death, so speedy diagnosis and therapy is necessary. Mild pulmonary hypertension usually shows no clinical signs, except perhaps coughing, and may or may not require therapy.Pulmonary contusions are treated with time and sometimes oxygen therapy. Usually, these contusions go away in 7-10 days, but in severe cases where they cause decreased oxygenation and heavy breathing, the vet may need to induce a coma and place your dog on mechanical ventilation.Noncardiogenic pulmonary edema is also treated with time and oxygen therapy. Again, in severe cases where the edema causes decreased oxygenation and heavy breathing, inducing a coma and placing a dog on mechanical ventilation is necessary until the edema resolves.Acute, severe bleeding is treated based on where it is. The veterinarian may recommend surgery to stop the bleeding and remove the source of the hemorrhage. Rat poison toxicity is treated by removing any blood buildup from around the lungs, often with chest tap and starting vitamin K therapy, which helps the blood clot. Unfortunately, this condition is fatal if left untreated.Cushing’s disease is sometimes treated and sometimes not. If your dog is frequently panting, drinking, and urinating a large amount, or develops chronic skin changes or frequent bladder stones, consider Cushing’s disease testing and therapy. Cushing’s disease is usually not fatal and often left untreated due to possible side effects from the medication used to treat it (trilostane).Featured Image: iStockphoto.com/simonkr"}]