[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Cloudy Eyes in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/dog-cloudy-eyes.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/dog-cloudy-eyes.jpeg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Symptom, Eye health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/cloudy-eyes-dogs"}, "datePublished": "December 15, 2022", "dateModified": "December 15, 2022", "description": "Worried that your dog’s eyes might have cataracts? There are many other possible reasons for cloudy eyes in dogs—some more serious than others. Here’s a breakdown of the most common conditions that cause this.", "articleBody": "A dog’s eyes should be clear and bright, so what does it mean when they start to get cloudy? Cloudy eyes can develop for many reasons in dogs. Some of the causes aren’t very serious, but others may signal an underlying condition that can quickly lead to blindness. A veterinary examination is necessary to tell the difference. Dogs of any age can have cloudy eyes, but certain health problems are more common in puppies and young dogs, while others tend to occur in middle-aged or older dogs. Let’s look at some of the most common causes of cloudy eyes in dogs, the other symptoms that you might notice at home, and most importantly, what you should do if your dog’s eyes become cloudy. What Do Cloudy Eyes Look Like in Dogs? A dog’s eye becomes cloudy when one of the normally “see-through” parts of the eye—the cornea or the lens—is no longer clear. The cornea is the outer layer of the front of the eyeball. The lens is suspended inside the eye. There may be just a light haze, or the area could be completely opaque (so dense you can’t see through it at all). The whole eye may be covered, or the cloudiness may be limited to one or just a few parts of the eye. One or both eyes may be involved. Often the cloudiness appears milky white, gray, or even blue, but other colors are possible, too. The surface of the eye may have a pink, fleshy appearance, or it may be red and angry-looking. Pigmented brown or black tissue can also cover part of the cornea. Other Symptoms to Watch For You may notice a few other symptoms that are related to your dog’s cloudy eyes. If the cloudiness is severe enough to impair vision, your dog may have difficulty navigating through new environments. However, dogs often know their way around familiar areas so well that even though their vision is poor, they don’t bump into things at home. However, be on the lookout for symptoms like redness, discharge, and pain, which your dog may or may not have, depending on the cause of their cloudy eye. What to Do If Your Dog’s Eyes Are Cloudy Never try treating your dog’s eye problems at home without first talking to a veterinarian. The eyes are incredibly delicate and complicated organs, and it’s easy to make matters worse rather than better. Sometimes a dog’s eyes gradually become cloudy over weeks or months. If this applies to your dog and everything else seems normal, you don’t need to rush to see your veterinarian. It’s still important to determine exactly what’s going on, but waiting a few extra days, or even weeks, isn’t likely to cause any harm. On the other hand, eyes that become cloudy over the course of just a few hours or days can go from bad to worse very quickly. This is especially true if the cloudiness is accompanied by redness, pain, discharge, squinting, or poor vision, or the eye appears to be larger than normal. Contact a veterinarian immediately if you see these things, even if it’s after hours, to determine when your dog needs to be seen. What Causes Cloudy Eyes in Dogs? Here are some of the more common causes of cloudy eyes in dogs. Nuclear sclerosis Nuclear sclerosis is a normal, age-related change typically seen in the eyes of older dogs. Also called lenticular sclerosis, it causes the lenses of a dog’s eyes to turn a hazy blue-gray color. Even though it usually involves both eyes, it does not significantly reduce a dog’s vision. Cataracts Cataracts can also make the lenses of the eye appear gray, blue, or milky white, but cataracts are more serious than nuclear sclerosis. When a cataract involves the whole lens, the dog cannot see out of that eye. Complete cataracts in both eyes lead to blindness. Cataracts can develop due to illness (diabetes, for example), injury, or genetics. Many breeds are at increased risk for cataracts, including the Smooth Fox Terrier, Havanese, Bichon Frise, Boston Terrier, Poodle, Boston Terrier, American Cocker Spaniel, and Miniature Schnauzer. Glaucoma Glaucoma is higher than normal pressure within the eyeball, which can damage the cornea and lead to cloudiness. The affected eye may also be red, painful, teary, and larger than normal. Dogs may become blind and even need to have their eye removed if glaucoma isn’t quickly treated. Glaucoma can develop from infection, inflammation, cancer, and other health problems, or it could be due to a genetic predisposition. Beagles, Basset Hounds, Boston Terriers, American Cocker Spaniels, Shar-peis, Siberian Huskies, Samoyeds, Labrador Retrievers, and Poodles are just some of the breeds that are at higher-than-average risk for glaucoma. Corneal ulcers and other wounds Corneal ulcers, scratches, and other wounds can also make a dog’s eyes cloudy. These wounds may be hard to see, but corneal edema (swelling), vascularization (blood vessels that develop on the surface of the eye), scarring, and sequestra (embedded pieces of dead tissue) can be quite visible. Other symptoms can include eye redness, pain, squinting, and drainage. Dog breeds with flat faces like Pugs and Pekingese have prominent eyes that are more prone to injury and ulcers. Uveitis Uveitis (inflammation and often infection inside the eyeball) can also be to blame for a dog’s cloudy, red, teary, and painful eyes. Dogs may also squint and avoid bright light. Corneal dystrophy Corneal dystrophy is a group of mostly genetic diseases that cause abnormal corneal development and increase the chances that a dog will have cloudiness, redness, and ulcers affecting the eyes because of abnormal corneal development. One eye may be affected first, but with time, both eyes are usually involved. Boston Terriers, Chihuahuas, Dachshunds, German Shorthaired Pointers, German Wirehaired Pointers, and other purebred dogs are at higher-than-average risk for corneal dystrophy. Corneal lipidosis Corneal lipidosis occurs when fats are deposited in a dog’s cornea. This is caused by elevated fat (lipid) levels in their bloodstream or because their corneas have been damaged or did not develop normally. You may notice areas of cloudiness, which may appear sparkly, in one or both of your dog’s eyes. This condition is not painful and does not always require treatment. Dry eye Dry eye, also known as keratoconjunctivitis sicca or KCS, is caused by poor tear production that’s often associated with an autoimmune disease affecting a dog’s tear glands. Genetics plays a role in the development of most cases of KCS. Breeds at higher-than-average risk include the American Cocker Spaniel, English Bulldog, Lhasa Apso, Shih Tzu, West Highland White Terrier, Cavalier King Charles Spaniel, Miniature Schnauzer, Pug, and Pekingese. Dogs with KCS often have recurrent eye infections, squinting, redness, eye discharge, pain, and corneal ulcers. Eventually, pigment may cover the surface of the eye. Pannus Pannus is an immune-mediated disease that leads to abnormal tissue developing at the corner of a dog’s eye. Without treatment, it often grows to fully cover the eye and results in blindness. Pannus usually affects both eyes, which may appear cloudy or red, or be covered by pink or dark tissue. German Shepherds are at the highest risk for pannus, but other breeds like the Australian Shepherd, Belgian Tervuren, Belgian Shepherd, Border Collie, Greyhound, Rottweiler, Rhodesian Ridgeback, and Siberian Husky also develop the condition frequently. What causes red cloudy eyes in dogs? Some of these conditions are true emergencies. Delaying treatment can lead to blindness or loss of an eye. Call a veterinarian immediately to determine how quickly your dog needs to be seen. Conditions that may cause red cloudy eyes include: GlaucomaCorneal ulcers and other woundsUveitisCorneal dystrophyDry eyePannusWhat causes blue cloudy eyes in dogs? These are usually not emergencies. Make an appointment with your veterinarian at your earliest convenience to have your dog’s eyes evaluated. Conditions that may cause blue cloudy eyes include: Nuclear sclerosisCataractsCorneal lipidosisWhat causes a cloudy eye with discharge? Some of these conditions are true emergencies. Delaying treatment can lead to blindness or loss of an eye. Call a veterinarian immediately to determine how quickly your dog needs to be seen. Conditions that may cause cloudy eyes with discharge include: GlaucomaCorneal ulcers and other woundsUveitisCorneal dystrophyDry eyePannusHow Do Vets Diagnose the Cause of Cloudiness in Dogs’ Eyes? Your veterinarian will take your dog’s health history and perform a physical examination and a thorough eye exam. They will also probably run some basic tests, like an eye stain to check for corneal ulcers and wounds, an eye pressure check that can help diagnose glaucoma (high pressure) or uveitis (low pressure), and a tear test to evaluate for dry eye. If the doctor thinks that a systemic illness may be causing your dog’s eye problems, they may also need to run bloodwork or other diagnostics. How Do Vets Treat Cloudy Eyes in Dogs? Appropriate treatment will depend on the underlying cause of your dog’s cloudy eyes, and for many eye problems, the sooner that treatment begins, the better. These are the treatments for some of the most common causes of cloudy eyes in dogs: Nuclear sclerosis: No treatment necessary.Cataracts: Removing a dog’s cataracts is an option that would greatly improve their vision.Glaucoma: Medications and sometimes surgery are necessary to reduce pressure within the eye and relieve pain.Corneal ulcers and other wounds: Eye drops usually work to treat infections and pain and help corneal wounds heal, but sometimes oral medications or surgery are also necessary.Uveitis: Treatment involves topical and sometimes oral antibiotics and anti-inflammatories. A veterinarian may prescribe eye drops to dilate the pupil. Other treatments may also be necessary, depending on the underlying cause of a dog’s uveitis.Corneal dystrophy: Eye drops that decrease corneal swelling and inflammation and help ulcers heal can be used to manage the condition, but sometimes surgery is needed as well.Corneal lipidosis: Treatment is not always required, but if it is, it’s often aimed at any underlying health problems.Dry eye: Treatment can involve eye drops that reduce the immune response within the tear glands, stimulate tear production, and treat infection. Artificial tears solutions can also help, but a more long-term solution is surgery to move the ducts carrying saliva from the mouth to the eye.Pannus: Treatment can include medications to suppress the eye’s immune response or surgery. Dogs can also wear UV-blocking goggles when outside in bright sunlight to slow the progression of the disease.Featured Image: Dr. Sandra Mitchell"}]