[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Sneezing?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Health", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-03/sneezing-puppy-picture.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-03/sneezing-puppy-picture.jpg"}, "author": {"@type": "Person", "name": "Heather Hoffmann, DVM", "url": "https://www.petmd.com/author/dr-heather-hoffmann"}, "keywords": "Dog, Sneezing, Symptom Checker, Sneezing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/why-my-dog-sneezing"}, "datePublished": "March 9, 2021", "dateModified": "September 12, 2023", "description": "Dr. Heather Hoffmann explains why your dog might be sneezing and when you should go to your veterinarian.", "articleBody": "Sneezing can be a normal occurrence in dogs, but in certain situations, you may wonder if excessive sneezing is a cause for concern. There are many reasons why dogs sneeze, so it’s important to distinguish between playful or communicative dog sneezing versus an indicator of a more serious underlying health condition. Here are some common reasons why your dog might be sneezing along with other signs to look for, what to do if your dog won’t stop sneezing, and when to take your dog to the veterinarian. Why Do Dogs Sneeze? This list will help you narrow down the possible causes behind your dog’s sneezing episode: Allergies If your dog is sneezing, it can sometimes be an indicator of underlying environmental allergies. You may notice sneezing in addition to other allergy signs, such as watery eyes or scratching and licking their fur due to itchiness. Play Sneezing Dogs often sneeze while they are playing as a sign of happiness. This also alerts the other dog that they are exerting play behavior. If you see your dog sneezing during a playdate, and there are no other symptoms, there is likely no need to worry! Reverse Sneezing Reverse sneezing in dogs is an interesting phenomenon that usually occurs in response to excitement, irritants, or inflammation. Dogs will exhibit sudden, repeated inhalations through the nose that sounds like honking. It almost seems like they are having trouble breathing when dogs reverse sneeze. Although it may sound dramatic, petting your dog and calming them down will usually resolve the behavior. Airborne Irritants Certain dogs can be sensitive to irritants, such as pollen or dust, that will cause them to sneeze. The small particles can get trapped in your dog’s nasal passages or pharynx, which incites a sneeze due to irritation. Other common irritants include scented candles, perfume, air fresheners, smoke, or cleaning products. Foreign Body Occasionally, dogs will get a piece of foreign material stuck in their nasal passages, causing severe irritation. Examples of such material include blades of grass, foxtails, or sticks. These objects are extremely irritating, so if this is the case, you will see continuous sneezing and discomfort. Nasal Infection Upper respiratory infections can cause dogs to sneeze. These can be fungal or bacterial in nature, and sometimes they can even originate from an infected tooth root. If your dog has an infection, you will usually see additional symptoms, such as a bloody or mucoid discharge and lack of appetite. Nasal Mites Nasal mites are small bugs that can cause severe nasal irritation in dogs. Dogs often get them when they dig or rub their nose in dirt. Due to the irritation and inflammation caused by these insects, you will usually see a bloody or thick discharge from your dog’s nose in addition to frequent sneezing. Nasal Tumor In older dogs (usually above 7 years of age), nasal tumors are a possible cause of sneezing. Symptoms are usually characterized by increased frequency of sneezing over time, and the tumors may cause bleeding on one side of the nose. Dog Breeds That Are Prone to Sneezing Brachycephalic, or flat-faced dogs, are more prone to sneezing due to the anatomical compression of their nasal passages. The most common brachycephalic breeds with breathing or sneezing tendencies are Pugs, Boston Terriers, and English Bulldogs. Uncontrollable Sneezing in Dogs Severe sneezing can be very concerning to see as a pet parent. The most common causes of uncontrollable sneezing in dogs are nasal foreign bodies, nasal mites, or a nasal tumor. If your pet is incessantly sneezing, especially if it is accompanied by a nasal discharge, seeking emergency veterinary care is warranted. Dog Sneezing With Other Symptoms What if your dog is not just sneezing but has other symptoms? Here are some of the most common symptoms that show up and what they mean. Dog Sneezing Blood Sneezing blood is a sign that something more serious is going on with your dog’s nasal passages. Possible causes include foreign bodies, nasal tumors, and bacterial or fungal infections. Dog Sneezing and Coughing If your canine companion is both sneezing and coughing, it may be a sign of a more serious underlying health condition. Possible causes of these symptoms include severe bacterial or fungal infections, kennel cough, canine influenza, or respiratory parasites. Dog Sneezing and Wheezing If your dog is wheezing in addition to sneezing, it may indicate a problem with your dog’s lungs that needs to be further investigated. Wheezing can be caused by asthma or other respiratory issues. Dog Sneezing vs. Snorting Sometimes it can be difficult to tell the difference between dog sneezing and snorting. One way to help differentiate is that sneezing is usually an outward expulsion of air, while snorting is drawing air in with an accompanying sound. Snorting is common in brachycephalic dogs, but it can also be seen with overweight animals or those that have underlying medical conditions. What Can I Give My Dog for Sneezing? There are multiple causes for sneezing in dogs; some require further treatment and others do not. Although you may be tempted to reach for over-the-counter human products, such as Benadryl, to help provide some relief, you should always have your local veterinarian determine the true underlying cause of your dog’s sneezing before starting any type of treatment. When to Take Sneezing Dogs to the Vet Occasional sneezing in dogs does not usually require a vet visit. However, some instances of dog sneezing do require a trip to the vet to see what’s wrong. Here are some cases where you should see a vet: If you see signs of thick nasal discharge/blood, nasal swelling, lethargy, fever, or reduced appetite, take your dog to your local vet as soon as possible for examination. Frequent sneezing in dogs without a clear cause may necessitate more testing. If your dog is experiencing severe signs of allergies (itching, licking, scratching) in addition to sneezing, make an appointment for further care. Featured image: iStock.com/sebliminal"}]