[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Bad Breath in Dogs: Causes and Treatment", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-02/young-black-man-playing-with-dogs-picture-id1329737066.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-02/young-black-man-playing-with-dogs-picture-id1329737066.jpg"}, "author": {"@type": "Person", "name": "Riley Shugg, MS, DVM", "url": "https://www.petmd.com/author/dr-riley-shugg"}, "keywords": "Dog, Bad breath, Oral health, Zoo General Dog Pack, Symptom Checker", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/bad-breath-dogs-causes-treatment"}, "datePublished": "February 15, 2022", "dateModified": "September 12, 2023", "description": "Does your dog&#039;s breath stink? Dr. Riley Shugg explains whether this is normal and what you can do about it.", "articleBody": "You may love getting kisses from your dog as a greeting when you get home, except when they’re accompanied by bad breath. Is it normal for a dog’s breath to stink? Bad dog breath can actually be a sign of a number of health issues, and some that you would never guess could be related to your dog’s breath. Understanding why your dog has bad breath is the first step in appropriately treating not only the smell but the underlying cause. Why Does My Dog Have Bad Breath? In the past 10 years, dental hygiene in dogs has changed from occasional tooth extractions to yearly dental examinations and routine teeth cleaning. Preventative dental care options have become widely available, as well as the knowledge of what a dog’s mouth can tell us about our canine patients. Bad breath has evolved from being a nuisance for pet parents to a veterinarian’s tool for diagnosing certain health issues. Here are some of the most common: Dental or Gum Disease: The most common cause of bad breath (halitosis) in dogs is periodontal disease. Similar to humans, dogs with crowded teeth or crooked, misaligned teeth (malocclusions) may be at a higher risk for secondary dental disease; however, most dogs will develop some tartar or plaque buildup (dental calculus) or gingivitis at some point in their life. Dental disease develops when an overgrowth of bacteria in the mouth forms a plaque, which leads to tartar buildup. Tartar can lead to inflammation of the gums (gingivitis). If enough tartar is allowed to build, hair and other debris can get stuck between a dog’s gumline, adding to the development of bad breath. Something Stuck in Your Dog’s Mouth (bone, stick, foreign body): Dogs fond of chewing on toys, ropes, and sticks are at greater risk of getting foreign material stuck in their mouths. Cloth materials tend to get stuck between the teeth, whereas sticks or other firm material such as chew toys may get wedged in the roof of a dog’s mouth. Some foreign bodies, like splinters, can get stuck under the tongue or in the cheek and may be hard to see. In some circumstances, strings or linear foreign material may get hooked under the tongue, and the bad breath could be accompanied by not eating and vomiting. Kidney Disease: The kidneys function as the body’s filtration system. When there’s underlying disease or kidney failure that causes the kidneys not to function, a dog may start to build up toxins called urea in their blood. The urea can make a dog’s breath smell like ammonia or urine, which may be an indicator of serious kidney dysfunction. Excessive urea, called uremia, can cause ulceration in the mouth as well, which your vet may see on examination. Liver Disease: Bad breath along with yellowing of the skin or eyes (jaundice) in conjunction with weight loss, poor appetite, and vomiting may indicate that your dog’s liver may be affected. Along with the kidneys, the liver acts as a filter for the body’s toxins. When there’s a problem with your dog’s liver function, toxins can build, and this can show up as bad breath. Diabetes: When diabetes becomes unregulated or untreated for a long enough period of time, the body starts breaking down fat, creating molecules called ketones. Dogs that are producing ketones secondary to diabetes may have an acetone or sweet smell to their breath. Dogs with diabetes often have other symptoms such as weight loss, changes in appetite, and increased thirst and urination. Ate Something Toxic: Certain toxins like plants can cause rancid or a rotting smell in a dog’s breath. Dogs who eat cigarettes may have a nicotine odor to their breath. There are hundreds of toxins present in the environment, and being able to detect what your dog may have been exposed to could help determine the right treatment. Ate Something Gross (non-food item): Puppies or adolescent dogs may be more inclined to eat feces of other dogs or be curious about what is in the cat’s litter box. Dog breath that smells like fecal matter may be linked to simply eating poop. Alternatively, dogs who eat household objects or toys can develop rotten-smelling breath and may vomit if they aren’t able to digest the foreign material. Oral Tumors: More common in older animals, the development of oral cancers or tumors can lead to bad breath. As masses grow, they can become infected, and parts of the tissues can start to die (necrose), leading to persistent bad breath despite good dental care. The most common oral tumors in dogs are melanoma, squamous cell carcinoma, and peripheral odontogenic fibromas. Dietary Deficiencies: Feeding your dog raw or home-cooked diets may disrupt the normal balance of bacteria in the mouth or gut. Imbalances of bacteria and increased likelihood of Salmonella overgrowth in a dog’s gut caused by raw diets may contribute to bad breath. If you feed your dog a raw or home-cooked diet, try to consult with a veterinary nutritionist (or if not, your regular vet) to help prevent dietary deficiencies. How to Get Rid of Your Dog’s Bad Breath If your dog has bad breath, your first step is to schedule a dental exam. If you allow a veterinary professional to routinely exam your dog’s mouth, they can detect dental disease and other health issues earlier. If your dog is prone to periodontal disease, routine cleaning may be needed to help prevent excessive tartar formation and frequent dental extractions (having teeth pulled). Here are some other ways to improve your dog’s oral health and keep their breath smelling better: Regular Brushing: Weekly to daily brushing with canine toothpaste and toothbrushes can be the most effective way to prevent plaque formation. Many dog toothpastes are flavored to be enticing to dogs. Dental Treats and Products: Dental treats can either help physically remove plaque as your dog chews or may contain additives that promote a healthy oral environment. Other products like dental water additives can be used to help mask bad breath as well as promote oral health. These are typically unflavored, and you simply add a small amount to your pet’s water dish each day. Dental Diets: There are dental diets made for dogs that can help reduce plaque buildup. They use a larger kibble size and a course texture to scrape along the tooth and remove plaque as your dog chews. The Veterinary Oral Health Council (VOHC) can be a useful resource in picking veterinary-recommended dental diets, treats, and supplements that are safe and effective. Featured image: iStock.com/adamkaz Bad Breath in Dogs FAQs Are there home remedies to treat bad breath in dogs? The only way to completely resolve your dog’s bad breath is treating the underlying cause. However, there are products that can help to lessen the bad breath and prevent it from worsening. The Veterinary Oral Health Council has a list of recommended products that may help. Can halitosis in dogs (bad breath) be cured? Halitosis is a symptom of an underlying medical condition, and successful treatment depends on the underlying cause. It’s commonly caused by dental disease, which can be treated, but  halitosis frequently returns if dental disease recurs."}]