[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Does dog wheezing sound like whistling?", "acceptedAnswer": {"@type": "Answer", "text": "Wheezing is characterized as a high-pitched sound made consistently as your dog breathes out. It is often compared to a human whistle, though it can have harsher tones."}}, {"@type": "Question", "name": "Is it normal for dogs to wheeze?", "acceptedAnswer": {"@type": "Answer", "text": "While a short bout of wheezing is most likely not concerning, if your dog wheezes consistently or has other symptoms along with wheezing, there could be a serious underlying health condition that warrants your dog being seen by a veterinarian. Featured Image: Adobe/peopleimages.com"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Wheezing: Causes and Treatment Options", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/AdobeStock_599766474.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/AdobeStock_599766474.jpg"}, "author": {"@type": "Person", "name": "Jamie Lovejoy, DVM", "url": "https://www.petmd.com/author/dr-jamie-lovejoy"}, "keywords": "Dog, Symptom Checker, Wheezing", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptom/dog-wheezing-causes-and-treatment"}, "datePublished": "June 19, 2023", "dateModified": "September 12, 2023", "description": "Dr. Jamie Lovejoy explains what may cause wheezing in a dog, including underlying issues, symptoms, and treatment options.", "articleBody": "What Is Dog Wheezing? Wheezing, also known as stridor, is a high-pitched, raspy sound made by turbulent air flow through the trachea, or windpipe. As a dog inhales normally, air flows into the mouth, through the larynx (the area of the throat that contains the vocal cords and is the upper opening of the trachea), then through the trachea before dispersing into the smaller airways of the lungs. Exhalation reverses this order. Most often heard as a dog exhales, a wheezing sound usually indicates that there is some sort of blockage of the air flow in either the trachea or the larynx. Air flow can be obstructed by inflammation, thickening of the airways, or by a foreign object or mass. There are a few benign causes of wheezing, such as a sudden increase in activity (especially during the summer) or stress that causes your dog to breathe hard enough to wheeze. However, if the wheezing is constant, prolonged, or accompanied by any signs of distress or discomfort, it may indicate a medical emergency. Concerning Symptoms of Dog Wheezing Wheezing that does not improve as your dog calms down or rests Wheezing accompanied by gagging/coughing Wheezing accompanied by blue or purple color change of the gums or tongue Wheezing accompanied by appetite decrease Wheezing and decreased activity levels/lethargy Causes of Dog Wheezing Wheezing Related to Infectious Disease Viral (e.g., influenza), bacterial (e.g., kennel cough), and parasitic (e.g., heartworm) infections can lead to wheezing. Infections can cause inflammation and thicken the airways (bronchitis), but wheezing can also occur when mucus and phlegm buildup near the vocal cords. Heartworm can also affect how the heart functions and lead to symptoms of heart failure. Mild cases of infectious respiratory disease, where your dog is still eating, drinking, and sleeping well, may not need medical intervention, but prolonged clinical signs, change in appetite, or any of the above symptoms warrant a vet visit and likely chest X-rays to make sure antibiotics and other supportive options aren’t necessary. Wheezing Related to Allergies Seasonal respiratory allergies are not as common in dogs as they are in humans, and wheezing during an allergic reaction in dogs is concerning because that could be a sign of anaphylaxis. Especially if the wheezing is accompanied by facial swelling or hives, a dog should be evaluated by a veterinarian immediately. Wheezing Related to Collapsing Trachea Most noted in small-breed dogs, collapsing trachea is a condition where the cartilage of the trachea is weakened. Due to the pressure changes inherent in inhalation and exhalation, the trachea will actually narrow at the weak points. Wheezing with this condition is usually accompanied by a “honking goose” cough. Severity of these symptoms can vary. Dogs who are not severely affected can be treated with environmental management. Examples of this include avoiding strenuous activities, keeping them in air-conditioned locations, and using harnesses that avoid pressure on the neck. For those with more serious clinical signs, there are some surgical options. Wheezing Related to Heart Disease When changes in the heart lead to heart failure, fluid can build up inside or outside the lungs, causing the dog to breathe much harder to get oxygen. This increased force during breathing can lead to wheezing, though coughing is a more common clinical sign. In cases like this, wheezing is often coupled with breathing faster. You may notice your dog using their abdomen more to help them breathe. Heart failure is a medical emergency; if your dog displays these clinical signs, they should be evaluated by your veterinarian immediately. Wheezing Related to a Foreign Body An object that your dog has in their mouth can slip and get lodged in the back of the throat near the larynx, obstructing the airway and leading to severe wheezing. As a dog experiences these sudden changes it can seem like they are choking, and the wheezing is often accompanied by distress, drooling, and coughing. Getting a foreign object out of the airway is a medical emergency, so contact a veterinarian immediately. Wheezing Related to Cancer Unfortunately, airways can also be compromised by cancer. Rare primary cancers can occur in the back of the throat, leading to the same symptoms as a foreign body in the airway. This wheezing usually gets worse over time. Lymphoma (cancer of the lymphatic system) increases the size of the lymph nodes around the airway, which can lead to wheezing. When cancer metastasizes (spreads), it can compromise the lungs internally, leading to the same wheezing from excess breathing effort that we see in heart disease. Wheezing from cancer may or may not be treatable but should be evaluated as soon as it is suspected. How Veterinarians Diagnose Dog Wheezing If a dog is wheezing, a veterinarian will start with a full physical exam. This will show how the dog is breathing, how their heart sounds, whether they have a fever, and if there are any external signs of why the airway is compromised. Taking X-rays of the chest and upper airway is standard to get more insight into the shape and condition of the respiratory tract. Bloodwork can help diagnose infectious causes (like heartworm disease or pneumonia) and ensure medications prescribed are safe for the liver and kidneys. In severe or difficult cases, a CT scan may be helpful to better evaluate the lungs and trachea. Treatment of Dog Wheezing Treatment of wheezing depends greatly on the underlying cause. Medications such as anti-inflammatories, steroids, antihistamines, and antibiotics can be used. Environmental management, such as keeping your dog calm, improving air quality, or even humidifying air may be helpful for dogs recovering from infectious disease. Surgery and anesthesia may be indicated for foreign bodies, cancers, and collapsing trachea. Your veterinarian will work with you to develop a plan that treats the primary condition and properly supports your dog’s recovery. Some treatments will be short-term, while some may be lifelong. Home Remedies for Dog Wheezing Given the severe nature of most respiratory diseases, it is not advised to try to treat your dog’s wheezing with home remedies without a veterinarian’s advice. While transporting your dog or waiting for advice or an appointment, keeping your dog calm and cool will often help the most. Your veterinarian may recommend over-the-counter antihistamines if they believe your dog could benefit from them. Recovery and Management of Dog Wheezing Recovery will depend entirely on the nature of your dog’s illness. Many viral and bacterial respiratory infections will resolve in a week to 10 days. Symptoms due to allergic bronchitis or heart failure will often respond quickly to treatment but may relapse multiple times throughout your dog’s life.  Prevention of Dog Wheezing There are vaccines available for many of the infectious causes of canine respiratory illness. All dogs need to be kept up to date on the distemper (DAPP) vaccine, and socially active dogs need to be actively given the Bordetella (kennel cough) and influenza vaccines. Monthly heartworm prevention is essential, even for indoor dogs. To avoid foreign bodies, ensure that your dog plays with appropriately sized toys and balls. Discourage running with sticks or other fragile objects that can splinter. Though heart disease, lower airway disease, and collapsing trachea are not directly preventable, obese and overweight dogs are more prone to severe symptoms with these illnesses. Keeping your dog in good body condition will go a long way in making these diseases more manageable."}]