[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Red Eyes in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/red-eyes-dog.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/red-eyes-dog.jpeg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Dog, Symptom, Red eyes", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/red-eyes-in-dogs"}, "datePublished": "June 5, 2023", "dateModified": "June 5, 2023", "description": "Red eyes in dogs can be caused by many different conditions. Learn more about dogs having red eyes and what it means.", "articleBody": "Red eyes are a prevalent eye issue in dogs and puppies. It’s also a very common presentation for a wide variety of conditions, from external irritants and excessive dryness to many diseases. Red eyes are an indication of inflammation in one of the components that make up the dog’s eye. Depending on the cause, red eyes can mean anything from a minor issue to a serious—even life-threatening—medical condition. A dog with red eyes can also be at risk of significant vision loss or blindness. The degree of redness may or may not be indicative of the severity of the problem. If you notice your dog’s eyes are red, take him to your veterinarian as soon as possible. Types of Red Eyes in Dogs Redness in a dog’s eye comes from one of the following locations within the eye: Episcleral Injection The white of the eye is called the sclera, which is the tough outer layer of the eye. This type of eye redness occurs when the blood vessels of the sclera become enlarged (congested), thus becoming more straight instead of tortuous (winding). Episcleral injection is an external sign of an intraocular disease. This means you see redness on the outer part of the eye, but it indicates a disease process inside the eye, such as uveitis or glaucoma. Conjunctival Hyperemia The conjunctiva of the eye is a thin membrane that covers the sclera near the front of the eye and also covers the inside of the eyelid. Conjunctival hyperemia is congestion of the blood vessels within the conjunctiva, making the vessels enlarge and causing increased redness. Extraocular diseases—meaning diseases that affect the outside of the eye, such as conjunctivitis—cause this type of red eye in dogs. Subconjunctival Hemorrhage Underneath the conjunctiva, deeper within the tissues of the eye, a diffuse redness can occur in which the blood vessels of the eye are completely hidden. This type of redness will take up the entire white part of the eye and is often a result of over-restraint, trauma, clotting disorders, or strangulation. Corneal Neovascularization In response to a defect on the cornea, new blood vessels will form on the surface of the eye, called corneal neovascularization. This can be superficial, deep (focal or one spot), or 360 degrees deep. This type of redness occurs with scratches on the surface of the eye, inflammatory conditions of the cornea (keratitis), and diseases such as glaucoma or uveitis. Hyphema Hyphema is a hemorrhage, or pooling of blood, within the anterior chamber of the eye. This type of redness will be noticed as complete redness, or a dull or bright red line in the eye. This can occur from clotting disorders, trauma, uveitis, or systemic hypertension (high blood pressure). There are many symptoms that can accompany a red eye that might give clues as to where the problem lies, such as: Third-eyelid inflammation Discharge from the eye Ruptured blood vessels Swelling in or around the eye Pain or discomfort (as evidenced by pawing or rubbing the eye and/or squinting) What To Do if Your Dog Has Red Eyes If you notice your dog has redness in their eyes, he should be examined by his veterinarian as soon as possible. A red eye should be evaluated right away to start any necessary medical treatment to preserve your dog’s vision. Causes of Red Eyes in Dogs Allergies Just as in humans, dogs might get red eyes from environmental allergies to things such as pollen or dander. This can often cause your dog to have itchy eyes as well. Allergies are treated with a variety of methods depending on the underlying cause, but can include oral medication such as antihistamines and/or eye drops to help secondary infections that might pop up. Conjunctivitis Inflammation of the surface of the eye, or cornea, causes redness to your dog’s eyes. Similar to pink eye in people, conjunctivitis can be from an infectious agent such as bacteria or viruses, trauma, or environmental irritants. It’s often accompanied by excessive discharge from the eye. Conjunctivitis is treated with topical medication such as drops or ointments. Severe cases might require oral medications. Keratoconjunctivitis Sicca (KCS) KCS, also known as dry eye in dogs, happens when your pup has little to no tear production. When this occurs, they won’t have the normal protective function of the surface of the eye. This leads to scratches and other abnormalities to the eye that will cause it to become red. This is an issue with your dog’s immune system and can go along with other conditions such as diabetes. KCS is treated with a combination of topical eye medications and oral medications to stimulate the immune system. Dogs with KCS should also use an artificial tears eye drops to keep their eyes lubricated. Entropion Entropion in dogs is the inward turning of the eyelid that causes the eyelashes to irritate the surface of the eye, leading to redness. The condition often causes chronic, recurrent eye infections, including swelling and discharge. Entropion is treated with corrective surgery. Cherry Eye Cherry eye is when a small gland inside the dog’s third eyelid becomes inflamed and protrudes. It’s often noticed as a small red swelling or lump in the inner corner of the eyelid. Mild cases can be treated with anti-inflammatory eye drops, while severe cases require corrective surgery. Eye Injury or Trauma External irritants or foreign material in or around the eyes can cause redness. Common examples include grass, hair, toxic gases/fumes, fights with other animals, and tree branches. Trauma often causes ulcers on the surface of the eye along with pain, squinting, and rubbing of the eyes. Depending on the severity, this can be treated with topical eye medications, pain relief, and/or oral medications. Corneal Ulcers Corneal ulcers are open sores on the surface of the eyes that may or may not be visible to the naked eye. Ulcers are often caused by trauma but can also be the result of bacterial or viral diseases. Aggressive medical treatment is necessary to avoid vision loss. Glaucoma Glaucoma is caused by increased pressure within the eye that causes red eyes and can lead to blindness. It often occurs in dogs with uncontrolled or unregulated diabetes, but it can also be hereditary or develop from other disease processes. Cloudiness on the eye’s surface can also be present. Medical treatment combined with surgery is often necessary. Uveitis Uveitis is characterized by decreased pressure within the eye caused by infection, metabolic diseases, toxins, injury, or eye tumors. This causes the eye to be red and will be painful, so you might see your dog squinting. Cloudiness on the surface of the eye can also be present. Uveitis is often managed with topical and oral medications. Blepharitis This is inflammation of the eyelid due to entropion, infection, irritation, or allergies. The eye(s) will often be red, itchy, and swollen, with or without squinting and rubbing at the face due to pain. Depending on the underlying cause, it can be treated with eye medications, oral medications, or even surgery. Tumor Benign or malignant tumors growing behind or within the eye can cause red eyes in dogs. Depending on the extent and severity, surgery might be necessary. High Blood Pressure Increased blood pressure can cause the small blood vessels in the eye to rupture, leading to a very red eye. If left untreated, this condition will lead to blindness. Treating the underlying cause of high blood pressure with methods such as oral medication should help resolve the red eyes. How Vets Diagnose the Cause of Red Eyes in Dogs Your veterinarian will assess your dog’s medical condition by obtaining a complete medical history and performing a complete physical exam (including a thorough examination of the eyes). They will likely recommend laboratory testing to determine the underlying cause of your dog’s red eye(s). Lab work should include a chemistry profile, complete blood count, electrolyte panel, and a urinalysis. Special non-invasive eye testing will be performed, such as: Schirmer tear test: Measures tear production to diagnose KCS. Fluorescein stain: Allows evaluation of the surface of the eye to check for scratches or changes to the cornea. A positive stain will diagnose a corneal ulcer. Tonometry: Measures the intraocular pressures to diagnose glaucoma or uveitis. More advanced testing for red eyes would include an ultrasound of the eye and surrounding tissue, blood pressure monitoring, and even advanced imaging such as a CT scan or an MRI. Treatment for Red Eyes in Dogs If you notice your dog has red eyes, schedule an appointment to have them seen by their veterinarian as soon as possible. If their vet is not available, this can be considered a medical emergency in some cases and your dog should be examined by your local emergency vet for initial treatment and diagnostics. A cold compress with a soft washcloth can help temporarily soothe any pain or discomfort by decreasing inflammation. Make sure triggers such as smoke, fumes, pollen, and dust are avoided until the cause of the red eyes is determined. A pet-specific eye wash or eye wipe can be used if your dog will tolerate it. Artificial tear eye drops can also be helpful if your dog’s tear production is low and to lubricate the eye and surrounding tissues. Featured Image: Adobe/rh2010"}]