[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/8vewqreai5", "@type": "VideoObject", "duration": "PT1M57S", "name": "5327119678001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/78cbaa9e55510bd173ec9415eae27ee1ed6f1a71.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/8vewqreai5", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/1a97ef309e5b8881972eaf4d894e5ec703710128.m3u8", "transcript": "Hi I'm Dr. Judy today on pet M.D. we'll be discussing lumps and bumps in your dog. I'd like to introduce you to Molly. We have recently rescued her Molly does have some lumps and bumps.\n\nOne of her major lumps is this little cyst behind her ear. Now how do we really know what that is. Whenever you find a lump on your part ideally it should be examined at minimum a fine needle aspirate should be performed. It's a very simple procedure.\n\nThere's no sedation or anesthesia required to put a little needle into the tumor. Most veterinary clinics can examine it immediately and tell whether or not that lump is for example a benign like Homa like homos are extremely common as dogs age and you can kind of move them around that kind of field gelatinous almost like a water balloon effect underneath the skin. So when you receive the diagnosis from the veterinarian and they say it's something benign and not to worry. Still keep in mind that lumps can change and it's your responsibility to keep an eye on that lump for any kind of changes if it enlarges if it becomes ulcerative or simply if it bothers your pet.\n\nThere are three basic types of treatment for a lump or a bump depending on what the definitive diagnosis is. And these are surgical removal radiation treatment or chemotherapy. So our take home tip today is that not all lumps and bumps are bad attention feeling for little lumps and some of the common areas if you notice something. It's important to get a definitive diagnosis from your veterinarian.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/symptoms/lumps-bumps-and-cysts-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What does a sebaceous cyst on a dog look like?", "acceptedAnswer": {"@type": "Answer", "text": "A sebaceous cyst is a smooth, raised swelling that contains sebum from the oil glands associated with hair follicles. They can become infected and inflamed and may rupture, secreting a thin, yellowish discharge."}}, {"@type": "Question", "name": "What can you do for a dog with a sebaceous cyst?", "acceptedAnswer": {"@type": "Answer", "text": "A sebaceous cyst should be observed for changes in size or material within the cyst. The cyst may break open from being scratched and release a fluid-like material. This should be gently cleaned with warm water and then allowed to dry. Any sign of infection or sensitivity in the area should be evaluated by a veterinarian for treatment recommendations and possibly surgical removal."}}, {"@type": "Question", "name": "How do I get rid of bumps on my dog?", "acceptedAnswer": {"@type": "Answer", "text": "The safest way to remove bumps from a dog’s skin is to have a veterinarian diagnose the type of bump. Then they will determine an appropriate plan for surgical removal using local or general anesthesia."}}, {"@type": "Question", "name": "Can a bug bite cause a bump on a dog?", "acceptedAnswer": {"@type": "Answer", "text": "Yes, a bug bite may cause a temporary swelling on a dog. These may be itchy as well. Growths are usually more defined and rarely regress but remain the same or grow larger over time."}}, {"@type": "Question", "name": "Is a belly lump normal after a dog spay?", "acceptedAnswer": {"@type": "Answer", "text": "No. A belly lump may indicate a reaction to a buried suture, or rarely, a hernia of the abdominal wall. Contact your vet if your dog has a lump in their belly after being spayed."}}, {"@type": "Question", "name": "Should I have my dog’s lump removed?", "acceptedAnswer": {"@type": "Answer", "text": "This would depend on the type of lump that it is. Many benign growths do not need to be removed. However, if the growth changes in appearance, bothers the dog, or interferes with movement, then a veterinary exam is needed to determine the appropriate treatment. For malignant growths, your vet can determine the appropriate treatment. Featured Image: iStock.com/Elayne Massaini"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Lumps, Bumps, and Cysts on Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Skin", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-08/dogs-running.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-08/dogs-running.jpg"}, "author": {"@type": "Person", "name": "Teresa Manucy, DVM", "url": "https://www.petmd.com/author/dr-teresa-manucy"}, "keywords": "Dog, Symptom, Lumps and Bumps, Symptom Checker, Lumps and Bumps", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/lumps-bumps-and-cysts-dogs"}, "datePublished": "August 30, 2022", "dateModified": "September 12, 2023", "description": "Worried about a lump or bump on your dog? Dr. Teresa Manucy goes over all the most common benign and malignant growths on dogs.", "articleBody": "The overall health of a dog is often reflected in their skin. Dogs can get lumps, bumps, and cysts from normal aging, or they can be signs of a problem. There are two major types of lumps and bumps on dogs: malignant (cancerous) and benign (not cancerous). However, you can’t tell the type or severity of a growth just by looking at it. A veterinarian can take a sample of cells to give you a diagnosis and appropriate treatment plan.   Types of Lumps and Bumps on Dogs Here are several common skin growths found in dogs, along with info on what they look like and what to watch for: Benign Tumors Tumors that are benign are not invasive or likely to spread to other body areas. Histiocytoma A histiocytoma is a benign skin growth that usually occurs in dogs less than 2 years of age. They are found on the front half of a dog’s body, usually on the head or legs. Rarely, they can be seen in older dogs or on other areas of the body. Histiocytomas are pink and fleshy but may get bigger and seem more irritated before improving. These tumors usually regress spontaneously over time without treatment and arise from the skin’s immune cells. They can be diagnosed through microscopic examination of a sample of cells from the growth. Lipoma A lipoma may show up anywhere on a dog’s body but is common on the trunk and legs. Lipomas come from fat cells under the skin or are found in muscle tissue. They usually develop in older, overweight dogs. They may become quite large or appear in multiple locations. A vet can diagnose a lipoma by taking a small sample of cells from the growth to look for fat droplets. No treatment is needed, but these should be monitored for rapid changes. They will gradually enlarge with time, and may bother your dog if they’re located in an area that interferes with motion. When lipomas start to bother your pet, you can consider surgical removal. Papilloma A papilloma in young dogs is a contagious, wart-like growth that usually occurs in and around the mouth. In older dogs, they might be seen around the eyes or on other areas of the body. Papillomas are caused by a virus that can be spread through direct contact with an infected dog or contaminated items, such as toys or feeding bowls. They appear small, fleshy, and round with a cauliflower-like texture to the surface. Many will dry up and fall off within a few months as the dog’s immune system matures. Severe cases may make eating or swallowing difficult and require treatment by surgical removal. Medications and other treatment methods are also available, including crushing of the warts to stimulate the immune system. Another type of papilloma is a skin wart that is more common in older dogs. These are usually solitary and not caused by a virus. These bumps may have a hardened surface that looks like a cauliflower. An inverted papilloma may also be seen in young adult dogs, especially on the lower abdomen. If the growth bothers the pet, surgical removal is an option. Skin Tag A skin tag grows in places where a dog’s skin rubs together. They are overgrowths of the connective tissue in the skin. They are the same color as the skin but extend out from the surface on thin stalks. Skin tags are common in older dogs and certain breeds. No treatment is needed, but these can be surgically removed if they are bothersome. Sebaceous Gland Tumor A sebaceous gland tumor is commonly found in older dogs. They are typically smaller than a pea and may develop in any location. Some will bleed or secrete a material that forms a crust. Large breeds often form these on their head, specifically their eyelids, and they may be black in color. Treatment is not necessary, but surgical removal may be considered when the growth is bothersome. Meibomian A meibomian gland tumor is a slow-growing benign lump that forms in the meibomian gland at the edge of the eyelid. The tumor can stick out or grow into the eyelid. They may become inflamed, irritated, painful, or ulcerated. They may also cause inflammation of the cornea and conjunctiva. Large tumors may cause problems when your dog blinks, because they cause extra tearing and tear staining. They are diagnosed by their appearance and location, and they can be removed with surgery, or the tissue can be frozen for removal. They rarely grow back after removal, but  regrowth is possible. Epulis An epulis is a common benign growth found in the mouth of dogs. They may form when a tooth rubs against the gums, as with an underbite in brachycephalic (flat-faced) breeds. These smooth, fleshy, pink bumps grow on the gum tissue near the outer surface of an incisor, canine, or premolar tooth. They can appear to grow on a stalk of tissue, like a mushroom, or as an unmoving mass, and they may have a bony interior. Certain types can invade surrounding bony tissue. Diagnosis of an epulis is made by recognizing it from appearance and confirming with a biopsy. An x-ray of your dog’s head will show if it has invaded surrounding tissues. These growths should be removed surgically, along with the adjacent tooth and any bony tissue that may be affected. They do not usually regrow if the entire tumor is removed. Radiation therapy may help cases where the growth is inoperable. Follicular Cysts Follicular cysts are large, benign bumps on the skin that grow up from the hair follicle. They may release a thick material that is white, yellow, or brown when you push on them. As they get bigger, they can become itchy or painful. These types of cysts are diagnosed on physical examination and may be confirmed with microscopic examination of a small sample of cells aspirated with a needle. Follicular cysts may become infected and require antibiotic treatment. If they are growing or become painful, they may be surgically removed and should not regrow. Perianal Adenomas Perianal adenomas are benign growths common in older, unneutered male dogs. They grow from oil glands near the anus but can also occur in similar glands along the abdomen, on the back, and near the tail. These commonly show up as multiple small lumps. Larger tumors may develop bleeding ulcerations and can compress the anal canal, making it difficult for your dog to poop. Almost all male dogs are cured by castration alone, but large or ulcerated tumors may also be surgically removed. Females improve with surgical removal, but the growths often recur. Laser surgery or freezing the growth may be necessary to avoid fecal incontinence when surgery involves the anal sphincter. Hemangiomas Hemangiomas are benign tumors that occur in adult dogs and closely resemble blood vessels. You usually see them on a dog’s legs and trunk. They may be single growths or multiple, compressible, reddish-black circular lumps that can resemble a blood blister. Some may become large and even ulcerate. The recommended treatment is surgical removal. Nevus A nevus is a dark raised or flat benign growth on the skin, commonly called a mole. These are found on areas prone to trauma, such as the legs, head, and neck, usually in older dogs. Treatment is surgical removal. Trichoepitheliomas Trichoepitheliomas are small, benign lumps that pop up from the hair follicles of adult dogs. They are cyst-like and filled with condensed, yellow, cheesy, granular material. They can occur anywhere on the body, but especially on the face and trunk. Treatment is surgical removal, but they are likely to continue to form at other locations, even after surgery. Cornifying epitheliomas Cornifying epitheliomas are benign growths that stick up from the skin surface and look like horns. They arise from hair follicles and may form anywhere on a dog’s body, but they are more common on the back, tail, and legs of adult dogs. No treatment is necessary unless there is evidence of self-trauma, ulceration, or secondary infection. Surgical removal is the ideal treatment. Basal Cell Tumors Basal cell tumors are benign growths that develop on the head, ears, neck, and forelimbs of older dogs. They are raised swellings that are typically firm, solitary, dome-shaped, and small. Some may be hairless, ulcerated, and stick out like stalks from the surface of the skin. They are dark in color and may form cysts that break open and drain fluid or pus. Treatment is surgical removal, especially when the dog is uncomfortable. Malignant Tumors Malignant tumors are cancerous growths that can invade tissue and spread to organs. Angiosarcomas Angiosarcomas are highly malignant blood vessel tumors that may vary in appearance. One or more red lumps in the skin or underlying soft tissue are commonly seen, but they may also appear as a poorly defined bruise. All types grow rapidly and destroy surrounding tissue. They also spread to the lungs and liver. Angiosarcomas may occur in response to sun exposure in dog breeds with short, white coats, but dogs with dark, thick coats can develop them as well. They usually form on the underside of the trunk, hip, thigh, and lower legs. A biopsy is required for a diagnosis. Freezing and laser surgery can help control smaller surface tumors. Surgical removal is needed for tumors below the skin’s surface. Chemotherapy may also be recommended to treat any remaining tumor cells. Basal Cell Carcinomas Basal cell carcinomas are flattened or raised growths that appear anywhere on the body of an older dog. They may spread to surrounding skin, forming new ulcerations, but they rarely spread to other organs. Surgical removal is recommended, including enough skin around the tumor to ensure that no tumor cells remain. Liposarcomas Liposarcomas are rare but may develop in older male dogs on the chest and legs. They can be soft or firm lumps that are slow to spread to other locations. Treatment is surgical removal, but recurrence is common. If this happens, radiation treatment may also be required. Lymphosarcoma Lymphosarcoma rarely develops directly on a dog’s skin but may be seen as a surface tumor or along with internal tumors. It can look like flaky skin, red patches, raised and ulcerated areas, or lumps deep within the skin. There are two forms of skin lymphosarcoma that differ in their expected progression and response to treatment, so it is important to determine which type your dog has early on. Treatments include surgical removal, chemotherapy, and radiation, done separately or combined. These treatments may improve the signs of the disease but do not lengthen the dog’s life expectancy. Mast Cell Tumors Mast cell tumors are the most common malignant tumor seen in dogs. They often affect older dogs but can occur in dogs of any age. They develop solitary growths anywhere on the body, especially the limbs, lower abdomen, and chest. Larger or rapidly growing tumors and those in certain locations are more likely to spread. Their appearance can greatly vary, but most are raised and either soft or firm to the touch. Your vet will need to examine a sample of cells from the growth under a microscope to confirm a diagnosis. There is variation on how aggressive these tumors are. Surgical removal is necessary. If the tumor regrows or spreads, other treatments, including chemotherapy and radiation, may be used. Malignant Melanomas Malignant melanomas are another type of skin tumor of older dogs. They commonly develop on the lips, mouth, and nail beds of male dogs. They appear as raised, ulcerated lumps and may be dark, light gray, or pink. If they appear in the nail bed, the toe is often swollen. These tumors grow quickly and may spread quickly to other organs. Complete surgical removal is the preferred treatment, but it may be difficult and involves removal of adjacent tissue to prevent recurrence. Chemotherapy and radiation are not effective treatment options. A vaccine is available that helps shrink the size of the tumor, which may prolong your dog’s life expectancy. Fibrosarcomas Fibrosarcomas are common, fast-growing malignant tumors in dogs. Most are on the trunk and legs and vary in appearance and size. Those under the skin’s surface appear lumpy, while those deep under the skin may be firm and fleshy. They can invade underlying muscles, but most do not spread to other areas of the body. Treatment consists of surgical removal, though complete removal may not be possible, and regrowth is common. Fibrosarcomas may also be treated with radiation and chemotherapy. Squamous Cell Carcinomas Squamous cell carcinomas can be found in two places on a dog: on the surface of the skin or under a nail. Most appear as firm, raised, irregular, and ulcerated areas. Many are solitary, but areas of prolonged sun exposure may produce multiple tumors. These growths invade surrounding tissues. Some are slow to spread, while others grow more rapidly. Treatment involves complete surgical removal of the tumor along with some normal tissue. What to Do If You Find a Lump or Bump on Your Dog When you find a growth on your dog, have your vet do a physical exam. It’s helpful to note the location of the lesion, how long it’s been there, any changes that have occurred since you first noticed it, and whether your dog seems bothered by the growth. How Vets Diagnose Lumps, Bumps, and Cysts on Dogs A sample of cells may need to be taken and evaluated under a microscope for a diagnosis. This can come from taking an impression of the surface of the growth, using a syringe and small needle to withdraw a small sample of cells in the exam room (fine needle aspiration), or surgically removing a small tissue sample (biopsy) while your dog is under local or general anesthesia. Most veterinarians evaluate impression smears or fine needle aspirates by staining the slide and examining it under a microscope in the veterinary office. Trained veterinary pathologists are available to analyze these same samples or small tissue samples to determine a diagnosis. Then your vet can determine the appropriate treatment recommendations and explain the expected outcome. Treatment for Dog Lumps, Bumps, and Cysts on Dogs Options for treatment of a growth on a dog may include: Monitoring for changes Removal by freezing or laser treatments Surgical removal of the lump with or without also removing some normal tissue Chemotherapy Radiation How to Monitor Your Dog’s Lumps and Bumps Keep a log where you write down when you first noticed the lumps and/or bumps, how many there are and where they are located, the size, color, and texture, whether it’s moveable or seems to be fixed to underlying tissue, and whether there is any discharge present. Take pictures and note any changes from day to day in any of these factors. Make an appointment with your vet as soon as possible and bring your log and photos along with any questions you may have."}]