[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Seizures in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-11/seizures-in-dogs_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-11/seizures-in-dogs_0.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, Seizures, Symptom, Symptom Checker, Seizures", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/dog-seizures"}, "datePublished": "November 17, 2022", "dateModified": "September 12, 2023", "description": "Seizures can be scary to watch, especially when your dog has never had one before. Dr. Jennifer Coates explains what a seizure could mean and what you should do if your dog has one.", "articleBody": "A seizure is caused by a sudden surge of uncontrollable electrical activity within the brain. Exactly where in the brain that electrical activity occurs and how much of the brain is involved determines what pet parents witness when a dog has a seizure. Dogs who are having seizures need veterinary attention. Left untreated, seizures tend to get worse, which can lead to permanent neurological damage or death. But with appropriate care, many dogs who have seizures can live long and happy lives. Seeing your dog shake or have any type of seizure is scary, and in the moment, you probably don’t know what to do to help. This guide will explain what a seizure looks like, the types and causes of seizures, what to do if your dog has one, and how they are treated. Seizures vs. Tremors vs. Shivering Sometimes what looks like a seizure may not be a seizure at all. It’s easy to mistake muscle tremors or even shivering for seizures in dogs, because they can all involve uncontrollable muscle movements. Evaluating a dog’s mental status will sometimes, not always, help you differentiate between seizures and muscle tremors or shivering. When a dog experiences muscle tremors or shivering, they are still fully aware of their surroundings. Most types of seizures, however, will affect a dog’s ability to sense and respond to the world around them. They may be unconscious, just seem “out of it,” or anything in between. However, some types of seizures don’t affect a dog’s mental status, which makes them difficult to diagnose. If you can, take a video of your dog during one of their episodes and show it to your veterinarian. This will help the doctor figure out what is going on. Types of Dog Seizures So, what are dog seizure symptoms? That depends on the type of seizure the dog is experiencing—generalized or partial. Generalized Seizures When most of a dog’s brain is affected by abnormal electrical activity, they will experience generalized seizures. This is what people usually picture when they think of seizures. Generalized seizures can be divided into three phases: Pre-ictal phase (aura): Before the seizure, many dogs seem to experience what is commonly known as an aura. People who have seizures often describe unusual sights, smells, or other sensations in the seconds or minutes before a seizure. Dogs probably experience something similar and may become restless, exhibit unusual behaviors, or stare vacantly into the distance. Ictal phase: This is the seizure itself. Dogs usually experience tonic-clonic (also called grand mal) seizures and have the following symptoms: They are completely unaware of their surroundings. They fall over and become stiff. They paddle their limbs. They may urinate or defecate. It’s also possible for dogs to experience these types of seizures: Generalized tonic seizures (stiffness without paddling) Generalized clonic seizures (paddling without stiffness) Generalized seizures without stiffness or paddling (sometimes called petit mal seizures), during which they simply lose consciousness for a period of time Post-ictal phase: After the seizure has ended, dogs will go through a post-ictal phase when they can be dull, lethargic, restless, unsteady on their feet, or even temporarily blind. The post-ictal phase usually lasts for a few minutes to a few hours, with longer and more severe seizures usually leading to a longer and more dramatic post-ictal phase. Partial Seizures Unlike generalized seizures, partial seizures involve abnormal electrical activity in just one or a few parts of the brain. Dogs experiencing partial seizures often exhibit unusual movements that are limited to a specific part of their body. For example, one leg may kick repeatedly, or they may have signs like lip licking or fly biting (snapping at the air). The terms “focal” or “partial motor” seizure may be used to describe the situation if the dog doesn’t seem to experience any mental changes during the seizure. Partial seizures that do involve a change in awareness are sometimes called complex partial seizures or psychomotor seizures. Dogs can have pre-ictal and post-ictal phases with partial seizures, but the signs tend to be milder than those associated with generalized seizures. What Causes Seizures in Dogs? Many health problems can lead to seizures in dogs, including: Infection or inflammation of the brain Cancer affecting the brain Head trauma Hypoglycemia (low blood sugar) Liver disease Hypocalcemia (low blood calcium levels) Kidney failure Low blood oxygen levels Lead toxicity Organophosphate toxicity Antifreeze poisoning Hydrocephalus (buildup of fluids in brain cavities) Heatstroke These are just some of the underlying causes of seizures in dogs. But when dogs have reoccurring seizures and a thorough health workup doesn’t identify an underlying cause, veterinarians will usually diagnose them with primary epilepsy. Some causes of seizures are more common at certain life stages than others. For example, hydrocephalus and hypoglycemia typically affect puppies, while brain cancer is more commonly diagnosed in older pets. Dogs with primary epilepsy usually first develop seizures when they are 1-4 years old. Are Certain Dog Breeds More at Risk for Seizures? The reasons why some dogs develop primary epilepsy are not fully understood, but genetics is certainly involved. Any dog can have seizures, but the following breeds are at a higher-than-average risk for developing primary epilepsy: Schnauzers Basset Hounds Collies German Shepherds Border Collies Australian Shepherds Keeshonden Belgian Tervurens Beagles Bernese Mountain Dogs Irish Setters Saint Bernards Poodles Wire Fox Terriers Cocker Spaniels Labrador Retrievers Golden Retrievers What To Do When a Dog Has a Seizure If you think your dog is having a seizure, the first step you need to take is the hardest—don’t panic! Most seizures only last for a minute or so and don’t cause any long-term damage. But there are times when seizures can be dangerous. Get to a veterinarian immediately if your dog experiences any of the following: A seizure that lasts longer than 5-10 minutes Seizures that cluster together and don’t give the dog enough time to recover in between More than two seizures in 24 hours During the seizure, simply remove anything from your dog’s surroundings that might pose a risk (a lamp that might be knocked over, for example) and let the seizure run its course. If your dog is in a risky situation, like at the top of the stairs or in the street, try to gently move them to a safer spot. Don’t put anything in your dog’s mouth, because you may inadvertently make it hard for them to breathe. Honey, maple syrup, or sugar water will help dogs only if they are having seizures due to low blood sugar levels. After the seizure is over, keep your dog in a safe area and monitor them until they come out of their post-ictal phase. Once they are steady on their feet and are mostly back to normal, you can give them a little water and take them outside for a potty break. Wait a bit longer before you offer some food. How Vets Find the Cause of Your Dog’s Seizures Dogs that have had a seizure for the first time should be seen by a veterinarian. The doctor will need to look for any underlying health problems that could have caused the seizure. The diagnostic process for seizures starts with a thorough health history, a physical examination, and a neurological examination. This will probably be followed by bloodwork, a urinalysis, and a fecal exam. Depending on the results, the veterinarian may also recommend specialized laboratory tests, taking a sample of cerebrospinal fluid for analysis, or an MRI or CT scan. Treatments for Dogs With Seizures Whenever possible, veterinarians will prescribe treatments for any underlying health problems causing the seizures. But when seizures continue or when a dog has been diagnosed with primary epilepsy, anti-seizure medications may be necessary. In general, veterinarians will prescribe medications to control seizures when dogs have: Seizures more frequently than every 4-6 weeks Seizures that last longer than 5 minutes or so Seizures that cluster together Required hospitalization for seizures Many medications can help reduce the severity and frequency of seizures in dogs. Phenobarbital and potassium bromide are two relatively inexpensive first-line treatments. If those are ineffective, veterinarians can prescribe other anti-seizure medications such as zonisamide (Zonegran), levetiracetam (Keppra), gabapentin (Neurontin), and pregabalin (Lyrica). Sometimes anti-seizure medications can be combined for better effect. Veterinarians may also prescribe diazepam (Valium) or similar medications to be given on an emergency basis if a dog experiences a severe seizure. Dogs with primary epilepsy or those that continue to have seizures despite treating underlying diseases often need to take anti-seizure medications for the rest of their lives. The goal of treatment isn’t necessarily to eliminate seizures. It may be better to reduce seizures to a level where they don’t interfere with a dog’s quality of life and to minimize medication side effects, like sedation or increased thirst and urination. Your veterinarian will need to regularly monitor your dog’s drug levels and bloodwork to ensure that treatment is as safe and effective as possible. It’s also a good idea to keep a seizure diary at home, so you can quickly note trends in seizure frequency and severity. Featured Image: iStock/gradyreese"}]