[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Dog Teeth Chattering: What You Need to Know", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog.teeth_.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2021-12/dog.teeth_.jpg"}, "author": {"@type": "Person", "name": "Heidi Kos-Barber, DVM", "url": "https://www.petmd.com/author/dr-heidi-kos-barber"}, "keywords": "Dog, Symptom", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/dogs-and-teeth-chattering-what-you-need-know"}, "datePublished": "December 30, 2021", "dateModified": "August 11, 2022", "description": "Dr. Heidi Kos-Barber explains dog teeth chattering, what teeth chattering could indicate, and when to take your dog to the vet.", "articleBody": "When you think of teeth chattering, you might picture someone who is cold or really nervous. But what about teeth chattering in dogs? If your dog’s teeth or jaws are chattering, are they just really cold or nervous, or is there something else going on that you should have checked out? Here’s what you need to know about the causes of dog teeth chattering and what you should do about it. Why Are My Dog&#039;s Teeth Chattering? Several different health problems can cause your dog’s teeth to chatter. A veterinarian can do a thorough exam to determine the cause. Here are some of the causes behind teeth chattering in dogs. Dental or Oral Pain One of the most common causes of teeth/jaw chattering in dogs is oral cavity pain or dental pain. A dog with a broken tooth, dental abscess, or gingival inflammation can be in pain, which manifests as jaw chattering. Oral ulcerations or growths (cancer), which don’t necessarily involve the teeth, can also cause pain and teeth chattering. If your dog has a dental or oral issue, they may also: Drool excessively Have bad breath (a sign of infection) Have trouble picking up and manipulating food Prefer softer food or treats instead of hard bones or dry food Your veterinarian will perform an oral exam to look for evidence of dental disease and soft tissue inflammation and make recommendations based on what is found. Temporomandibular Joint (TMJ) Dogs with pain in the temporomandibular joint (TMJ) may also exhibit jaw chattering. If a dog has a jaw fracture or arthritis involving the TMJ, they may show similar signs to a dog with oral pain or disease. Your veterinarian will open and close your dog’s mouth to feel for grinding or resistance to movement of both TMJs. If TMJ disease is suspected, imaging such as x-rays or computed tomography (CT) may be recommended.  Gastrointestinal Issues Gastrointestinal problems can also cause jaw chattering. Dogs with nausea, vomiting, or gastroesophageal reflux may chatter their jaws or grind their teeth. If your dog’s jaw is clenched, their teeth can rub together, causing grinding. They may also drool. Your veterinarian may recommend performing lab work and imaging, such as ultrasound or endoscopy (a camera scope fed into the GI tract). Anxiety Anxiety can result in jaw chattering behavior in dogs, too. Greyhounds will commonly have chattering teeth during routine exams because they are nervous. Once a dog is out of the stressful situation, their jaw chattering usually stops.  Seizures Neurological conditions, such as focal seizures (seizures that only affect a specific area in one half of the brain), may show up as jaw chattering or even fly-biting behaviors. Unlike the other causes for jaw chattering, dogs with seizure activity usually won’t respond to you. With seizure activity, a dog tends to “space out” and not respond when you try to get their attention (calling their name, clapping, etc.). Your dog may show specific signs before or after a seizure. For example, just before the seizure, your dog may pace or become clingy, and after the seizure, they may be tired. Your veterinarian may ask you to try to get a video of your dog’s behavior and note the circumstances surrounding the seizure (level of activity, time of day, duration, etc.) to rule in seizure activity as a potential cause for jaw chattering. Pheromones Some dogs, especially intact male dogs, may chatter their jaws/teeth after smelling a female dog. However, female dogs can do this too. The thought is that the pet is trying to smell the scent better by bringing the odors into the scent organ at the roof of their mouth. When this happens, there may also be salivation that is sometimes foamy. Ear Infection or Inflamed Muscles Less commonly, dogs in pain from ear infections or muscle inflammation may have jaw chattering. Your vet will be able to verify either of these through a physical exam. Further testing such as x-rays, CT, or special bloodwork may be recommended.  What to Do If Your Dog&#039;s Teeth Are Chattering You should be concerned if your dog’s teeth/jaw chattering is associated with: Bad breath Swelling around/in the mouth Drooling Bleeding Decreased or no appetite Weight loss Loss of muscle tissue  If you have a concern about your dog’s teeth/jaw chattering, make an appointment with your veterinarian. They will likely be able to find the possible cause based on the exam alone and will make recommendations to help treat the underlying problem. Featured Image: iStock.com/ELizabethHoffmann"}]