[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/b3yabhvy56", "@type": "VideoObject", "duration": "PT2M6S", "name": "5349691153001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/165620a97b31661be21aeb15f575f0c7396bb4bf.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/b3yabhvy56", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/9940e5e42f6ace76b5d427f6a4c8d7c90cef94f3.m3u8", "transcript": "The symptoms of upset stomach and dogs generally vomiting and diarrhea are not uncommon for our canine Companions to experience every once in a while an upset stomach may occur if a dog eat something unfavourable is stressed or has sensitivities to certain foods. If your dog is experiencing mild vomiting and diarrhea at home. There are some things that pet parents can do to help. It's important to note that if you notice blood in your dog's vomit or feces or if your dog's vomiting increases in frequency you should seek that injury care immediately.\n\nAs these can be signs of a serious medical problem. Additionally, if your dog doesn't have an appetite or lacks an energy a visit to your vet nearing is recommended for mild upset stomachs and dogs. Pet parents can try withholding food and allowing your pup to fast for 12 to 24 hours. This will help his digestive system work through the problem after the fast.\n\nYou can slowly reintroduce your dog's food if your dog still has trouble digesting his food. Consider feeding him a bland diet of boiled chicken and cooked white rice for a couple of days before adding his regular dog food back into the rotation. If your dog is having a difficult time keeping down water try providing him with some easy to chew ice chips every two to three hours. If he successfully keeps the ice chips down slowly allowing the drink small quantities of water before working back up to a full boil.\n\nIt's important to keep dogs with upset stomachs well hydrated. In addition to water. You can also add a small amount of organic sodium free chicken broth to his water to help encourage him to drink. If a dog is experiencing diarrhea or constipation as the result of an upset stomach.\n\nPet owners can offer him a small amount of plain canned pumpkin not pumpkin pie filling plain canned pumpkin is high in soluble fiber, which helps to coat and soothe irritated bowels. It's also a great source of potassium for dehydrated pets. If your dog's upset stomach symptoms don't subside over a 12 to 24 hour period. It's important to make an appointment with your vet myriad they can help diagnose and treat the problem appropriately.\n\nAnd it may recommend further testing or medications.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/wellness/evr_dg_remedies-for-upset-stomach-in-dogs?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "3 Remedies for Upset Stomach in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Health", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/sick-dog-under-blankets_319235351_0.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/sick-dog-under-blankets_319235351_0.jpg"}, "author": {"@type": "Person", "name": "Katherine Smith, DVM, CVA, CVSMT", "url": "https://www.petmd.com/author/dr-katherine-smith"}, "keywords": "Dog, Digestive health, Diarrhea, Vomiting", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/wellness/evr_dg_remedies-for-upset-stomach-in-dogs"}, "datePublished": "August 3, 2020", "dateModified": "September 8, 2023", "description": "What causes upset stomach in dogs, and how can you help your pup feel better? Find out how to help soothe your dog&#039;s upset stomach and when to call the vet.", "articleBody": "When you have an upset stomach, you probably reach for ginger ale or crackers to settle your tummy. But what should you do when your dog’s stomach is out of sorts? Here’s some information about the causes and symptoms of upset stomach in dogs and tips for how to make your pup feel better with natural remedies.  Common Causes of Upset Stomach in Dogs There are many reasons your dog may have an upset stomach, though there’s one common cause: they ate something they shouldn’t have, says Kathy Backus, DVM, at Holistic Veterinary Services in Kaysville, Utah. “Dogs are curious like kids; they’re always putting things in their mouth,” she says. “Vomiting and diarrhea are signs that a dog’s body is trying to expel something that shouldn’t be in their system. In a healthy dog, it’s a protective mechanism of the body that’s totally normal.” These are a few (of many) things that can trigger an upset stomach in dogs: Ingesting something that they shouldn’t Bacterial imbalances within the digestive tract Chronic conditions such as food sensitivities Symptoms of Upset Stomach in Dogs The most common signs of upset stomach in dogs are diarrhea and vomiting. If your dog is nauseous, you may also see him eat grass to soothe his stomach or try to induce vomiting, says Jody Bearman, DVM at Anshen Veterinary Acupuncture, Madison, Wisconsin. Watch for other signs of upset stomach in dogs, such as: Decreased appetite or loss of appetite Fatigue Drinking less water Seeming depressed Looking uncomfortable and stretching more often (like they are attempting a downward dog) Gulping to combat reflux Licking their lips, the air, or objects When to Call Your Vet Monitor your pup’s symptoms. If your dog is consistently uncomfortable, or if the signs worsen at any point, call your veterinarian. Watch for these signs: Increasing discomfort Vomiting or having an episode of diarrhea more than twice Blood in their vomit or stool Toy or other foreign object in their vomit or stool Weakness or collapse These can all be signs of something more serious, including pancreatitis, stomach bloating, a severe allergic reaction, or internal parasites. If you realize that your dog has eaten something he shouldn’t have—a plant, food, toy, or chemical—you should seek immediate veterinary care. If your primary veterinarian is unavailable, call your local emergency veterinary hospital. They will be able to advise whether your pet needs to be seen or whether you can continue to monitor him at home. You can also call the ASPCA Animal Poison Control hotline at 888-426-4435 for a fee. They can also determine a poison’s level of toxicity and recommended care for your dog. 3 Remedies for Upset Stomach in Dogs It is crucial to consult with your veterinarian before administering any home remedies to soothe your pup’s tummy troubles. If your veterinarian recommends at-home monitoring, these are a few ideas you can ask them about trying while you are at home with your dog. Fasting When your dog’s stomach is trying to get rid of something, it can be helpful to stop putting more things in their stomach for 12-24 hours, Dr. Backus says. “If the gastrointestinal (GI) system is having a tough time, you don’t want it to digest things.”  Fasting may seem simple enough, but it’s important to speak with your veterinarian first because some dogs (particularly small breeds or those with prior health conditions) cannot tolerate fasting as well as others. If your veterinarian does recommend fasting, ask whether they would like you to start a bland diet (and what they recommend) after the fasting period is complete. Ice Cubes When your dog is vomiting or has diarrhea, you want them to stay hydrated, but giving him too much water may make his stomach even more upset, Dr. Backus says. Monitoring your dog’s water intake and discouraging gulping is important. Offer your dog ice chips to help encourage drinking. If your dog can keep down small quantities of water or ice chips, you can gradually increase the amount and how often you are offering the water and ice. Canned Pumpkin When fighting indigestion and upset stomach in dogs, 100% canned pumpkin is a favorite of many holistic veterinarians. “It has a low glycemic index, so it slowly absorbs, which helps with upset stomach and digestion,” Dr. Bearman says. Make sure to get 100% canned pumpkin, not pumpkin pie mix, as you don’t want to feed your dog spices and other ingredients, she says. Check that there are no ingredients listed other than pumpkin (such as sugar or sugar substitutes). According to Dr. Bearman, smaller dogs (approximately 5 pounds) can be fed one-half teaspoon of canned pumpkin, while larger dogs (approximately 75 pounds) can be fed 1 tablespoon. Is Upset Stomach in Dogs a Sign of Food Allergies? An upset stomach every once in a while can be normal in a dog, but if it happens often, it could signal that something is wrong in their GI tract, says Randy Aronson, DVM, of P.A.W.S. Veterinary Center in Tucson, Arizona. If digestive upset is a frequent occurrence for your dog, discuss the possibility of a food allergy with your veterinarian. When food allergies are diagnosed in dogs, it is often an allergy to a protein source, which is why a more “novel” protein (one that your dog has never eaten) may be recommended. There are many options on the market, but examples may include beef, buffalo, venison, or lamb. How to Help Prevent Upset Stomach in Dogs To help your dog maintain a healthy gut, consider giving them a prebiotic and probiotic, Dr. Aronson says. There are both prebiotics and probiotics that are made specifically for dogs, some of which are available over the counter. Be sure to ask your veterinarian if they have a particular brand recommendation. Always talk to your veterinarian first to find out the best course of action. Featured Image: Shutterstock/Igor Normann"}]