[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/f94i96og46", "@type": "VideoObject", "duration": "PT2M41S", "name": "5612837399001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/69e059cb040ccf8ffdda2fce1ed16a842ccad45f.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/f94i96og46", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/fe196c8b31601a2195447d4a0e1c07e3feded310.m3u8", "transcript": "Chewing and digging are normal, natural behaviors in dogs. But when our canine Companions destroy household items like furniture shoes and carpets it can be pretty frustrating. If your dog has destructive tendencies you first need to identify the underlying cause destructive behavior in dogs might stem from inadequate supervision lack of daily exercise or the wrong types of chewing outlets. However, in some cases destructive chewing can be a sign of a behavioral problem that requires a medical diagnosis.\n\nFor example, separation anxiety can manifest in destructive behavior. In addition to chewing household items your dog may also destroy doors and windows or go to the bathroom in the house even though he's house trained dogs with separation anxiety will wait until you've left the house to start destroying things and the symptoms will occur almost every time you're gone. In other cases storms loud noises and other stressful situations like nearby construction activity can set off your dog's symptoms. Signs of fear related destruction include panting pacing shivering and hiding.\n\nThese symptoms may be worse when you're not there to comfort your dog. Your veterinarian will perform a full exam to rule out any physical conditions that may be linked to your dog's destructive behavior. If your doctor finds a medical problem. She'll treat the illness first in the hopes that it will resolve the behavioral issue.\n\nIf your dog is otherwise healthy typical destructive behavior can usually be addressed through prevention training and increased exercise directing your dog to a variety of treat stuff rubber toys or safe bones can also help to reduce destructive behavior household destruction that stems from separation anxiety will require a combination of behavior modification training and medication your veterinarian may prescribe an anti anxiety medication to help your dog respond to training. Once you and your dog have work through behavior modification protocols you might be able to decrease and eventually stop the medication.\n\nPatience is key as your dog learns to move past his destructive behavior. Now training may take several months or more. Some dogs with well-established destructive behaviors may need long term medication and training until they feel confident. It's important to start to training at an early age.\n\nSo your dog can understand what he can and can't chew on. It's also important to gently socialize your dog to a variety of people, animals, and situations at his own pace while he's still young. Waiting until your dog is older could bring on excessive shyness anxiety or protective behaviors. If you notice any surprising changes in your pets behavior.\n\nIt's best to address them immediately. Treating medical or behavioral problems quickly will make life easier for you and your dog.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/behavior/how-to-stop-dogs-from-chewing-and-scratching-everything?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Training & Behavior", "item": "https://www.petmd.com/dog/behavior"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Keep Your Dog From Chewing and Scratching Everything", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-04/dog-chewing-furniture.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-04/dog-chewing-furniture.jpg"}, "author": {"@type": "Person", "name": "Jeannine Berger, DVM, DACVB, DACAW, CAWA", "url": "https://www.petmd.com/author/dr-jeannine-berger"}, "keywords": "Dog, Adult, Puppy, Destructive Behavior, Symptom Checker, Destructive Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/behavior/how-to-stop-dogs-from-chewing-and-scratching-everything"}, "datePublished": "April 27, 2023", "dateModified": "September 12, 2023", "description": "Is your dog destroying your house? Find out what’s behind this behavior and how you can stop it with helpful tips from a certified veterinary behaviorist.", "articleBody": "There’s no doubt that canines can cause destruction to your home and yard, depending on their size and breed. Although this is quite frustrating, destructive behavior in dogs has many different motivations. It could be normal canine behavior, and “fixing” it could be as easy as offering a dog more mental and physical enrichment. On the other hand, it could be very complex and require an immediate consultation with a veterinarian or veterinary behavior specialist to address any underlying anxieties. To address this behavior, you’ll need to become a behavior detective and observe your dog closely. Try to find out how they destroy things, what they destroy, and when they do it so you can make a plan to prevent future incidents. Let’s begin with the how. Is Your Dog Destroying Things With Their Teeth and/or Claws?  Dogs primarily destroy things with their teeth or their claws. They can also destroy property by urinating and defecating, but for this discussion, let’s focus on their teeth and claws. In some situations, they will use either or both to reach their objective. The objective may indeed be destruction of a certain item, but that’s not necessarily the only reason for a dog to dig their teeth into an object. More often the not, dogs will destroy things while in the process of completing a different objective. Since property and items can get destroyed for different reasons, we need to gather more information to determine if it may be play behavior, curiosity and natural seeking behavior, predatory behavior, escape-motivated, or anxiety-related. What Is Your Dog Destroying and Where Is It Located?  To find the reason for the destruction, we need to know what is getting chewed up or scratched. This often gives insight to the underlying motivation or reason. Is it loose random items that are lying around the house and freely available to your dog? Does your dog tend to pick the same type of items, such as shoes, books, or the remote control? Or are these specific personal things, like your clothes, for example? Is there a preference for a specific texture, or is it a certain type of fabric? Is it a specific location or item, like the leather couch by the window, or is it the home itself, like the door frames, window areas, or a specific wall in the kitchen?   When Is Your Dog Chewing and Scratching Everything? When is the destruction happening? Is your puppy grabbing something and chewing on it when you’re not paying attention, and by the time you look up, the item is destroyed? Does your dog scratch and bite at the door frames only when you’re leaving your home? Or do they dig and chew in the couch cushions or your flower bed whether you’re home or not? How to Keep Your Dog From Destroying the House Equipped with your observations on the How, What, and When, you can make a plan to manage the situation. All these little details will give you clues to help prevent destruction in the future and understand when to seek professional help in case your dog has an anxiety-related condition. Rule Out Medical Issues Any dog that’s chewing things up should be evaluated by a veterinarian to rule out underlying medical reasons such as dental problems; pain; metabolic, gastrointestinal, or skin conditions; or even pica. This is especially important if a dog has a sudden change in behavior. It’s also important to have your dog’s teeth checked, as some dogs hurt themselves and have gum problems or even cracked teeth from destructive chewing. Rule Out Anxiety Although it’s very frustrating when your property gets destroyed, it’s also very important to make sure your pet is OK. That’s why the next step is to rule out anxiety-related behavior issues that can be quickly addressed by a veterinarian or veterinary behavior specialist. Animals that are anxious often destroy items to cope with a less than ideal situation. They may try to escape and get hurt or lost in the process. If your dog is destroying things only when left alone and the destruction is mainly around exit areas such as doors or door frames, this could be due to separation anxiety. If you find that your dog has destroyed items while you were out, don’t wait to act. Immediately try to further evaluate your dog’s destructive behavior by setting up a camera to watch your dog when you’re gone. If you see other anxiety-related behaviors happening while you’re gone, such as panting and pacing, your dog may have separation-related issues and will need further evaluation. Seek help from a veterinarian right away if this is the case. A specific behavior-modification plan can be designed, and your dog may also need medications to help alleviate their anxiety when you are away. Add Some Enrichment When You’re Gone Separation anxiety is different from a situation where a dog has destroyed the same items while you were home, but you previously told them no, so they stopped doing it while you were around. Instead, your dog has learned to dig into the couch, for example, while you’re not home. Your dog may remove the couch cushion with their teeth and tear it in the process just to find that one lost Dorito or the few pizza crumbs that made their way between the seat cushions. In this case, getting to the food is the objective, and your couch has just become a giant food-dispensing toy. The destruction here shows how determined your dog is to get to what they want. Another common scenario is if your dog digs a hole in the flower bed or yard to hide their favorite toy or bone. These digging dogs will not seem anxious. Instead, they seem focused, determined, busy, and even happy. If this is the case, your dog may require some confinement and enrichment while you are gone. Food enrichment or a digging pit with sand may be just what you need to prevent this from happening again. Give Your Dog Exercise, Attention, and Mental Stimulation If a dog destroys items when you’re at home, does it happen when you’re busy? This happens more lately, especially with more people working from home who are occupied with 2-hour Zoom meetings. Your dog may just be bored or wanting to get your attention by grabbing your shoe or the remote control. In this case, give your dog a good exercise session before meetings and a stuffed KONG during them. If a dog grabs and destroys items whether you are home or not and the items seem to be random things, this may indicate natural canine seeking behavior. Control your dog’s environment by tidying up your house, putting things away, or limiting your dog’s access to certain areas of the home. At the same time, make sure to offer enough enrichment and opportunity for your dog to chew, dig, and destroy things that are allowed. For example, ditch the food bowl and offer food only in food-dispensing toys. Use boxes to offer your dog something they can dig into with their teeth and claws and find a treat hidden inside. Remove Outside Triggers And then there is the dog that will destroy items such as curtains, a couch, or even a wall next to a large window where they can see outside cats, squirrels, or other dogs. This type of behavior can happen because your dog is confined inside and wants to go outside and either chase or play with what they see. This may be play, territorial, or even predatory behavior that’s prevented from happening, which may cause your dog to want to escape. A determined dog will do what they can to get outside, and in the process, they end up destroying your home. Or your dog could be so anxious and worked up that they redirect their feelings toward items close by in your home. There was a case where a Terrier tore into a wall because there were mice behind the drywall, and this dog was determined to not let them get away. In that case, rodent prevention was the solution, but if dogs show that type of destructive behavior, you want to prevent them from having access to those areas. This means closing off a certain room, using a barrier like a pet gate or an x-pen, or even putting up other visual barriers to prevent the dog from seeing outside. At the same time, you want to teach your dog different behaviors, such as sitting on the bed and staying calm. A positive-reinforcement trainer can make a plan to teach your dog alternative behaviors and reward your dog for calm behavior. Never Punish Your Dog   If your dog destroys things, don’t yell at or hit your dog. This will not “teach” them to stop the behavior, especially not after the fact, and it will have a negative effect. If your dog destroys items because they are anxious, punishment only makes things worse in the long run by setting training back, making your dog’s anxiety and fear worse, and breaking the human-animal bond. If you catch your dog in the act, interrupt the behavior by calling their name and redirect their attention to something more appropriate, such as a toy or a stuffed KONG.   Featured Image: Adobe/Photoboyko"}]