[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Diseases A-Z", "item": "https://www.petmd.com/dog/conditions"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "What are the stages of DIC in dogs?", "acceptedAnswer": {"@type": "Answer", "text": "There are two forms of DIC, acute and chronic. Acute DIC is the most dangerous form and can result in blood clots, organ failure, bleeding, and death. Both forms of DIC are caused by an underlying disease or condition that should be identified and treated as quickly as possible."}}, {"@type": "Question", "name": "What is the survival rate of dogs with DIC?", "acceptedAnswer": {"@type": "Answer", "text": "Approximately 40% of dogs diagnosed with DIC survive. DIC is a severe, life-threatening condition which should be treated immediately for the best possible outcome. Featured Image: iStock.com/DuxX"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "DIC (Disseminated Intravascular Coagulation) In Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Cardiovascular", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-07/Dog-getting-IV-medication-at-vet.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-07/Dog-getting-IV-medication-at-vet.jpg"}, "author": {"@type": "Person", "name": "Veronica Higgs, DVM", "url": "https://www.petmd.com/author/dr-veronica-higgs"}, "keywords": "Dog, Condition, Adult, Puppy, Emergency", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/conditions/cardiovascular/dic-disseminated-intravascular-coagulation-dogs"}, "datePublished": "July 28, 2023", "dateModified": "October 6, 2023", "description": "DIC or disseminated intravascular coagulation in dogs is a severe life-threatening blood clotting disorder. If not treated immediately, it can be fatal in dogs.", "articleBody": "What Is DIC in Dogs? Disseminated intravascular coagulation (DIC) is a complex condition. In DIC, clotting in the blood is activated and blood clots can block blood vessels that supply the organs, such as the liver and kidneys, causing decreased blood flow. Organ damage can occur and progress to multiple organ failure, even death.  After all clotting factors are used up, bruising and bleeding from the gums and nose may be seen. DIC is always triggered by an underlying condition and is very difficult to diagnose. In most cases, dogs will likely be hospitalized for an underlying illness and the veterinarian will suspect that DIC has also developed. DIC is considered a medical emergency and should be treated immediately, as it can quickly become life-threatening. If your dog is not already at the veterinary hospital, take them immediately if DIC is suspected.   Symptoms of DIC in Dogs Clinical signs of DIC vary and may be influenced by the underlying condition causing the DIC. Common signs include: Weakness/lethargyBruisingNosebleed (epistaxis)Bleeding from gumsBlood in urineVomiting, may be bloodyDiarrhea, may be bloodyTrouble breathingIncreased heart rateAbnormal heart rhythm (arrhythmia)Decreased blood pressure Causes of DIC in Dogs DIC is always secondary to an underlying disease or condition. In other words, DIC is triggered by another condition. Some of the common conditions known to cause DIC include: Any infection (sepsis)PeritonitisShockPancreatitisImmune mediated hemolytic anemia (IMHA)PneumoniaCancerTraumaDehydrationFeverHeart diseaseHeartworm diseaseGastric dilation-volvulus (GDV)Liver failureCushing’s diseaseSnakebitesHow Veterinarians Diagnose DIC in Dogs Diagnosing DIC can be challenging, since there is no definitive test. Advanced blood tests to assess clotting factors and clotting times may be useful, but the results can be highly variable based on where the pet is on the spectrum of disease.  During the clotting phase, results will differ from the results seen when clotting factors are used up.  Serum chemistry will likely be performed to assess organ function and screen for organ failure.  The complete blood count will be monitored to identify anemia from bleeding. Additional diagnostics will likely be performed to identify the underlying cause that triggered DIC. It may include chest X-rays, abdominal ultrasound, urinalysis, and additional specialized testing. Treatment of DIC In Dogs The underlying condition that triggered the DIC must be identified and treated. Subsequently, treatment for DIC  may include surgery and/or aggressive medical management, including IV fluids, antibiotics, and steroids.  There is no cure or specific treatment for DIC. Additional treatment for DIC will be general supportive care. In most cases, DIC will be diagnosed on a patient already hospitalized. They will need to continue to be hospitalized for IV fluids (to keep them hydrated) and administered supportive care medications to address any symptoms such as vomiting, diarrhea, or pain. Oxygen therapy may be needed for any dogs having trouble breathing. Plasma and blood transfusions may be needed. Recovery and Management of DIC in Dogs DIC is a severe, life-threatening condition that should be treated immediately because it can have deadly consequences. Early diagnosis and treatment of DIC and the underlying condition are vital for a successful outcome and survival. Typically, dogs will require 3-5 days in the hospital (sometimes more) for treatment of the underlying condition and aggressive supportive care. Even with intensive care, the prognosis for survival is typically around 40%. Dogs that do survive may have long-term organ damage and require continued veterinary care, bloodwork, and medications."}]