[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "New Puppy Care: 12-18 Months", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-697888060.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-697888060.jpg"}, "author": {"@type": "Person", "name": "Autumn Madden, DVM", "url": "https://www.petmd.com/author/dr-autumn-madden"}, "keywords": "Dog, Puppy, Wellness", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/new-puppy-care-12-18-months"}, "datePublished": "December 6, 2022", "dateModified": "September 27, 2023", "description": "Dr. Autumn Madden explains the development, feeding, and behavior of puppies during the age of 12-18 months.", "articleBody": "At 12 to 18 months, your puppy may still be in the adolescent stage. While their external growth may have slowed down or stopped, your puppy is still developing socially. During this time, your pup may still have the occasional accident and may ignore commands that are used regularly. Small breed dogs typically reach adulthood around 12 months of age. However, large  and giant breed dogs may not reach adulthood until around 2 years of age. While you may see the milestones listed below in dogs of all breeds, you may see them the most in larger dogs. Development At between 12-18 months old, large breed dogs will still be growing and developing, while small breed dogs typically reach adulthood by 12 months. If you have a large or giant breed dog, it is possible that they may continue to grow and develop; growth plates at the end of long bones may still be open until l 20 months of age. This is important to keep in mind when it comes to the type and duration of activity. While new pup parents may be eager to share the world with them through hiking or running as soon as they are fully vaccinated, it is not advisable until the bones and joints are completely developed. This will reduce the chance of causing joint-related issues by doing too much, too soon. Veterinarians and trainers may recommend activities where your pup can control the pace, such as fetch and exposure to obstacle courses. During this time, your pup’s veterinarian may give you the okay to start short periods of running or hiking. If you notice that your pup is severely lagging behind or panting excessively, it’s time to ease up. Behavior Depending on when your dog was spayed or neutered, they may have already gone through puberty. If you have an unspayed female dog, it is not uncommon for the first few estrus cycles to be irregular. They may become moodier and more lethargic. If your pup is not neutered, they may display signs of marking and humping. Some training may be necessary at this time, because dogs sometimes try to test the limits and boundaries you have established for them. It is important to continue to enforce training lessons and rules of the home if you do not want them to regress. Behaviors that may be considered a red flag and may need more work include guarding of objects or food, selective hearing, and accidents in the home. Reach out to a reputable dog trainer in your area to quickly address these behaviors before they’re harder to break. discourage. Your veterinarian is a great resource to connect you with the right trainer, depending on your needs Nutrition During this period, it’s critical to transition your dog from puppy food to adult food. The standard recommendation for a diet transition is 7-14 days. However, food transitions can take more time, sometimes 3-4 weeks if needed. During a food transition, probiotics can help reduce the risk of GI upset, vomiting, and diarrhea. Ask your veterinarian for their advice. While training and skills are reinforced, it is important to consider the calories that are present in their snacks. The more treats given, the more the diet may need to be adjusted to not overfeed your dog. In adulthood, your dog’s energy requirements have changed because they are not growing as rapidly. Different breeds and cross-breeds come in a variety of shapes and sizes, but there are some basic landmarks you can observe in any dog. They should have an abdominal tuck, and an hourglass-like figure when you look directly down on them. You should be able to feel the last two ribs along their sides with very little pressure.  If your dog does not meet these criteria, it may be helpful to discuss weight management. Training Training should be focused on continuing to reinforce the following commands: Sit Wait Leave it Off Down Place Recall commands During this time, your pup may have a schedule of activities, such as day care, dog parks, hiking, camping, or running. If you worked with a trainer as your puppy has been growing, check in with them for additional reinforcement of commands. Your pup may be able to move on to more advanced techniques such as retrieving their leash, picking up dropped objects or mail, or even circuit training or a dance routine. Around 14-18 months of age, especially in large breed dogs, there is another “fear period” where training should be enforced along with positive support. If your pup is still shy about coming to the vet, it may be helpful to see if it would be okay (and to find an ideal time) to help put your pup more at ease with the route to the veterinary clinic, being brought to the general area the clinic is located and being brought into the veterinary clinic. It may be helpful to grab some of their favorite treats and hang out in or outside the veterinary practice to help acclimate them. Health Conditions If your pup has not been vaccinated, they are susceptible to common diseases including kennel cough, distemper, and leptospirosis. It’s critical to vaccinate your pup early in life to ensure they are protected. A pup who is not on heartworm or flea prevention medications is also susceptible to fleas, ticks, and heartworm-related disease, including intestinal parasites. Chat with your veterinarian to determine the right preventatives for your pet. Vaccinations If your pup has received all their vaccines during their younger months, their time may be coming up again for revaccination. The time frame for distemper and rabies vaccine may depend on state law and when the booster vaccine was due. Vaccines that are boosted yearly include influenza, leptospirosis, and Lyme. The vaccine typically boosted every 6 months is Bordetella."}]