[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/ni63b4k0sl", "@type": "VideoObject", "duration": "PT2M6S", "name": "5327109432001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/ac9d4f1f324d3e1a26404d9851c1101a133474a5.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/ni63b4k0sl", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/598eb6e3126708113960c45eed78c981a5c26ec3.m3u8", "transcript": "Bringing home a new puppy is so much fun. But it can also be a challenge because there is so much to know. One of the most helpful things you can do with your new puppy is establish a consistent feeding schedule. Ideally, you want to feed your dog at the same time every day.\n\nMaybe 7 AM noon and 5 PM. Now those times don't work for you. That's OK. Just make sure that your meals are evenly space out and that you leave enough time after that final meal of the day for a potty break.\n\nThe food you select should take the needs of puppies into consideration. You can even think about it breed specific food like for a friend g.o. here puppy foods generally support digestion the immune system and healthy growth puppies need to eat several small meals a day because their digestive systems are still forming. Depending on your puppy size and age, you'll probably need up to three small meals a day. The general rule of thumb is to cut back to two meals per day at four months for smaller dogs and six months for larger dogs.\n\nBut your vet can give you advice on that. She was a feeding spot for your puppy where you know he's going to feel comfortable and he won't be distracted for some puppies. This is in the crate and the good thing about that is it helps your puppy learn to love his home base in the crate your new puppy is going to have to go out a lot probably more than you realize. So there's no firm rule as to how frequently you should take your puppy out.\n\nBut there is a tip you can follow. Take your puppy's age in months and turn that into hours. And that's roughly how long he can go in between potty trips. So our friend Joe is about nine weeks old, which means he could probably hold it for about two hours.\n\nBut this is just a guideline. It's not a rule. Now remember reprimanding your puppy for accidents in the house will do nothing to help him get potty trained. It will only confuse him about the process and maybe make him a little bit scared of you as well.\n\nBeing positive using treats to reward your puppy when he goes outside and being consistent is what it takes to train your puppy.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/care/your-puppy-months-6-9?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Your Puppy: Months 6-9", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "", "image": {"@type": "ImageObject", "url": ""}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Puppy, General Care", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/your-puppy-months-6-9"}, "datePublished": "September 30, 2013", "dateModified": "August 30, 2022", "description": "Welcoming a new puppy home can be difficult. Here are some early development and training tips for your 6-9 month old puppy.", "articleBody": "by Jessica Remitz  From the moment your puppy is born till he or she becomes an adult, they’re learning, growing and developing into the happy, healthy dogs that will hopefully be a part of your life for the next 10 to 15 years. Prepare to welcome them home — or make the first months together easier — by learning about their early development, care needs and training tips from six to nine months. Puppy Physical Development Puppies between six and nine months are still growing rapidly as they reach their adolescence, or “teenage,” phase. They should have all of their adult teeth at this time, and if any baby teeth are retained you should consult your veterinarian for removal of the remaining baby teeth, says Louise Murray, DVM and vice president of the ASPCA Animal Hospital. These remaining baby teeth may appear as a small tooth crowded next to an adult tooth in the same location. If you haven’t done so already, this is the time to spay or neuter your pup. According to petMD, spaying greatly reduces the chance of mammary cancer and eliminates the possibility of uterine or ovarian cancer, while neutering will decrease the possibility of prostate disease and eliminates testicular cancer in your dog. Spaying and neutering can also help to lessen the development of certain behavioral issues in your puppy as he or she continues to grow, Dr. Murray says. Puppy Behavior As your puppy reaches sexual maturity and their adult personality begins to surface, you may notice certain behavioral changes in your dog. Puppies at this age may begin to test the waters with their human caregivers, and may not be as responsive to training commands as they normally are, says Victoria Wells, senior manager of behavior and training at the ASPCA adoption center. This is the most active period of their lives, and they may find less productive or desirable ways to alleviate any boredom, such as chewing shoes and furniture, Wells says. If your dog hasn’t been spayed or neutered at this age, they’ll be less attentive to their human pet parents and more focused on finding a doggy companion. Dogs that are altered will be very playful with humans at this age, but may need more attentive training as they can get rowdy, Wells says. Since they have most of their adult teeth, it will be important for you to teach them games that encourage impulse control by learning to drop objects to prevent them from biting, Wells says. Puppy Food At this age, your puppy should still be eating a diet formulated for growing dogs, but you may be able to reduce the number of feedings from three times a day to two meals a day. Talk with your veterinarian if you have any breed or size-specific questions about your puppy’s individual diet or nutritional needs, Dr. Murray says. It’s also important to discuss the best heartworm and flea and tick preventions with your veterinarian, Dr. Murray says, as puppies at this age should be administered both of these on a monthly basis. Puppy Health  By six months, puppies should have completed their full series of vaccinations, which are ideally given at 8, 12 and 16 weeks of age, Dr. Murray says. As mentioned, your puppy should be spayed or neutered between four and six months, or before the first hear occurs in females to reduce the dog’s chance of developing breast cancer. Make sure your pup is comfortable with having their paws and mouth handled to allow for nail trimming, and teeth cleaning. Dr. Murray suggests daily brushing either with a dog toothbrush or some moistened gauze wrapped around your fingertip. Your puppy may feel uncomfortable with this at first, so make sure they become accustomed to it gradually to keep you from being bitten and your puppy from dashing at the sight of their toothbrush.  Puppy Training Keep up with basic training during puppy’s adolescence to prevent them from being too unruly. If you haven’t already done so, begin teaching and reinforcing recall training (having your dog come to you when called), impulse control (training your dog to wait to take toys or treats until you say) and teaching the word “no,” Wells says.  At this age, it’s important to provide your puppy with plenty of exercise to help them burn off extra energy in a positive way. Help them keep up their good manners at home by working on your training outside of obedience classes and keep them close to you at home so that they don’t get into anything they shouldn’t. A Few Other Puppy Care Tips Some advantages to bringing home a puppy at this stage is that they’ll have more bladder control than younger dogs and have a more independent nature, Wells says. They will sleep less and play more enthusiastically, however, so they will still need supervision at home and an environment that’s puppy-proof. Because of the differences between infant and adolescent puppies, Wells recommends providing your puppy with consistent aerobic exercise and a specific set of rules, just as you would with a human teenager. Learn More: Photo courtesy of the ASPCA. "}]