[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "New Puppy Care: 0-7 Weeks", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1390694526.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1390694526.jpg"}, "author": {"@type": "Person", "name": "Autumn Madden, DVM", "url": "https://www.petmd.com/author/dr-autumn-madden"}, "keywords": "Dog, Puppy", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/new-puppy-care-0-7-weeks"}, "datePublished": "December 6, 2022", "dateModified": "September 8, 2023", "description": "Dr. Autumn Madden explains the development, feeding, and behavior of puppies between 0-7 weeks old.", "articleBody": "The following may contain Chewy links. PetMD is operated by Chewy. Raising a newborn puppy is an exciting time—especially because there are many developmental changes happening. During their first few weeks, puppies begin to learn about the world around them. For most puppies, their primary interactions are with siblings and with mom. But it is also the time time when, in addition to body changes, puppies begin to learn how to socialize. Here’s what you can expect over the first seven weeks of a puppy’s life, but keep in mind: Puppyhood is a process that can last up to 18 months. The Neonatal Stage (0-2 Weeks) Development The complete neonatal period takes about four weeks. Because so many changes happen during this time, the time frame is generally described in two-week intervals. Once a puppy is born, it’s important to check them for defects such as a cleft palate. Also, if there’s concern that a puppy has been born prematurely, you can check for the absence of hair on the tops of their feet. Puppies at this stage should gain weight daily. Weight gain is a helpful indicator of issues with their mother’s lactation, or determining if the puppy has a disease or another medical problem. Low birth weights are associated with a higher mortality rate, because the puppy may be at risk of developing sepsis or hypoglycemia. The umbilicus should dry up and fall off after about three days, and the area should be checked daily for signs of infection or inflammation. Umbilical infection is a common source of sepsis. When your veterinarian checks your puppy’s umbilicus, they will also check the abdomen for umbilical or inguinal hernias. Newborn puppies use their mom and siblings to help maintain their ideal body temperature, as they can’t regulate body temperature on their own. Neonates can only bring their temperature about 12 degrees above room temperature, in part because they lack insulating body fat. Your newborn puppy’s rectal temperature should be around 95-99° F. In the second week of life, a puppy’s temperature should be around 97-100° F. If the puppy’s body temperature is too low, hypothermia may cause a reduction in feeding, which can lead to hypoglycemia and even death. To encourage regular eating, the pup’s body temperature must be corrected. Neonatal puppy bodies lack the ability to shiver and undergo peripheral vasoconstriction—the process whereby the body reduces blood flow to the extremities to keep the core of the body warm. Both abilities develop in the first week of life. Puppies of some breeds may have a hole, called an open fontanelle, in their skull. This is common in toy breeds such as the Chihuahua or Miniature Dachshund, and these fontanelles may never close. This should not cause any issues with your puppy long-term. Neonate puppies are born with a sterile gastrointestinal tract that is not colonized with bacteria just after birth, but will be soon afterward. In the first 48 hours after birth, the meconium (soft, yellow/brown stool) is passed. Normal neonate stool is pasty and yellow or tan in color, and variations may indicate problems: Neonates that are being overfed may develop green or yellow watery stool. White stools in neonates may indicate lactose intolerance. Foamy yellow stools may indicate the canine herpes virus. Blood-tinged stool may indicate sepsis or coccidiosis. A puppy who does not eat for 24 hours may be able to maintain their blood sugar (glucose levels). After that time frame, puppies’ glucose levels will begin to severely decline, which can lead to hypoglycemia. Dehydration is also a big concern with neonate puppies. Neonates are composed of less than 80% water. During the first two weeks of life, the kidneys are still developing, and pups lack the ability to concentrate urine. During this period, they may need to urinate two to three times more than an adult dog. Neonates have a lower blood pressure and faster heart rate than older puppies and adults. It is normal for a neonate’s heart rate to be around 200 beats per minute. When a neonate is born, they typically take about 10-18 breaths per minute. After the first day, the neonate breathing rate regulates to normal, which is about 30 breaths per minute. Around the fifth or sixth day after being born, your puppy should be able to support themselves on their front legs. Around 14-16 days of age, your puppy should be starting to support themselves on their hind legs. Behavior Neonates sleep for about 90% of the day. During this time, they are in an what is called activated sleep. An activated sleep strengthens the muscles to allow them to stand. When puppies are born, they can right themselves, withdraw from stimuli, and their anal and urinary release reflexes respond to stimulation (either from a damp swab or by Mom). The sucking and rooting reflex, which is what puppies do to find a nipple/feeding source, also appears at this time. This can look like head bobbing or nudging. Feeding Mother’s milk or a foster mother’s milk are ideal for neonates because of the role it plays in immunity. It helps to protect against harmful gut bacteria promotes good bacteria, which encourages nutrient absorption; supplies hormones; and gives energy. And to understand the importance of feeding in neonates and through the development process, it is important to appreciate the ways in which milk changes to fit the needs of the puppy. Colostrum is the type of milk that mom first produces. It has a thick and sticky consistency because of its dry matter content. Colostrum provides 95% of the neonates’ immunity during the first 24 hours of nursing. Twenty-four hours after birth, the milk begins to change and continues to change over the first week of life until it becomes the milk that puppies will feed on for the rest of the nursing process. Newborn puppies should be encouraged to nurse within a few hours after birth. During the first week, puppies will nurse about 8 to 10 times a day. After the first week, the frequency begins to decline. There may be a few complications that come up with nursing, such as rejected, orphaned, or weak puppies. The first thing to do is to make sure the neonate puppy does not have a cleft palate, which can make nursing difficult and may require surgical intervention. Small or weak puppies may have difficulty getting colostrum due to its thickness. These puppies may need to be offered colostrum through alternative methods, such as offering it in a bottle. When nursing complications arise, they are typically a result of complications with the mom. These include the possibility of the mom rejecting the puppies, the mom is sick, or the mom doesn’t have enough milk. If nursing complications arise, the ideal next option would be to let those puppies nurse from a mom with puppies of a similar age. If no foster mom is found, a modified plan includes commercial or homemade milk replacer. If a puppy was not able to ingest colostrum from a new mom, immunity may be provided by injecting a puppy with sterile serum from a dog that has been fully vaccinated. When the weaker or smaller puppies are nursing, sometimes the stronger and larger puppies may push them out of the way, leading to malnourishment, which can cause restlessness, increased vocalization, and enlarged abdomens. If this is happening, it may be helpful to make sure the smaller puppies feed first and get their fill. If mom is not able to produce enough milk, it may be helpful to supplement the milk supply with a formulated option so puppies are still able to meet their nutrient requirements. If mom is not around at all for feeding (commonly seen in shelters or when litters are dumped), pet parents can again use a commercial milk replacer specific for puppies. When feeding milk replacer, it is better to err on the side of caution and underfeed, rather than overfeed. Overfeeding can cause diarrhea, which may lead to dehydration. While you may be tempted to use cow or goat milk, it is not recommended because it is not nutritionally balanced for dogs. Chat with a veterinarian before starting a milk replacer, so they can help you determine how much to offer. Health Conditions A nursed puppy also inherits mom’s immunity—if mom is fully vaccinated, and the puppies have received colostrum in the first 16 hours of life. However, puppies that have had complications with nursing or have physical defects may have additional concerns such as hypothermia, dehydration, and sepsis. Puppies that did not receive any colostrum may be at risk to develop gastrointestinal tract issues caused by various bacteria. If Mom has not been vaccinated or a puppy has not received any form of immune system support, they may be at risk for additional viruses.   Vaccinations At this time during a puppies’ life, there are no vaccines necessary. The Transitional Stage (2-4 weeks) Development Puppies have usually doubled in size at about 10 days old (for nursing pups) or 14 days old (for formula-fed puppies). Puppies should be weighed daily, or at a minimum every other day, for the first four weeks to help detect any issues that may cause weight loss or lack of weight gain. At about three weeks of age, puppies should be able to concentrate urine, which means you may see the urine have more of a yellow coloring and they may start to urinate less often. Their elevated heart rate should drop down to a normal heart rate around 4 weeks of age. At 18-21 days, your puppy should be attempting to walk. It may look like an uncoordinated jumble of limbs trying to work toward a common goal—which is normal at this time. Active learning begins when a puppy is 3 weeks old, and the suckling reflex will still be present during this time. A puppy’s eyes should fully open around 10-14 days. During the first 2-4 weeks of life, the cornea may appear cloudy but should become clear. The iris may have a blue-gray appearance during this time as well. For the first three weeks of life, vision is very poor. Hearing during the first 2 weeks of life is also poor. The external ear canals do not open until 10-14 days of age. Behavior The critical time for socialization to begin is 3 weeks old, and the socialization window closes around 12-14 weeks of age. If socialization is not done during this period, your puppy may react fearfully to unfamiliar situations such as new people, places, or objects. It is important that human interactions are mindful and purposeful, to give the puppy positive experiences and associations with people. Negative experiences such as abrupt weaning and sudden separation from littermates can have lifelong adverse effects on behavior. Feeding During this time, feeding is reduced to about 4 times a day. Mom may start to reduce the amount of time the puppies are allowed to feed per feeding session. Until puppies are about 3-4 weeks of age, their diet should be liquid only. When weaning begins, it is important to separate the puppies from their mother for short periods of time, a couple of times a day. The puppy should be fed a high-protein, 25-30% diet with water added to make it as porridge-like as possible. This meal should be prior to nursing, to help decrease the amount of time the puppies nurse. Health Conditions At this point, puppies should still be covered by mom’s immunity. Typically, most of the issues that puppies encounter during this time may be related to their environment, such as: Sepsis Hypothermia Dehydration Hypoglycemia Vaccinations At this time, it is not recommended to start vaccinations. At 2 weeks of age, deworming with a general dewormer that is recommended by a veterinarian may be helpful to reduce parasitic load. Typically, puppies are dewormed every 2 weeks until they can be started on regular prevention products  for fleas, ticks, and other parasites. Socialization Period (4-7 weeks) Development Once puppies are 4 weeks old, they are no longer considered neonates. Glucose and protein leakage in urine stops by 6 weeks of age. In normal male puppies, the testicles should descend by 4-7 weeks of age. During this time, your puppy should be hearing and seeing the world. Puppies are still rapidly gaining weight at this time to meet the benchmark of approximately 50% of their adult body weight around 4 months of age. Behavior Now your puppies are learning discipline and social skills, how to play, and how to stop biting. These behaviors are learned by interacting with other puppies and mom. During this time, it may be helpful to start exposing a puppy to positive experiences with people, because lacking that, a pup will start to develop fear postures. If your puppy had issues as a neonate (such as low birth weight, feeding complications, or sepsis), they are at risk for behavioral issues that may include aggression, fear of new adults or children, and separation-related issues. It’s important to chat with a veterinarian about ways to help a puppy during this time. Puppies can be messy. They are messy when they eat and are prone to accidents in the house, which may or may not be in the designated bathroom area. Because of this frustration, it may be tempting to isolate them to a crate. However, it is best to keep them as involved in as many positive family interactions as possible. Isolation in a crate or room without much interaction can lead to learning deficits and an increased fear response to other dogs, people (including children), changes to their environment, and sounds. Feeding Puppies should be consuming three times the amount of calories required to meet their resting energy requirement. During this time, puppies are being weaned from mom’s milk with a high-protein porridge. The length of time puppies are kept away from their mothers should be gradually increased every other day. When puppies reach 6 weeks of age, they should be separated from their mother for about 4 hours a day. Puppies are typically weaned from their mothers around 6-8 weeks old. Health Conditions At 6-8 weeks of age, if a puppy did not receive colostrum from mom or serum from a fully vaccinated dog, they may be at risk for commonly prevented disease such as parvovirus, distemper, kennel cough, adenovirus, leptospirosis, vomiting and diarrhea, or intestinal parasites. If you believe your puppy may have one of these medical issues or appears to be ill, contact a veterinarian immediately. Vaccinations Vaccinations such as the DAPP (Distemper, Adenovirus, Parvovirus, parainfluenza) can start when the puppy is 6 weeks old. From this point forward, puppies are on a two- to four-week vaccination schedule. The Bordetella vaccine may also be given around this time—how it is bolstered and when depends on the formulation used. The injectable Bordetella vaccine requires two doses, with the second dose given  two to four weeks after the initial dose. If the bordatella vaccine is given in the nose or in the mouth, these formulations typically require no immediate booster but should be given every six months for maximum efficacy. All vaccinations should be given by a veterinarian to ensure the vaccine has been stored appropriately and given correctly. Your veterinarian can also help you stay on schedule during this important vaccination time.   Along with receiving vaccinations, your puppy should still be dewormed at two-week intervals. Your puppy may also be started on prevention for flea, ticks, and heart worms at this time, with the guidance of their veterinarian. There are specific preventatives formulated for puppies; never give a puppy a preventative intended for a different weight."}]