[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "New Puppy Care: 8-12 Weeks", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1313905755.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1313905755.jpg"}, "author": {"@type": "Person", "name": "Autumn Madden, DVM", "url": "https://www.petmd.com/author/dr-autumn-madden"}, "keywords": "Dog, Puppy, Wellness", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/new-puppy-care-8-12-weeks"}, "datePublished": "December 6, 2022", "dateModified": "September 27, 2023", "description": "Dr. Autumn Madden explains the development, feeding, and behavior of puppies between 8-12 weeks old.", "articleBody": "Welcome to the age of adolescence. At 8-12 weeks old, puppies should be getting ready to go to their new homes. During this period, they are undergoing lots of changes. While it is important to use discretion when choosing appropriate social interactions for your puppy, they should not be placed in isolation—this may cause fearful behaviors to develop. When you bring your new puppy home, it is important to carefully research veterinary clinics and choose one you want to use for your pet’s lifetime. Because it is important that experiences during this time are positive, it may be helpful to look for clinics that have veterinarians and staff that are Fear Free-certified and/or accredited by the American Animal Hospital Association (AAHA). Before bringing your puppy home, make sure you have the following: Tags with identification Leash Food and water bowls Toys Large crate (depending on their size or their eventual adult size) Bed/bedding Development During this time, puppies are rapidly growing. They have increased independence and start to test their boundaries. Teething also occurs now—this is considered the peak time for destructive chewing. This can be corrected by diverting the puppy’s attention to what they should be chewing on, and giving them praise for chewing on what is appropriate by using a praising tone, a clicker, or treats. Because puppies are losing puppy teeth to make room for their adult teeth, it is important to be mindful of what your puppy is chewing on. Puppies should not chew on anything that is harder than what you can place your thumbnail print into. That’s important to check, so your puppy does not risk fracturing one of their baby teeth. When baby teeth are damaged or shifted, it is possible that might affect their adult teeth that have not erupted, which may lead to extensive and complicated dental work. Behavior When placed in their new home, common puppy behaviors include biting, tail wagging, yipping, and nipping. Nipping is a puppy’s primary form of communication—a way to signal that they are ready to play and to test the limits of their new home. However, nipping should be discouraged. In the 8-16-week window, it may be difficult for puppies to grasp complex training concepts. An introduction to commands (their name, positive reinforcement of behaviors that you want to encourage) can be done at this time. Puppies at 3-12 weeks old are in an important socialization period. The most critical part of socialization development is the fear period, from 8-10 weeks. During this time, puppies are very sensitive to traumatic experiences, so keep that in mind when beginning puppy training. Training should focus more on praise for behaviors that you would like to encourage, such as treats for using the designated bathroom area. Training should not involve harsh punishments or isolation. During this time, puppies can retain fear for a person, another animal, or object. Fearful behavior is exhibited by trembling, ears folded against the head, tail tucking, freezing in place, hiding, growling, barking while backing away, or excessive fidgeting. Nutrition During this time, your puppy should be completely weaned from a milk diet and should be eating an AAFCO-approved puppy food. Puppies should be fed three to four times a day. However, the frequency may change based on the size of your dog and other special considerations. Talk to your veterinarian about what diet may be appropriate for your puppy and an appropriate feeding schedule. Training It’s critical to be consistent with training and to reinforce commands. If not, your puppy may regress and develop unfavorable behaviors. Training sessions can be made fun and interactive with treats, praise, and toys to help keep your puppy’s interest during training and help them associate it with positive experiences. During this time, skills to work on include: Socialization: Socialization includes exposing your puppy to new people, animals, objects, and environments. Curiosity can be cautiously encouraged to promote positive associations with something your puppy has not experienced yet. If there are objects in constant use at the home such as bikes, wheelchairs, or hats, your puppy should be allowed to explore them, using positive reinforcement such as treats and toys.Low-stress handling: This includes touching your puppy’s ears, lifting their lips, and touching gums and teeth, playing with feet and bellies, and lightly moving their tail around. If your puppy is uncomfortable with this at first, start slowly with areas that your puppy is most comfortable with and reward positive behavior with treats, praise, clicker, or toys. Gradually move to areas where a puppy may not be so comfortable, until they learn the experience is not stressful. If your puppy is having a difficult time accepting this handling process, it may be helpful to seek out the guidance of a certified dog trainer. This type of interaction helps prepare a pup for vet visits.Independence training: Since pet parents are typically excited about the new addition, it is tempting to want to spend all your time with them when at home. However, your puppy does need time apart from you—even when you are home—so they can become comfortable with alone time. The most important step in independence training is making sure your puppy has their own dedicated place to sleep—not in bed with you. Pheromone collars, place training, and music therapy can all be used to help develop independence and self-soothing methods as your puppy grows.Housetraining/Crate training: Crate training can be the foundation for house training, because if your puppy has been limited to a small sleeping space, they pick up house training (potty training) more effectively. It’s important that your puppy is comfortable in their space and does not feel like it’s an area used for negatively associated isolation.  It may also be helpful to encourage the association of the crate with experiences such as chew toys, meals, and sleep times.During play sessions, use toys for play to help discourage mouthing. Do not play with your puppy using your hands or feet; it can cause issues later with training. Health Conditions During this time, your puppy’s vaccine schedule is ongoing. While it is important to let your puppy go outside, enroll in puppy classes, and generally explore the world, make sure your puppy has safe experiences with pets you are familiar with, or pets that are around the same age group, to reduce the risk of exposure to a diseases. At this time, they are at risk for contracting intestinal parasites from chewing on sticks, grass, and being exposed to diseases they may not have started vaccination for or completed. They may also be around other pets with unknown vaccination and deworming status. Puppies are also at risk for developing the papilloma virus. Puppies are curious, growing, and developing, which can place them at risk of foreign body and toxicity ingestion. While this can happen at any age, a puppy is more susceptible because they are still learning commands such as “leave it” or “drop it” and because they are exploring the world with their mouths. During this time, there are so many things a puppy can get into, it may be helpful to look into pet insurance for your pup. That way you have the support you need if an accident does happen. Vaccinations During this time, your puppy will be going to the vet quite a bit. Most vaccines require multiple rounds of boosters to be effective. When puppies are older than 16 weeks, most vaccines need an initial shot,  then a booster for the series to be completed. The timing of the rabies vaccine should be discussed with your vet. The age when a puppy may start a rabies vaccine is dictated by state law. The Distemper vaccine (DAPP) series may be given in 2–4-week intervals starting at 6 weeks of age, depending on clinic and manufacturer recommendations up to about 16 weeks of age. Vaccines given at home (not under a licensed veterinarian) are typically not counted toward vaccination status. This is because a licensed professional has been trained on the correct method of storage and administration of vaccines to make sure the vaccination is safe. It must be stored correctly and must be used prior to the vaccine expiration date. It is important that vaccines given to your pup are listed on official letterhead from a veterinary practice. If official vaccine records cannot be provided by the previous home, they may be repeated at the veterinary clinic to make sure that your puppy has the protection they need. Your veterinarian may also recommend other vaccines for your puppy. These depend on lifestyle and what diseases may be prominent in the area. Non-core vaccines that may be recommended include: Bordetella Leptospirosis Lyme disease Influenza Rattlesnake It’s also important to talk to your veterinarian about what may be considered appropriate and safe prevention treatment for fleas, ticks, and heartworm. Unfortunately, due to global warming and a variety of other factors, these pests are now known to be living everywhere in the United States."}]