[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": ""}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "New Puppy Care: 6-12 Months", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1385214312.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-12/iStock-1385214312.jpg"}, "author": {"@type": "Person", "name": "Autumn Madden, DVM", "url": "https://www.petmd.com/author/dr-autumn-madden"}, "keywords": "Dog, Puppy, Wellness", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/care/new-puppy-care-6-12-months"}, "datePublished": "December 6, 2022", "dateModified": "September 27, 2023", "description": "Dr. Autumn Madden explains the development, feeding, and behavior of puppies during the age of 6-12 months old.", "articleBody": "When your puppy is between 6-12 months old, they’re officially in their “teen years.” Your puppy is all set to explore all types of new experiences and should be fully vaccinated at this point. Training may need to be reinforced as your puppy continues to grow. Development During this time, your puppy is continuing to gain weight and get closer to their adult weight. Around 6-7 months of age, your puppy should have all their adult teeth. Starting at around 8 months, they may be starting to mount things, mark, and—if you have a female unspayed dog—come into heat. It is possible, depending on where you picked up your puppy, that they may have come already spayed or neutered. If they have not, it may be helpful to start having that conversation with their vet. Studies have shown that the recommended time frame for sterilization may vary based upon age, weight, breed, or purpose. Behavior Before this age, your puppy may have had some training and be familiar with basic commands. If they are displaying concerning behavior, seek out a veterinary behaviorist or a certified trainer for support. Concerning behavior may include: Avoidance of people, animals, and objects Lunging and raised hair of back and neck Excessive mouthing when being handled Anxiety, which may display as having difficulty focusing in certain environments Excessive vocalization while in the crate or at home alone Nutrition At this time, your puppy should still be eating a puppy diet approved by the Association of American Feed Control Officials (AAFCO). During the later stages, 10-12 months of age, start talking with your veterinarian about transitioning to an adult dog food. The minimum recommended diet transition time is one to two weeks, but a new diet may be more tolerated if a transition is done over three to four weeks. Also work with your veterinarian about how often to feed your puppy. At this stage, reducing feedings to two or three times a day may be helpful. It is important that the time between meals is no greater than 12 hours. This is recommended to avoid bilious vomiting, where the vomit is green or bright yellow, indicating larger amounts of bile in the stomach than is normal. This may throw off feeding schedules and lead to additional GI issues such as an irritated stomach lining. If there are changes to the feeding schedule or if your puppy vomits in the morning prior to breakfast, a snack before bed may be helpful. However, your puppy should be seen by their veterinarian to make sure they are not experiencing an underlying illness. Training This is the time to reinforce the skills that you have been working on with your puppy and to expand on more complicating training commands. During this time, positive reinforcement is recommended to encourage your puppy to continue to follow these commands. If there was a command that your puppy learned when they were younger and you have not used during this window, your puppy may forget the command associated with a certain action. Health Conditions At this age, a puppy has no immune support from their mother. Because of this, if your puppy is unvaccinated, they are at risk for common diseases such as kennel cough, distemper, parvovirus, leptospirosis, or influenza. It’s critical to ensure your puppy is fully vaccinated to avoid these illnesses.   Your puppy should be exploring the world and interacting with new friends—both animal and human. This is the time where puppies may regress in their training and get into things they shouldn’t around the house. Be mindful about the placement of: Items that can be easily swallowed or chewed Trash Cleaning products Medications If you suspect or if you have seen your puppy consume something that could be toxic or cause an obstruction, contact an emergency veterinarian immediately.   During these months, your puppy is growing rapidly—so be sure to have them checked out by a vet at 6 months and at 1 year old to ensure everything is aligning properly. If your puppy is having difficulty with leaking urine, or drinking excessive amounts of water, check with their vet to determine if there is a medical issue or if your puppy is just being stubborn with training. Certain behaviors may need intervention from a board-certified veterinary behaviorist or a certified dog trainer. Seek out professional one-on-one assistance if: Your puppy is anxious and having difficulty focusing on the tasks given to them   They are excessively active or stubborn They vocalize a lot when in the crate or when home alone They are extremely destructive while in the crate or home alone Vaccinations During this time, the Bordetella vaccine may need to be bolstered. If your puppy has not completed or received vaccines your veterinarian recommended, be sure to discuss them. At this age, your puppy is eligible for all vaccines that their veterinarian may recommend. Because these vaccines may still be new—never received or long period of time between boosters—it may be helpful to plan for multiple vaccines to receive the immunity they need against common diseases.  "}]