[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "FAQPage", "mainEntity": [{"@type": "Question", "name": "Is Lyme disease in dogs painful?", "acceptedAnswer": {"@type": "Answer", "text": "The most common painful symptom is Lyme arthritis, which causes joint swelling and lameness in the legs. Most dogs that test positive for Lyme disease will not develop symptoms."}}, {"@type": "Question", "name": "Can dogs with Lyme disease make a full recovery?", "acceptedAnswer": {"@type": "Answer", "text": "In dogs that are treated early, a full recovery is generally expected. Dogs that have had symptomatic Lyme arthritis for an extended period may have persistent damage to their joints that causes long-term arthritis. Some dogs have recurrence of clinical signs, requiring additional treatment. In the rare cases where a dog develops kidney disease, they are unlikely to recover."}}, {"@type": "Question", "name": "Is Lyme disease in dogs contagious to other pets?", "acceptedAnswer": {"@type": "Answer", "text": "No, Lyme disease is not contagious to other pets. Lyme disease is transmitted through tick bites. However, any dog can develop Lyme disease, so tick prevention is key in areas known to have tick-borne diseases. Featured Image: iStock.com/Hirurg"}}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What to Know: Adopting a Dog with Lyme Disease", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/dog.friend.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/dog.friend.jpg"}, "author": {"@type": "Person", "name": "Rhiannon Koehler, DVM", "url": "https://www.petmd.com/author/dr-rhiannon-koehler"}, "keywords": "Dog, Adult, Puppy, Adoption, Condition, Shelters and rescue, Zoo Adoptable Dog Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/what-know-adopting-dog-lyme-disease"}, "datePublished": "May 9, 2023", "dateModified": "September 8, 2023", "description": "Dr. Rhiannon Koehler shares everything you need to know before and after adopting a dog with Lyme disease from the shelter.", "articleBody": "What Does It Mean if a Dog Has Lyme Disease? Lyme disease is a bacterial illness that’s transmitted by the blacklegged tick. While many dogs that test positive for Lyme disease don’t have symptoms, some dogs develop a fever, lameness in the legs, joint swelling, swollen lymph nodes, loss of appetite, and lethargy. The good news is that Lyme disease can be managed and treated effectively. If the dog has already started treatment in the shelter, symptoms will likely be gone or mild at adoption time. Overall, treatment for Lyme disease in a dog usually lasts for one month. When adopting a dog with Lyme disease, it’s important to work with the shelter to determine what treatment has been started, ask about any known medical history, and schedule an appointment with your veterinarian once your pup is adopted. Adopting a Dog With Lyme Disease First off, thank you for welcoming a dog that has tested positive for Lyme disease into your home! These canine friends often wait longer to find their forever home due to a diagnosis that usually doesn’t cause long-term issues. Knowing what to expect and what to ask can ensure you are informed on your new dog’s diagnosis. Before the adoption, expect to see your new dog’s medical record. This record should include: Any vaccinations and preventatives they’ve been given in the shelter Record of spay or neuter (if done while in the shelter’s care) Indication they tested positive for Lyme disease If the records include physical examination notes, look for any clinical signs of Lyme disease, such as limping or swollen lymph nodes. The shelter should discuss the diagnosis and will recommend a follow-up with your veterinarian. Ask for a copy of the medical record to take to your veterinarian. Shelter veterinarians often prescribe the antibiotic doxycycline for dogs that test positive for Lyme disease. Your new pet may still be taking this antibiotic at the time of adoption. What To Ask the Shelter Before Adoption While the shelter should provide you with information about Lyme disease, try to come with a list of questions, including: What test was done to detect Lyme disease? Did you do any additional testing specific to Lyme disease? Did you complete any blood or urine testing? What symptoms of Lyme disease did my dog show? Has my dog been drinking and peeing more than normal? Has my dog received any treatment for Lyme disease? Did my dog have ticks when they came to the shelter, and did you give any tick-killing prevention? If your dog is currently taking medications, make sure to ask: Will you be sending the remainder of the prescription(s) with me, or do I need to get more from my veterinarian? How much longer should my dog take this medication? Do you have any tips for how my dog takes these medications? Could you give me an informational handout on Lyme disease? Can I have a copy of my dog’s medical record to take to my veterinarian? All the above information will be helpful to share with your veterinarian when taking your pup for their first official vet visit. Treatment Options for Lyme Disease in Dogs Private-practice veterinarians often won’t treat a Lyme-positive dog that shows no symptoms. However, a shelter vet may start doxycycline medication whether they note symptoms or not. Doxycycline is an antibiotic taken by mouth once or twice daily. For Lyme disease and other tick-borne illnesses, this antibiotic is given for at least four weeks. Be sure to get the exact dosing from the shelter if they want you to continue medication after adoption. After you’ve adopted your pup, take them for a first visit with your veterinarian. Rarely, Lyme-positive dogs can develop severe kidney disease. If the shelter did not perform full blood work or a urinalysis, ask your veterinarian about running these tests to check your pet’s kidney function. Because you will be actively managing Lyme disease, be prepared for follow-up appointments. In most cases, rechecks would include a physical examination to monitor for symptoms, bloodwork, and urine analysis. Depending on other symptoms, your veterinarian will be able to guide you on additional medications that may be needed to treat sore joints or arthritis linked to the Lyme disease. Most dogs with symptomatic Lyme disease will recover quickly during treatment without long-term effects. Improvement in joint inflammation should be seen within three to five days of beginning treatment. Others that had longstanding joint inflammation may have permanent changes to their joints, resulting in arthritis. Be sure to provide your veterinarian with all the known medical history information given by the shelter. Cost of Lyme Disease Treatment in Dogs In some cases, the shelter may send you home with the pet’s prescriptions free of charge, so you may only need to pay for a recheck with your veterinarian. At the recheck, you could expect to spend a couple hundred dollars for an exam, bloodwork, and urinalysis. If you need to get medications from your own veterinarian, expect to add the price of doxycycline and potentially pain medications. Depending on your location, the cost can be $100–$150 or more, depending on the dosage and number of medications prescribed. There will be variation in costs depending on the size of the dog you’ve adopted, your geographic location, your dog’s symptoms, and the testing and treatment completed by the shelter. Long-term Management of Lyme Disease in Dogs Arthritis and kidney disease are long-term conditions to be mindful of. Most dogs that have had symptoms of Lyme arthritis make a full recovery, but those that had longstanding joint inflammation may have permanent arthritis. These dogs may require long-term pain medication, and your veterinarian may recommend joint supplements. Keeping your dog at a healthy weight also reduces stress on joints. A dog that tests positive for Lyme disease should be monitored for kidney disease, whether they have symptoms or not. Your veterinarian will work with you to develop a plan for monitoring that makes the most sense, based on your pup’s health. Lyme disease can recur and ticks can continue to transmit other diseases like ehrlichiosis. For this reason, year-round protection is recommended. Options for tick prevention include oral medications, topical medications, and collars. The annual Lyme vaccine may be recommended for your new pup depending on where you live, your lifestyle, and your pet’s health. By creating a safe, comfortable environment for your newly adopted dog and establishing regular care with a veterinarian, you can help your new pup live a long, healthy, and happy life."}]