[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Caring for Newborn Puppies", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Health", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2022-05/Newborn_puppies.jpeg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2022-05/Newborn_puppies.jpeg"}, "author": {"@type": "Person", "name": "Lauren Jones, VMD", "url": "https://www.petmd.com/author/dr-lauren-jones"}, "keywords": "Dog, Puppy, General health, Wellness", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/general-health/dog/caring-newborn-puppies"}, "datePublished": "May 2, 2022", "dateModified": "September 27, 2023", "description": "[node:summary] Dr. Lauren Jones describes how to care for newborn puppies.", "articleBody": "Just like human babies, newborn puppies new special care and attention. Here&#039;s what you need to know about taking care of your newborn pups after they are born.  Approach the Puppies With Caution Although you may want to pet and hold the puppies constantly, it is important not to intervene too much in the first week or two of their lives, as they are very susceptible to disease, and it can be stressful for the mother and puppies.  Use caution when approaching the puppies, as some mothers may show aggression to humans or other household pets if they perceive a threat. As the puppies get older and more active, your dog will want more and more time to get away and sleep, exercise, or socialize with members of the household. So give your dog space to get away from the puppies, but make sure that she is often returning to check on them. Provide A Warm Environment Puppies cannot regulate their body temperature until they are 3 to 4 weeks old. Therefore, for the first 4 weeks of their lives, you should provide a warm, clean box or bedding for the mother and puppies to share.  To keep the puppies warm, position a heating lamp above it. Ensure there are unheated areas, as the puppies will need to move away from the heat source if they become too warm. Monitor the puppies&#039; temperature. Their temperature during the first week of life is 96-98°F. If puppies are too cold, they cannot process milk and it may curdle in their stomach. Do not use heating pads, as the puppies may be cold and stay on the heating pad too much. If it is too hot, it can cause burns. Start Socializing the Puppies If the mother dog allows it, you can get the puppies used to your presence. Socializing them early can help ensure that they fit nicely into a household.  Watch for “poor doers” or “runts of the litter” (puppies that are much smaller and not growing as quickly as their littermates), as they could have underlying health conditions affecting their ability to grow. Puppies should initially be weighed twice a day for the first week or two, then daily. Puppies should never lose weight or even maintain weight—either of these is cause for supplementation and concern. If you notice that one of your puppies is smaller, not gaining weight, or has less energy than the others, consult your veterinarian. Puppies should not be taken away from their mother and sent to their new homes too quickly, as they learn important social rules and behavior from their mother and siblings. Puppies should not be separated from their mother if they are younger than 8 weeks old, and it may be illegal before this in many states. Waiting until they are 10 weeks old will give the maximum benefit of social interaction with their mother and littermates. Feeding and Weaning Newborn puppies should nurse at least every 2 hours for the first week or two of life. After this, they can stretch the feeding times to 3-4 hours, as long as they are still gaining weight and doing well. Once the puppies are 3 to 4 weeks old, you can begin the weaning process by giving them access to puppy food. You can mix a high-quality commercial puppy food with water or canned puppy food to make it easier for them to eat. It is important that the food is softened at first. They should still have constant access to the mother, as she will continue to nurse them. Over the next few weeks, they will rely more and more on puppy food rather than nursing. Most dogs will wean their puppies by 5 to 6 weeks of age. Puppies have sharp teeth at this point, so nursing may be painful to the mother dog. Continue to be vigilant and monitor her for signs of mastitis. Contact Your Vet Just After the Puppies Are Born Contact your veterinarian to ask for their recommendation regarding when the puppies should first be examined. They may want to see them right away to evaluate for cleft palates, umbilical hernias, and other health concerns, or they may advise you to wait until they are a bit older. Most veterinarians recommend deworming at regular 2-week intervals starting at 2 weeks old. Puppies should receive their first distemper/parvovirus vaccination around 6 weeks, unless your veterinarian recommends otherwise."}]