[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Get Your Puppy on a Healthy Sleeping Schedule", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/puppy-sleeping-schedule.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/puppy-sleeping-schedule.jpg"}, "author": {"@type": "Person", "name": "Dr. Rania Gollakner", "url": "https://www.petmd.com/author/dr-rania-gollakner"}, "keywords": "Dog, Puppy, Zoo Puppy Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/puppy-sleep-schedule"}, "datePublished": "February 10, 2023", "dateModified": "August 30, 2023", "description": "Do puppies sleep a lot? And when they do sleep, how can you make sure it&#039;s at the right time? Learn more about sleep training puppies and how to help your dog rest easy.", "articleBody": "Getting a puppy is an exciting time, but it can also be overwhelming. In some ways, having a puppy is like having a baby, because they need a lot of attention and patience while they’re learning and adjusting. One of the first things your puppy needs to learn is a sleep schedule. Depending on the breed of dog, their age, and their activity during the day, puppies sleep a lot—anywhere from 12-20 hours per day. Very young puppies will sleep constantly—unless they’re nursing. As puppies get older, they alternate between sleeping and bursts of energy. With all this time spent snoozing, here’s how to help your puppy learn good sleeping habits. Where Should a Puppy Sleep at Night? Your puppy needs to have their own sleeping space. A properly sized crate is useful for sleep training, and your pet will soon learn that this is where to go for a quiet and safe place to rest. Bonus: Teaching your dog to sleep in the crate also helps with potty training. The crate should be a comfortable and warm place. For at least the first few weeks, it should be placed in your bedroom where you sleep. Remember that your puppy is in a new home, away from his mom and siblings, and those first few nights will be scary! It’s important that he learns from the beginning that he is safe and not alone. A scared puppy will have trouble falling asleep. How to Prepare a Puppy for Bed Creating a routine will help your puppy know what will happen next and what behavior you expect. Make sure your puppy has eaten his last meal of the day at least three hours before bedtime. This gives him enough time to digest and use the bathroom before bed. Take a walk and have a final, gentle playtime about an hour before bed. Once you put your puppy in the crate to sleep, you should either go to sleep or pretend to go to sleep. If you are still up, active, and making noise, your puppy will want to join you. Creating a cozy and comfortable bed will also prepare your puppy for sleep. If possible, put a blanket or something with your scent in the crate with him. If that is not possible, a soft, warm blanket will still offer some comfort. Choose a dog bed for the crate that has raised sides so your puppy will feel cradled and protected. Whatever bedding you choose, make sure it’s washable in case of an accident. There are also toys designed to mimic another dog, such as the Snuggle Puppy, that can be a soothing toy for your puppy to cuddle. If you do put toys in the crate, stick with ones conducive to bedtime—not something that would make your puppy think it’s playtime. As always, use your best judgment when choosing items to put in the crate with your puppy; you do not want to put anything in the crate that could be a choking hazard. What To Do If Your Puppy Is Crying There are two main reasons your puppy cries in his crate: He needs to go to the bathroom, or he wants attention. If your puppy just went to the bathroom but is still crying, comfort him by gently and quietly reassuring him with your voice, or quietly sitting by the crate until he falls asleep. Do not interact with your puppy in a way that gets him excited or playful. You also do not want to let him out of the crate in response to his crying. Doing so will get him in the habit of waking you up simply because he’s bored. And remember: Even though you do not want to indulge his crying when he just wants attention, never punish your puppy for crying at night. How Often Do Puppies Pee at Night? When puppies are young, they need to go to the bathroom every 2-4 hours. If your puppy cries during the night; is awake or unsettled; and it has been at least a few hours since he last went to the bathroom, then assume he needs to go again. Quietly take your puppy out without interacting much or playing with him. As soon as your puppy goes to the bathroom, immediately go back inside and quietly go back to bed. Leaving the crate to use the restroom should be all business—not a fun field trip. Some puppies can sleep through the night by 12 weeks old, but it could take longer for them to hold their bladders for 6-8 hours through the night. Learn to Be a Morning Person Like babies, puppies will sleep when they need to sleep and wake up when they need food, water, playtime, or to go potty. Let your puppy sleep undisturbed as much as possible so they get the sleep they need. Eventually, your pet will learn your sleep routine and wake up in the morning when you do. But remember: Puppies need to go potty more frequently than adult dogs, so sleeping in might be challenging until your puppy is older. Because puppies are like babies, they will have moments of energy and being awake—and then suddenly they will be sleepy and need a nap. If your household is constantly full of noise and activity and your puppy struggles with napping during the day, consider putting your puppy in a quiet place to nap. Like a baby, your puppy may need someone to be nearby until they fall asleep. With love, patience, and a schedule, your puppy will be on their way to a great sleeping routine. Featured Image: iStock/SolStock"}]