[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Looking for a Teacup Dog or Puppy? Read This First", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-05/teacup-puppies-and-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-05/teacup-puppies-and-dogs.jpg"}, "author": {"@type": "Person", "name": "Jennifer Coates, DVM", "url": "https://www.petmd.com/author/dr-jennifer-coates"}, "keywords": "Dog, General health, Puppy, Zoo Puppy Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/teacup-dogs-puppies"}, "datePublished": "May 1, 2023", "dateModified": "August 30, 2023", "description": "Teacup dogs and teacup puppies are popular, but these little dogs have major health considerations. Here’s what to know about teacup puppy breeders and their dogs.", "articleBody": "Small dogs can be a lot of fun. They make great companions and travel buddies, and are easy to exercise and clean up after. So, if small is good, wouldn’t smaller be even better? Not so fast. Despite their popularity, purchasing a “teacup” puppy supports unethical breeding practices and results in teacup dogs that can have some truly intense health problems. What Is a Teacup Dog? Teacup dogs are significantly smaller than what is typical for their breed. These pups go by many different names, including tiny teacup dogs, micro dogs, and pocket dogs. The breeds that are used to make these itty-bitty dogs are already small: Dog Breed Ideal Weight Yorkshire Terrier (Yorkie) 4–7 pounds Toy Poodle 4–6 pounds Shih Tzu 9–16 pounds Maltese 4­–6 pounds Pomeranian 3–7 pounds Chihuahua 3–6 pounds Pug 14­–18 pounds   Teacup puppy breeders work to make these dogs even smaller. While there is no official weight for a teacup dog, it’s not uncommon for adult teacup dogs to weigh well under 4 pounds. Some breeders of teacup dogs also sell mixed, or “designer,” teacup puppy breeds. For example, teacup Pomchis (a Pomeranian-Chihuahua mix) and teacup Maltipoos (a Maltese-Pomeranian). Problems With Breeding Teacup Dogs A dog breed’s ideal weight range is important to understand. Reputable breeders try to produce dogs that adhere as closely as possible to their breed standard. They pick the best dogs to take part in their breeding programs and make partner matches that have the greatest chance of producing puppies that are healthy and likely to succeed in the show ring. Despite their popularity, purchasing a “teacup” puppy supports unethical breeding practices and results in teacup dogs that can have some truly intense health problems.Breeders of teacup dogs, on the other hand, are laser-focused on one thing: size. Other concerns, including the dog’s health, fall by the wayside as they simply breed the smallest females to the smallest males so they can sell tiny puppies for high prices. This makes it easy for significant health problems to be passed down from parent to puppy. Teacup Dog Health Problems  Many of these health problems are found in small breed, not just teacup, dogs. Unfortunately, research is still ongoing into whether they occur more frequently the tinier a dog is bred to be, but the chances for these health problems are elevated during poor breeding practices. Hypoglycemia Teacup puppies are prone to developing dangerously low blood sugar levels (hypoglycemia), which can lead to mental dullness, weakness, muscle tremors, seizures, and death. To help prevent hypoglycemia, pet parents may need to feed their teacup puppies every two hours (yes, even overnight!) until they are 1 year old. Hydrocephalus That “cute” dome-like head that many teacup dogs have can be related to a serious congenital anomaly called hydrocephalus (water on the brain). Extra pressure within the skull damages the brain, leading to blindness, behavioral changes, and other neurologic problems. Surgery may be necessary to create a path for fluid to drain away from the brain. Liver Shunts Portosystemic (liver) shunts are abnormal blood vessels that prevent blood from entering the liver. Common clinical signs include: Behavioral abnormalities and seizures that get worse after eating Poor growth Vomiting Diarrhea An accumulation of fluid within the abdomen Most liver shunts in teacup puppies and dogs are caused by numerous tiny vessels that can’t be closed surgically. Medical management may improve symptoms but won’t cure these types of liver shunts. Dental Disease Teacup dogs have a tiny mouth, so their teeth typically do not grow in normally. This can lead to crowding and retained baby teeth, both of which encourage plaque and tartar buildup and increase a dog’s risk of gingivitis, periodontal disease, and other dental problems. Collapsing Trachea  Teacup dogs are at a higher-than-average risk of developing collapsing trachea. This is when the muscular portion of the windpipe weakens over time and sags, narrowing the passageway for air and leading to a cough that sounds a little like a goose honk. Medications and sometimes surgery are necessary to keep dogs with this condition comfortable. Heart Disease Degenerative mitral valve disease (DMVD) is very common in teacup dogs. Symptoms tend to develop in middle or older age as the dog’s mitral valve (the valve that separates the left atrium and left ventricle in the heart) thickens, weakens, and doesn’t work well anymore. Dogs with DMVD generally have a heart murmur and can develop coughing, trouble breathing, an inability to exercise, weakness, and congestive heart failure. Medications to improve heart function will often help a dog’s symptoms but won’t cure the underlying problem. Orthopedic Diseases Some types of orthopedic diseases, such as luxating patella and Legg-Calvé-Perthes disease, are common in teacup dogs. Surgery becomes necessary when pain-relieving and anti-inflammatory medications, physical therapy, and other treatments fail to keep a dog comfortable. Other Potential Dangers for Tiny Teacup Dogs  Tiny teacup dogs also face other dangers related to their size. Hypothermia The smaller the dog, the harder it is for them to stay warm. If teacup dogs aren’t protected from the cold, they can develop hypothermia and frostbite. Even when temperatures are relatively mild, teacup dogs may need to wear a sweater or coat when temps drop. Difficulty Dosing Medications Most common dog medications, including heartworm, flea, and tick preventives, are labeled for use in dogs that weigh 5 pounds or more. Teacup dogs often need to take compounded medications (which increases their expense) or use medications in an off-label manner. Complications With Anesthesia and Surgery Safely anesthetizing and performing surgery on teacup dogs can be done, but it’s not always easy. Everything from placing an IV catheter, to repairing a broken bone, to keeping the anesthetized dog warm is harder when they are this small. Fragility Teacup dogs are more likely to be seriously wounded if they experience a traumatic injury. Their bones are relatively fragile, so even normal activities, like jumping off a bed, can lead to fractures. Additionally, teacup dogs and especially teacup puppies seem to become sicker faster than bigger dogs. Stress alone is sometimes enough to send fragile dogs like these to the veterinary hospital. Should You Adopt a Teacup Puppy? For all these reasons, purchasing a teacup puppy doesn’t make a lot of sense. Typically, a pet parent looking for a small dog can find a healthier and heartier option in a puppy that has been bred to meet the breed standard. If you’re absolutely set on having a small teacup dog, talk to a breeder of “regular-size” dogs who performs all the breed-specific tests recommended by the Canine Health Information Center. Smaller-than-normal pups are born from time to time, and reputable breeders are always looking for good homes for them—with the condition they are not bred as an adult. Featured Image: iStock/michellegibson"}]