[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "What Is Shaking Puppy Syndrome?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-shaking-puppy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-shaking-puppy.jpg"}, "author": {"@type": "Person", "name": "Katy Nelson, DVM", "url": "https://www.petmd.com/author/dr-katy-nelson"}, "keywords": "Dog, Puppy, Condition", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/what-shaking-puppy-syndrome"}, "datePublished": "August 25, 2017", "dateModified": "September 7, 2022", "description": "Many things can cause your puppy to shiver or tremble. But what if it is due to something that your puppy was born with? Learn more about Shaking Puppy Syndrome and whether treatment is possible.", "articleBody": "By Katy Nelson, DVM Many things can cause your puppy to shiver or tremble. It could be excitement that you’re home, or it could be from ingesting a toxin. But what if it is due to something that your puppy was born with? Is treatment possible, and will he recover?  What Is Shaking Puppy Syndrome? Shaking puppy syndrome, or hypomyelination, affects a young dog’s central or peripheral nervous system and involves the entire body. Myelin is the fatty protective sheath that covers every nerve in the body. When this protective sheath is too thin, as in hypomyelination, the electrical impulses can get lost between nerves and cause the nerves and corresponding muscles to malfunction. Symptoms of Shaking Puppy Syndrome In shaking puppy syndrome, tremors begin shortly after birth, with symptoms beginning as early as 2 weeks of age. Besides shaking, the puppy may have difficulty walking, issues with balance and coordination, and their legs may appear more wide-based than normal in an attempt to stabilize themselves. Excitement can make the tremoring more violent, and puppies tend to shake more while eating, with tremors subsiding while resting. Mentally, the puppies seem to appear fine. Causes of Hypomyelination Hypomyelination is hereditary, and certain breeds are predisposed to developing the condition. Most common are the Springer Spaniel, Australian Silky Terrier, Weimeraner, Golden Retriever, Catahoula Cur, Dalmatian, Chow Chow, Welsh Springer Spaniel, Vizsla, Samoyed, and Bernese Mountain Dog. Other breeds and mixed breeds can also suffer from the disorder, and male dogs are more prone to develop shaking puppy syndrome than females. Golden Retrievers inherit a form of shaking puppy syndrome that involves the peripheral nervous system, rather than the central nervous system, causing them to develop all other symptoms of hypomyelination minus the shaking. The disorder appears later in Goldens, usually between the ages of 5-7 weeks old. Male Springer Spaniel puppies suffer most from hypomyelination because the form of genetic transmission is different in this breed. Female Springers eventually will recover from this disease, but males most often do not. They typically die by the age of 6 months old, whether due to the severity of the disease or because the owner may choose to euthanize them if the tremoring is especially severe. Diagnosing Hypomyelination Diagnosis of hypomyelination is generally by ruling out all other potential problems.  Your veterinarian will perform a thorough physical exam, and collect an extensive history, including any knowledge of familial history of your pup. A thorough neurologic exam will also be conducted to rule out damage to the spinal cord or cranial nerves.  Tests will be recommended to analyze blood chemistry and check for any imbalances in organ function or evidence of toxicities. Radiographs of the chest and back will be analyzed to screen for tumors or other damage to the skeletal system, and a sample of the fluid surrounding the spinal cord may be collected for analysis. Tests may be run to detect the genetic mutation responsible for hypomyelination, though some dogs can be asymptomatic carriers of the genetic defect.  Other procedures may be recommended to rule out other conditions, like CT (computed tomography), electromyography, MRI (magnetic resonance imaging), or myelography (a nerve conduction study).  Diagnosis is considered a diagnosis of exclusion, as truly the only way to definitively diagnose this disorder is to microscopically examine the spinal cord of the affected animal after death.  Treating Shaking Puppy Syndrome There is no actual treatment for hypomyelination. Fortunately, most puppies affected by this disorder eventually recover, and are fairly normal by the age of 1 to 1.5 years old. Less severely affected pups may be back to normal by the age of 3-4 months, although most dogs who survive shaking puppy syndrome will have mild hind limb tremors lifelong. "}]