[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Side Effects of Pet Medications", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-02/hand%20with%20pill%20in%20front%20of%20brown%20dog.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-02/hand%20with%20pill%20in%20front%20of%20brown%20dog.jpg"}, "author": {"@type": "Person", "name": "Barri J. Morrison, DVM", "url": "https://www.petmd.com/author/dr-barri-j-morrison"}, "keywords": "Cat, Dog, Adult, Kitten, Puppy, Senior, Prescription medication, Poisoning, Symptom Checker, Medication Side Effect/Overdose", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/side-effects-pet-medications"}, "datePublished": "February 20, 2023", "dateModified": "September 12, 2023", "description": "Find out what side effects you can expect from the most common pet medications and which are serious.", "articleBody": "Pets can experience side effects to medications they are given, just like people. These can range from mild to more severe reactions, depending on many factors. It’s always best to discuss the risks of a drug with your veterinarian and decide if the potential benefits outweigh the potential side effects. If you suspect your pet is having any side effects, speak with your veterinarian as soon as possible to determine the next steps. Common Medication Side Effects in Pets Symptoms of a drug reaction in pets, or side effects to that drug, can be based on: The type of medication and how it’s administered. Usually, injectable medications have a higher chance of causing side effects than oral medications. Your pet’s health status and age. Older pets that have a medical diagnosis might react differently to the same medication given to a young, healthy pet. These are some of the most common side effects that pets experience: Gastrointestinal Upset  One of the most common side effects of pet medications is mild stomach upset. This is because most medications are taken by mouth and absorbed in the gastrointestinal tract. Some pets have a more serious reaction, including vomiting, diarrhea, and decrease or lack of appetite. These symptoms often resolve as their body adjusts to taking the medication, but sometimes the symptoms can become severe. Ask your veterinarian if the medicine should be given with or without food, because that can make a big difference on how your pet tolerates the medication. Some medications that commonly cause stomach upset are: Antibiotics. Consider giving your pet probiotics when they are on antibiotics, to prevent or relieve antibiotic-associated diarrhea, vomiting, and appetite issues. Levothyroxine (used for hypothyroidism in dogs) Methimazole (used for hyperthyroidism in cats) Steroids such as prednisone and prednisolone Blood pressure medications Gabapentin (especially in cats) Oral and topical flea and tick medications Excessive Salivation  Excessive saliva production, or hypersalivation, is a common side effect with some pet medications. Often this is because the medicine has a bitter or unpleasant taste. For these medications, it is not recommended that the pet parent crush the medication, which can make it taste much worse. Tramadol, a pain medication, is a very commonly prescribed pet medication that’s known to have a bitter taste; it should not be crushed. Medications such as antibiotics, antihistamines, and steroids can cause dry mouth, which triggers saliva production. Other medications known to cause hypersalivation include methimazole, flea and tick medications, and gabapentin. Stomach Ulcers Nonsteroidal anti-inflammatory drugs (NSAIDs) such as carprofen (Rimadyl), deracoxib (Deramaxx), meloxicam, and robenacoxib (Onsior), as well as steroids like prednisone and prednisolone, are known to increase your pet’s risk of getting gastrointestinal ulcers. These ulcers can then cause vomiting and diarrhea, with or without blood and/or dark, tarry stools. These medications should NEVER be given together, as it greatly increases the risk of ulcers. Stomach ulcers are often treated with medications that reduce acid production and protect the lining of the gastrointestinal system. Lumps and Bumps Side effects of medications that affect the skin are very common among pets. Lumps and bumps on the skin are most often caused by injectable medications. After the injection, you may notice a small lump where the medication was administered. These lumps often go away quickly as the medication is absorbed into your pet’s body. Skin Irritation Oral, injectable, and topical pet medications can all cause skin irritation. Antibiotics, thyroid medications, steroids, and flea and tick medications have all been associated with skin irritation in pets. Hair loss, itchiness, swelling, redness, scabbing, red bumps, hives, and blisters are the most common symptoms of skin irritation in pets. Skin reactions vary highly in severity and level of pain. They can be mild and resolve easily, or they can be severe, leading to immune system conditions such as lupus. Skin irritation in pets can also cause intense licking, biting, and chewing, which can cause worse damage to your pet’s skin. Liver or Kidney Damage Any medication your pet receives needs to be broken down by the body to be effective. The liver and kidneys do this, and they can be damaged in the process. Common side effects are increased thirst and urination, vomiting, diarrhea, yellowing of the skin or eyes, and lethargy. NSAIDs used short- or long-term are commonly associated with liver and/or kidney damage. This reaction is commonly called idiosyncratic, which means it is unpredictable. In general, if an NSAID medication is given at the correct dose for the correct period of time, these side effects should not occur. Steroids are known to cause liver issues, but usually only when given at high doses for long periods of time or if the liver was already compromised before starting the medication. Blood pressure medications have also been known to cause kidney dysfunction. Lethargy or Behavioral Changes Pet medications often affect a pet’s brain, causing them to behave differently. Sometimes this behavior change is what they were prescribed for, such as with anti-anxiety and sedative/pain medication such as opiates, tramadol, and gabapentin. However, other times it’s an unintended side effect, like restlessness and hyperactivity. These behavior changes can be mild to severe, even causing dysphoria. Dysphoria is an altered mental state where your pet might vocalize, pant, or have difficulty settling down. Dysphoria is also common after or during anesthesia in pets. Metronidazole, which is used to treat infections, is an antibiotic known to have effects on the brain in older pets or if too high a dose is given. Most antihistamines, which are commonly used for a wide variety for allergy manifestations, can also cause lethargy or hyperactivity, depending on the pet. Other medications known to have these side effects are levothyroxine, steroids, blood pressure medications, insulin, antihistamines, and flea and tick medications. Rare Medication Side Effects in Pets If your dog experiences any of the rare side effects listed below, they should be treated as soon as possible by a veterinarian because the consequences can be fatal. In most cases, giving these medications does not outweigh the risk of the side effects. Severe Allergic Reaction Anaphylaxis, or severe allergic reaction, is the most frightening medication side effect that pets can have. It can happen with any medication if your pet’s immune system is activated. Anaphylaxis is a potentially deadly type of allergic reaction. This reaction can occur the first time they have a medication (acute) or after it has been given a couple times (delayed). In most pets, anaphylaxis primarily affects the lungs and airways. The most common symptom in most pets is trouble breathing. However, in dogs, the gastrointestinal system often releases histamine directly into the liver, causing symptoms such as vomiting and diarrhea as well as liver enzyme elevation. Blood Disorders Rarely, medications can trigger blood disorders such as low platelets (thrombocytopenia) or low red blood cells (anemia) in pets, which can cause spontaneous bleeding. Antibiotics have often been implicated in causing low platelet disorders, which in turn can cause hemorrhaging or bruising, and this is potentially fatal if not treated quickly and aggressively. Methimazole in cats has also been associated, rarely, with blood disorder development. Neurologic Issues Some pet medications can cause symptoms such as seizures, tremors, and loss of coordination. These include: Antibiotics (metronidazole, fluoroquinolones such as Baytril and Marbofloxacin) Anti-anxiety medications Flea and tick medications (Bravecto, NexGard, Simparica, Revolution Plus, and Credelio) Insulin Chemotherapy drugs   The side effect could be related to the dose, such as high doses of metronidazole, or it can be unpredictable. Unlike some toxin-induced seizures and tremors, those related to antibiotics generally respond well to first-line anti-seizure treatment. Difficulty Standing/Walking and Collapse These side effects can happen with medications that cause an alternation to the cardiovascular system. These medications can alter blood pressure and cause abnormalities in the way your pet’s heart beats, which can be very serious. Blood pressure medications and flea and tick medications can cause collapse in pets. Breed-Related Reactions to Parasite Medication Herding dogs such as Collies, Australian Shepherds, Shetland Sheepdogs, English Sheepdogs, and related breeds can have a gene mutation that makes them especially sensitive to certain parasite prevention and treatment medications, such as ivermectin or moxidectin. A genetic test is available to identify at-risk dogs. The dose of ivermectin or moxidectin in heartworm preventatives is so low that it is usually safe for use in any breed of dog. However, at high doses, these medications have serious and potentially fatal side effects, including dilated pupils, unsteadiness, mental dullness, drooling, vomiting, blindness, tremors, seizures, coma, and death. When to Worry About Medication Side Effects in Pets If your pet starts to experience any side effects, whether mild or significant, consult with your veterinarian before continuing or discontinuing the medication. It is important to ask about the side effects that your pet might have when they start any medication. Ask your veterinarian what adverse reactions you should look for. If you notice any of these signs, contact your veterinarian immediately. Do not discontinue your pet’s medication unless they instruct you to do so. If your pet has any serious symptoms, take them to your vet or an emergency veterinarian as soon as possible to avoid possibly life-threatening consequences. In most cases of significant or severe side effects, your veterinarian will recommend that you stop the medication immediately and see if the symptoms ease. Serious symptoms include: Seizures Trouble breathing Collapse Lethargy/weakness Spontaneous bleeding/bruising Anaphylaxis Yellowing of the skin/eyes/mouth Blood in the stool or dark, tarry stool Blood in the vomit Not eating For mild side effects, such as stomach upset, your vet might be able to assist you over the phone in making a new treatment plan. If a mild symptom lasts for more than 24 hours, your pet should be examined by a veterinarian. In these less severe cases, some medications cannot be abruptly stopped. Your veterinarian will need to determine the safest plan for your pet, which is usually to slowly taper off the medication to avoid additional side effects. Side Effects or Accidental Overdose of Pet Medication? Your pet may be having a side effect from a prescribed pet medication, or it could be possible that they got more than the recommended dose. This could easily happen if you and another family member both gave the medication without knowing, or if you forget that you already gave it and then give them another dose. Your pet could have also gotten into the bottle or container. This is another reason why it’s important to monitor any reactions to a medication and talk to your vet if you are concerned or notice any serious symptoms. In mild cases, your pet can be treated, but depending on the type of medication and amount ingested, an overdose can cause illness and even death. Featured image: iStock.com/Daria Kulkova"}]