[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/2v67xx4tqk", "@type": "VideoObject", "duration": "PT2M34S", "name": "5519575107001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/ce9a6e9442cca003ad3b6a7bbfc9649bd111e4c5.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/2v67xx4tqk", "uploadDate": "2018-04-08", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/2ba5209e07dd021c1645fdcea3137fb991ccef4d.m3u8", "transcript": "Puppies are cute and they bring undeniable joy into the lives of pet parents. But new puppy owners have to be cautious when it comes to their pets health and well-being. Puppy immune systems aren't as developed as those of adult dogs, which puts puppies at a greater risk of contracting certain illnesses. Let's discuss a few common puppy illnesses and what you can do to prevent them parvovirus is one problem that is particularly dangerous for puppies.\n\nThis highly contagious viral infection is passed through bodily secretions of other infected dogs and can spread quickly in animal shelters or boarding facilities fever, vomiting, and bloody diarrhea characterized this illness parvo and puppies is often fatal. Even with intense therapy. So make sure to vaccinate your puppy against parvovirus and if you suspect your puppy has parvo take him to the vet million, immediately. Puppies suffering from parvovirus often need to be hospitalized for IV fluids dietary supplementation and intense monitoring.\n\nAnother common virus that impacts puppies is the canine distemper virus. This initially appears as an upper respiratory disease but can turn into pneumonia and neurological problems. Puppy owners sometimes think their pet is just suffering from a cold since early symptoms of distemper such as sneezing and eye discharge can seem benign. Puppy owners should talk to their vet Marion about a vaccine that prevents distemper in dogs.\n\nUsually puppies can receive the first vaccine as early as six to eight weeks of age. Puppy owners should also watch out for symptoms of kennel cough and their new family members while dogs of any age can contract kennel cough. Puppies are more susceptible this bacterial infection is airborne and spreads quickly. Puppies suffering from kennel cough will be lethargic and have a decreased appetite before developing a deep cough.\n\nIf you notice unusual coughing in your puppy. It's important to see a vet Miriam before kennel cough turns into pneumonia intestinal parasites like round worms or hook worms may also plague puppies. These parasites may be transferred to your puppy through her mother's milk and are not uncommon. Signs of intestinal parasites include vomiting or diarrhea that Syrians will most likely prescribe oral medications to help get rid of worms prevent your puppy from developing intestinal worms by putting her on a monthly preventive to keep your puppy healthy.\n\nIt's imperative that you schedule a wellness visit with a veterinarian as soon as the dog is under your care. Even if she already received medical care at a shelter. Speak with your veterinarian about the right vaccination schedule for your dog and keep a close eye on your new puppy to watch for symptoms of illness. If you suspect anything is wrong.\n\nDon't hesitate and make sure to schedule a visit to your vet.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/general-health/7-common-puppy-illnesses-and-how-to-protect?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "7 Common Puppy Illnesses and How To Protect Your Pup", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1279224916.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/iStock-1279224916.jpg"}, "author": {"@type": "Person", "name": "Brittany Grenus, DVM", "url": "https://www.petmd.com/author/dr-brittany-grenus"}, "keywords": "Dog, Puppy, Zoo Puppy Pack", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/7-common-puppy-illnesses-and-how-to-protect"}, "datePublished": "January 10, 2023", "dateModified": "August 30, 2023", "description": "New pet parents need to know common puppy illnesses to watch out for. Learn more about these sicknesses in puppies and how to keep your dog healthy.", "articleBody": "Bringing a new puppy into your home is always exciting. And when you add a new family member, you want to do everything you can to keep them safe and healthy. Just like human kids, puppies don’t have as strong of an immune system as adults, and there are several illnesses they’re more susceptible to—especially if they’re not fully vaccinated. Here’s what you need to know about the most common puppy illnesses your new addition can experience, and how you can help your new four-legged family member. 1. Parvovirus (Parvo)  Parvovirus is one of the scariest illnesses a puppy can get—it’s prevalent throughout the United States, easily transmissible, and potentially fatal. At its most basic level, parvovirus is a highly contagious, really nasty stomach virus. It’s transmitted through feces and can survive in the environment for months or even years. Because of this, it’s recommended to avoid putting a puppy on the ground in public places or taking her for walks in the neighborhood until she’s fully vaccinated. The symptoms of parvovirus are typically acute (meaning they have a sudden onset) and can be rapidly progressive. If you notice any of these common symptoms, contact your veterinarian: Vomiting Diarrhea (usually bloody and profuse) Lethargy Decreased appetite Depression Dehydration Stomach pain Pale gums Fever Weakness Seizures There is no specific treatment for parvovirus, only supportive care. Ideally, puppies with parvo should be hospitalized to ensure they get adequate care. With hospitalization, survival rates have been shown to be as high as 90%, but this greatly depends on the puppy’s age, symptom severity, vaccination history, underlying health issues, and the level of medical care provided.  2. Distemper  Distemper virus is another highly contagious, often fatal virus that primarily attacks the respiratory, gastrointestinal, and nervous systems of dogs and puppies. The virus is typically spread through the air, such as through sneezing or coughing, or from shared food and water bowls. The symptoms of distemper include: Green or yellow discharge from the eyes Green or yellow nasal discharge Fever Coughing Lethargy Decreased appetite Vomiting Thickened paw pads Circling Head tilt Seizures As with parvo, there is no treatment for distemper virus. Supportive care can be provided to your pet, but the disease is often fatal. Recovery is very rare, and dogs that do recover often have underdeveloped tooth enamel, which predisposes them to dental disease throughout life. Also, if your dog developed any neurologic signs during the course of this common puppy disease and survived, those neurologic symptoms usually remain for life. 3. Kennel Cough  Kennel cough, more formally known as canine infectious respiratory disease, is one of the most common upper respiratory illnesses in both dogs and puppies. It can be caused by bacteria or viruses (or both at once!). Kennel cough is transmitted when your puppy’s mouth or nose comes into contact with the disease. This is why the common puppy illness is associated with places that have a lot of dog traffic, such as kennels, shelters, grooming facilities, dog parks, and veterinary hospitals. Kennel cough is easy to recognize—your dog will be coughing but seem otherwise healthy. She’ll be eating well, drinking well, and have good energy, though she might also experience some nasal or eye discharge. The good news about kennel cough? Treatment is often not needed, as the symptoms are generally mild and self-limiting. However, in some cases, antibiotics, steroids, and cough suppressants might be prescribed by your veterinarian, so it’s important to have your pet checked just to be safe. Most puppies recover within 10 days. 4. Leptospirosis  Leptospirosis is a bacterial infection typically transmitted through infected urine. Dogs often pick it up from exposure to water sources, soil, food, or bedding that has infected urine on it. Once infected, the bacteria primarily target the kidneys and liver. In the U.S., leptospirosis is most commonly found in the Midwest, East, and Southeast. Dogs that are more exposed to livestock and wildlife—as well as dogs in a shelter setting—seem to have an increased risk of acquiring the disease. Telltale symptoms of this common puppy illness include: Fever Vomiting Diarrhea Dehydration Increased thirst and urination Lethargy Muscle soreness Stomach pain Coughing Difficulty breathing Jaundice (yellowing of the skin) Spontaneous bleeding (from the nose, gums, in the stool or vomit, in the urine, etc.) Unlike the other illnesses listed above, this disease can be transmitted to people. For this reason, it’s important to wear gloves and wash your hands when cleaning your dog’s urine until they’ve finished their course of treatment, which is typically done through antibiotics. But leptospirosis can be fatal, and some dogs require more aggressive fluid therapies. Even after surviving the initial infection, dogs can develop chronic kidney failure and chronic liver disease. 5. Vomiting and Diarrhea   While not illnesses themselves, vomiting and diarrhea are symptoms of an underlying illness and are indications your puppy should be assessed by a veterinarian. Some of the more common causes of vomiting and diarrhea in puppies include: Foreign body (they ate something they shouldn’t have and it’s stuck in their stomach) Eating a toxin or garbage Intestinal parasites Diet change Bacterial infection Viral infection Stress Treatment for vomiting and diarrhea varies depending on the cause and can range from outpatient therapy to surgery and/or hospitalization. 6. Parasites  Parasites are organisms that live on—or in—a host and get their food from or at the expense of the host. Puppies are more predisposed to parasites due to their underdeveloped immune system, and there are several different types of parasites that can affect them, both externally and internally.  Common internal parasites include: Roundworms Hookworms Tapeworms Whipworms Giardia Coccidia Heartworms Common external parasites are: Fleas Ticks Lice Ear mites Scabies (Sarcoptic Mange) Demodex Cheyletiella mites (“walking dandruff”) Symptoms and treatment vary greatly depending on the type of parasite. To protect your puppy, stay up to date on dewormers and routine flea and tick prevention. 7. Adenovirus  Though not as common as other puppy illnesses on this list, canine adenovirus, also known as infectious canine hepatitis, is a viral infection in dogs. It is typically spread through contact with an infected animal or a contaminated fomite (an object that encountered an infected animal). The virus primarily attacks the liver and the cells that line blood vessels. Fortunately, this virus is part of a combination DAPP vaccine that protects against distemper virus, adenovirus, parvovirus, and parainfluenza and has been used to effectively control the disease, making the condition rare. That said, it can still occur in unvaccinated dogs. Symptoms of adenovirus include: Fever Decreased or no appetite Lethargy Depression Vomiting Diarrhea—usually bloody Coughing Eye and nose discharge Weakness Difficult breathing Like most viruses, there is no specific treatment for adenovirus, but supportive, symptomatic care can be provided through IV fluids, blood transfusions, liver supplements, and more. The survival rate for adenovirus ranges from 1-30%, which is why it’s so important to get your puppy vaccinated. Dogs that do recover are at risk of chronic liver disease. How To Keep Your Puppy Healthy While many of these diseases may sound scary, there are vaccines that can help prevent many common puppy illnesses. Vaccinate Your Puppy  One of the core vaccines in puppies is DAPP (sometimes labeled DHPP), which stands for distemper, adenovirus (or hepatitis if labeled DHPP), parvovirus, and parainfluenza virus. This vaccine is administered every 2-4 weeks until your puppy is 16-20 weeks old. There is also a vaccine for bordetellosis and canine influenza, which are two common causes of kennel cough, as well as a vaccine for leptospirosis. These vaccines can significantly reduce the risk that your puppy will acquire these diseases, which could save her life. Work To Prevent Parasites                        Regarding parasites, it’s important to have your pup on flea, tick, and heartworm preventatives, which typically come in the form of monthly chewable tablets. It’s also important to have your puppy’s feces tested for intestinal parasites that, if present, can then be treated with an appropriate dewormer. And while some of these preventative measures may seem to add up financially, they can ultimately save you a significant amount of money when compared to treating the diseases themselves. Many of the common illnesses in puppies can be easily prevented when the appropriate vaccines and preventative care protocols are followed. It’s important that you consult with your veterinarian to see what’s recommended for your pet.  "}]