[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Potty Train a Puppy or Adult Dog", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/potty-train-puppy.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/potty-train-puppy.jpg"}, "author": {"@type": "Person", "name": "Heather Hoffmann, DVM", "url": "https://www.petmd.com/author/dr-heather-hoffmann"}, "keywords": "Dog, Puppy, Adult, Symptom Checker, Potty Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/how-to-potty-train-your-dog"}, "datePublished": "June 30, 2020", "dateModified": "September 27, 2023", "description": "House training is an important part of adding a new dog to your family. Here’s everything you need to know about how to potty train a puppy.", "articleBody": "One of the most important first steps when you adopt a puppy is house training, aka potty training. The process of training a puppy (or even an adult dog) to learn the appropriate time and place to eliminate takes determination and patience. The key is to remember that successful potty training is based on repetition and positive reinforcement instead of punishment. So how do you potty train a puppy? And what if you have adopted an adult dog that is not potty trained? Here’s how to save your floors. How to Potty Train a Puppy Potty training should begin with developing a schedule that both you and your dog can follow. You may also wish to use a repeatable phrase, such as “bathroom,” or “potty,” each time you take your dog to the elimination area so they learn to associate that word with the action. Here are some do’s and don’ts of potty training a dog. Do&#039;s of Potty Training a Puppy Follow these tips, and you’ll have your puppy or dog potty trained before you know it! 1. Take Your Puppy Out Often New puppies, especially those under 12 weeks of age, should be taken outside every one to two hours. This high frequency is because puppies 12 weeks and younger are still developing their bladder control and are more likely to have accidents in the house. It’s also a good habit to take your puppy out after sleeping, playing, eating, or drinking. 2. Stick to a Feeding Schedule Typically, it’s recommended to feed your puppy three to four meals a day. Feed your dog each meal at the same time each day. They will naturally eliminate shortly after eating, so developing a consistent feeding schedule can avoid confusion and accidents in the house. 3. Use Crate Training as an Aid to Potty Training Crate training is a very effective tool to help not only with potty training your puppy, but also with creating a safe place for your puppy to call home. Dogs are naturally den animals, so their instincts will tell them to find a quiet place to eat and rest. Dogs do not like to eliminate where they sleep or eat, so training your puppy to be comfortable in a crate is a great way to prevent them from having accidents inside. The crate should never be used as punishment, but it should be used whenever your puppy cannot be directly supervised, and for naptime and bedtime. Choosing the correct crate size is extremely important, especially for large-breed dogs that grow rapidly during puppyhood. Keep in mind that your puppy should only have enough room to stand up, turn around, and lie down comfortably—any more room will give your dog room to rest in one corner and pee or poop in the other. Many crates come with a divider that can be moved as your puppy grows. 4. Always Practice Positive Reinforcement Positive reinforcement teaches your puppy that they get rewarded for going to the bathroom outside, and it’s the key to successful potty training. Each time your puppy eliminates outside, immediately reward them with verbal praise, treats, or a favorite toy. The reward should immediately follow the event so that your puppy makes a positive association with eliminating outside. 5. Recognize When Your Puppy Needs to Go Out Constant supervision is another important part of successful potty training a puppy. Learning the clues or signals that indicate your puppy needs to eliminate will prevent unnecessary accidents in the house. Most dogs will sniff, make circles, wander off, whine, or sit by the door to indicate they need to go to the bathroom. 6. Put Your Puppy on a Leash for Potty Breaks You should always put your puppy on a leash when you go outside for a potty break. This will not only help get them comfortable with being on a leash, but you will also be right there to reward the good behavior. After giving a positive reward, play with your puppy outside for a few minutes to avoid creating a negative connection with returning inside. Don&#039;ts of Potty Training a Puppy You may have heard some conflicting advice on house training a puppy. Here’s what you should NOT do. 1. Use Potty Pads Puppy pee pads should not be used as a substitute for going outside, unless you have a special situation such as living in a high-rise apartment or have limited mobility. Allowing puppies to eliminate on potty pads inside the house can confuse them about where they’re allowed to eliminate. This may slow down the potty-training process and should be avoided, if possible. 2. Use Punishment Instead of Positive Reinforcement Punishment is never an acceptable or successful training method. Outdated “training techniques” used to suggest hitting a dog with a newspaper or rubbing their face in their excrement to “teach them a lesson.” Dogs do not associate these behaviors with doing something wrong. Instead, punishment teaches your puppy to become fearful of their human parents or other people who try to punish them. Remember that potty training takes patience and kindness! 3. Keep Inconsistent Schedules Failing to adhere to a consistent potty break and feeding schedule can create confusion for your puppy, therefore leading to more accidents in the house. Having a puppy is a big responsibility, and it’s your job to stick with the schedule and constant supervision—just as you would with a child. The more frequent trips outside, the better! The more often your puppy is allowed to successfully eliminate outside, the more quickly they will become potty trained. How to Potty Train an Adult Dog Potty training an adult dog can be very similar to training a puppy, depending on the circumstances. Some adult dogs may have never been taught to go to the bathroom outside, so they’ll need be trained to hold their bladder. If you adopt an older dog who is peeing inside, have your new pet examined by a veterinarian to ensure that they are healthy and don’t have any underlying conditions that could prevent them from being successfully potty trained. Most adult dogs can be successfully potty trained in a month or less. If it has been over a month and you are still having trouble, you may need to speak to your veterinarian or a trainer for additional advice. Do&#039;s of Potty Training an Adult Dog You may wish to say a phrase like “bathroom” or “potty” each time you take your dog outside so they start to associate that phrase with eliminating. Here are some more tips to potty train your adult dog successfully. 1. Set a Schedule As with puppies, potty training an adult dog should begin with developing a schedule that both you and your dog can follow. This includes feeding your dog two meals daily at the same time each day. Adult dogs also naturally eliminate shortly after eating, so developing a consistent schedule of eating and potty breaks can avoid confusion and accidents in the house. 2. Limit Your Dog’s Space While Potty Training For adult dogs entering a new home, it’s important to limit the amount of space they have access to while the house-training process is still in progress. This can be accomplished with baby gates or crate training. As your dog becomes potty-trained, you can gradually increase the amount of space that they have access to. 3. Use Crate Training to Help With Potty Training Crate training is also effective for adult dogs. Like puppies, they do not like to eliminate where they sleep or eat, so they will avoid eliminating in a crate they have come to call home. Again, the crate you use to train your dog should only have enough room for them to comfortably stand up, turn around, and lie down. While you are potty training, your dog should be crated during naptime, bedtime, and whenever they cannot be directly supervised. Adult dogs may take more time to adjust to a crate. If your dog is showing signs of stress or anxiety with crate training, contact your veterinarian. 4. Use Positive Reinforcement Positive reinforcement isn’t just for puppies—it’s the key to successful potty training for any dog, including adults. Each time your dog eliminates outside, reward them with verbal praise, treats, or a favorite toy. Just as with puppies, positive reinforcement will teach your adult dog that they get rewarded for going to the bathroom outside. Give the reward immediately after your dog eliminates outside so they make a positive association with that behavior. 5. Recognize When Your Dog Needs to Go Out Learning your adult dog’s signs that they need to eliminate will prevent unnecessary accidents in the house. Just like puppies, adult dogs often sit by the door, whine, wander off, sniff, or make circles when they need to go to the bathroom. 6. Walk Your Dog on a Leash Instead of Just Letting Them Out in the Yard During potty training, you should always walk your adult dog on leash to the appropriate elimination area. This ensures you will be close by to reward their good behavior. After giving a positive reward, remember to play with your dog outside for a few minutes to avoid creating a negative connection between eliminating and returning inside. Don&#039;ts of Potty Training an Adult Dog Don’t fall into these traps while potty training your adult dog. 1. Use Potty Pads Allowing your adult dog to eliminate on potty pads inside the house can be confusing for them as they’re learning which areas are appropriate potty spots—and which aren’t. This may slow down the potty-training process and should be avoided if possible. 2. Use Punishment Instead of Positive Reinforcement Whether you’re training a puppy or an adult dog, punishment is never acceptable or successful. Never hit your dog with anything or rub their face in their excrement when they have an accident—these outdated tactics have been proven ineffective. Dogs that are punished will often become fearful of the people punishing them. Potty training can be frustrating, but remember to practice patience and kindness—no matter how old your dog is! 3. Keep Inconsistent Schedules Failing to adhere to a regular routine can confuse your dog, leading to potty accidents in the house. Remember: It’s your job to create and maintain a schedule, keeping constant watch over your dog. The more opportunities your dog has for successful elimination outside, the faster potty training will go! Featured Image: iStock/StephM2506"}]