[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Care & Healthy Living", "item": "https://www.petmd.com/dog/care"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Ear Cropping in Dogs", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-06/ear-cropping-dogs.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-06/ear-cropping-dogs.jpg"}, "author": {"@type": "Person", "name": "Jamie Lovejoy, DVM", "url": "https://www.petmd.com/author/dr-jamie-lovejoy"}, "keywords": "Dog, General health, Adult, Puppy", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/general-health/ear-cropping-dogs"}, "datePublished": "June 14, 2023", "dateModified": "June 14, 2023", "description": "Ear cropping in dogs is a historical and controversial practice. While it’s fairly common to see some breeds of dogs with cropped ears, many major veterinary groups advocate against it. Here’s what to know about ear cropping dogs.", "articleBody": "Though dogs have been bred to have a wide range of ear sizes and shapes, there’s still a large population of dogs who are subjected to a surgical ear alteration called “ear cropping.” Banned in multiple countries, this cosmetic procedure has too much risk and too little benefit for the modern dog. Though becoming less popular with pet parents and even some breed enthusiasts, myths about the benefits of ear cropping still make this procedure a welfare struggle in the U.S. Here’s what to know about ear cropping in dogs. What Is Ear Cropping in Dogs? Ear cropping refers to surgically cutting away the outer ear (pinna) to alter the ear’s shape. This is usually done either with scissors or a sharp blade. Depending on the extent of the procedure, the tissue may be closed with sutures or with surgical glue. In some dogs, the remaining tissue is then positioned with tape and bandages to encourage the appearance of a pointed ear. In others, nearly the entire outer ear is removed. Cropping is usually performed on puppies who are 6–12 weeks old because it allows for further development of the ear after surgery. It’s also believed that older animals suffer more from the pain of the procedure. While a procedure such as this should only ever be performed by a licensed veterinarian under general anesthesia, it’s not unheard of for unscrupulous breeders to crop ears at home without pain control.  Most ear cropping is performed to achieve a specific appearance and is extremely uncommon in mixed-breed dogs. Common breeds to exhibit cropped ears are: Doberman Pinschers Great Danes Mastiffs Pit Bull Terriers Doberman and Great Dane ears are generally left long and pointed while the “Bully” breeds will frequently have very little of their outer ear left. Are There Any Benefits to Ear Cropping a Dog? Historically, ear cropping in some breeds was used to reduce injury in dogs expected to live a violent lifestyle. Dogs used in dogfighting and bear baiting (both now-illegal sports) were cropped to keep the opponent from grabbing onto a long pinna. Dogs who were used for protection had their ears cropped to create a more aggressive appearance. Cropped ears became an expected appearance for these breeds and is perpetuated now only to harken back to those standards. While some claim that cropped ears are medically beneficial (such as to avoid ear infections and injuries), there’s no evidence to support this. There is also a myth that cropping a dog’s ears helps with hearing, but the pinna is extremely important for hearing acuity in mammals, so it’s more likely that the reverse is true.  Should I Crop My Dog’s Ears? Anesthetic and post-operative complications from ear cropping—especially when not performed by a veterinarian—are well documented. Normal post-operative pain and/or complications such as infection during the time when a puppy is most impressionable (8–10 weeks of age) can negatively (and permanently!) affect how a puppy interacts with their environment and family. Puppies and adult dogs use their ears for communication. Though in-depth studies have not been performed, it is suspected that ear cropping can actually hinder inter-dog and dog-human communication, resulting in fear and anxiety behaviors. This negative result has been documented in a closely related procedure: tail docking. Due to the risks and lack of clear medical benefits, veterinary groups including the American Veterinary Medical Association, American Animal Hospital Association, and Canadian Veterinary Medical Association actively oppose the practice. Ear cropping is illegal in the United Kingdom, and the Royal Kennel Club will not allow cropped dogs to be shown in their rings. In short, ear cropping is a purely aesthetic procedure and there is no medical benefit to cropping the ears of a dog. Though most purebred puppies will have their ears cropped prior to going to their forever home, it’s worthwhile as a dog-lover to find a breeder who does not commit to these standards. Featured Image: Adobe/DragoNika"}]