[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How to Help a Puppy Who Isn’t Gaining Weight", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/petmd-puppy-weight.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/petmd-puppy-weight.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Nutrition, Puppy", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/how-help-puppy-who-isnt-gaining-weight"}, "datePublished": "February 6, 2018", "dateModified": "August 16, 2022", "description": "Puppies grow at different rates, but if yours is below the average for his breed, there may be an issue. Find out why some puppies are resistant to weight gain, as well as what you can do to tip the scale in their favor.", "articleBody": "By Paula Fitzsimmons You’re feeding your puppy a nutritionally-balanced diet and following the directions on the label with precision. You watch as your new best friend voraciously eats his dog food, and surmise his appetite isn’t the problem. Despite your best efforts, however, he’s not gaining weight as he should. Puppies grow at different rates, but if yours is below the average for his breed, there may be an issue. Anything from ineffective feeding methods to underlying diseases can cause slowed growth in puppies, says Dr. Dan Su, a clinical nutrition resident at the College of Veterinary Medicine at the University of Tennessee in Knoxville. You may unwittingly be feeding your puppy an insufficient number of calories or a diet that lacks essential nutrients for growth. However, “medical causes of slowed growth are more common and can include parasites, digestive issues (such as inflammatory bowel disease), a liver shunt, and diabetes, for example,” Su says. Read on to gain insight into why some puppies are resistant to weight gain, as well as what you can do to tip the scale in their favor. Of course, run any changes you plan to make to your puppy’s diet past your veterinarian first. Underlying Causes  For pampered pets, the inability to gain weight is rarely due to inadequate food intake, “especially if the puppy’s appetite seems good,” says Dr. Cailin Heinze, a veterinary nutritionist at Cummings School of Veterinary Medicine at Tufts University in North Grafton, Massachusetts. It’s best to play it safe and bring your puppy to the vet to rule out medical causes. There could be any number of reasons behind her inability to gain weight, but intestinal parasites—particularly roundworms and hookworms—are probably the most common, says Dr. Joe Bartges, professor of medicine and nutrition at the College of Veterinary Medicine at the University of Georgia in Athens. Inflammatory bowel disease, protein losing enteropathy (any condition of the GI tract resulting in loss of protein), and hypoglycemia are examples of diseases your vet may look for, says Dr. Susan Jeffrey, a veterinarian with Truesdell Animal Hospital in Madison, Wisconsin. Or the problem may be dental-related. “Is there something painful? For example, the puppy’s teeth may not have erupted normally and may be coming into contact with the tongue.”   Additionally, certain foods can be too rich for some puppies and result in diarrhea. “This isn&#039;t necessarily a food allergy, but I think some pups with developing gastrointestinal tracts can&#039;t handle certain foods,” she explains. Is Your Puppy Getting Sufficient Calories? If your vet has ruled out an underlying condition, it’s possible your puppy is not getting the right number of calories. Jeffrey recommends discussing your dog’s diet with a vet, and calculating the recommended daily caloric intake for the puppy, a methodology based on breed, a dog’s activity level, and reproductive status. “Spayed or neutered animals may not need as many calories as intact animals,” she says.  Feeding a higher calorie food may be beneficial if the puppy has a poor appetite and isn’t finishing the recommended portion of food, says Heinze, who is board-certified in veterinary nutrition. “But this should only be attempted after parasites have been checked for and treated and blood work and other diagnostics have been done to rule out health issues.” Examine Your Puppy’s Diet Diets devoid of an essential balance of vitamins, minerals, proteins, fats, and carbohydrates may also be to blame, says Jeffrey, whose professional interests include preventative care. “You should be feeding your puppy a diet that is AAFCO-approved (complete and balanced) for growth, as well as choosing a diet that is appropriate for the presumed adult size,” Jeffrey explains. “For example, large and giant breed puppies should eat a diet labeled for large breed puppies.” Despite what you might think, diets formulated for growth aren’t always high quality. “Consider changing the diet to a more well-known diet from a larger pet food company or even feed a therapeutic diet,” advises Bartges, who is board-certified in veterinary internal medicine and veterinary nutrition. A raw food diet isn’t a cure-all, either. “While I help people with raw food diets if that is what they want to feed, I discourage pet parents from feeding raw food diets to puppies,” he says.  “The margin of safety is narrow during growth and this can be an issue not only for nutrient imbalances but also infectious disease.” What to Avoid You may be tempted to add a nutritional supplement to puppy food to encourage growth, but using supplements without consulting a vet can harm your canine companion. For example, “excess calcium can increase the risk of developmental orthopedic diseases in large breed puppies; excess vitamin D can lead to toxicity,” Su says. Another potential problem to avoid is obesity. “Many puppies that owners deem too thin are at a healthy weight and the owners are trying to make them fat because they don’t have a good understanding of what a healthy puppy looks like,” Heinze says. “Unless the puppy has a known health issue, being slightly ‘ribby’ is generally healthier than slightly overweight, especially for large and giant breed dogs.” Vets recommend frequent weight checks to ensure your puppy doesn’t become overweight. “And if weight gain is faster than desired, calorie adjustments can be made before weight gain becomes excessive,” Su says. In addition to ruling out underlying conditions and ensuring your dog’s diet is balanced and provides the appropriate number of calories, you may want to examine your feeding methods. “Some puppies need several small meals throughout the day instead of two large meals,” Jeffrey says. “Feeding small meals may help with weight gain.” Also look for behavioral clues. “If the puppy is having to compete to eat with other dogs in the house, the puppy should be fed separately,” she says. “Not only will this help reduce stress, it will allow the owner to determine the exact amount of food the puppy is eating.”"}]