[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Dog Nutrition Center", "item": "https://www.petmd.com/dog/centers/nutrition"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "How Much To Feed a Puppy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-09/puppy-at-his-bowl.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-09/puppy-at-his-bowl.jpg"}, "author": {"@type": "Person", "name": "Amanda Ardente, DVM, PhD", "url": "https://www.petmd.com/author/dr-amanda-ardente"}, "keywords": "Dog, Puppy, Feeding, Nutrition, Zoo Puppy Pack, Wellness", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/nutrition/how-much-to-feed-puppy"}, "datePublished": "January 17, 2023", "dateModified": "November 6, 2023", "description": "Creating a puppy feeding schedule keeps your dog on a routine and ensures their nutritional health. Learn more about how much to feed your puppy.", "articleBody": "Meals can be given to your puppy in different ways. These include: Free choice: when food is left down for your pup to eat as he pleases. Time-restricted meals: when food is put down for a certain amount of time for your dog and then taken away. Food-restricted meals: when the amount of food is minimized per mealtime or per day. The most effective method for growing puppies is providing food-restricted meals. This can help control your puppy’s growth and physical condition. Here’s what to know about feeding your puppy, how much to feed a puppy, and how to create a puppy feeding schedule. How Much Should I Feed My Puppy? The amount of food given to your pup depends on their current body weight and body condition score. The goal is to prevent your puppy from growing too quickly and becoming obese. The puppy food you select will likely have a feeding chart on the bag describing how much food to give your dog depending on their body weight. However, these charts often don’t provide the most accurate amount, and don’t consider your pup’s individual needs and current physical condition. Instead of relying on the pet food label chart, talk with your veterinarian about the best feeding plan for your new family member. If you find that your puppy is becoming overweight, reduce the amount of food given per day while maintaining the same feeding schedule. Increase your puppy’s daily low-impact exercise by taking them on more frequent walks or encouraging them to swim. As your puppy continues to grow, their body condition will begin to balance out, indicating that their nutrient needs are met. Instead of relying on the pet food label chart, talk with your veterinarian about the best feeding plan for your new family member.How Often Should I Feed My Puppy?  A puppy’s meal schedule should include at least three measured meals a day, preferably at the same time. For example, feed your puppy’s first meal around 7 a.m., second meal at 12 p.m., and dinner at 5 p.m. Smaller, more frequent meals will help manage your puppy’s fast metabolism and help keep them full throughout the day. Feeding Chart for Puppies To find the best puppy feeding times, create a schedule that aligns with your weekday routine and can also be followed on weekends. Keep in mind that puppies who are under 3 months old may need to be fed three to four times a day. Discuss the best feeding and exercise schedule for your specific pup with your veterinarian. Here is an example of a feeding schedule for a puppy:  What Food Is Best for Puppies? Dog food formulated for growth will have a greater amount of nutrients such as protein, fat, and calcium to help promote muscle and bone development. As your puppy grows, their nutritional needs shift. It’s important to work with your veterinarian to make sure you’re meeting your puppy’s needs when choosing the right food for them. Here are a few key components to look for in your puppy’s food: Energy: To support their growing bodies and greater activity levels, puppies need to be provided with sufficient energy (calories) to meet their high metabolic needs. Protein: Newly weaned puppies (puppies who have recently stopped drinking their mother’s milk) require the most protein. As they age, their need for protein slowly decreases. Fat: Fat is necessary for growing puppies because it’s high in calories, contains essential fatty acids, and acts as a carrier for vital vitamins. Carbohydrates: Until adulthood, carbohydrates should be included in the food at about 20% dry matter (when moisture is removed) to promote a pup’s metabolism and overall health. Calcium and phosphorous: To support their growing bones, puppies need more calcium and phosphorous than adult dogs. Large- and giant-breed puppies require restricted calcium amounts to prevent them from growing too much or too fast. Copper: Puppies can develop copper deficiency if it isn’t in their food. Signs of copper deficiency include loss of hair pigment, hyperextension of the toes, splayed toes, and anemia. Digestibility: A puppy’s digestive tract is still maturing, so their food should be highly digestible to reduce gastrointestinal discomfort or upset. Foods specifically formulated for puppies will be rich in energy-containing nutrients like protein and fat, making them inherently more digestible. Amino acids: Arginine: This amino acid is essential for puppies, meaning that their bodies cannot make it on their own. Dog foods formulated for the puppy life stage will be fortified with arginine. Phenylalanine and tyrosine: These amino acids are required for growth, so a minimum amount (1% dry matter) is recommended for growing puppies. As your puppy grows, their nutritional needs shift. It’s important to work with your veterinarian to make sure you’re meeting your puppy’s needs when choosing the right food for them.Weaning to 3 Months Protein in a dog’s milk is high, readily available, and digestible. Therefore, younger puppies that have just been weaned have the greatest need for protein. Fat is also an important at this stage because it supports a puppy’s rapidly developing nervous system. 3 to 6 Months When puppies reach 3 months old, their protein and fat requirements begin to decline (though they’re still greater than the amounts required in adulthood). At this stage, a puppy’s activity level ramps up, so his weight and body condition should be closely monitored to ensure the right number of calories are provided. If you were feeding your pup four times per day, consider reducing to three meals per day. 6 to 12 Months As puppies near 1 year of age, their growth is continuing to slow down, particularly for large and giant breeds. It’s important to reassess weight gain, body condition, and activity level, as well as standing position and walk, and reduce the amount of food and calories provided, as needed. You may also reduce the feeding frequency at this point to just twice per day. After 1 Year Adult dogs require less protein, fat, and minerals than puppies do. The goal is to transition your dog to an adult food once they have reached about 80% of their anticipated adult size. For small and medium-sized dogs, this can be around 12 months of age, but for large and giant breed dogs, this could occur between 18–24 months of age. There’s no harm in feeding a puppy diet into adulthood if the calories and amount of food provided are appropriately adjusted for your dog’s body weight and condition. Again, the best way to balance your pup’s diet is by working with your vet. Finding the Best Food for Puppies The most important factor in selecting a food for your puppy is choosing one that promotes their growth. The food should also be produced by a reputable company that has scientifically researched their foods by conducting feeding trials. Ensure the company employs a nutritionist to help formulate their diets. This information might not be readily available, so you may have to call the company or search their website to find the answer. Always be sure to discuss your choice with your veterinarian to ensure your puppy is starting off his life with an optimal nutrition plan that meets the standards set by the Association of American Feed Control Officials (AAFCO). Featured Image: iStock.com/VYCHEGZHANINA"}]