[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Slideshows", "item": "https://www.petmd.com/slideshows"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "6 Common Puppy Actions and What They Mean", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Slideshows", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_519274420.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2020-10/shutterstock_519274420.jpg"}, "author": {"@type": "Person", "name": "Victoria Schade, CPDT-KA", "url": "https://www.petmd.com/author/victoria-schade"}, "keywords": "Dog, Puppy, Behavior", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/slideshows/6-common-puppy-actions-and-what-they-mean"}, "datePublished": "May 2, 2017", "dateModified": "September 7, 2022", "description": "If your puppy does things that make you scratch your head in confusion, here are some explanations as to why puppies act the way they do. Learn what your puppy&#039;s actions mean and how you can help train your puppy from the start.", "articleBody": "By Victoria Schade   You’ve got a new puppy, which probably means you’ve also got quite a few questions about your furry housemate. Some of your pup’s behaviors can be mystifying. Like, why is the puppy sleeping so much? Why does she nip me every time I try to pet her? What’s with that crazy running around thing she does every afternoon? And will she grow out of these behaviors?   Even though some puppy behaviors can seem strange, most of what the average puppy parent deals with is completely normal. The following list will help you decode some of your new puppy’s perplexing behaviors. You might notice that your puppy has two speeds: either full-tilt or deep sleep. Sometimes, the deep sleep is so deep, and goes on for so long that it’s a bit unsettling. Is a constantly napping puppy okay?   If you’ve taken your pup to the vet and gotten a clean bill of health, you shouldn’t worry about your champion day-sleeper. Growing pups need a great deal of time to rest their brains and bodies—well over fifteen to eighteen hours per day—so your pup’s drive to nap is a perfectly normal part of development. Let your sleeping pup lie, preferably in her crate, and enjoy the solitude while you can. Many pet parents are caught off guard the first time their puppy gets a burst of energy and zips from room to room like a wild animal. This silly behavior is known as a “FRAP” or frenetic random activity period, and it is an adorable and very normal part of puppyhood.   FRAPs typically happen in the late afternoon, and usually include a combination of crazed running, drive-by nipping, rolling, and leaping. There’s no need to intervene in your pup’s FRAP unless she’s causing damage or is in danger of hurting herself. If your puppy’s FRAPs are particularly intense, consider redirecting her before she starts running with a bone or toy in her mouth. Otherwise, enjoy the silliness while it lasts, because most pups will eventually grow out of this behavior. Puppies love to be petted, but there’s a misunderstood period that often occurs during the teething phase, typically around sixteen and eighteen weeks of age, when many pups opt to nip their humans any time they reach out for a pet or snuggle. This type of reaction can be physically and emotionally painful, because the nippy reaction hurts, plus it seems like the pup no longer enjoys your touch.   Barring any undiagnosed medical or behavioral problems, this is a normal developmental hiccup that’s fleeting if you approach it the right way. Your pup might be too revved up after a vigorous game to enjoy petting and might respond by nipping you, so instead of pushing for physical contact, take a break and redirect her to an appropriate chewing outlet. Resume petting when your pup has calmed down, and opt for a gentle shoulder massage instead of pats. Remember to use the proper “ouch” protocol to help your puppy learn how to manage her teeth around human skin.  You and your puppy are having a blast playing together when she suddenly stops and takes a potty break on the carpet right in front of you without any of the typical warning signs, like circling or sniffing the ground. These types of seemingly unpredictable accidents can be a part of the process as your puppy learns to make the connection between the need to eliminate and the importance of signaling that fact to you.   Puppies can get so caught up in playtime that they don’t realize that they have to go, and wait until it’s too late. It’s important to remember that intense physical activity can increase your pup’s need to go. The best way to avoid mid-game accidents is to take frequent potty breaks during the game, even if your pup had one right before you began. Heading outside every 20 minutes or so is not unreasonable during the potty-training period. You might be surprised when your fuzzy tornado suddenly freezes and refuses to move the moment you put the leash on her. This statue-like behavior can be frustrating when you need to walk your pup, but it’s important to think about what’s going on from your puppy’s perspective. The unfamiliar sensation of the collar around her neck and the feeling of being tugged along by the leash probably feels strange, and possibly scary. It’s not a matter of insubordination when your puppy refuses to walk along with you, it’s more a matter of sensory confusion.   To prevent the freeze, purchase the lightest leash your pup can safely wear and allow her to check it out before you put it on her (a heavy leash and clasp can feel uncomfortable around your pup’s neck). Attach the leash and let her drag it around the house while you supervise her, and when you finally pick up the leash, drop savory treats on the ground in front of her to encourage her to walk along near you. Give her time to acclimate to the new sensation before you go out for a stroll.  Most dogs have an irresistible urge to chase rapidly retreating objects, from balls to squirrels, and for puppies this innate desire might manifest in pursuing your pant legs or shoes as you walk by. It doesn’t mean your pup is vicious or out to get you, it’s merely a play behavior that likely gets a reaction from you that accidentally encourages the chase. Remember, any attention a bored puppy receives “works” for her, so the shrieking and leg shaking you resort to when your pup latches on to your pajamas becomes a fun way for her to start the day.   This is a predictable behavior and may be triggered by a specific pair of pants or shoes. Prevent the behavior from occurring by redirecting your puppy to a treat-filled activity toy when you wear the tempting outfit. Or train your puppy to walk along beside you by dropping treats as you pass. You can also encourage her to play with a toy on a string instead of your clothes.   "}]