[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Vomiting and Diarrhea in Puppies", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-03/beautiful-portrait-of-a-beagle-puppy-lying-on-the-floor-looking-at-the-camera.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DElkJV9ZeEHvwNG9EvW0SJPRe4A7Tt4X0lJC1tuRAOM8%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-03/beautiful-portrait-of-a-beagle-puppy-lying-on-the-floor-looking-at-the-camera.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DElkJV9ZeEHvwNG9EvW0SJPRe4A7Tt4X0lJC1tuRAOM8%3D.jpg"}, "author": {"@type": "Person", "name": "Jamie Case, DVM", "url": "https://www.petmd.com/author/dr-jamie-case"}, "keywords": "Dog, Puppy, Symptom, Vomiting, Digestive health, Diarrhea", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/vomiting-and-diarrhea-puppies"}, "datePublished": "March 29, 2023", "dateModified": "March 29, 2023", "description": "Is it normal for puppies to throw up or have diarrhea? Dr. Jamie Case explains why your puppy might be having an upset stomach and when you should go to the vet.", "articleBody": "All puppies will experience vomiting or diarrhea at some point—and most of the time, it doesn’t mean there’s anything seriously wrong. However, it’s not a good idea to dismiss vomiting or diarrhea in your puppy, especially if you see blood or mucus or if it’s happening often. Learn more about the causes of vomiting and diarrhea in puppies and when you should see your veterinarian to make sure there are no serious underlying causes.   Causes of Vomiting and Diarrhea in Puppies There are many reasons your puppy might be vomiting or have diarrhea, from harmless to serious medical conditions. Some conditions might cause blood in the vomit or diarrhea as well. In many cases, it’s impossible to tell what’s causing the upset just by looking at the vomit or diarrhea. The best way to figure out what’s going on is by going to the vet to make sure it’s not serious. Many times, multiple underlying causes will be identified. Here’s a list of the most common causes of vomiting and diarrhea in puppies. Viruses There are several viruses that can cause signs of an upset stomach in puppies. These include the common canine parvovirus, as well as other viruses like canine coronavirus, canine distemper virus, and canine herpesvirus. Viral infections tend to be more severe in young puppies. You can protect your puppy against many of the most common viruses with vaccinations. Typically, puppies require multiple vaccinations spread out over the first several months of life to be fully vaccinated, so work with your veterinarian to determine the most appropriate vaccination schedule for your puppy. Bacteria A healthy puppy’s digestive tract normally contains many strains of bacteria that cause no health issues. However, if certain strains of bacteria multiply too quickly or overgrow, or if your puppy picks up a bacterial infection, it can cause gastrointestinal upset. Bacteria that commonly overgrow include E. coli and Clostridial bacteria, which are both normally present in the GI tract. Stress, a sudden change in diet, a viral infection, or intestinal parasites can all cause these bacteria to overgrow. Bacterial infections that may cause vomiting and diarrhea include: SalmonellaCampylobacterYersinia enterocoliticaThese bacteria are zoonotic, meaning they can be transmitted to people, so it’s very important to wash your hands after handling a puppy that is experiencing vomiting and diarrhea. Intestinal Parasites Intestinal parasites are another common infectious cause of vomiting and diarrhea in puppies. Even if you don’t see worms in the vomit or diarrhea, and even if your puppy has been dewormed, puppies are highly susceptible to intestinal parasites. The Companion Animal Parasite Council recommends that puppies be tested for intestinal parasites at least four times in their first year of life. Worms that may cause vomiting and diarrhea in puppies include hookworms, roundworms, whipworms, and tapeworms. There are also microscopic intestinal parasites that can lead to gastrointestinal upset, including giardia and coccidia. Stress No matter how playful your puppy seems most of the time, it’s good to remember that puppyhood is a stressful time of life, and stress can cause vomiting and diarrhea. Stress can also affect immune system function and may make puppies more susceptible to viruses, bacteria, and intestinal parasites. Stress can come from leaving their mom and siblings, moving to a new home, being exposed to new situations, and learning the rules that are expected of them. Swallowing Things Puppies are curious and constantly exploring their environment. As a result, they often eat things they’re not supposed to, which can result in either vomiting or diarrhea. Many things puppies eat that cause upset are small enough to pass through the digestive system, irritating the sensitive lining of the stomach and intestines. This can include small toys, mulch, sand, rocks, sticks, paper, food wrappers, or really anything a puppy can get access to and is curious about. This can even include chew treats that were not completely chewed before swallowing. Larger objects are potentially more dangerous because they can get stuck in the gastrointestinal tract and cause an obstruction. Depending on where it’s stuck and whether it’s causing a complete obstruction (nothing can move past the object) or partial obstruction (some things are able to move past the object), this may be a medical emergency. Some larger objects that puppies commonly eat include toys, socks, underwear, blankets, bedding, and bones. Long, stringy objects like fabric, carpet, strings, and ribbons also pose a risk for causing what is known as a linear foreign body. A linear foreign body occurs when one end of a long, linear object gets stuck in the gastrointestinal tract (often where the stomach empties into the small intestine). This can cause the intestines to bunch up on themselves and results in serious, potentially life-threatening infections. Eating Something Toxic Toxins are also common causes of vomiting and diarrhea. Ingesting a toxin may cause a serious medical emergency, so if you suspect your puppy ate something toxic, it’s important that they be evaluated by a veterinarian as soon as possible. Common toxins include human pain medications (ibuprofen, Tylenol, Aleve), household cleaning agents (bleach, carpet fresheners and shampoos, dryer sheets, fabric softeners, and tablets used for toilet cleaning), chocolate, xylitol, grapes, rat poisons, and household plants. It is particularly important to make sure that none of your plants are toxic to puppies. Sudden Changes in Diet Sudden changes in food, introducing too many new treats, or letting your puppy eat human food can cause inflammation in their gastrointestinal tract and may lead to signs of an upset stomach. New foods can also alter the bacteria in their gastrointestinal tract. It is best to gradually transition puppies to new foods over the course of a week (sometimes even more slowly if you have a puppy with a sensitive digestive system).  Pancreatitis  Treats and human foods that are high in fat pose a risk of causing pancreatitis, which can cause a lot of pain and discomfort in addition to vomiting, diarrhea, and decreased appetite. Chronic Disease Chronic diseases are a less common cause of vomiting and diarrhea in puppies, but if a puppy is having issues with recurrent vomiting and diarrhea or is not responding well to treatment, their veterinarian may start to look for evidence of food intolerances or allergies. If an allergy or intolerance is discovered, your vet may recommend a special diet. Depending on your puppy’s other symptoms, your vet may also test for underlying liver or kidney disease, which can both contribute to vomiting and diarrhea. Other Potential Causes of Vomiting and Diarrhea in Puppies Hernias in puppies can lead to vomiting and diarrhea. A hernia occurs when a portion of the gastrointestinal tract becomes pinched off. Puppies can be born with hernias or they may develop after an injury. Intussusceptions, which occur when a section of the intestines bunches up, can lead to obstruction of the gastrointestinal tract and cause vomiting and diarrhea in puppies. What to Do if Your Puppy Is Vomiting and Has Diarrhea See a veterinarian right away in the following cases: Puppies under 4 months of age experiencing vomiting and/or diarrhea Puppies over 4 months of age that are experiencing both vomiting and diarrhea or are showing any other signs of not feeling well, such as decreased interest in eating or lethargy There is a suspicion that they may have swallowed or eaten something they shouldn’t have (a foreign object or a potential toxin) There is evidence of blood in the vomit or diarrhea They are vomiting so frequently that they can’t keep any food or water down They are showing signs of dehydration They have been vomiting for more than 24 hours They have had diarrhea for more than 24 hours Puppies that are experiencing both vomiting and diarrhea or are showing other signs of illness can quickly become dehydrated and should see their veterinarians right away. However, there are instances where waiting to see your veterinarian may be OK, including: In puppies that are over 4 months of age and having issues with vomiting, it may be safe to wait 24 hours to see the vet if they are not having diarrhea; are able to hold down water when offered small, frequent sips; do not appear to be in pain; can rest comfortably; and have relatively normal energy levels. In puppies that are over 4 months of age and having issues with diarrhea, it may be safe to wait 24 hours to see the vet if they are not vomiting; do not have blood in their diarrhea; are not having very frequent, watery diarrhea; and are eating, drinking, and acting normally. How to Check for Dehydration Dehydration can happen quickly in puppies experiencing vomiting and diarrhea. If you suspect your puppy might be dehydrated, try these at-home tests:   Skin Tent Test—This involves gently pulling up on the skin on the back of their neck to see if it quickly snaps back into place. If you pull up on the skin and it slowly goes back to normal, your puppy may be dehydrated. Mucous Membranes—If your puppy will allow it, try feeling their gums. If their gums feel sticky or tacky (like wet paint drying), they may be dehydrated. It’s important to keep in mind that some puppies will drool if they are nauseated, so it may feel like their gums are moist even if your puppy is dehydrated. Other things you may notice in dehydrated puppies are dry noses, sunken eyes, or lethargy. Is There Anything You Can Do at Home? If your puppy is over 4 months of age and only having an issue with vomiting or diarrhea but otherwise acts normal, some things that may help at home include: Offering a bland diet temporarily. A typical meal might include two parts cooked white rice mixed with one part boiled, boneless, skinless chicken breast. It is best to offer small, frequent meals when feeding a bland diet. Consider adding a probiotic to their diet to help promote digestive health (Nutramax Proviable and Purina FortiFlora are good options). How Vets Diagnose Vomiting and Diarrhea in Puppies When dealing with a puppy with vomiting or diarrhea, most veterinarians will start out with a general examination. They’ll also want to test a stool sample for intestinal parasites and canine parvovirus. Based on their findings, they may also recommend looking at blood work, X-rays, and ultrasound to investigate what is going on with your puppy. There are several questions your veterinarian will likely ask and information they will want when trying to determine what is causing vomiting and diarrhea in your puppy:  A copy of your puppy’s vaccination records (if they don’t already have it) If your puppy is on any sort of monthly heartworm prevention (some heartworm preventatives also help prevent some intestinal parasites) How long has your puppy had vomiting and diarrhea? How are they acting at home? Are they still eating and drinking normally? Has there been any blood in their vomit or diarrhea? Have there been any recent changes in their food or treats? Have they recently gotten into anything that they shouldn’t have? Treating Vomiting and Diarrhea in Puppies Treatment is highly dependent on the cause and severity. The mainstays of treatment include medications to stop vomiting, treat dehydration, and correct electrolyte imbalances. This will typically involve giving an anti-nausea medication, like Cerenia, and some sort of fluid therapy. In extremely mild cases where there isn’t evidence of significant dehydration, your veterinarian may recommend using an oral electrolyte solution, such as Oralade. In cases with mild dehydration, fluids may be administered under the skin (subcutaneous fluids) to help get puppies back to their proper hydration status. In cases of moderate to severe dehydration, hospitalization with IV fluids will be required. Some other mainstays of supportive care include probiotics, prescription bland diets such as Royal Canin Gastrointestinal Puppy, Purina Pro Plan EN, or Hill’s Prescription Diet i/d, and possibly an anti-diarrheal, such as Proviable diarrhea kit or Pro-Pectalin paste. Antibiotics may be recommended in cases of suspected bacterial infections. They may even be given when the cause is viral, even though antibiotics don’t treat viruses, because they may help prevent secondary bacterial infections. If intestinal parasites are causing gastrointestinal upset, prescription dewormers and/or antibiotics may be prescribed. If there are concerns about an obstruction, hernia, or intussusception, immediate surgery may be needed. Featured image: iStock.com/Vicente Suarez Belloch"}]