[{"@context": "http://schema.org/", "@id": "https://fast.wistia.net/embed/iframe/mgvley4kpv", "@type": "VideoObject", "duration": "PT2M3S", "name": "5327091881001", "thumbnailUrl": "https://embed-ssl.wistia.com/deliveries/ca3f0045a534dae049bb43857701dd8df5759aeb.jpg?image_crop_resized=640x360", "embedUrl": "https://fast.wistia.net/embed/iframe/mgvley4kpv", "uploadDate": "2018-04-09", "description": "a PetMD / Brightcove Videos video", "contentUrl": "https://embed-ssl.wistia.com/deliveries/29af0d06f6c461d5df28a5c973e219c678a4aee2.m3u8", "transcript": "Poly gypsy refers to an increased level of thirst in dogs while poly urea refers to an abnormally high urine production while serious consequences are rare. Your pet should be evaluated to ensure that these conditions are not symptoms of an underlying medical problem. Your vet Marion will want to rule out a urinary tract infection. Kidney failure, diabetes liver disease and other metabolic disorders.\n\nThe most common cause of urea and polydipsia also called PPD is a urinary tract infection but other issues include metabolic disease and renal failure metabolic diseases can include diabetes or a decrease in hormone production by the adrenal glands or the thyroid. Kidney disease Meanwhile can be congenitally based or can be linked to tumors. Increased steroid production increased thyroid hormone levels and electrolyte or hormonal disorders. Other potential factors behind PPD are low protein diets or even side effects from prescription medications.\n\nThe most common symptoms of dip Sia and poly area are an increase in urination and drinking more water than usual. There are generally no other behavioral changes standard tests will include a complete blood count. Blood chemistry a urinalysis and x-rays to diagnose a urinary tract infection or any issues with the kidneys the thyroid or adrenal glands or the reproductive system. Any other symptoms accompanying the increase in thirst and urination even when appearing unrelated will be taken into consideration during the final diagnosis.\n\nTreatment will depend on the underlying cause of the PPD. If a urinary tract infection is found antibiotics will be recommended and your pet should be rechecked in a couple of weeks. If kidney or liver disease is diagnosed your veteran may recommend a diet change or fluid therapy diagnosis of a metabolic disorder will require further therapy such as insulin treatment or thyroid or adrenal gland modifying medication if no serious medical conditions are found. No treatment or behavior modification may even be necessary.\n\nYour doctor just might recommend water limitation while cautioning you to observe that your dog is adequately hydrated.", "potentialAction": {"@type": "SeekToAction", "target": "https://www.petmd.com/dog/symptoms/why-my-dog-peeing-lot?wtime={seek_to_second_number}", "startOffset-input": "required name=seek_to_second_number"}}, {"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Why Is My Dog Peeing a Lot?", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/ready-for-some-walk.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DihHIUuYfewTp92vwjthh_9LFLwWkHWYV86g9bQViNgY%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/ready-for-some-walk.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3DihHIUuYfewTp92vwjthh_9LFLwWkHWYV86g9bQViNgY%3D.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Symptom, Urinary health, Adult, Puppy, Senior, Symptom Checker", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/why-my-dog-peeing-lot"}, "datePublished": "January 25, 2023", "dateModified": "September 12, 2023", "description": "Dr. Katie Grzyb explains why your dog may need to go out more often, what to watch for, and when you should go to the vet.", "articleBody": "If you notice that your dog has to go out more often to pee, or they’re suddenly having accidents in the house or squatting to urinate more than usual on their walks, it’s always a good idea to check with your vet. Here are some guidelines for how much dogs pee normally and some of the most common reasons your dog may be peeing a lot more than usual. How Much Should Dogs Pee? The “normal” amount for your dog to pee depends on a few factors, including their hydration level and underlying medical issues. Adult Dogs As a general rule, healthy adult dogs should be able to hold their urine for 6-8 hours. Normal adult dogs should produce about 20-40 milliliters of urine per kilogram of body weight over 24 hours. So, for a 20-pound dog, that would be about 6-12 ounces per day, and a 45-pound dog should pee about 14-28 ounces per day. Puppies Puppies will pee more because they are potty training and because their bodies need more water to keep them from becoming dehydrated rapidly. Puppies should be taken out to urinate every 2-6 hours depending on their age. They should usually be able to hold their urine the same number of hours as their age in months. For example, a 2-month-old puppy should be able to hold their urine for 2 hours. When puppies reach about 6-8 months old, however, their requirements are dependent on their lifestyle and any underlying medical conditions. Senior Dogs Senior dogs may also need to urinate more frequently, either due to underlying medical conditions or cognitive dysfunction (meaning they may forget they’ve already urinated or forget they should be urinating outside). When to See a Vet for Frequent or Excessive Urination in Dogs Frequent urination or large amounts of urination are not usually emergencies, so you can probably wait to see your veterinarian unless there are also other symptoms. Seek out immediately veterinary care if you also notice: Vomiting Blood in the urine Straining to urinate with no urine produced or with small dime-sized puddles Lethargy Known toxin ingestion Not eating for over 24 hours Pus from the vulva Reasons Why Your Dog Is Peeing a Lot The first thing you’ll want to rule out is a medical condition. Many health issues can cause increased urination, and only a vet can help you get to the bottom of it. There are also plenty of other factors and causes for dogs to pee more than usual, aside from medical conditions. Medical Conditions Very frequent urination with large amounts of urine is known as polyuria. This is a different condition than urinating small amounts frequently, which is known as pollakiuria. Polyuria Polyuria may be caused by: Kidney Failure or Infections Kidney failure (or renal failure) occurs when the kidney can’t effectively filter waste products and toxins from the blood. These toxins draw water with them, leading to increased urination, usually large amounts. At least two-thirds of kidney function must be compromised before it shows up on blood tests. End-stage kidney failure can lead to decreased urine production as the kidneys start to shut down. Bacterial infections in the kidneys can also lead to polyuria. Diabetes Mellitus Diabetes is a disease where the pancreas does not produce enough insulin (or the body stops responding the insulin produced), causing the blood sugar (glucose) level to increase. The body tries to eliminate this excessive sugar through the urine. This glucose draws water with it, leading to increased urination and thirst. Often this increase in thirst and urination is the first clinical sign of diabetes noted by dog parents. Diabetes Insipidus This type of diabetes is rare in dogs. Although it shares the same symptoms of excessive thirst and urination as diabetes mellitus, the two are different. With diabetes insipidus, a dog can’t react to or produce a specific antidiuretic hormone. Cushing’s Disease Also known as hyperadrenocorticism, Cushing’s is caused by the overproduction of cortisol (stress hormone) and steroids from the adrenal glands. This causes increased thirst and urination. Other clinical signs include a potbelly appearance, panting, thin skin, hair loss, and increased hunger. Hyperthyroidism This condition is rarely seen in dogs and is most often caused by a cancerous thyroid mass. Some other symptoms of hyperthyroidism include vomiting, constipation, hyperactivity, and losing weight but acting very hungry. Pyometra This life-threatening condition is an infection of the uterus in female dogs that have not been spayed. Bacterial toxins released into the blood affect the kidney’s ability to hold urine, leading to increased urination. Dogs will often drink more water to compensate for the increase in urination. Pyometra is often paired with pus from the vulva, fever, lethargy, changes in appetite, and vomiting. Hypercalcemia With this condition, dogs have abnormally elevated blood calcium levels, and you may see a lack of appetite, vomiting, constipation, lethargy, depression, and confusion. Cancer Certain types of cancers, especially those involving the urinary tract (such as transitional cell carcinoma) or those that elevate calcium in the bloodstream (such as lymphoma or anal gland adenocarcinoma), can lead to increased urine production. Liver Infection Bacterial infection of the liver (specifically and most commonly with Leptospirosis) leads to increased urine production and increased thirst, usually after the bacteria infects both the liver and the kidneys. This infection is fatal if left untreated. Leptospirosis is passed through infected rodent urine and is most commonly found in stagnant water puddles or ponds. A vaccine is available that protects dogs against this infection. Electrolyte Imbalances Sodium or salt imbalances lead to increased thirst and urination in dogs. Sodium attracts water. Also, the kidneys will not hold or store water appropriately if there is an imbalance of sodium and potassium in the water. Dehydration, high-sodium meals, certain toxins, and other medical conditions can cause electrolyte issues. Medication Side Effect Certain medications can cause increased thirst and urination as side effects. These medications include diuretics (such as furosemide or torsemide), anti-seizure medications (such as phenobarbital), and corticosteroids (such as prednisone). Psychogenic Polydipsia (Increased Thirst) This is a condition where your dog ingests more water than needed and thus needs to urinate more frequently. This diagnosis requires ruling out all other possible medical conditions. It is thought to be behavioral in cause. Pollakiuria Pollakiuria may be caused by lower urinary tract conditions often associated with straining to urinate and/or blood in the urine: Bladder Infections Bacterial infections in the bladder often lead to increased urination. This can be seen as peeing large amounts of urine or straining to urinate but passing only small, quarter-sized urine puddles. These infections can also lead to blood in the urine (pink or red-tinged). Bladder or Urethral Stones or Crystals in the Urine Crystals or stones in the bladder (often composed of struvite or calcium oxalate) lead to irritation in the bladder or urethral lining. This inflammation causes a dog to feel an urgency to urinate and often leads to frequently urinating only a small amount of urine and straining to urinate with or without blood. Cancers of the Bladder Bladder cancer can cause dogs to strain to urinate or not be able to urinate at all. You may also see urinary incontinence or frequent urination. Prostate Issues (Enlargement, Cancer, Infections) The prostate is a small gland located at the neck of the bladder in male dogs. The urethra (a tube that carries urine from the bladder to the outside of the body) runs through this gland. Infection or inflammation in the prostate can lead to changes in urination, including increased amounts of urine, increased frequency, straining to urinate, and sometimes blood or pus in the urine. Non-Medical Reasons That Affect How Much a Dog Pees Aside from medical conditions, other factors may influence how often your dog pees, including:   Diet—Low-protein and/or high-sodium diets cause an increase in urination. Increased activity—Exercise causes water loss, leading to thirst. The more a dog drinks, the more they may urinate. Heat—Dogs will drink more when the weather is warmer, sometimes leading to increased urination. Age—Puppies and senior dogs will often urinate more frequently or larger amounts. Bad weather—Some dogs with anxiety will hold their urine for longer periods of time during thunderstorms to avoid the loud booms. Your dog may also refuse to go if it’s simply raining or sprinkling outside. They will pass larger amounts of urine when they do finally urinate. How Vets Evaluate Excessive Urination in Dogs There are many tests vets can run to investigate the underlying cause of your dog’s excessive urination. They will first get a thorough history of your dog and conduct a physical examination to look for any abnormalities or pain. Based on this, some of the tests they might order include: Full bloodwork—This is taken to assess the kidney enzymes, liver enzymes, electrolytes, and red and white blood cell counts. Urinalysis—This is a general urine profile to assess the concentrating ability of the kidneys and look for protein, blood, crystals, white blood cells, and bacteria in the urine. Urine culture and sensitivity—This is a more specific urine test to check for bacterial growth in the urine and ascertain the best antibiotic to kill off any bacteria. X-rays of the abdomen—X-rays are used to look for any bladder/urethral stones and tumors in or around the bladder, as well as to rule out enlarged uterine horns seen with uterine infections, and enlargement/mineralization of the prostate. Abdominal ultrasound—Ultrasounds are used to check out the full urinary tract, including the kidneys, bladder, ureters, prostate (in male dogs), and proximal urethra while also assessing the uterus (in female unspayed dogs), liver, adrenal glands, and other internal organs for any abnormalities. Cadet BRAF urine testing—This is a specific test to help diagnose transitional cell carcinoma (bladder cancer) in dogs. Calcium testing—This can help identify hypercalcemia (excessive calcium). ACTH stimulation—This test is given to rule out Cushing’s disease. Treatments for Excessive Peeing in Dogs Some of the more likely causes and their treatments include: Psychogenic Polydipsia (Increased Thirst) Once this condition is diagnosed by ruling out all other possible causes, water deprivation is commonly recommended. Kidney Failure Treatment for this condition is based on the stage of renal failure. It can range from fluid administration at home to hospitalization for intravenous fluids, low-phosphorus diets, appetite stimulants, gastroprotectant medications, and sometimes blood pressure and antibiotic therapy. Medication Side Effects The side effects of these medications are often self-limiting, as the body normalizes over the first 1-2 weeks of taking them. Sometimes dose adjustments are made by the veterinarian if urination becomes excessive and remains this way. Kidney Infection or Urinary Tract Infections (UTIs) Appropriate antibiotic therapy and often pain medications and probiotics are used to treat these infections. Diabetes Mellitus Insulin therapy is the mainstay of treatment for diabetes mellitus. Sometimes hospitalization is required if this condition becomes more serious and progresses into diabetic ketoacidosis. Cushing’s Disease This condition is usually treated using a medication called trilostane, which is a synthetic enzyme used to decrease the production of excessive cortisol.  Bladder Stones and Crystals Certain types of stones and crystals (specifically struvite) can be dissolved using prescription diet changes. Stones that cannot be dissolved often require surgical removal. Prostatitis Antibiotics and pain medications are often used to treat this condition. Pyometra Surgical removal of the infected uterus is the preferred therapy. For open, draining uterine infections, longer courses of antibiotics can often clear the infection, but these infections often recur until the uterus is surgically removed. Cancer Treatment for cancer depends on the type of cancer. Often a mixture of surgery, chemotherapy, and radiation are used to attempt remission. Liver Infection Treatment often requires hospitalization with intravenous antibiotics, fluid therapy, and gastroprotectants. If diagnosed and treated early on in infection, most dogs can be cured. Electrolyte Imbalances Treatment is dependent on the cause and type of electrolyte imbalance. Sometimes hospitalization and fluid therapy is initiated. In other cases, treatment is as simple as a diet change and avoiding high-sodium treats. Featured image: iStock.com/bernardbodo Related video: Increased Urination and Thirst in Dogs"}]