[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}, {"@type": "ListItem", "position": 1, "name": "Symptoms & What They Mean", "item": "https://www.petmd.com/dog/symptoms"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "Puppy Diarrhea", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/2023-01/dog-tearing-up-a-disposable-dog-diaper-on-the-floor.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3D1UlMWmPZxELibHTy4tV5E81rihwfivHrZKkVgYfKgPc%3D.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/2023-01/dog-tearing-up-a-disposable-dog-diaper-on-the-floor.jpg_s%3D1024x1024%26w%3Dis%26k%3D20%26c%3D1UlMWmPZxELibHTy4tV5E81rihwfivHrZKkVgYfKgPc%3D.jpg"}, "author": {"@type": "Person", "name": "Katie Grzyb, DVM", "url": "https://www.petmd.com/author/dr-katie-grzyb"}, "keywords": "Dog, Puppy, Symptom, Diarrhea, Digestive health", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/symptoms/puppy-diarrhea"}, "datePublished": "January 25, 2023", "dateModified": "January 25, 2023", "description": "Diarrhea in puppies can be caused by all sorts of things. Find out what to look for and whether you should go to the vet right away.", "articleBody": "Any abrupt change or illness can be very concerning, especially with a puppy. Puppies are prone to gastrointestinal issues such as diarrhea and vomiting. Sometimes the stool is just soft, but it can also be pure liquid with blood. Causes of puppy diarrhea can range from mild belly upset to more severe viruses that can be fatal. That’s why it’s good to know whether your puppy’s symptoms require an emergency veterinarian visit or if you can wait to see your regular veterinarian in a few days.  Here’s some insight on what the stool might look like, when to see a vet, and possible causes for diarrhea in puppies. What to Do if Your Puppy Has Diarrhea It can be difficult to know when puppy diarrhea is a true emergency. If any of these signs are noted, take your dog to a veterinarian immediately for evaluation: Large amounts of bright red blood or black stool Liquid diarrhea Vomiting more than once Lethargy Not eating Not drinking Weakness/collapse Coughing/sneezing/eye or nasal discharge Tremors or seizures If your puppy has no other signs besides diarrhea and is still active and eating and drinking normally, then it is probably okay to wait one or two days to see your veterinarian. Do not bring your puppy into contact with any other dogs during this time, in case they have an infectious condition. It is best to contact your veterinarian before you make any diet changes or give over-the-counter medications, as puppies can be very sensitive to these. Your veterinarian may recommend a bland diet of boiled chicken (no skin or spices) and rice, plus sweet potato or pumpkin to ease digestion and increase fiber to re-form the stool. They may also recommend picking up a probiotic supplement while you wait for your appointment. This holistic supplement helps reintroduce good, healthy bacteria into the gut, which is very important in puppies whose gastrointestinal tracts are still growing and forming. Types of Puppy Diarrhea Your puppy’s diarrhea can just be soft, or it could be all liquid or even be a different color. Here are some common ways diarrhea can show up in puppies and what they mean. Soft Stool Soft stool in puppies is common and often a precursor to diarrhea. If the soft stool doesn’t have any blood, and your puppy is still active, eating well, and not vomiting, there’s probably no need to rush them to a veterinarian. You should definitely contact your veterinary office, though, to discuss the signs. They will advise you on next steps, whether that’s bringing your pup in or perhaps dropping off a fecal sample. Red Diarrhea (Diarrhea With Blood) Diarrhea with blood can look very scary. Sometimes it’s a sign of a concerning medical condition, though it’s often a sign of colonic inflammation. Bloody diarrhea can be caused by something they should not have eaten, intestinal parasites, or more concerning things such as parvovirus or E. coli infection. If there is only a slight amount of bright red blood in soft stool, then there’s no need to be frightened. Simply call your veterinarian and discuss what you see. If there’s a lot of bloody diarrhea with a large amount of bright red blood, or if the diarrhea is black or paired with any of the following signs, get your puppy to a veterinarian immediately for evaluation: Vomiting Not eating Lethargy Respiratory signs such as eye or nasal discharge Sneezing Diarrhea with blood that last more than 12 hours in an unvaccinated puppy should also be investigated to rule out potentially fatal viruses. Diarrhea With Mucus Mucus is often seen in puppy diarrhea, no matter the condition, and this is due to inflammation of the colon walls. A little mucus is nothing to be concerned about, but if you also see other worrisome signs, bring your puppy to a veterinarian for evaluation. Diarrhea With Vomiting Puppies can have diarrhea with vomiting from any of the medical conditions mentioned. Vomiting usually happens once inflammation has affected the stomach and upper small intestines. Diarrhea itself can lead to dehydration, but along with vomiting, it can quickly lead to potentially fatal dehydration. So if your puppy starts to vomit and has diarrhea, get them to the vet or emergency vet as soon as possible. Yellow Diarrhea Yellow diarrhea can indicate increased movement in the intestines (termed hypermotility) due to inflammation. This coloration of feces can be noted in any of the previously mentioned medical conditions. The feces can also appear yellow if you’re feeding your puppy chicken and rice to help with belly upset. This is important to know, as a chicken and rice diet is often recommended when your puppy has an upset tummy. If the yellow discoloration is seen immediately after you started feeding chicken and rice, your puppy seems alert, and the feces is starting to get more formed, then this may not be anything to be concerned about. Always talk to your veterinarian if you have any concerns about your puppy’s feces. Causes of Puppy Diarrhea There can be many reasons why a puppy has diarrhea. Here are the most common: Bacterial Infection Young animals do not yet have fully formed immune systems to help them fight off dangerous bacteria such as E. coli, Salmonella, or Clostridium. Salmonella infections are most commonly caused by undercooked meat. E. coli and Clostridium are bacteria normally found in the lower intestines in dogs, but in puppies, they can overgrow and cause severe infections due to compromised immune systems. Viral Infections Puppies require multiple vaccine boosters at different growth milestones. The distemper vaccine helps protect against four viruses that can be fatal if left untreated, or even with aggressive therapy. These viruses are parvovirus, distemper virus, coronavirus, and adenovirus. Parvovirus is a highly contagious virus that affects all quickly replicating cells in the body, including the cells of the gastrointestinal tract. Diarrhea and vomiting are the most common clinical signs noted. Distemper virus is a contagious disease that affects the respiratory, gastrointestinal, and neurologic system in dogs. It usually starts with respiratory and gastrointestinal signs and then progresses to tremors, seizures, and death. Coronavirus is a contagious virus in puppies and unvaccinated dogs that causes acute gastrointestinal signs. Older dogs don’t tend to show any signs, but they can be carriers. Puppies are prone to developing clinical signs due to their growing immune systems. Adenovirus (also called infectious hepatit­­­­­­­­is) is a virus that can cause respiratory signs in dogs, but in puppies it can also cause severe gastrointestinal signs as well as jaundice, a yellowing of the skin, due to liver inflammation/infection. Internal Parasites These are commonly known as “worms” to most pet parents and include roundworms, hookworms, whipworms, tapeworms, Giardia, and Coccidia. These worms are highly contagious between dogs—especially those that are immunocompromised, such as puppies. Many pet parents think that you will see these parasites in a dog’s stool. Sometimes you can if they have matured to adults, but often they are tiny and require a microscope to diagnose. All of these parasites live in or pass through the gastrointestinal tract during their life cycle, leading to diarrhea, weight loss, vomiting, and sometimes lethargy. Puppies can also have dull hair coats and swollen bellies if they have a lot of intestinal parasites. In severe cases of diarrhea caused by intestinal parasites, one section of intestines can telescope into another section, leading to blockage. This is called intussusception. Stress Anxiety, fear, and stress can lead to inflammation of the colon (colitis), which can cause belly upset, diarrhea, or vomiting. You may notice that when you’re away from your puppy for long periods of time, or they go through a stressful event such as a vet visit or an unexpected car ride, their stool becomes soft or even liquid in consistency. It’s similar to irritable bowel syndrome in humans, which has been shown to have a stress-related component. Food Change or Intolerance Abrupt changes in diet, such as starting a new food or adding a new treat, can cause diarrhea in puppies. Puppies thrive on routine, and their gastrointestinal tracts follow this same rule. It’s best to make slow transitions over a week’s time when switching to new diets. You can also add small amounts of one particular treat at a time to assess for any belly upset before moving on to different foods. You should also resist feeing your puppy from your own dinner plate. This is not recommended, as it can lead to an upset tummy, especially if the food is high in fats and oils. Puppies can also get into the trash or find food scraps outside while on walks. These dietary indiscretions can cause inflammation in a puppy’s gastrointestinal tract. Though food hypersensitivity (allergy) is usually not noted until around 3-6 years old, it is possible at any age. If your puppy continues to have diarrhea when eating a strict chicken- or beef-based food, ask your veterinarian for diet change recommendations. They may recommend changing to a different protein, trying a specific puppy gastrointestinal diet, or even changing to a novel protein prescription diet to help alleviate the diarrhea. Toxin or Foreign Body Ingestion Puppies are constantly sniffing and licking the floor or ground and putting almost everything in their mouths to chew on. This puts them at a higher risk for toxin and foreign body ingestion. Not all toxins or swallowed objects will cause diarrhea. Some can actually do the opposite and cause constipation, such as beach sand ingestion. It is so important to stay vigilant when walking your puppy outdoors or when they are at someone else’s home.  How Vets Diagnose the Cause of Puppy Diarrhea Your veterinarian is likely to ask what symptoms you are seeing at home, when they started, how they progressed, where your puppy is in their vaccination series, if there are any recent diet changes or new treats, and about any interaction with other dogs recently. They may also perform these tests: Fecal ova, parasite, and Giardia testing: This is where a small amount of feces is floated in a special liquid that brings parasite eggs to the surface. The vet can assess this under a microscope. Fecal smear: A small amount of feces is smeared onto a glass slide to check for certain types of bacterial overgrowth such as Clostridium and E. Coli. Viral testing: Rapid tests for parvovirus often give an answer in 10 minutes or less. Keep in mind that false negatives and positives have been reported for viral testing, as the result depends on the viral load in the body during testing. Vets can also send tests to the lab to check for distemper, adenovirus, and coronavirus. Full bloodwork: This helps assess for systemic disease and bone marrow function (red and white blood cell counts). Abdominal imaging such as x-rays or ultrasound: These may be considered if gastrointestinal signs are severe or progressive to rule out any intussusceptions or obstructions. Treating Puppy Diarrhea The treatment of puppy diarrhea depends on the cause. The most common treatments for the most common causes are as follows: Bacterial infections: Mild cases are treated with oral antibiotics, while severe cases may need hospitalization with intravenous fluids and antibiotics. Viral infections: Mild cases are treated with medications that protect the stomach, anti-emetics that treat nausea and vomiting, and often antibiotics, since puppies are prone to secondary bacterial infections. More severe cases require hospitalization with aggressive fluid therapy and broad-spectrum intravenous antibiotic therapy. Internal parasites: Treatment involves anti-parasitic medications specific to the type of parasite. Often, probiotics are used to add healthy gut flora bacteria to help fight parasitic infection. Stress: Decreasing your puppy’s stress as much as possible and adding fiber and probiotics to their diet can be helpful. Sometimes in more severe cases, an oral anti-diarrhea medication called metronidazole is started. Dietary indiscretion/diet change/dietary intolerance: Removing the food that caused it, treatment with metronidazole, switching to a bland or novel protein diet, and probiotic therapy is often enough for mild to moderate cases of dietary intolerance. It is important to avoid human foods and abrupt diet changes with puppies to avoid any belly upset. Toxin/foreign object ingestion: Often, toxins are never fully diagnosed unless they are known to be ingested. In this case, a pet poison control hotline is often recommended to obtain a full case report with recommendations on decontamination and therapeutic options. Smaller foreign objects will often pass through, and the belly upset is controlled with oral medications such as anti-emetics, metronidazole, and probiotics. Larger foreign objects may require either endoscopic removal from the stomach or abdominal exploratory surgery to fully remove the cause. No matter the cause of diarrhea in your puppy, it can be quite concerning, especially if they’re not yet fully vaccinated. It’s best to have your puppy evaluated by a vet right away if you have concerns about how they’re acting at home. Diagnosing any of these medical conditions in the early stages makes it easier to treat your puppy in the long run. Featured image: iStock.com/food and animals"}]