[{"@context": "https://schema.org", "@type": "BreadcrumbList", "itemListElement": [{"@type": "ListItem", "position": 0, "name": "Home", "item": "https://www.petmd.com/"}]}, {"@context": "https://schema.org", "@type": "Article", "headline": "3 Simple Tips to Train Your Puppy", "inLanguage": "en-US", "isFamilyFriendly": "True", "isAccessibleForFree": "True", "articleSection": "Pet Care Center", "thumbnailUrl": "https://image.petmd.com/files/styles/863x625/public/puppy-training-205154482.jpg", "image": {"@type": "ImageObject", "url": "https://image.petmd.com/files/styles/863x625/public/puppy-training-205154482.jpg"}, "author": {"@type": "Person", "name": "PetMD Editorial", "url": "https://www.petmd.com"}, "keywords": "Dog, Puppy, Training", "publisher": {"@type": "Organization", "name": "PetMD", "logo": {"@type": "ImageObject", "url": "https://www.petmd.com/images/petmd_logo.png"}, "url": "https://www.petmd.com"}, "mainEntityOfPage": {"@type": "WebPage", "@id": "https://www.petmd.com/dog/puppycenter/training/evr_dg_DIY_puppy_obedience_training"}, "datePublished": "April 7, 2011", "dateModified": "September 6, 2022", "description": "Training a puppy requires lots of patience and consistency, but with hard work, your puppy can become the perfect canine citizen. Here are the top three tips for training a puppy that can make puppy training easier for everyone.", "articleBody": "Image via Dora Zett/Shutterstock.com Part of the responsibility of being a new puppy parent is teaching your puppy good manners. These three quick tips for training a puppy will help get you started. 1. Puppy House-Training Constant supervision is key with a new puppy. Keep a close eye on your pup so that when she starts sniffing around—a clear indication that she has to do her &quot;business&quot;—you can quickly bring her outside for a potty trip. Reward your puppy with small dog treats immediately after she finishes, and then praise her for a job well done. 2. Responding to Biting Puppies love to bite in play, and doing so is an important step in their development, but puppies need to learn that painful nips aren’t acceptable. When your puppy clamps down on your finger, mark the behavior by saying “ouch!” and then withdraw your attention for ten seconds. If your puppy continues biting, say “ouch” to mark the nip, and then walk away. When it comes to puppy training, they often learn more when you withdraw attention when appropriate; they can&#039;t stand losing your attention and affection. 3. Training a Puppy to &quot;Come&quot; Help your puppy learn that running to you is a very good thing by associating the word “come” with delicious treats. Say “come” in a happy tone when your pup is standing close by, then reward her with a treat and praise. Add a friend to the game and take turns saying “come” and then giving your dog a treat. Never reprimand your pup when she returns to you, since you want the puppy to associate &quot;come&quot; with all things good. It helps to always keep some treats on you whenever you venture out with your pup. A pocketful of biscuits is worth a pound of gold for an eager-to-please puppy."}]